HostMgd.EditorInput.PromptStringOptionsEventArgs
Класс, обеспечивающий данными событие PromptingForString
редактора.

HostMgd.EditorInput.PromptStringOptionsEventArgs.Options
Возвращает входные параметры приглашения.