Teigha.DatabaseServices.BeginWblockSelectedObjectsEventArgs
Класс представляет данные для события <c>BeginWblockSelectedObjects</c> базы данных.

Teigha.DatabaseServices.BeginWblockSelectedObjectsEventArgs.From
Свойство возвращает объект базы данных, для которой выполняется операция <c>Wblock</c>.
Returns: Возвращает объект базы данных. Тип Database.

Teigha.DatabaseServices.BeginWblockSelectedObjectsEventArgs.InsertionPoint
Свойство возвращает точку вставки для операции <c>Wblock</c>.
Returns: Возвращает точку вставки. Тип Point3d.