Teigha.Geometry.AugmentedPolylineCurve3d
Класс <c>AugmentedPolylineCurve3d</c> представляет математический объект, используемый для поддержки различных типов сплайновых кривых в трехмерном пространстве.

Teigha.Geometry.AugmentedPolylineCurve3d.#ctor
Конструктор по умолчанию класса <c>AugmentedPolylineCurve3d</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.#ctor(Teigha.Geometry.Curve3d,System.Double,System.Double,System.Double)
Конструктор класса <c>AugmentedPolylineCurve3d</c>.
Создает полилинию, которая аппроксимирует переданную кривую в указанном параметрическом диапазоне с заданной точностью.
curve: Входная 3D-кривая.  Тип <c>Curve3d</c>.
fromParameter: Входная начальная точка параметрического диапазона, на котором выполняется аппроксимация кривой. Тип <c>double</c>.
toParameter: Входная конечная  точка параметрического диапазона, на котором выполняется аппроксимация кривой. Тип <c>double</c>.
eps: Заданная точность аппроксимации кривой.  Тип <c>double</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.#ctor(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection)
Конструктор класса <c>AugmentedPolylineCurve3d</c>.
Создает экземпляр класса с указанными управляющими вершинами, узлами и векторами.
knots: Входной узловой вектор.  Тип <c>KnotCollection</c>.
controlPoints: Входной массив управляющих 3D-вершин.  Тип <c>Point3dCollection</c>.
vectorBundle: Входной массив 3D-векторов.  Тип <c>Vector3dCollection</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection)
Конструктор класса <c>AugmentedPolylineCurve3d</c>.
Создает трехмерную полилинию с заданным вектором в каждой управляющей вершине.
controlPoints: Входной массив 3D управляющих вершин.     Тип <c>Point3dCollection</c>.
vectorBundle: Массив 3D-векторов для вершин полилинии.  Тип <c>Vector3dCollection</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта <c>AugmentedPolylineCurve3d</c> на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, на базе которого создается новый объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает новый объект.  Тип <c>AugmentedPolylineCurve3d</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.GetD2VectorAt(System.Int32)
Метод предоставляет вектор второй производной по указанному индексу.
index: Индекс извлекаемого вектора. Тип <c>int</c>.
Returns: Возвращает вектор второй производной.  Тип <c>Vector3d</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.GetPointAt(System.Int32)
Метод позволяет получить точку с указанным индексом.
index: Входной индекс искомой точки. Тип <c>int</c>.
Returns: Возвращает точку с указанным индексом.
Тип <c>Point3d</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.GetVectorAt(System.Int32)
Метод позволяет получить вектор с указанным индексом.
index: Входной индекс искомого вектора. Тип <c>int</c>.
Returns: Возвращает вектор с указанным индексом.
Тип <c>Vector3d</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.SetD2VectorAt(System.Int32,Teigha.Geometry.Vector3d)
Метод позволяет задать вектор второй производной с указанным индексом.
index: Входной индекс вектора.  Тип <c>int</c>.
point: Входной вектор второй производной.  Тип <c>Vector3d</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.SetPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет задать новое положение точки с указанным индексом.
index: Входной индекс точки.  Тип <c>int</c>.
point: Новые координаты точки.  Тип <c>Point3d</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.SetVectorAt(System.Int32,Teigha.Geometry.Vector3d)
Метод позволяет задать вектор с указанным индексом.
index: Входной индекс вектора.  Тип <c>int</c>.
point: Входной вектор.  Тип <c>Vector3d</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.ApproximateTolerance
Свойство <c>ApproximateTolerance</c> представляет точность, которая использовалась при аппроксимации данной полилинией трехмерной кривой.
Returns: Возвращает точность аппроксимации.  Тип <c>double</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.D1Vectors
Свойство <c>D1Vectors</c> предоставляет доступ к коллекции касательных векторов в вершинах полилинии.
Returns: Возвращает коллекцию касательных векторов в вершинах полилинии.  Тип <c>Vector3dCollection</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.D2Vectors
Свойство <c>D2Vectors</c> предоставляет доступ к коллекции векторов второй производной в вершинах полилинии.
Returns: Возвращает коллекцию векторов второй производной в вершинах полилинии.
Тип <c>Vector3dCollection</c>.

Teigha.Geometry.AugmentedPolylineCurve3d.Points
Свойство <c>Points</c> предоставляет доступ к коллекции точек, которые определяют данную полилинию.
Returns: Возвращает коллекцию точек.  Тип <c>Point3dCollection</c>.