Teigha.DatabaseServices.MTextFragment
Этот класс описывает фрагмент текста, создаваемый методом <c>MText.ExplodeFragments()</c>.

Teigha.DatabaseServices.MTextFragment.GetOverLinePoints
Метод возвращает массив из двух точек, определяющих линию надчёркивания текста, если таковая используется.
Returns: Возвращает массив из двух точек, которые определяют линию надчёркивания.
Тип <c>Point3d[]</c>.

Teigha.DatabaseServices.MTextFragment.GetUnderLinePoints
Метод возвращает массив из двух точек, определяющих линию подчёркивания текста, если таковая используется.
Returns: Возвращает массив из двух точек, которые определяют линию подчёркивания.
Тип <c>Point3d[]</c>.

Teigha.DatabaseServices.MTextFragment.BigFont
Свойство возвращает имя большого шрифта SHX.
Returns: Возвращает имя большого шрифта. Тип <c>String</c>.

Teigha.DatabaseServices.MTextFragment.Bold
Свойство позволяет проверить, представлен ли текст полужирным шрифтом.
Returns: Возвращает <c>true</c>, если текст представлен полужирным шрифтом.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MTextFragment.CapsHeight
Свойство возвращает высоту текста.
Returns: Возвращает высоту текста. Тип <c>double</c>.

Teigha.DatabaseServices.MTextFragment.Color
Свойство возвращает цвет текста.
Returns: Возвращает цвет текста. Тип <c>Colors.EntityColor</c>.

Teigha.DatabaseServices.MTextFragment.Direction
Свойство возвращает направление оси <c>X</c> текста.
Returns: Возвращает направление оси <c>X</c> текста.
Тип <c>Vector3d</c>.

Teigha.DatabaseServices.MTextFragment.Extents
Свойство возвращает ограничивающий (габаритный) бокс данного объекта в системе координат объекта (OCS).
Returns: Возвращает размеры двумерного ограничивающего бокса в системе координат объекта (OCS).
Тип <c>Point2d</c>.

Teigha.DatabaseServices.MTextFragment.Italic
Свойство позволяет проверить, представлен ли текст наклонным шрифтом.
Returns: Возвращает <c>true</c>, если текст представлен наклонным шрифтом.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MTextFragment.LineBreak
Свойство позволяет проверить, завершается ли данный фрагмент символом разрыва строки.
Returns: Возвращает <c>true</c>, если фрагмент завершается разрывом строки.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MTextFragment.Location
Свойство возвращает точку вставки текста.
Returns: Возвращает точку вставки текста. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MTextFragment.NewParagraph
Свойство позволяет проверить, является ли данный фрагмент началом нового абзаца текста.
Returns: Возвращает <c>true</c>, если данный фрагмент представляет начало нового абзаца текста.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MTextFragment.Normal
Свойство представляет вектор нормали плоскости, в которой располагается данный объект.
Returns: Возвращает вектор нормали плоскости объекта.  Тип <c>Vector3d</c>.

Teigha.DatabaseServices.MTextFragment.ObliqueAngle
Свойство возвращает угол наклона текста.
Returns: Возвращает угол наклона текста (в радианах).  Тип <c>double</c>.

Teigha.DatabaseServices.MTextFragment.Overlined
Свойство позволяет проверить, является ли текст надчёркнутым.
Returns: Возвращает <c>true</c>, если текст является надчёркнутым.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MTextFragment.ShxFont
Свойство возвращает имя шрифта SHX.
Returns: Возвращает имя шрифта SHX. Тип <c>String</c>.

Teigha.DatabaseServices.MTextFragment.StackBottom
Свойство позволяет проверить, представляет ли данный фрагмент знаменатель дробного текста.
Returns: Возвращает <c>true</c>, если данный фрагмент представляет знаменатель дробного текста.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MTextFragment.StackTop
Свойство позволяет проверить, представляет ли данный фрагмент числитель дробного текста.
Returns: Возвращает <c>true</c>, если данный фрагмент представляет числитель дробного текста.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MTextFragment.Text
Свойство возвращает текст данного фрагмента в виде строки, очищенной от кодов форматирования.
Returns: Возвращает строку текста данного фрагмента.
Тип <c>String</c>.

Teigha.DatabaseServices.MTextFragment.TrackingFactor
Свойство возвращает коэффициент трекинга в данном фрагменте.
Returns: Возвращает коэффициент трекинга. Тип <c>double</c>.

Teigha.DatabaseServices.MTextFragment.TrueTypeFont
Свойство представляет имя шрифта TrueType.
Returns: Возвращает имя шрифта TrueType.
Тип <c>String</c>.

Teigha.DatabaseServices.MTextFragment.Underlined
Свойство позволяет проверить, является ли текст фрагмента подчёркнутым.
Returns: Возвращает <c>true</c>, если данный фрагмент представляет подчёркнутый текст.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MTextFragment.WidthFactor
Свойство представляет коэффициент растяжения символов текста.
Returns: Возвращает коэффициент растяжения символов текста.
Тип <c>double</c>.