Teigha.DatabaseServices.TableTemplate
Класс <c>TableTemplate</c> предназначен для хранения и управления шаблонами таблиц.

Teigha.DatabaseServices.TableTemplate.#ctor(Teigha.DatabaseServices.Table,Teigha.DatabaseServices.TableCopyOptions)
Конструктор класса <c>TableTemplate</c>. Создает экземпляр класса с указанными параметрами.
table: Таблица, на основе которой создается шаблон. Тип <c>Table</c>.
copyOption: Опции копирования, определяющие, что именно требуется захватывать из шаблона. Перечисление <c>TableCopyOptions</c>.

Teigha.DatabaseServices.TableTemplate.Capture(Teigha.DatabaseServices.Table,Teigha.DatabaseServices.TableCopyOptions)
Метод позволяет захватить шаблон таблицы.
table: Исходная таблица. Тип <c>Table</c>.
copyOption: Опции копирования, определяющие, что именно требуется захватывать из шаблона. Перечисление <c>TableCopyOptions</c>.

Teigha.DatabaseServices.TableTemplate.CreateTable(Teigha.DatabaseServices.TableCopyOptions)
Метод предназначен для создания нового шаблона таблицы.
copyOption: Опции копирования, определяющие, что именно требуется захватывать из шаблона. Перечисление <c>TableCopyOptions</c>.
Returns: Возвращает созданный шаблон таблицы. Тип <c>Table</c>.