Teigha.DatabaseServices.AuditInfo
Класс предназначен для отслеживания общей информации, получаемой в ходе выполнения аудита базы данных.

Teigha.DatabaseServices.AuditInfo.#ctor
Конструктор класса по умолчанию.

Teigha.DatabaseServices.AuditInfo.ErrorsFixed(System.Int32)
Метод увеличивает количество ошибок, отмеченных в данном экземпляре AuditInfo как исправленные.
count: Входное количество исправленных ошибок.  Тип int.

Teigha.DatabaseServices.AuditInfo.ErrorsFound(System.Int32)
Метод увеличивает счетчик обнаруженных ошибок, которые следует интерпретировать как пропущенные.
count: Входное количество пропущенных ошибок.  Тип int.

Teigha.DatabaseServices.AuditInfo.IncNumEntities
Метод увеличивает на единицу количество ошибок, которые в данном объекте AuditInfo учтены как обработанные.

Teigha.DatabaseServices.AuditInfo.PrintError(Teigha.DatabaseServices.DBObject,String,String,String)
Метод уведомления, вызываемый для печати информации об ошибке.
value: Объект, вызвавший ошибку. Тип DBObject.
value2: Входное ошибочное значение. Тип String.
validation: Входное описание причины, по которой данные рассматриваются как ошибочные. Тип String.
defaultValue: Устанавливаемое значение по умолчанию. Тип String.

Teigha.DatabaseServices.AuditInfo.PrintError(String,String,String,String)
Метод уведомления, вызываемый для печати информации из журнала об обнаруженных или исправленных ошибках.
name: Входная строка, описывающая тип найденных ошибочных данных. Тип String.
value: Входное ошибочное значение. Тип String.
validation: Входное описание причины, по которой данные рассматриваются как ошибочные. Тип String.
defaultValue: Устанавливаемое значение по умолчанию. Тип String.

Teigha.DatabaseServices.AuditInfo.PrintNumEntities(String)
Как только количество учтенных в экземпляре AuditInfo объектов оказывается кратным 100, этот метод выводит в файл журнала  указанное сообщение (если оно не нулевое) и текущее количество учтенных объектов.
msg: Входная строка, которую требуется напечатать в лог-файл аудита.  Тип String.

Teigha.DatabaseServices.AuditInfo.RequestRegen
Метод позволяет исправленным объектам уведомлять систему о необходимости выполнить их регенерацию.

Teigha.DatabaseServices.AuditInfo.ResetNumEntities
Метод обнуляет количество объектов, поддерживаемых данным экземпляром AuditInfo.

Teigha.DatabaseServices.AuditInfo.AuditPass
Свойство возвращает текущий проход аудита как значение из перечисления DatabaseServices.AuditPass.
Returns: Возвращает текущий проход аудита как значение из перечисления DatabaseServices.AuditPass.

Teigha.DatabaseServices.AuditInfo.FixErrors
Свойство позволяет определить, должны ли ошибки быть исправлены реализуемым объектом.
Returns: Возвращает значение <c>true</c>, если ошибки должны быть исправлены реализуемым объектом.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AuditInfo.NumEntities
Свойство возвращает количество объектов, обработанных данным экземпляром AuditInfo.
Returns: Возвращает количество объектов. Тип int.

Teigha.DatabaseServices.AuditInfo.NumErrors
Свойство возвращает количество ошибок, учтенных в данном экземпляре AuditInfo.
Returns: Возвращает количество учтенных ошибок. Тип int.

Teigha.DatabaseServices.AuditInfo.NumFixes
Свойство возвращает количество ошибок, отмеченных в данном экземпляре AuditInfo как исправленные.
Returns: Возвращает количество исправленных ошибок. Тип int.