Teigha.Geometry.PlanarEntity
Класс <c>PlanarEntity</c> является абстрактным базовым классом для всех типов плоских поверхностей в трехмерном пространстве.

Teigha.Geometry.PlanarEntity.ClosestPointToLinearEntity(Teigha.Geometry.LinearEntity3d)
Метод вычисляет точку на данной плоской поверхности, которая располагается ближе всего к указанной линии, и точку на этой линии, которая ближе всего располагается к данной плоской поверхности. Вычисление координат точек выполняется в пределах точности по умолчанию.
line: Входная линия. Тип <c>LinearEntity3d</c>.
Returns: Возвращает массив из двух точек. Тип <c>Point3d[]</c>.
Первый элемент массива соответствует ближайшей точке на линии <c>line</c>, а второй — ближайшей точке на данной плоской поверхности.

Teigha.Geometry.PlanarEntity.ClosestPointToLinearEntity(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод вычисляет точку на данной плоской поверхности, которая располагается ближе всего к указанной линии, и точку на этой линии, которая ближе всего располагается к данной плоской поверхности. Вычисление координат точек выполняется в пределах явно заданной точности.
line: Входная линия. Тип <c>LinearEntity3d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив из двух точек. Тип <c>Point3d[]</c>.
Первый элемент массива соответствует ближайшей точке на линии <c>line</c>, а второй — ближайшей точке на данной плоской поверхности.

Teigha.Geometry.PlanarEntity.ClosestPointToPlanarEntity(Teigha.Geometry.PlanarEntity)
Метод вычисляет точку на данном объекте, которая располагается ближе всего к указанной плоской поверхности, и точку на этой плоской поверхности, которая ближе всего располагается к данному объекту.
otherPlane: Входная плоская поверхность, для которой требуется найти ближайшие точки. Тип <c>PlanarEntity</c>.
Returns: Возвращает массив из двух точек. Тип <c>Point3d[]</c>.
Первый элемент массива соответствует ближайшей точке на плоскости <c>otherPlane</c>, а второй — ближайшей точке на данной плоской поверхности.

Teigha.Geometry.PlanarEntity.ClosestPointToPlanarEntity(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод вычисляет точку на данном объекте, которая располагается ближе всего к указанной плоской поверхности, и точку на этой плоской поверхности, которая ближе всего располагается к данному объекту. Вычисление координат точек выполняется в пределах явно заданной точности.
otherPlane: Входная плоская поверхность, для которой требуется найти ближайшие точки.  Тип <c>PlanarEntity</c>.
tolerance: Заданная геометрическая точность.  Тип <c>Tolerance</c>.
Returns: Возвращает массив из двух точек. Тип <c>Point3d[]</c>.
Первый элемент массива соответствует ближайшей точке на плоскости <c>otherPlane</c>, а второй — ближайшей точке на данной плоской поверхности.

Teigha.Geometry.PlanarEntity.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект.
Тип <c>PlanarEntity</c>.

Teigha.Geometry.PlanarEntity.GetCoordinateSystem
Метод предоставляет каноническую ортонормированную систему координат плоскости данного объекта.
Returns: Возвращает систему координат плоскости данного объекта.
Тип <c>CoordinateSystem3d</c>.

Teigha.Geometry.PlanarEntity.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод вычисляет точку пересечения данной плоской поверхности с указанной линией с использованием точности по умолчанию.
linearEntity: Входной линейный объект. Тип <c>LinearEntity3d</c>.
Returns: Возвращает массив, в котором содержится единственная точка пересечения (если она существует).
Тип <c>Point3d[]</c>.

Teigha.Geometry.PlanarEntity.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод вычисляет точку пересечения данной плоской поверхности с указанной линией, используя предписанную точность.
linearEntity: Входной линейный объект. Тип <c>LinearEntity3d</c>.
tolerance: Заданная точность для вычисления точки пересечения. Тип <c>Tolerance</c>.
Returns: Возвращает массив, в котором содержится единственная точка пересечения (если она существует).
Тип <c>Point3d[]</c>.

Teigha.Geometry.PlanarEntity.IsCoplanarTo(Teigha.Geometry.PlanarEntity)
Метод позволяет проверить, является ли данный объект компланарным указанной плоской поверхности.
otherPlanarEntity: Проверяемый входной плоский объект.  Тип <c>PlanarEntity</c>.
Returns: Возвращает <c>true</c>, если в пределах точности по умолчанию проверяемые плоские объекты можно считать компланарными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.PlanarEntity.IsCoplanarTo(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет проверить, являются ли данный объект и указанная плоская поверхность компланарными в пределах заданной точности.
otherPlanarEntity: Проверяемый входной плоский объект.  Тип <c>PlanarEntity</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах точности <c>tolerance</c> проверяемые плоские объекты можно считать компланарными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.PlanarEntity.IsParallelTo(Teigha.Geometry.LinearEntity3d)
Метод позволяет проверить параллельность указанной линии и данной плоской поверхности в пределах точности по умолчанию.
linearEntity: Проверяемый линейный объект. Тип <c>LinearEntity3d</c>.
Returns: Возвращает <c>true</c>, если в пределах точности по умолчанию линейный объект <c>linearEntity</c> можно считать параллельным данной плоской поверхности.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.PlanarEntity.IsParallelTo(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить параллельность указанной линии и данной плоской поверхности в пределах предписанной точности.
linearEntity: Проверяемый линейный объект. Тип <c>LinearEntity3d</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах точности <c>tolerance</c> линейный объект <c>linearEntity</c> можно считать параллельным данной плоской поверхности.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.PlanarEntity.IsParallelTo(Teigha.Geometry.PlanarEntity)
Метод позволяет проверить параллельность данного объекта и указанной плоской поверхности в пределах точности по умолчанию.
otherPlanarEntity: Проверяемая на параллельность плоская поверхность. Тип <c>PlanarEntity</c>.
Returns: Возвращает <c>true</c>, если в пределах точности по умолчанию сравниваемые плоские объекты можно считать параллельными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.PlanarEntity.IsParallelTo(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет проверить параллельность данного объекта и указанной плоской поверхности в пределах предписанной точности.
otherPlanarEntity: Проверяемая на параллельность плоская поверхность. Тип <c>PlanarEntity</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах заданной точности сравниваемые плоские объекты можно считать параллельными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.PlanarEntity.IsPerpendicularTo(Teigha.Geometry.LinearEntity3d)
Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта (в пределах точности по умолчанию).
linearEntity: Входной линейный объект. Тип <c>LinearEntity3d</c>.
Returns: Возвращает <c>true</c>, если в пределах точности по умолчанию линейный объект <c>linearEntity</c> можно считать перпендикулярным данной плоской поверхности.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.PlanarEntity.IsPerpendicularTo(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта в пределах предписанной точности.
linearEntity: Входной линейный объект. Тип <c>LinearEntity3d</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах точности <c>tolerance</c> линейный объект <c>linearEntity</c> можно считать перпендикулярным данной плоской поверхности.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.PlanarEntity.IsPerpendicularTo(Teigha.Geometry.PlanarEntity)
Метод позволяет проверить перпендикулярность данного объекта и указанной плоской поверхности (в пределах точности по умолчанию).
linearEntity: Проверяемая плоская поверхность. Тип <c>PlanarEntity</c>.
Returns: Возвращает <c>true</c>, если в пределах точности по умолчанию плоскую поверхность <c>linearEntity</c> можно считать перпендикулярной данной плоской поверхности.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.PlanarEntity.IsPerpendicularTo(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет проверить перпендикулярность данного объекта и указанной плоской поверхности в пределах заданной точности.
linearEntity: Проверяемый плоский объект. Тип <c>PlanarEntity</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах точности <c>tolerance</c> плоский объект <c>linearEntity</c> можно считать перпендикулярной данной плоской поверхности.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.PlanarEntity.Coefficients
Свойство <c>Coefficients</c> представляет коэффициенты общего уравнения плоскости данного объекта.
Returns: Возвращает коэффициенты общего уравнения плоскости.
Тип <c>PlanarEquationCoefficients</c>.

Teigha.Geometry.PlanarEntity.Normal
Свойство <c>Normal</c> представляет единичный вектор нормали плоскости данного объекта.
Returns: Возвращает вектор нормали плоскости данного объекта. Тип <c>Vector3d</c>.

Teigha.Geometry.PlanarEntity.PointOnPlane
Свойство <c>PointOnPlane</c> представляет некоторую точку, гарантированно располагающуюся на плоскости данного объекта.
Returns: Возвращает некоторую точку, гарантированно лежащую в плоскости данного объекта.
Тип <c>Point3d</c>.