Teigha.Geometry.NurbSurfaceDefinition.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если объект <c>obj</c> равен данному объекту.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbSurfaceDefinition.GetHashCode
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает хеш-код объекта.
Тип <c>int</c>.

Teigha.Geometry.NurbSurfaceDefinition.IsEqualTo(Teigha.Geometry.NurbSurfaceDefinition)
Метод проверяет, совпадают ли данные этого определения NURBS поверхности с данными другого определения <c>NurbSurfaceDefinition</c>.
a: Проверяемые данные определения NURBS поверхности. Тип <c>NurbSurfaceDefinition</c>.
Returns: Возвращает <c>true</c>, если сравниваемые объекты можно считать равными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbSurfaceDefinition.ControlPoints
Свойство <c>ControlPoints</c> представляет массив управляющих вершин NURBS поверхности.
Returns: Возвращает массив управляющих вершин сплайна.
Тип <c>Point3dCollection</c>.

Teigha.Geometry.NurbSurfaceDefinition.DegreeInU
Свойство <c>DegreeInU</c> представляет степень сплайна в направлении U.
Returns: Возвращает степень сплайна в направлении U.
Тип <c>int</c>.

Teigha.Geometry.NurbSurfaceDefinition.DegreeInV
Свойство <c>DegreeInV</c> представляет степень сплайна в направлении V.
Returns: Возвращает степень сплайна в направлении V.
Тип <c>int</c>.

Teigha.Geometry.NurbSurfaceDefinition.NumberOfControlPointsInU
Свойство <c>NumberOfControlPointsInU</c> представляет количество управляющих вершин в направлении U.
Returns: Возвращает количество управляющих вершин в направлении U.
Тип <c>int</c>.

Teigha.Geometry.NurbSurfaceDefinition.NumberOfControlPointsInV
Свойство <c>NumberOfControlPointsInV</c> представляет количество управляющих вершин в направлении V.
Returns: Возвращает количество управляющих вершин в направлении V.
Тип <c>int</c>.

Teigha.Geometry.NurbSurfaceDefinition.PropertiesInU
Свойство <c>PropertiesInU</c> представляет значение <c>NurbSurfaceProperties</c> как свойство поверхности в направлении U.
Returns: Возвращает значение <c>NurbSurfaceProperties</c> как свойство поверхности в направлении U.
Тип <c>int</c>.

Teigha.Geometry.NurbSurfaceDefinition.PropertiesInV
Свойство <c>PropertiesInV</c> представляет значение <c>NurbSurfaceProperties</c> как свойство поверхности в направлении V.
Returns: Возвращает значение <c>NurbSurfaceProperties</c> как свойство поверхности в направлении V.
Тип <c>int</c>.

Teigha.Geometry.NurbSurfaceDefinition.UKnots
Свойство <c>UKnots</c> представляет узловой вектор поверхности в направлении U.
Returns: Возвращает узловой вектор в направлении U.
Тип <c>KnotCollection</c>.

Teigha.Geometry.NurbSurfaceDefinition.VKnots
Свойство <c>VKnots</c> представляет узловой вектор поверхности в направлении V.
Returns: Возвращает узловой вектор в направлении V.
Тип <c>KnotCollection</c>.

Teigha.Geometry.NurbSurfaceDefinition.Weights
Свойство <c>Weights</c> представляет массив весов NURBS поверхности.
Returns: Возвращает массив значений весов.
Тип <c>DoubleCollection</c>.