HostMgd.EditorInput.PromptAngleOptions
Класс, обеспечивающий необязательными параметрами приглашение
для ввода угла.

HostMgd.EditorInput.PromptAngleOptions.AllowNone
Возвращает или устанавливает признак того, разрешен ли ввод
только Enter.
Значение true означает, что ввод только Enter разрешен, и
false в противном случае.

HostMgd.EditorInput.PromptAngleOptions.AllowZero
Возвращает или устанавливает признак того, разрешен ли ввод
нулевого значения.
Значение true означает, что ввод нулевого значения разрешен,
и false в противном случае.

HostMgd.EditorInput.PromptAngleOptions.BasePoint
Возвращает или устанавливает базовую точку, используемую в
приглашении.

HostMgd.EditorInput.PromptAngleOptions.DefaultValue
Возвращает или устанавливает значение, которое будет
присвоено при нажатии только Enter без какого-либо другого
ввода.

HostMgd.EditorInput.PromptAngleOptions.#ctor(String)
Конструктор.
message: Приглашающее сообщение

HostMgd.EditorInput.PromptAngleOptions.#ctor(String,String)
Конструктор.
messageAndKeywords: Приглашающая строка с ключевыми словами
globalKeywords: Имена ключевых слов (глобальные имена).

HostMgd.EditorInput.PromptAngleOptions.UseAngleBase
Возвращает и выставляет признак того, будет ли использоваться
базовый угол.

HostMgd.EditorInput.PromptAngleOptions.UseBasePoint
Возвращает и выставляет признак того, будет ли использоваться
базовая точка.

HostMgd.EditorInput.PromptAngleOptions.UseDashedLine
Включает и выключает штриховую "резиновую" линию, которая
рисуется между базовой точкой и текущим положением курсора
при вводе.

HostMgd.EditorInput.PromptAngleOptions.UseDefaultValue
Возвращает и выставляет признак того, будет ли использоваться
значение по умолчанию в случае, если пользователь вводит
Enter без какого-либо другого ввода. Это свойство позволяет
использовать программный код для задания значения по
умолчанию, определенного в производных классах.