Teigha.DatabaseServices.FieldEvaluationStatusResult
Этот класс предназначен для хранения кодов, представляющих результаты вычисления поля.

Teigha.DatabaseServices.FieldEvaluationStatusResult.#ctor(Teigha.DatabaseServices.FieldEvaluationStatus,System.Int32,String)
Конструктор класса <c>FieldEvaluationStatusResult</c>.  Только для внутреннего использования.
s: Статус вычисления поля. Значение из перечисления <c>FieldEvaluationStatus</c>.
e: Код ошибки. Тип <c>int</c>.
m: Сообщение об ошибке. Тип <c>String</c>.

Teigha.DatabaseServices.FieldEvaluationStatusResult.ErrorCode
Свойство <c>ErrorCode</c> возвращает код ошибки этого объекта.
Returns: Возвращает код ошибки. Тип <c>int</c>.

Teigha.DatabaseServices.FieldEvaluationStatusResult.ErrorMessage
Свойство <c>ErrorMessage</c> возвращает сообщение об ошибке этого объекта.
Returns: Возвращает сообщение об ошибке. Тип <c>String</c>.

Teigha.DatabaseServices.FieldEvaluationStatusResult.Status
Свойство <c>Status</c> возвращает статус вычисления поля этого объекта.
Returns: Возвращает статус вычисления поля. Значение из перечисления <c>FieldEvaluationStatus</c>.