Teigha.Geometry.ClipBoundary2dData.Equals(Object)
Метод предназначен для проверки на равенство данного и переданного в метод объектов.
obj: Входной объект, с которым проверяется равенство. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если оба сравниваемых объекта не являются нулевыми и выполняются условия равенства объектов <c>ClipBoundary2dData</c> (см. выше). В противном случае возвращает <c>false</c>.

Teigha.Geometry.ClipBoundary2dData.GetHashCode
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает хеш-код объекта.
Тип <c>int</c>.

Teigha.Geometry.ClipBoundary2dData.IsEqualTo(Teigha.Geometry.ClipBoundary2dData)
Метод предназначен для проверки данного объекта на равенство другому объекту <c>ClipBoundary2dData</c>.
a: Входной объект, с которым проверяется равенство.  Тип <c>ClipBoundary2dData</c>.
Returns: Возвращает <c>true</c>, если оба объекта не являются нулевыми и одновременно выполняются следующие условия:
1. Совпадают обрезанные вершины;
2. Совпадают исходные метки обрезанных сегментов;
3. Совпадают условия обрезки.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ClipBoundary2dData.ClipCondition
Свойство <c>ClipCondition</c> представляет условие обрезки.
Returns: Возвращает условие обрезки. Тип <c>ClipCondition</c>.

Teigha.Geometry.ClipBoundary2dData.ClippedSegmentSourceLabel
Свойство <c>ClippedSegmentSourceLabel</c> представляет исходную метку обрезанного сегмента.
Returns: Возвращает исходную метку обрезанного сегмента.
Тип <c>IntegerCollection</c>.

Teigha.Geometry.ClipBoundary2dData.ClippedVertices
Свойство <c>ClippedVertices</c> представляет массив обрезанных вершин.
Returns: Возвращает массив обрезанных вершин.
Тип <c>Point2dCollection</c>.