Teigha.LayerManager.LayerGroup
Класс <c>LayerGroup</c> представляет в базе данных объект фильтра группы слоёв.

Teigha.LayerManager.LayerGroup.#ctor
Конструктор по умолчанию класса <c>LayerGroup</c>.

Teigha.LayerManager.LayerGroup.LayerIds
Свойство <c>LayerIds</c> представляет коллекцию идентификаторов слоев в данном фильтре группы слоев.
Returns: Возвращает коллекцию идентификаторов слоев в данном групповом фильтре слоев.
Тип <c>LayerCollection</c>.