HostMgd.EditorInput.PromptDistanceOptionsEventArgs
Класс обеспечивает данными событие PromptingForDistance для
класса Editor.

HostMgd.EditorInput.PromptDistanceOptionsEventArgs.Options
Возвращает параметры приглашения.