Teigha.DatabaseServices.DxfFiler
Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DXF.

Teigha.DatabaseServices.DxfFiler.#ctor(IntPtr,System.Boolean)
Конструктор класса DxfFiler.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Флаг автоудаления исходного объекта. Тип <c>bool</c>.

Teigha.DatabaseServices.DxfFiler.ReadBoolean
Метод возвращает логическое значение из текущего элемента этого объекта Filer.
Returns: Возвращает логическое значение.  Тип <c>bool</c>.

Teigha.DatabaseServices.DxfFiler.ReadByte
Метод возвращает 8-разрядное целое число без знака (байт) из текущего элемента этого объекта Filer.
Returns: Возвращает 8-разрядное целое число без знака. Тип byte.

Teigha.DatabaseServices.DxfFiler.ReadBytes(array&lt;unsigned char&gt;)
Метод возвращает указанное количество байтов из данного объекта Filer.
value: Массив байтов. Тип <c>unsigned char[]</c>. Длина массива определяет количество считываемых байтов.

Teigha.DatabaseServices.DxfFiler.ReadAngle
Метод возвращает значение угла из текущего элемента этого объекта Filer.
Returns: Возвращает значение угла. Тип <c>double</c>.

Teigha.DatabaseServices.DxfFiler.ReadDouble
Метод возвращает значение типа <c>double</c> из текущего элемента этого объекта Filer.
Returns: Возвращает значение типа <c>double</c>.

Teigha.DatabaseServices.DxfFiler.ReadHandle
Метод возвращает дескриптор <c>Handle</c> из текущего элемента этого объекта Filer.
Returns: Возвращает дескриптор объекта. Тип <c>Handle</c>.

Teigha.DatabaseServices.DxfFiler.ReadObjectId
Метод возвращает идентификатор объекта из текущего элемента этого объекта Filer.
Returns: Возвращает идентификатор объекта. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.DxfFiler.ReadInt16
Метод возвращает 16-разрядное целое число со знаком из текущего элемента этого объекта Filer.
Returns: Возвращает 16-разрядное целое число со знаком. Тип <c>short</c>.
///<summary>
///</summary>
virtual int ReadInt32() abstract;

Teigha.DatabaseServices.DxfFiler.ReadInt32
Метод возвращает 32-разрядное целое число со знаком из текущего элемента этого объекта Filer.
Returns: Возвращает 32-разрядное целое число со знаком. Тип <c>int</c>.

Teigha.DatabaseServices.DxfFiler.ReadInt64
Метод возвращает 64-разрядное целое число со знаком из текущего элемента этого объекта Filer.
Returns: Возвращает 64-разрядное целое число со знаком. Тип <c>long</c>.

Teigha.DatabaseServices.DxfFiler.ReadPoint2d
Метод возвращает двумерную точку Point2d из текущего элемента этого объекта Filer.
Returns: Возвращает двумерную точку. Тип <c>Point2d</c>.

Teigha.DatabaseServices.DxfFiler.ReadPoint3d
Метод возвращает трехмерную точку Point3d из текущего элемента этого объекта Filer.
Returns: Возвращает трехмерную точку. Тип <c>Point3d</c>.

Teigha.DatabaseServices.DxfFiler.ReadScale3d
Метод возвращает значение масштаба из текущего элемента этого объекта Filer.
Returns: Возвращает масштаб. Тип <c>Scale3d</c>.

Teigha.DatabaseServices.DxfFiler.ReadString
Метод возвращает текстовую строку из текущего элемента этого объекта Filer.
Returns: Возвращает строку. Тип <c>String</c>.

Teigha.DatabaseServices.DxfFiler.ReadUInt16
Метод возвращает 16-разрядное целое число без знака (ushort) из текущего элемента этого объекта Filer.
Returns: Возвращает 16-разрядное целое число без знака. Тип <c>ushort</c>.

Teigha.DatabaseServices.DxfFiler.ReadUInt32
Метод возвращает 32-разрядное целое число без знака (uint) из текущего элемента этого объекта Filer.
Returns: Возвращает 32-разрядное целое число без знака. Тип <c>uint</c>.

Teigha.DatabaseServices.DxfFiler.ReadUInt64
Метод возвращает 64-разрядное целое число без знака (ulong) из текущего элемента этого объекта Filer.
Returns: Возвращает 64-разрядное целое число без знака. Тип <c>ulong</c>.

Teigha.DatabaseServices.DxfFiler.ReadVector2d
Метод возвращает 2D-вектор из текущего элемента этого объекта Filer.
Returns: Возвращает 2D-вектор. Тип <c>Vector2d</c>.

Teigha.DatabaseServices.DxfFiler.ReadVector3d
Метод возвращает 3D-вектор из текущего элемента этого объекта Filer.
Returns: Возвращает 3D-вектор. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.DxfFiler.AtSubclassData(String)
Метод проверяет, является ли текущим элементом этого файлера маркер данных подкласса с указанным именем подкласса.
value: Имя подкласса. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если текущим элементом файлера является маркер данных подкласса с именем <c>value</c>.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DxfFiler.HaltAtClassBoundaries(System.Boolean)
Метод определяет, следует ли файлеру прекратить работу в случае выхода за границу класса.
value: Входное логическое значение, указывающее, следует ли прекращать работу на определенных ключевых маркерах в файле. Тип <c>bool</c>.

Teigha.DatabaseServices.DxfFiler.PushBackItem
Метод возвращает этот объект Filer на позицию, где он был до прочтения последнего элемента.

Teigha.DatabaseServices.DxfFiler.ReadResultBuffer
Метод считывает следующий элемент этого объекта Filer и возвращает буфер результатов.
Returns: Возвращает буфер результатов. Тип <c>ResultBuffer</c>.

Teigha.DatabaseServices.DxfFiler.ResetFilerStatus
Метод сбрасывает текущий статус этого объекта Filer.

Teigha.DatabaseServices.DxfFiler.RewindFiler
Метод предназначен для переключения файлера в состояние по умолчанию без изменения положения указателя на данные.
Returns: Метод в реализации по умолчанию возвращает 0. Тип <c>int</c>.
Notes
Реализация по умолчанию этого метода не делает ничего.

Teigha.DatabaseServices.DxfFiler.SetError(String,array&lt;String&gt;)
Метод печатает сообщение об ошибке, используя предоставленный формат строки и переданные параметры.
Не реализован.
format: Формат сообщения об ошибке. Тип <c>String</c>.
values: Массив аргументов для форматированной строки с описанием ошибки. Тип <c>String[]</c>.

Teigha.DatabaseServices.DxfFiler.SetError(Teigha.BoundaryRepresentation.ErrorStatus,String,array&lt;String&gt;)
Метод печатает сообщение об ошибке с указанным кодом, используя предоставленный формат строки и переданные параметры.
Не реализован.
value: Код ошибки. Значение из перечисления ErrorStatus.
format: Формат сообщения об ошибке. Тип <c>String</c>.
values: Массив аргументов для форматированной строки с описанием ошибки. Тип <c>String[]</c>.

Teigha.DatabaseServices.DxfFiler.Seek(long long,System.Int32)
Перемещает указатель ввода-вывода данного файлера в указанную позицию.
offset: Смещение указателя в байтах.  Тип <c>long long</c>.
method: Метод поиска новой позиции. Тип <c>int</c>. Допустимы следующие значения

Teigha.DatabaseServices.DxfFiler.WriteBoolean(Teigha.DatabaseServices.DxfCode,System.Boolean)
Метод записывает в данный объект Filer указанное логическое значение.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>bool</c>.

Teigha.DatabaseServices.DxfFiler.WriteByte(Teigha.DatabaseServices.DxfCode,unsigned char)
Метод записывает в данный объект Filer указанное байтовое значение.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>unsigned char</c>.

Teigha.DatabaseServices.DxfFiler.WriteBytes(Teigha.DatabaseServices.DxfCode,array&lt;unsigned char&gt;)
Метод записывает в данный объект Filer указанный байтовый массив.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>unsigned char[]</c>.

Teigha.DatabaseServices.DxfFiler.WriteDouble(Teigha.DatabaseServices.DxfCode,System.Double,System.Int32)
Метод записывает в данный объект Filer указанное действительное значение с заданной точностью.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>double</c>.
precision: Количество десятичных знаков после разделителя в диапазоне от 0 до 16. Тип <c>int</c>.

Teigha.DatabaseServices.DxfFiler.WriteEmbeddedObjectStart
Метод записывает в данный объект Filer строковые данные «встроенного объекта» для группового кода <c>DxfCode.EmbeddedObjectStart</c>.

Teigha.DatabaseServices.DxfFiler.WriteHandle(Teigha.DatabaseServices.DxfCode,Teigha.DatabaseServices.Handle)
Метод записывает в данный объект Filer указанный дескриптор Handle.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Дескриптор, который следует записать. Тип <c>Handle</c>.

Teigha.DatabaseServices.DxfFiler.WriteInt16(Teigha.DatabaseServices.DxfCode,short)
Метод записывает в данный объект Filer указанное 16-разрядное целое число со знаком (<c>short</c>).
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>short</c>.

Teigha.DatabaseServices.DxfFiler.WriteInt32(Teigha.DatabaseServices.DxfCode,System.Int32)
Метод записывает в данный объект Filer указанное 32-разрядное целое число со знаком (<c>int</c>).
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>int</c>.

Teigha.DatabaseServices.DxfFiler.WriteInt64(Teigha.DatabaseServices.DxfCode,long long)
Метод записывает в данный объект Filer указанное 64-разрядное целое число со знаком (<c>long long</c>).
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>long long</c>.

Teigha.DatabaseServices.DxfFiler.WriteObjectId(Teigha.DatabaseServices.DxfCode,Teigha.DatabaseServices.ObjectId)
Метод записывает в данный объект Filer указанный идентификатор объекта ObjectId.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Идентификатор объекта, который следует записать. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.DxfFiler.WritePoint2d(Teigha.DatabaseServices.DxfCode,Teigha.Geometry.Point2d,System.Int32)
Метод записывает в данный объект Filer указанную двумерную точку.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: 2D-точка, которую следует записать. Тип <c>Point2d</c>.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип <c>int</c>. Параметр используется для представления координат точки.

Teigha.DatabaseServices.DxfFiler.WritePoint3d(Teigha.DatabaseServices.DxfCode,Teigha.Geometry.Point3d,System.Int32)
Метод записывает в данный объект Filer указанную трехмерную точку.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: 3D-точка, которую следует записать. Тип <c>Point3d</c>.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип <c>int</c>. Параметр используется для представления координат точки.

Teigha.DatabaseServices.DxfFiler.WriteResultBuffer(Teigha.DatabaseServices.ResultBuffer)
Метод записывает в данный объект Filer указанный буфер результатов.
buffer: Буфер результатов, который должен быть записан в файлер. Тип <c>ResultBuffer</c>.

Teigha.DatabaseServices.DxfFiler.WriteScale3d(Teigha.DatabaseServices.DxfCode,Teigha.Geometry.Scale3d,System.Int32)
Метод записывает в данный объект Filer указанный масштаб.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Масштаб, который следует записать. Тип <c>Scale3d</c>.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип <c>int</c>. Используется для действительных значений.

Teigha.DatabaseServices.DxfFiler.WriteString(Teigha.DatabaseServices.DxfCode,String)
Метод записывает в данный объект Filer указанную строку.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>String</c>.

Teigha.DatabaseServices.DxfFiler.WriteUInt16(Teigha.DatabaseServices.DxfCode,unsigned short)
Метод записывает в данный объект Filer указанное 16-разрядное целое число без знака (unsigned short).
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>unsigned short</c>.

Teigha.DatabaseServices.DxfFiler.WriteUInt32(Teigha.DatabaseServices.DxfCode,unsigned int)
Метод записывает в данный объект Filer указанное 32-разрядное целое число без знака (unsigned int).
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>unsigned int</c>.

Teigha.DatabaseServices.DxfFiler.WriteUInt64(Teigha.DatabaseServices.DxfCode,unsigned long long)
Метод записывает в данный объект Filer указанное 64-разрядное целое число без знака (<c>unsigned long long</c>).
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>unsigned long long</c>.

Teigha.DatabaseServices.DxfFiler.WriteVector2d(Teigha.DatabaseServices.DxfCode,Teigha.Geometry.Vector2d,System.Int32)
Метод записывает в данный объект Filer указанный 2D-вектор и точность представления координат вектора.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>Vector2d</c>.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип <c>int</c>.

Teigha.DatabaseServices.DxfFiler.WriteVector3d(Teigha.DatabaseServices.DxfCode,Teigha.Geometry.Vector3d,System.Int32)
Метод записывает в данный объект Filer указанный 3D-вектор и точность представления координат вектора.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>Vector3d</c>.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип <c>int</c>.

Teigha.DatabaseServices.DxfFiler.WriteAngle(Teigha.DatabaseServices.DxfCode,System.Double,System.Int32)
Метод записывает в данный объект Filer указанное значение угла.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>double</c>.
precision: Количество цифр после запятой в интервале от 0 до 16. Тип <c>int</c>. Определяет точность представления числа с плавающей точкой.

Teigha.DatabaseServices.DxfFiler.WriteName(Teigha.DatabaseServices.DxfCode,String)
Метод записывает в данный объект Filer указанное имя в виде текстовой строки.
opCode: Групповой код DXF. Тип <c>DxfCode</c>.
value: Значение, которое следует записать. Тип <c>String</c>.

Teigha.DatabaseServices.DxfFiler.WriteXDataStart
Метод определяет начало расширенных данных xdata в этом объекте Filer.

Teigha.DatabaseServices.DxfFiler.AtEndOfFile
Свойство позволяет определить, находится ли в конце файла указатель этого объекта Filer.
Returns: Возвращает <c>true</c>, если указатель объекта Filer находится в конце файла.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DxfFiler.AtEndOfObject
Свойство позволяет определить, находится ли этот объект Filer в конце данных объекта.
Returns: Возвращает <c>true</c>, если указатель объекта Filer находится в конце данных объекта.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DxfFiler.AtExtendedData
Свойство позволяет определить, находится ли этот объект Filer в начале расширенных данных xdata объекта.
Returns: Возвращает <c>true</c>, если Filer находится в начале расширенных данных (xdata) объекта.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DxfFiler.Precision
Свойство задает или возвращает точность представления чисел с плавающей точкой в представлении ASCII DXF.
Точность задается как количество десятичных знаков после разделителя в диапазоне от 0 до 16.
Returns: Возвращает количество десятичных знаков после разделителя. Тип <c>int</c>.

Teigha.DatabaseServices.DxfFiler.IsModifyingExistingObject
Свойство позволяет определить, используется ли данный DxfFiler для изменения существующего объекта.
Не реализовано.
Returns: Возвращает <c>true</c>, если данный DxfFiler используется в операции изменения существующего объекта.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DxfFiler.AtEmbeddedObjectStart
Свойство позволяет определить, указывает ли этот объект DxfFiler на элемент с кодом <c>DxfCode.EmbeddedObjectStart</c>.
Не реализовано.
Returns: Возвращает <c>true</c>, если объект DxfFiler указывает на элемент с кодом <c>DxfCode.EmbeddedObjectStart</c>.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DxfFiler.IncludesDefaultValues
Свойство позволяет определить, используется ли DxfFiler для целей, в которых обычно выводятся значения по умолчанию.
Не реализовано.
Returns: Возвращает <c>true</c>, если DxfFiler используется для целей, в которых обычно выводятся значения по умолчанию.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DxfFiler.Elevation
Свойство обеспечивает доступ к высоте расположения (возвышению) объекта.
Не реализовано.
Returns: Возвращает высоту (возвышение) расположения объекта. Тип <c>double</c>.

Teigha.DatabaseServices.DxfFiler.Thickness
Свойство возвращает толщину.  Не реализовано.
Returns: Возвращает толщину. Тип <c>double</c>.

Teigha.DatabaseServices.DxfFiler.ErrorMessage
Свойство обеспечивает доступ к сообщению об ошибке, которое в данный момент настроено в объекте DxfFiler для отображения в случае возникновения ошибки. Не реализовано.
Returns: Возвращает строку с сообщением об ошибке. Тип <c>String</c>.

Teigha.DatabaseServices.DxfFiler.DwgVersion
Свойство обеспечивает доступ к текущей версии чертежа.
Returns: Возвращает версию чертежа. Тип <c>FullDwgVersion</c>.

Teigha.DatabaseServices.DxfFiler.Database
Свойство предоставляет доступ к базе данных, связанной с данным объектом DxfFiler.
Returns: Возвращает базу данных. Тип DatabaseServices.Database.

Teigha.DatabaseServices.DxfFiler.FilerStatus
Свойство возвращает текущее состояние данного объекта DxfFiler.
Returns: Возвращает текущее состояние данного объекта DxfFiler.  Тип Runtime.ErrorStatus.

Teigha.DatabaseServices.DxfFiler.FilerType
Свойство возвращает конкретный тип данного объекта Filer.
Returns: Возвращает тип данного файлера как значение из перечисления Teigha.DatabaseServices.FilerType.

Teigha.DatabaseServices.DxfFiler.Position
Свойство обеспечивает доступ к позиции указателя ввода-вывода данного объекта DxfFiler.
Returns: Возвращает позицию указателя ввода-вывода данного объекта DxfFiler.  Тип <c>long</c>.