Teigha.BoundaryRepresentation.ComplexShellEnumerator
Класс <c>ComplexShellEnumerator</c> представляет перечислитель оболочек, соответствующих комплексу.

Teigha.BoundaryRepresentation.ComplexShellEnumerator.Current
Свойство <c>Current</c> предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип <c>Shell</c>.