Teigha.DatabaseServices.MlineStyle
Этот класс представляет в базе данных объекты стиля мультилинии.

Teigha.DatabaseServices.MlineStyle.#ctor
Конструктор по умолчанию класса <c>MlineStyle</c>.

Teigha.DatabaseServices.MlineStyle.Reset
Метод предназначен для реинициализации данного объекта.

Teigha.DatabaseServices.MlineStyle.Set(Teigha.DatabaseServices.MlineStyle,System.Boolean)
Метод делает данный объект копией указанного объекта <c>MlineStyle</c>.
source: Объект-источник.  Тип <c>MlineStyle</c>.
checkIfReferenced: Флаг, указывающий, следует ли проверять наличие ссылок на этот стиль. Тип <c>bool</c>.  В текущей версии не используется.

Teigha.DatabaseServices.MlineStyle.Description
Свойство представляет описание данного объекта.
Returns: Возвращает описание данного объекта. Тип <c>String</c>.

Teigha.DatabaseServices.MlineStyle.Elements
Свойство представляет элементы данного объекта <c>MlineStyle</c> с данными о цвете, смещении и типах линий, используемых стилем мультилинии.
Returns: Возвращает коллекцию элементов мультилинии. Тип <c>MlineStyleElementCollection</c>.

Teigha.DatabaseServices.MlineStyle.EndAngle
Свойство представляет угол скоса торцевого ограничителя на завершающем торце мультилинии.
Returns: Возвращает угол скоса торцевого ограничителя (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.MlineStyle.EndInnerArcs
Свойство управляет отображением внутренних дуг на завершающем торце мультилинии.
Returns: Возвращает <c>true</c>, если отображение внутренних дуг на завершающем торце мультилинии включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MlineStyle.EndRoundCap
Свойство управляет отображением круглого торцевого ограничителя на завершающем торце мультилинии.
Returns: Возвращает <c>true</c>, если отображение круглого торцевого ограничителя включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MlineStyle.EndSquareCap
Свойство управляет отображением квадратного торцевого ограничителя на завершающем торце мультилинии.
Returns: Возвращает <c>true</c>, если отображение квадратного торцевого ограничителя включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MlineStyle.FillColor
Свойство представляет цвет фоновой заливки мультилинии.
Returns: Возвращает цвет фоновой заливки мультилинии.  Тип <c>Color</c>.

Teigha.DatabaseServices.MlineStyle.Filled
Свойство управляет режимом фоновой заливки мультилинии.
Returns: Возвращает <c>true</c>, если фоновая заливка включена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MlineStyle.Name
Свойство представляет наименование данного стиля.
Returns: Возвращает наименование данного стиля. Тип <c>String</c>.

Teigha.DatabaseServices.MlineStyle.ShowMiters
Свойство управляет отображением линий стыков (miterlines) в вершинах мультилиний.
Returns: Возвращает <c>true</c>, если отображение линий стыков включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MlineStyle.StartAngle
Свойство представляет угол скоса торцевого ограничителя на начальном торце мультилинии.
Returns: Возвращает угол скоса торцевого ограничителя (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.MlineStyle.StartInnerArcs
Свойство управляет отображением внутренних дуг на начальном торце мультилинии.
Returns: Возвращает <c>true</c>, если отображение внутренних дуг на начальном торце мультилинии включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MlineStyle.StartRoundCap
Свойство управляет отображением круглого торцевого ограничителя на начальном торце мультилинии.
Returns: Возвращает <c>true</c>, если отображение круглого торцевого ограничителя включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MlineStyle.StartSquareCap
Свойство управляет отображением квадратного торцевого ограничителя на начальном торце мультилинии.
Returns: Возвращает <c>true</c>, если отображение квадратного торцевого ограничителя включено.
В противном случае возвращает <c>false</c>.