Teigha.DatabaseServices.GeometryOverrule
Абстрактный класс Teigha.DatabaseServices.GeometryOverrule определяет связанные с геометрией методы объектных переопределений.

Teigha.DatabaseServices.GeometryOverrule.GetGeomExtents(Teigha.DatabaseServices.Entity)
Метод GetGeomExtents возвращает минимальный прямоугольный параллелепипед, в который вписан заданный экземпляр класса Entity.
entity: Входной объект типа Entity, для которого определяются границы.
Returns: Возвращает экземпляр класса Extents3d для аргумента entity.

Teigha.DatabaseServices.GeometryOverrule.IntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Plane,Teigha.Geometry.Point3dCollection,IntPtr,IntPtr)
Метод находит точки пересечения двух объектов чертежа.
entity: Первый объект, экземпляр класса Entity,
ent: Второй объект, экземпляр класса Entity,
intType: Значение перечисления Teigha.DatabaseServices.Intersect,
Plane projPlane: Плоскость проекции, экземпляр класса Plane,
points: Коллекция Point3dCollection точек пересечения,
thisGsMarker: Первый указатель IntPtr,
otherGsMarker: Второй указатель IntPtr.

Teigha.DatabaseServices.GeometryOverrule.IntersectWith(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Intersect,Teigha.Geometry.Point3dCollection,IntPtr,IntPtr)
Метод находит точки пересечения двух объектов чертежа.
entity: Первый объект, экземпляр класса Entity,
ent: Второй объект, экземпляр класса Entity,
intType: Значение перечисления Teigha.DatabaseServices.Intersect,
points: Коллекция Point3dCollection точек пересечения,
thisGsMarker: Первый указатель IntPtr,
otherGsMarker: Второй указатель IntPtr.

Teigha.DatabaseServices.GeometryOverrule.SetCustomFilter
Метод делает возможным использование метода IsApplicable базового класса Overrule, чтобы установить применимость объектных переопределений.

Teigha.DatabaseServices.GeometryOverrule.SetExtensionDictionaryEntryFilter(String)
Метод делает возможным поиск в словаре расширений, чтобы установить необходимость применения объектных переопределений.
entryName: Имя входного объекта, тип String.

Teigha.DatabaseServices.GeometryOverrule.SetIdFilter(array&lt;ObjectId&gt;)
Метод реализует фильтрацию объектов по ObjectId перед применением объектного переопределения.
ids: Входной массив объектов ObjectId.

Teigha.DatabaseServices.GeometryOverrule.SetNoFilter
Отключает все методы фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter, а также метод IsApplicable() базового класса Overrule) при определении необходимости применения объектного переопределения.

Teigha.DatabaseServices.GeometryOverrule.SetXDataFilter(String)
Позволяет задать условие применения объектного переопределения на основе расширенных данных (xdata).
registeredApplicationName: Имя зарегистрированного приложения, тип String.