Teigha.DatabaseServices.Filters.FilteredBlockIterator
Данный класс реализует итераторы, выполняющие проход по запросам, которые определены объектами <c>Filter</c> в записях таблицы блоков.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.Accepts(Teigha.DatabaseServices.ObjectId)
Метод предоставляет возможность проверить, проходит ли указанный объект запрос объекта <c>Filter</c>.
id: Входной идентификатор проверяемого объекта. Тип <c>ObjectId</c>.
Returns: Возвращает <c>true</c> тогда и только тогда, когда указанный объект удовлетворяет запросу.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.AddToBuffer(Teigha.DatabaseServices.ObjectId)
Метод позволяет добавить указанный идентификатор объекта чертежа в буфер, поддерживаемый итератором индекса.
id: Идентификатор добавляемого объекта чертежа. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.Seek(Teigha.DatabaseServices.ObjectId)
Метод <c>Seek()</c> реализует устаревший метод обобщенного обхода индекса, используемый для поддержки эмуляции устаревшей базы данных.
id: Идентификатор искомого объекта. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.Start
Данный метод инициирует работу итератора.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.BuffersForComposition
Свойство позволяет проверить, должен ли итератор индекса, если он не является основным итератором, буферизовать свои выходные данные.
Returns: Возвращает <c>true</c> тогда и только тогда, когда итератор индекса, если он не является основным итератором, должен буферизовать свои выходные данные. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.EstimatedHitFraction
Свойство <c>EstimatedHitFraction</c> используется для определения приоритета, согласно которому объекты FilteredBlockIterator будут использоваться в процессе обхода блоков.
Returns: Возвращает предполагаемую долю в интервале [0.0 .. 1.0] объема содержимого индекса, который будет обработан на основе запроса фильтра. Тип <c>double</c>.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.Id
Свойство <c>Id</c> возвращает идентификатор объекта в текущей позиции итератора.
Returns: Возвращает идентификатор объекта в текущей позиции итератора. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.Filters.FilteredBlockIterator.Next
Свойство <c>Next</c> получает доступ к текущей позиции итератора и возвращает следующий идентификатор объекта <c>ObjectId</c>.
Returns: Возвращает следующий идентификатор объекта <c>ObjectId</c>.