Teigha.DatabaseServices.AssocArrayParameters
Класс предоставляет интерфейс для управления параметрами ассоциативного массива.

Teigha.DatabaseServices.AssocArrayParameters.Commit
Метод предназначен для коммита (фиксации) изменений в объекте AssocArrayParameters и синхронизации изменений с базой данных, таким образом, изменения в массиве становятся видны на экране.

Teigha.DatabaseServices.AssocArrayParameters.Owner
Свойство обеспечивает доступ к владельцу данного объекта AssocArrayParameters (т.е. к объекту AssocArray).
Returns: Возвращает объект AssocArray.