Teigha.BoundaryRepresentation.Vertex
Класс <c>Vertex</c> является интерфейсным классом для вершин BREP.

Teigha.BoundaryRepresentation.Vertex.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса <c>Vertex</c>. Создает экземпляр класса, используя переданный путь подобъекта.
fullSubentPath: Полный путь подобъекта.

Teigha.BoundaryRepresentation.Vertex.GetEdgesStartingFrom(Teigha.BoundaryRepresentation.Edge)
Метод позволяет получить коллекцию ребер, начиная с указанного стартового ребра.
startFrom: Входное стартовое ребро.  Тип <c>Edge</c>.
Returns: Возвращает коллекцию ребер.  Тип <c>VertexEdgeCollection</c>.

Teigha.BoundaryRepresentation.Vertex.GetLoopsStartingFrom(Teigha.BoundaryRepresentation.BoundaryLoop)
Метод позволяет получить коллекцию циклов грани, начиная с указанного стартового цикла.
startFrom: Стартовый цикл грани.  Тип <c>BoundaryLoop</c>.
Returns: Возвращает коллекцию циклов грани.  Тип <c>VertexLoopCollection</c>.

Teigha.BoundaryRepresentation.Vertex.Edges
Свойство <c>Edges</c> предоставляет доступ ко всем ребрам, связанным с данной вершиной.
Returns: Возвращает коллекцию ребер.  Тип <c>VertexEdgeCollection</c>.

Teigha.BoundaryRepresentation.Vertex.Loops
Свойство <c>Loops</c> предоставляет доступ ко всем циклам, связанным с данной вершиной.
Returns: Возвращает коллекцию циклов.  Тип <c>VertexLoopCollection</c>.

Teigha.BoundaryRepresentation.Vertex.Point
Свойство <c>Point</c> предоставляет доступ к базовой точке данной вершины как к объекту <c>Point3d</c>.
Returns: Возвращает базовую точку данной вершины.  Тип <c>Point3d</c>.