Teigha.GraphicsSystem.Model
Класс <c>Model</c> представляет коллекции отображаемых объектов платформы ODA Platform.

Teigha.GraphicsSystem.Model.Highlight(GraphicsInterface.PathNode,System.Boolean,Teigha.GraphicsSystem.View)
Метод подсвечивает указанный объект чертежа в данном объекте <c>Model</c>.
path: Путь к объекту, который следует подсветить. Тип <c>GraphicsInterface.PathNode</c>.
bDoIt: Флаг, определяющий, включено ли подсвечивание объектов (значение <c>true</c>) или отключено (значение <c>false</c>). Тип <c>bool</c>.
pView: Вид, в котором указанный объект должен быть подсвечен. Тип <c>View</c>.

Teigha.GraphicsSystem.Model.Invalidate(Teigha.GraphicsSystem.InvalidationHint)
Метод делает недействительными указанные кэшированные данные, содержащиеся в данном объекте <c>Model</c>.
hint: Уточнение типа кэшированных данных, которые следует отметить как неактуальные.

Teigha.GraphicsSystem.Model.Invalidate(Teigha.GraphicsSystem.View)
Метод делает недействительными кэшированные данные указанного вида в данном объекте <c>Model</c>.
pView: Объект вида, кэшированные данные которого следует отметить как неактуальные.

Teigha.GraphicsSystem.Model.OnAdded(Teigha.GraphicsInterface.Drawable,long)
Метод реализует уведомление о каждом добавлении объекта типа <c>Drawable</c> к данному объекту <c>Model</c>.
Данные о родительском объекте добавленного объекта передаются идентификатором родительского объекта.
pAdded: Добавленный объект типа <c>Drawable</c>.
parentID: Идентификатор объекта, который является родительским по отношению к добавленному объекту <c>pAdded</c>.  Тип <c>long</c>.

Teigha.GraphicsSystem.Model.OnAdded(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.Drawable)
Метод реализует уведомление о каждом добавлении объекта типа <c>Drawable</c> к данному объекту <c>Model</c>.
Данные о родительском объекте добавленного объекта передаются указателем на объект типа <c>Drawable</c>.
pAdded: Добавленный объект типа <c>Drawable</c>.
pParent: Родительский объект добавленного объекта <c>pAdded</c>.  Тип <c>Drawable</c>.

Teigha.GraphicsSystem.Model.OnErased(Teigha.GraphicsInterface.Drawable,long)
Метод реализует уведомление о каждом удалении объекта типа <c>Drawable</c> из данного объекта <c>Model</c>.
Данные о родительском объекте удаленного объекта передаются в метод идентификатором родительского объекта.
pErased: Удаленный объект типа <c>Drawable</c>.
parentID: Идентификатор объекта, который является родительским по отношению к удаленному объекту <c>pErased</c>.  Тип <c>long</c>.

Teigha.GraphicsSystem.Model.OnErased(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.Drawable)
Метод реализует уведомление о каждом удалении объекта типа <c>Drawable</c> из данного объекта <c>Model</c>.
Данные о родительском объекте удаленного объекта передаются указателем на объект типа <c>Drawable</c>.
pErased: Удаленный объект типа <c>Drawable</c>.
pParent: Родительский объект удаленного объекта <c>pErased</c>.  Тип <c>Drawable</c>.

Teigha.GraphicsSystem.Model.OnModified(Teigha.GraphicsInterface.Drawable,long)
Метод реализует уведомление о каждом изменении объекта типа <c>Drawable</c> в данном объекте <c>Model</c>.
Информация о родительском объекте измененного объекта передается идентификатором родительского объекта.
pModified: Измененный объект типа <c>Drawable</c>.
parentID: Идентификатор объекта, который является родительским по отношению к измененному объекту <c>pModified</c>.  Тип <c>long</c>.

Teigha.GraphicsSystem.Model.OnModified(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.Drawable)
Метод реализует уведомление о каждом изменении объекта типа <c>Drawable</c> в данном объекте <c>Model</c>.
Информация о родительском объекте измененного объекта передается указателем на объект типа <c>Drawable</c>.
pModified: Измененный объект типа <c>Drawable</c>.
pParent: Родительский объект измененного объекта <c>pModified</c>.  Тип <c>Drawable</c>.

Teigha.GraphicsSystem.Model.OnUnerased(Teigha.GraphicsInterface.Drawable,long)
Метод реализует уведомление о каждой отмене удаления объекта типа <c>Drawable</c> в данном объекте <c>Model</c>.
Информация о родительском объекте восстановленного объекта передается идентификатором родительского объекта.
pUnerased: Восстановленный объект типа <c>Drawable</c>.
parentID: Идентификатор объекта, который является родительским по отношению к восстановленному объекту <c>pUnerased</c>.  Тип <c>long</c>.

Teigha.GraphicsSystem.Model.OnUnerased(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.Drawable)
Метод реализует уведомление о каждой отмене удаления объекта типа <c>Drawable</c> в данном объекте <c>Model</c>.
Информация о родительском объекте восстановленного объекта передается идентификатором родительского объекта.
pUnerased: Восстановленный объект типа <c>Drawable</c>.
pParent: Родительский объект восстановленного объекта <c>pUnerased</c>. Тип <c>Drawable</c>.

Teigha.GraphicsSystem.Model.setSectioning(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d)
Метод позволяет задать активное сечение для данного объекта <c>Model</c>.
Аргументы метода определяют плоскость сечения и границу области сечения.
После определения сечения его следует активировать, используя свойство <c>EnableSectioning</c>.
points: Коллекция копланарных точек, определяющих плоскую границу области сечения. Тип <c>Point3dCollection</c>.
upVector: Вектор, задающий ориентацию плоскости области сечения. Тип <c>Vector3d</c>.
Returns: Возвращает <c>true</c>, если если указанное сечение является допустимым.
Возвращает <c>false</c>, если указанное сечение недействительно или сформировано неправильно.

Teigha.GraphicsSystem.Model.setSectioning(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,System.Double,System.Double)
Метод позволяет задать активное сечение для данного объекта <c>Model</c>.
Рассечение ограничено по вертикали с использованием заданных значений высот сверху и снизу.
После определения сечения его следует активировать, используя свойство <c>EnableSectioning</c>.
points: Коллекция копланарных точек, определяющих плоскую границу области сечения. Тип <c>Point3dCollection</c>.
upVector: Вектор, задающий ориентацию плоскости области сечения. Тип <c>Vector3d</c>.
dTop: Высота, ограничивающая сечение сверху. Тип <c>double</c>.
dBottom: Высота, ограничивающая сечение снизу.  Тип <c>double</c>.
Returns: Возвращает <c>true</c>, если если указанное сечение является допустимым.
Возвращает <c>false</c>, если указанное сечение недействительно или сформировано неправильно.

Teigha.GraphicsSystem.Model.Background
Свойство <c>Background</c> представляет идентификатор объекта, определяющего фон вида.
Returns: Возвращает идентификатор объекта, определяющего фон вида. Тип <c>DatabaseServices.ObjectId</c>. Если фон не задан, возвращает <c>ObjectId.kNull</c>.

Teigha.GraphicsSystem.Model.EnableLightsInBlocks
Свойство <c>EnableLightsInBlocks</c> позволяет определить, используются ли при визуализации содержащиеся в блоках источники света.
Returns: Возвращает <c>true</c>, если источники света, содержащиеся в блоках, используются при визуализации.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.Model.EnableLinetypes
Свойство <c>EnableLinetypes</c> позволяет определить, активирован ли в данном объекте <c>Model</c> режим использования типов линий.
Returns: Возвращает <c>true</c>, если режим использования типов линий включен.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.Model.EnableSectioning
Свойство <c>EnableSectioning</c> позволяет определить, включено ли использование текущего определения сечения на видах, на которых представлен данный объект <c>Model</c>.
Returns: Возвращает <c>true</c>, если отображение сечения включено.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.Model.EnableViewExtentsCalculation
Свойство <c>EnableViewExtentsCalculation</c> позволяет определить, включено ли вычисление габаритных границ видов.
Returns: Возвращает <c>true</c>, если вычисление габаритных границ видов включено.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.Model.RenderModeOverride
Свойство <c>RenderModeOverride</c> представляет переопределенный режим рендеринга данного объекта <c>Model</c>.
Returns: Возвращает переопределенный режим рендеринга.
Тип <c>RenderMode</c>.

Teigha.GraphicsSystem.Model.RenderType
Свойство <c>RenderType</c> представляет тип рендеринга данного объекта <c>Model</c>.
Returns: Возвращает тип рендеринга данного объекта.
Тип <c>GraphicsSystem.RenderType</c>.

Teigha.GraphicsSystem.Model.SectioningVisualStyle
Свойство <c>SectioningVisualStyle</c> представляет визуальный стиль, который будет использоваться для объектов на отрезанной стороне сечения.
Передача нулевого идентификатора объекта (это стиль по умолчанию) указывает на то, что отрезанная сторона отображаться не должна.
Стиль по умолчанию — <c>null</c>.
Returns: Возвращает идентификатор визуального стиля.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.GraphicsSystem.Model.Selectable
Свойство <c>Selectable</c> представляет доступ к переменной <c>Selectable</c>, которая определяет, можно ли выделять данный объект <c>Model</c>.
Returns: Возвращает <c>true</c>, если выделение допустимо.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.Model.Transform
Свойство <c>Transform</c> представляет матрицу базового геометрического преобразования для данного объекта <c>Model</c>.
Returns: Возвращает матрицу геометрического преобразования модели.
Тип <c>Matrix3d</c>.

Teigha.GraphicsSystem.Model.ViewClippingOverride
Свойство <c>ViewClippingOverride</c> позволяет определить, учитываются ли на видах передняя и задняя плоскости отсечения.
Returns: Возвращает <c>true</c>, если геометрическим элементам модели позволено игнорировать плоскости отсечения вида (если таковые определены).
Значение <c>false</c> гарантирует, что модель учитывает плоскости отсечения вида (это поведение по умолчанию).

Teigha.GraphicsSystem.Model.ViewSectioningOverride
Свойство <c>ViewSectioningOverride</c> позволяет определить, должна ли геометрия данного объекта <c>Model</c> игнорировать переднюю и заднюю плоскости отсечения вида (если определены) и 3D-отсечение для видового экрана (если задано).
Returns: Возвращает <c>false</c>, если плоскости отсечения вида и 3D-отсечение для видового экрана разрешены данным объектом <c>Model</c>.
В противном случае возвращает <c>true</c>.

Teigha.GraphicsSystem.Model.VisualStyle
Свойство <c>VisualStyle</c> представляет непостоянный визуальный стиль отображения данного объекта <c>Model</c>.
Returns: Возвращает стиль отображения данной модели.
Тип <c>GraphicsInterface.VisualStyle</c>.

Teigha.GraphicsSystem.Model.VisualStyleId
Свойство <c>VisualStyleId</c> представляет постоянный визуальный стиль отображения модели.
Returns: Возвращает идентификатор объекта постоянного визуального стиля отображения модели.
Тип <c>DatabaseServices.ObjectId</c>.