Teigha.DatabaseServices.XrefGraphNode
Класс <c>XrefGraphNode</c> представляет в базе данных узлы графа внешних ссылок.

Teigha.DatabaseServices.XrefGraphNode.BlockTableRecordId
Свойство <c>BlockTableRecordId</c> представляет идентификатор объекта <c>BlockTableRecord</c>, связанный с данным узлом.
Returns: Возвращает идентификатор связанного объекта <c>BlockTableRecord</c>.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.XrefGraphNode.Database
Свойство <c>Database</c> представляет базу данных, соответствующую данному узлу.
Returns: Возвращает базу данных для данного объекта.
Тип <c>DatabaseServices.Database</c>.

Teigha.DatabaseServices.XrefGraphNode.IsNested
Свойство <c>IsNested</c> позволяет проверить, представляет ли данный узел вложенную внешнюю ссылку.
Returns: Возвращает <c>true</c>, если данный узел представляет вложенную внешнюю ссылку.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.XrefGraphNode.Name
Свойство <c>Name</c> представляет имя, связанное с данным узлом.
Returns: Возвращает связанное с данным узлом имя.
Тип <c>String</c>.

Teigha.DatabaseServices.XrefGraphNode.XrefNotificationStatus
Свойство <c>XrefNotificationStatus</c> представляет состояние уведомления о внешней ссылке для данного узла.
Returns: Возвращает состояние уведомления о внешней ссылке. Перечисление <c>DatabaseServices.XrefNotificationStatus</c>.

Teigha.DatabaseServices.XrefGraphNode.XrefStatus
Свойство <c>XrefStatus</c> представляет состояние данного узла.
Returns: Возвращает состояние данного узла. Перечисление <c>DatabaseServices.XrefStatus</c>.