Teigha.DatabaseServices.TransactionManager
Данный класс представляет системный менеджер транзакций.

Teigha.DatabaseServices.TransactionManager.#ctor(IntPtr,System.Boolean)
Конструктор.

Teigha.DatabaseServices.TransactionManager.AddNewlyCreatedDBObject(Teigha.DatabaseServices.DBObject,System.Boolean)
Данный метод добавляет в транзакцию вновь созданную запись DBObject в базе данных.
obj: Объект DBObject.
add: Если add == true, объект, на который указывает obj, добавляется к верхней транзакции. Если add == false, то объект удаляется.

Teigha.DatabaseServices.TransactionManager.GetAllObjects
Метод выполняет поиск всех существующих на данный момент объектов транзакции и возвращает коллекцию с указателями на все найденные объекты.

Teigha.DatabaseServices.TransactionManager.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode)
Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
id: Идентификатор ObjectId получаемого объекта.
mode: Режим доступа к объекту из перечисления OpenMode.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.TransactionManager.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean)
Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
С помощью логического аргумента openErased можно получить доступ к удаленному объекту.
id: Идентификатор ObjectId получаемого объекта.
mode: Режим доступа к объекту из перечисления OpenMode.
openErased: Если передать значение true, можно получить удаленный объект.  Если задать false, то попытка получить удаленный объект вернет ошибку.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.TransactionManager.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Этот метод вызывает метод GetObject() верхней транзакции с передачей ему всех полученных аргументов.
Аргументы метода позволяют управлять режимом доступа к открываемым объектам, а также включать доступ к удаленным объектам и заблокированным слоям.
id: Идентификатор ObjectId получаемого объекта.
mode: Режим доступа к объекту из перечисления OpenMode.
openErased: Если передать значение true, можно получить удаленный объект.  Если задать false, то попытка получить удаленный объект вернет ошибку.
forceOpenOnLockedLayer: Флаг доступа к заблокированному слою. Если задать true, можно открыть заблокированный слой. Если задать false, то попытка обращения к заблокированному слою вернет ошибку.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.TransactionManager.QueueForGraphicsFlush
Этот метод формирует очередь графического обновления всех измененных объектов-резидентов любых транзакций этого менеджера транзакций.

Teigha.DatabaseServices.TransactionManager.StartOpenCloseTransaction
Этот метод создает должным образом инициализированный объект OpenCloseTransaction.

Teigha.DatabaseServices.TransactionManager.StartTransaction
Этот метод запускает новую транзакцию.

Teigha.DatabaseServices.TransactionManager.NumberOfActiveTransactions
Свойство возвращает количество активных транзакций.
Returns: Возвращает количество активных транзакций, тип int.

Teigha.DatabaseServices.TransactionManager.TopTransaction
Предоставляет доступ к объекту Transaction, который является верхним в стеке транзакций (т.е. к последнему созданному объекту Transaction).
Returns: Возвращает объект Transaction.