Teigha.DatabaseServices.Wipeout
Класс <c>Wipeout</c> представляет в базе данных растровые объекты с полигональной границей, которые используются в качестве масок (маскирующих объектов), чтобы перекрывать элементы других объектов на чертеже.

Teigha.DatabaseServices.Wipeout.#ctor
Конструктор по умолчанию класса <c>Wipeout</c>.

Teigha.DatabaseServices.Wipeout.SetFrom(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector3d)
Метод позволяет задать ориентацию и границу данной маски.
points: Коллекция 2D-точек, которые определяют новую границу данной маски.  Тип <c>Point2dCollection</c>.
normal: Вектор нормали плоскости границы. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Wipeout.HasFrame
Свойство <c>HasFrame</c> позволяет определить, отображается ли граница данной маски.
Returns: Возвращает <c>true</c>, если граница маски отображается.
В противном случае возвращает <c>false</c>.