Teigha.BoundaryRepresentation.BrepFaceCollection
Класс <c>BrepFaceCollection</c> представляет коллекцию граней, соответствующих граничному представлению.

Teigha.BoundaryRepresentation.BrepFaceCollection.GetEnumerator
Метод предоставляет перечислитель данной коллекции.
Returns: Возвращает перечислитель коллекции граней B-Rep.
Тип <c>BrepFaceEnumerator</c>.