Teigha.DatabaseServices.DatabaseIOEventArgs
Класс представляет данные для событий базы данных, связанных с операциями ввода-вывода (<c>BeginSave</c>, <c>DwgFileOpened</c> и <c>SaveComplete</c>).

Teigha.DatabaseServices.DatabaseIOEventArgs.FileName
Свойство представляет доступ к имени файла чертежа.
Returns: Возвращает имя файла. Тип String.