Teigha.BoundaryRepresentation.BrepShellEnumerator
Класс <c>BrepShellEnumerator</c> представляет перечислитель оболочек, соответствующих граничному представлению B-Rep.

Teigha.BoundaryRepresentation.BrepShellEnumerator.Current
Свойство <c>Current</c> предоставляет доступ к оболочке, которая является текущим элементом данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип <c>Shell</c>.