Teigha.DatabaseServices.DynamicDimensionData
Класс DynamicDimensionData поддерживает динамические размеры для производных от Entity объектов.

Teigha.DatabaseServices.DynamicDimensionData.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.DynamicDimensionData.#ctor(Teigha.DatabaseServices.Dimension)
Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension.
dimension: Входной размер, на основе которого создается динамический размер. Тип Dimension.

Teigha.DatabaseServices.DynamicDimensionData.#ctor(Teigha.DatabaseServices.Dimension,System.Boolean)
Конструктор класса DynamicDimensionData.
Создает динамический размер на основе данных указанного объекта Dimension.
Дополнительный аргумент позволяет включить или отключить возможность редактирования динамического размера.
dimension: Входной размер, на основе которого создается динамический размер. Тип Dimension.
editable: Флаг, который определяет, является ли создаваемый динамический размер редактируемым. Тип <c>bool</c>.

Teigha.DatabaseServices.DynamicDimensionData.#ctor(Teigha.DatabaseServices.Dimension,System.Boolean,System.Boolean)
Конструктор класса DynamicDimensionData. Создает динамический размер на основе данных указанного объекта Dimension.
Дополнительные аргументы позволяют настроить возможность редактирования и видимость динамического размера.
dimension: Входной размер, на основе которого создается динамический размер. Тип Dimension.
editable: Флаг, который определяет, является ли создаваемый динамический размер редактируемым. Тип <c>bool</c>.
hideIfValueIsZero: Флаг, который определяет, следует ли скрывать создаваемый динамический размер в случае нулевого значения. Тип <c>bool</c>.

Teigha.DatabaseServices.DynamicDimensionData.Create(IntPtr,System.Boolean)
Метод позволяет создать новый объект DynamicDimensionData на основе переданного в метод указателя.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Флаг автоудаления исходного объекта. Тип <c>bool</c>.
Returns: Возвращает новый экземпляр класса DynamicDimensionData.

Teigha.DatabaseServices.DynamicDimensionData.ApplicationData
Свойство ApplicationData обеспечивает доступ к данным приложения, связанным с этим объектом.
Returns: Возвращает данные приложения, связанные с динамическим размером. Тип <c>Object</c>.

Teigha.DatabaseServices.DynamicDimensionData.Dimension
Свойство Dimension обеспечивает доступ объекту Dimension этого динамического размера.
Returns: Возвращает объект размера. Тип Dimension.

Teigha.DatabaseServices.DynamicDimensionData.Editable
Свойство Editable позволяет определить, доступен ли для редактирования этот динамический размер.
Returns: Возвращает <c>true</c>, если динамический размер доступен для редактирования.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DynamicDimensionData.Focal
Свойство Focal позволяет определить, находится ли в фокусе данный динамический размер.
Returns: Возвращает <c>true</c>, если этот динамический размер в фокусе.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DynamicDimensionData.HideIfValueIsZero
Свойство HideIfValueIsZero определяет, следует ли скрывать этот размер в случае нулевого значения.
Returns: Возвращает <c>true</c>, если динамичекий размер должен скрываться при нулевом значении.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DynamicDimensionData.Visible
Свойство Visible предоставляет возможность управлять видимостью динамического размера.
Returns: Возвращает <c>true</c>, если динамический размер является видимым.
В противном случае возвращает <c>false</c>.