Teigha.DatabaseServices.GradientColor
Этот класс является контейнером для градиентных цветов, используемых объектом Hatch.

Teigha.DatabaseServices.GradientColor.#ctor
Конструктор по умолчанию класса GradientColor.

Teigha.DatabaseServices.GradientColor.#ctor(Teigha.Colors.Color,System.Single)
Конструктор класса GradientColor.
color: Входной цвет.  Тип <c>Teigha.Colors.Color</c>.
value: Входное число с плавающей точкой, представляющее интерполированное значение, которое определяется градиентом. Тип <c>float</c>.

Teigha.DatabaseServices.GradientColor.get_Color
Метод предназначен для получения цвета градиента, представленного данным объектом GradientColor.
Returns: Возвращает цвет градиента.  Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.GradientColor.get_Value
Метод предоставляет интерполированное значение данного цвета в градиенте.
Returns: Возвращает интерполированное значение данного цвета. Тип <c>float</c>.