Teigha.DatabaseServices.BlockTableRecordEnumerator
Этот класс реализует перечислитель для объекта BlockTableRecord.

Teigha.DatabaseServices.BlockTableRecordEnumerator.#ctor(IntPtr,System.Boolean,System.Boolean)
Конструктор класса BlockTableRecordEnumerator.
unmanagedPointer: Неуправляемый указатель на входной объект.  Тип IntPtr.
autoDelete: Флаг автоудаления входного объекта. Тип bool.
skipDeleted: Флаг, определяющий, следует ли пропускать удаленный объект. Тип bool.

Teigha.DatabaseServices.BlockTableRecordEnumerator.MoveNext
Метод реализует переход перечислителя к следующему блоку в объекте BlockTableRecord.
Returns: Возвращает <c>true</c>, если индекс текущего блока  не превышает количество элементов в коллекции. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.BlockTableRecordEnumerator.Reset
Метод перемещает перечислитель на первый блок.

Teigha.DatabaseServices.BlockTableRecordEnumerator.Current
Свойство возвращает текущий блок данного перечислителя.
Returns: Возвращает идентификатор текущего блока. Тип ObjectId.