Teigha.BoundaryRepresentation.LoopEdgeCollection
Класс <c>LoopEdgeCollection</c> представляет коллекцию рёбер цикла грани.

Teigha.BoundaryRepresentation.LoopEdgeCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции.
Returns: Возвращает перечислитель данной коллекции.
Тип <c>LoopEdgeEnumerator</c>.