Teigha.DatabaseServices.Section
Класс <c>Section</c> представляет объект секущей плоскости.

Teigha.DatabaseServices.Section.#ctor
Конструктор по умолчанию класса <c>Section</c>.

Teigha.DatabaseServices.Section.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d)
Конструктор класса <c>Section</c>. Создает экземпляр класса с использованием указанных точек и вектора.
pts: Коллекция точек, определяющих секущую плоскость. Тип <c>Point3dCollection</c>. Совпадающие точки в этой коллекции не допускаются. Должна содержать как минимум две точки.
verticalDir: Вектор вертикального направления, перпендикулярный линии сечения. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Section.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса <c>Section</c>. Создает экземпляр класса с указанными параметрами.
pts: Коллекция точек, определяющих секущую плоскость. Тип <c>Point3dCollection</c>. Совпадающие точки в этой коллекции не допускаются. Должна содержать как минимум две точки.
verticalDir: Вектор вертикального направления, перпендикулярный линии сечения. Тип <c>Vector3d</c>.
vecViewingDir: Вектор направления просмотра. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Section.AddVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет добавить в плоскость сечения новую вершину.
nInsertAt: Индекс, по которому добавляется новая вершина. Тип <c>int</c>.
pt: Координаты добавляемой вершины. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Section.CreateJog(Teigha.Geometry.Point3d)
Метод позволяет создать излом в указанной точке на линии сечения.
ptOnSection: Координаты точки на линии сечения. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Section.GenerateSectionGeometry(Teigha.DatabaseServices.Entity,[Out]Array%,[Out]Array%,[Out]Array%,[Out]Array%,[Out]Array%)
Метод предназначен для формирования геометрии сечения.
pEnt: Входной объект чертежа, тип которого допустим для построения сечения. Тип <c>Entity</c>.
pIntFillEnts: Выходной массив, содержащий геометрию границ разрезов. Тип <c>Array</c>.
pBackgroundEnts: Выходной массив, содержащий объекты штриховки разрезов. Тип <c>Array</c>.
pForegroundEnts: Выходной массив, содержащий геометрию объектов фона. Тип <c>Array</c>.
pFurveTangencyEnts: Выходной массив, содержащий геометрию объектов переднего плана. Тип <c>Array</c>.
pCurveTangencyEnts: Выходной массив, содержащий объекты касательных к кривой. Тип <c>Array</c>.

Teigha.DatabaseServices.Section.GetVertex(System.Int32)
Метод позволяет получить вершину по ее индексу.
nIndex: Входной индекс вершины. Тип <c>int</c>.
Returns: Возвращает вершину с указанным индексом. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Section.GetVertices(Teigha.Geometry.Point3dCollection)
Метод позволяет получить все вершины секущей плоскости.
pts: Коллекция вершин. Тип <c>Point3dCollection</c>.

Teigha.DatabaseServices.Section.Height(Teigha.DatabaseServices.SectionHeight)
Метод предназначен для вычисления высоты секущей плоскости для указанного типа высоты.
nHeightType: Задает тип вычисляемой высоты (выше или ниже линии сечения). Перечисление <c>SectionHeight</c>.
Returns: Возвращает вычисленное значение высоты. Тип <c>double</c>.

Teigha.DatabaseServices.Section.HitTest(Teigha.Geometry.Point3d)
Метод проверяет попадание указанной точки на секущую плоскость.
ptHit: Координаты проверяемой точки. Тип <c>Point3d</c>.
Returns: Возвращает результат проверки на попадание.
Тип <c>SectionHitTestInfo</c>.

Teigha.DatabaseServices.Section.RemoveVertex(System.Int32)
Метод предназначен для удаления из секущей плоскости вершины с указанным индексом.
nIndex: Индекс удаляемой вершины. Тип <c>int</c>.

Teigha.DatabaseServices.Section.SetHeight(Teigha.DatabaseServices.SectionHeight,System.Double)
Метод позволяет задать высоту индикатора секущей плоскости выше или ниже линии сечения.
nHeightType: Входной тип высоты из перечисления <c>SectionHeight</c> (выше или ниже линии сечения).
fHeight: Входное значение высоты. Тип <c>double</c>.

Teigha.DatabaseServices.Section.SetVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет задать координаты вершины с указанным индексом.
nIndex: Индекс вершины. Тип <c>int</c>. Отсчет индексов ведется от нуля. Передаваемое в метод значение индекса  должно быть меньше текущего количества вершин.
pt: Новые координаты вершины.  Тип <c>Point3d</c>.

Teigha.DatabaseServices.Section.BottomPlane
Свойство <c>BottomPlane</c> представляет высоту индикатора секущей плоскости ниже линии сечения.
Returns: Возвращает высоту индикатора. Тип <c>double</c>.

Teigha.DatabaseServices.Section.Boundary
Свойство <c>Boundary</c> представляет секущую плоскость, ограниченную линией сечения, двумя боковыми линиями и задней линией.
Returns: Возвращает список точек границы. Тип <c>IList\<Point3d\></c>.

Teigha.DatabaseServices.Section.Elevation
Свойство <c>Elevation</c> представляет уровень плоскости по оси <c>Z</c>.
Returns: Возвращает значение координаты <c>Z</c>.
Тип <c>double</c>.

Teigha.DatabaseServices.Section.IndicatorFillColor
Свойство <c>IndicatorFillColor</c> представляет цвет заливки индикатора секущей плоскости.
Returns: Возвращает цвет заливки. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.Section.IndicatorTransparency
Свойство <c>IndicatorTransparency</c> представляет прозрачность индикатора секущей плоскости в интервале [1–100].
Returns: Возвращает прозрачность индикатора. Тип <c>int</c>.

Teigha.DatabaseServices.Section.IsLiveSectionEnabled
Свойство <c>IsLiveSectionEnabled</c> позволяет определить, включен ли режим псевдоразреза.
Returns: Возвращает <c>true</c>, если режим псевдоразреза активен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Section.Name
Свойство <c>Name</c> представляет имя секущей плоскости.
Returns: Возвращает имя секущей плоскости. Тип <c>String</c>.

Teigha.DatabaseServices.Section.Normal
Свойство <c>Normal</c> представляет вектор нормали секущей плоскости.
Returns: Возвращает вектор нормали плоскости. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Section.NumVertices
Свойство <c>NumVertices</c> представляет количество вершин на секущей плоскости.
Returns: Возвращает количество вершин. Тип <c>int</c>.

Teigha.DatabaseServices.Section.Settings
Свойство <c>Settings</c> представляет настройки этого сечения или разреза.
Returns: Возвращает идентификатор объекта настроек данного объекта.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Section.State
Свойство <c>State</c> представляет тип секущей плоскости.
Returns: Возвращает тип секущей плоскости как значение из перечисления <c>SectionState</c>.

Teigha.DatabaseServices.Section.TopPlane
Свойство <c>TopPlane</c> представляет высоту индикатора секущей плоскости выше линии сечения.
Returns: Возвращает указанную высоту индикатора секущей плоскости.
Тип <c>double</c>.

Teigha.DatabaseServices.Section.VerticalDirection
Свойство <c>VerticalDirection</c> представляет вектор вертикального направления этой секущей плоскости.
Returns: Возвращает направление вертикали. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Section.Vertices
Свойство <c>Vertices</c> представляет коллекцию вершин данной секущей плоскости.
Returns: Возвращает коллекцию вершин секущей плоскости.
Тип <c>Point3dCollection</c>.

Teigha.DatabaseServices.Section.ViewingDirection
Свойство <c>ViewingDirection</c> представляет вектор направления обзора этой секущей плоскости.
Returns: Возвращает направление обзора. Тип <c>Vector3d</c>.