Teigha.Geometry.NurbSurface
Класс <c>NurbSurface</c> представляет параметрические NURBS поверхности.

Teigha.Geometry.NurbSurface.#ctor
Конструктор по умолчанию класса <c>NurbSurface</c>.
Создает пустой объект без каких-либо фактических данных.

Teigha.Geometry.NurbSurface.#ctor(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection)
Конструктор класса <c>NurbSurface</c>.
Создает экземпляр класса с указанными параметрами, используя геометрическую точность по умолчанию.
degreeU: Степень сплайна в направлении U. Тип <c>int</c>.
degreeV: Степень сплайна в направлении V. Тип <c>int</c>.
propsInU: Свойства поверхности в направлении U (используются значения <c>NurbSurfaceProperties</c>). Тип <c>int</c>.
propertiesInV: Свойства поверхности в направлении V (используются значения <c>NurbSurfaceProperties</c>). Тип <c>int</c>.
numberControlPointsInU: Количество управляющих вершин в направлении U. Тип <c>int</c>.
numberControlPointsInV: Количество управляющих вершин в направлении V. Тип <c>int</c>.
controlPoints: Массив управляющих вершин. Тип <c>Point3dCollection</c>.
weights: Массив весов. Тип <c>DoubleCollection</c>.
knotsInU: Узловой вектор в направлении U. Тип <c>KnotCollection</c>.
knotsInV: Узловой вектор в направлении V. Тип <c>KnotCollection</c>.

Teigha.Geometry.NurbSurface.#ctor(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.Tolerance)
Конструктор класса <c>NurbSurface</c>.
Создает экземпляр класса с указанными параметрами, используя заданную геометрическую точность.
degreeU: Степень сплайна в направлении U. Тип <c>int</c>.
degreeV: Степень сплайна в направлении V. Тип <c>int</c>.
propsInU: Свойства поверхности в направлении U (используются значения <c>NurbSurfaceProperties</c>). Тип <c>int</c>.
propertiesInV: Свойства поверхности в направлении V (используются значения <c>NurbSurfaceProperties</c>). Тип <c>int</c>.
numberControlPointsInU: Количество управляющих вершин в направлении U. Тип <c>int</c>.
numberControlPointsInV: Количество управляющих вершин в направлении V. Тип <c>int</c>.
controlPoints: Массив управляющих вершин. Тип <c>Point3dCollection</c>.
weights: Массив весов. Тип <c>DoubleCollection</c>.
knotsInU: Узловой вектор в направлении U. Тип <c>KnotCollection</c>.
knotsInV: Узловой вектор в направлении V. Тип <c>KnotCollection</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbSurface.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>NurbSurface</c>.

Teigha.Geometry.NurbSurface.GetDefinition
Метод предоставляет определение данной NURBS поверхности.
Returns: Возвращает определение данной NURBS поверхности
Тип <c>NurbSurfaceDefinition</c>.

Teigha.Geometry.NurbSurface.Set(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection)
Метод позволяет переопределить указанные параметры данной NURBS поверхности, используя геометрическую точность по умолчанию.
degreeU: Степень сплайна в направлении U. Тип <c>int</c>.
degreeV: Степень сплайна в направлении V. Тип <c>int</c>.
propsInU: Свойства поверхности в направлении U (используются значения <c>NurbSurfaceProperties</c>). Тип <c>int</c>.
propsInV: Свойства поверхности в направлении V (используются значения <c>NurbSurfaceProperties</c>). Тип <c>int</c>.
numControlPointsInU: Количество управляющих вершин в направлении U. Тип <c>int</c>.
numControlPointsInV: Количество управляющих вершин в направлении V. Тип <c>int</c>.
controlPoints: Массив управляющих вершин. Тип <c>Point3dCollection</c>.
weights: Массив весов. Тип <c>DoubleCollection</c>.
knotsInU: Узловой вектор в направлении U. Тип <c>KnotCollection</c>.
knotsInV: Узловой вектор в направлении V. Тип <c>KnotCollection</c>.

Teigha.Geometry.NurbSurface.Set(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.Tolerance)
Метод позволяет переопределить указанные параметры данной NURBS поверхности, используя заданную геометрическую точность.
degreeU: Степень сплайна в направлении U. Тип <c>int</c>.
degreeV: Степень сплайна в направлении V. Тип <c>int</c>.
propsInU: Свойства поверхности в направлении U (используются значения <c>NurbSurfaceProperties</c>). Тип <c>int</c>.
propsInV: Свойства поверхности в направлении V (используются значения <c>NurbSurfaceProperties</c>). Тип <c>int</c>.
numControlPointsInU: Количество управляющих вершин в направлении U. Тип <c>int</c>.
numControlPointsInV: Количество управляющих вершин в направлении V. Тип <c>int</c>.
controlPoints: Массив управляющих вершин. Тип <c>Point3dCollection</c>.
weights: Массив весов. Тип <c>DoubleCollection</c>.
knotsInU: Узловой вектор в направлении U. Тип <c>KnotCollection</c>.
knotsInV: Узловой вектор в направлении V. Тип <c>KnotCollection</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbSurface.ControlPoints
Свойство <c>ControlPoints</c> представляет массив управляющих вершин данной NURBS поверхности.
Returns: Возвращает массив управляющих вершин сплайна.
Тип <c>Point3dCollection</c>.

Teigha.Geometry.NurbSurface.DegreeInU
Свойство <c>DegreeInU</c> представляет степень сплайна в направлении U.
Returns: Возвращает степень сплайна в направлении U.
Тип <c>int</c>.

Teigha.Geometry.NurbSurface.DegreeInV
Свойство <c>DegreeInV</c> представляет степень сплайна в направлении V.
Returns: Возвращает степень сплайна в направлении V.
Тип <c>int</c>.

Teigha.Geometry.NurbSurface.IsPeriodicInU
Свойство <c>IsPeriodicInU</c> позволяет проверить, является ли данная поверхность периодической в направлении U.
Returns: Возвращает <c>true</c>, если поверхность является периодической в направлении U.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbSurface.IsPeriodicInV
Свойство <c>IsPeriodicInV</c> позволяет проверить, является ли данная поверхность периодической в направлении V.
Returns: Возвращает <c>true</c>, если поверхность является периодической в направлении V.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbSurface.IsRationalInU
Свойство <c>IsRationalInU</c> позволяет проверить, является ли данная поверхность рациональной в направлении U.
Returns: Возвращает <c>true</c>, если поверхность является рациональной в направлении U.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbSurface.IsRationalInV
Свойство <c>IsRationalInV</c> позволяет проверить, является ли данная поверхность рациональной в направлении V.
Returns: Возвращает <c>true</c>, если поверхность является рациональной в направлении V.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbSurface.NumControlPointsInU
Свойство <c>NumControlPointsInU</c> представляет количество управляющих вершин в направлении U.
Returns: Возвращает количество управляющих вершин в направлении U.
Тип <c>int</c>.

Teigha.Geometry.NurbSurface.NumControlPointsInV
Свойство <c>NumControlPointsInV</c> представляет количество управляющих вершин в направлении V.
Returns: Возвращает количество управляющих вершин в направлении V.
Тип <c>int</c>.

Teigha.Geometry.NurbSurface.NumKnotsInU
Свойство <c>NumKnotsInU</c> представляет количество управляющих вершин в направлении U.
Returns: Возвращает количество управляющих вершин в направлении U.
Тип <c>int</c>.

Teigha.Geometry.NurbSurface.NumKnotsInV
Свойство <c>NumKnotsInV</c> представляет количество управляющих вершин в направлении V.
Returns: Возвращает количество управляющих вершин в направлении V.
Тип <c>int</c>.

Teigha.Geometry.NurbSurface.PeriodicInU
Свойство <c>PeriodicInU</c> представляет период в направлении U, если данная NURBS поверхность является периодической в направлении U.
Returns: Возвращает период в направлении U.
Тип <c>double</c>.

Teigha.Geometry.NurbSurface.PeriodicInV
Свойство <c>PeriodicInV</c> представляет период в направлении V, если данная NURBS поверхность является периодической в направлении V.
Returns: Возвращает период в направлении V.
Тип <c>double</c>.

Teigha.Geometry.NurbSurface.SingularityInU
Свойство <c>SingularityInU</c> представляет одно из значений <c>NurbSurfaceProperties</c>, которое является характеристикой сингулярности поверхности в направлении U.
Returns: Возвращает значение <c>NurbSurfaceProperties</c>, являющееся характеристикой сингулярности поверхности в направлении U.
Тип <c>int</c>.

Teigha.Geometry.NurbSurface.SingularityInV
Свойство <c>SingularityInV</c> представляет одно из значений <c>NurbSurfaceProperties</c>, которое является характеристикой сингулярности поверхности в направлении V.
Returns: Возвращает значение <c>NurbSurfaceProperties</c>, являющееся характеристикой сингулярности поверхности в направлении V.
Тип <c>int</c>.

Teigha.Geometry.NurbSurface.UKnots
Свойство <c>UKnots</c> представляет узловой вектор в направлении U для данной поверхности.
Returns: Возвращает узловой вектор в направлении U.
Тип <c>KnotCollection</c>.

Teigha.Geometry.NurbSurface.VKnots
Свойство <c>VKnots</c> представляет узловой вектор в направлении V для данной поверхности.
Returns: Возвращает узловой вектор в направлении V.
Тип <c>KnotCollection</c>.

Teigha.Geometry.NurbSurface.Weights
Свойство <c>Weights</c> представляет массив весов.
Returns: Возвращает массив весов.
Тип <c>DoubleCollection</c>.