Teigha.Runtime.CommandClassAttribute
Класс <c>CommandClassAttribute</c> представляет пользовательские атрибуты, которые используются для обозначения типа как класса команд приложения.

Teigha.Runtime.CommandClassAttribute.#ctor(Type)
Конструктор класса <c>CommandClassAttribute</c>. Создает экземпляр класса с указанным именем.
name: Имя атрибута.

Teigha.Runtime.CommandClassAttribute.Type
Свойство <c>Type</c> представляет тип объекта, связанный с данным атрибутом.
Returns: Возвращает тип объекта.
Тип <c>System.Type</c>.