Teigha.Geometry.NurbCurve2dData.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если объект <c>obj</c> равен данному объекту.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2dData.GetHashCode
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает хеш-код объекта.
Тип <c>int</c>.

Teigha.Geometry.NurbCurve2dData.IsEqualTo(Teigha.Geometry.NurbCurve2dData)
Метод проверяет, совпадают ли данные этой NURBS кривой с данными указанного объекта типа <c>NurbCurve2dData</c>.
a: Проверяемые данные двумерной NURBS кривой. Тип <c>NurbCurve2dData</c>.
Returns: Возвращает <c>true</c>, если сравниваемые объекты можно считать равными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2dData.ControlPoints
Свойство <c>ControlPoints</c> представляет коллекцию управляющих вершин NURBS кривой.
Returns: Возвращает коллекцию управляющих вершин кривой. Тип <c>Point2dCollection</c>.

Teigha.Geometry.NurbCurve2dData.Degree
Свойство <c>Degree</c> представляет степень NURBS кривой.
Returns: Возвращает степень NURBS кривой.
Тип <c>int</c>.

Teigha.Geometry.NurbCurve2dData.Knots
Свойство <c>Knots</c> представляет узловой вектор NURBS кривой.
Returns: Возвращает узловой вектор NURBS кривой.
Тип <c>KnotCollection</c>.

Teigha.Geometry.NurbCurve2dData.Periodic
Свойство <c>Periodic</c> позволяет проверить, является ли данная кривая периодической.
Returns: Возвращает <c>true</c>, если кривая является периодической.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2dData.Rational
Свойство <c>Rational</c> позволяет проверить, является ли данная NURBS кривая рациональной.
Returns: Возвращает <c>true</c>, если кривая является рациональной.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2dData.Weights
Свойство <c>Weights</c> представляет веса NURBS кривой.
Returns: Возвращает массив весов данной NURBS кривой.
Тип <c>DoubleCollection</c>.