Teigha.DatabaseServices.BulgeVertex
Класс представляет безразмерную величину прогиба сегмента полилинии, берущего начало в двумерной вершине.

Teigha.DatabaseServices.BulgeVertex.#ctor(Geometry.Point2d,System.Double)
Конструктор класса BulgeVertex.
point: 2D-координаты новой вершины. Тип Geometry.Point2d.
bulge: Новое значение выпуклости. Тип double.

Teigha.DatabaseServices.BulgeVertex.Bulge
Свойство обеспечивает доступ к значению прогиба данного объекта BulgeVertex.
Returns: Возвращает выличину прогиба дугового сегмента. Тип double.

Teigha.DatabaseServices.BulgeVertex.Vertex
Свойство обеспечивает доступ к вершине, с которой связан объект BulgeVertex.
Returns: Возвращает координаты 2D-вершины. Тип Geometry.Point2d.