Teigha.DatabaseServices.RenderEnvironment
Класс <c>RenderEnvironment</c> представляет собой класс-контейнер для свойств, связанных с окружающей средой, таких как туман или общее изображение окружающей среды.

Teigha.DatabaseServices.RenderEnvironment.#ctor
Конструктор по умолчанию класса <c>RenderEnvironment</c>.

Teigha.DatabaseServices.RenderEnvironment.Distances
Свойство <c>Distances</c> представляет расстояния для ближнего и дальнего тумана.
Returns: Возвращает дальности для тумана. Тип <c>DoubleRangeParameter</c>.

Teigha.DatabaseServices.RenderEnvironment.EnvironmentImageEnabled
Свойство <c>EnvironmentImageEnabled</c> позволяет управлять режимом отображения окружающей среды.
Returns: Возвращает <c>true</c>, если отображение окружающей среды включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RenderEnvironment.EnvironmentImageFileName
Свойство <c>EnvironmentImageFileName</c> представляет полное имя файла с изображением окружающей среды.
Returns: Возвращает полное имя файла изображения. Тип <c>String</c>.

Teigha.DatabaseServices.RenderEnvironment.FogBackgroundEnabled
Свойство <c>FogBackgroundEnabled</c> позволяет управлять учетом влияния тумана на фон.
Returns: Возвращает <c>true</c>, если режим влияния тумана на фон активен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RenderEnvironment.FogColor
Свойство <c>FogColor</c> представляет цвет тумана.
Returns: Возвращает цвет тумана. Тип <c>Colors.EntityColor</c>.

Teigha.DatabaseServices.RenderEnvironment.FogDensity
Свойство <c>FogDensity</c> представляет плотность ближнего и дальнего тумана.
Returns: Возвращает плотность тумана.
Тип <c>DoubleRangeParameter</c>.

Teigha.DatabaseServices.RenderEnvironment.FogEnabled
Свойство <c>FogEnabled</c> управляет включением и выключением влияния тумана.
Returns: Возвращает <c>true</c>, если влияние тумана учитывается.
В противном случае возвращает <c>false</c>.