Teigha.DatabaseServices.FitData
Этот класс инкапсулирует данные, возвращаемые свойством <c>Spline.FitData</c>.

Teigha.DatabaseServices.FitData.Equals(Object)
Метод предназначен для проверки на идентичность данного и указанного в аргументе объектов.
obj: Объект, с которым выполняется сравнение. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если данный объект идентичен объекту <c>obj</c>.
В противном случае возвращает <c>false</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику - если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.

Teigha.DatabaseServices.FitData.GetFitPoints
Метод предоставляет коллекцию определяющих точек сплайна, заданных в координатах WCS.
Returns: Возвращает коллекцию определяющих точек сплайна. Тип <c>Point3dCollection</c>.

Teigha.DatabaseServices.FitData.GetHashCode
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает уникальный для каждого экземпляра класса целочисленный идентификатор. Тип <c>int</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику - если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.

Teigha.DatabaseServices.FitData.IsEqualTo(Teigha.DatabaseServices.FitData)
Метод предназначен для сравнения этого объекта с другим объектом <c>FitData</c> и возвращает <c>true</c>, если они равны.
other: Объект, с которым сравнивается данный.  Тип <c>FitData</c>.
Returns: Возвращает <c>true</c>, если объект <c>other</c> равен данному объекту.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.FitData.IsEqualTo(Teigha.DatabaseServices.FitData,Teigha.Geometry.Tolerance)
Метод предназначен для сравнения этого объекта с другим объектом <c>FitData</c> в пределах заданного допуска.
other: Сравниваемый объект. Тип <c>FitData</c>.
tolerance: Допуск для сравнения на равенство. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если сравниваемые объекты совпадают в пределах заданного допуска.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.FitData.Degree
Свойство возвращает степень сплайна.
Returns: Возвращает степень сплайна. Тип <c>int</c>.

Teigha.DatabaseServices.FitData.EndTangent
Свойство возвращает направление касательной на конце сплайна.
Returns: Возвращает направление касательной. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.FitData.FitTolerance
Свойство возвращает допуск аппроксимации сплайна.
Returns: Возвращает допуск аппроксимации сплайна. Тип <c>double</c>.

Teigha.DatabaseServices.FitData.KnotParam
Свойство возвращает метод узловой параметризации сплайна, который строится по определяющим точкам.
Returns: Возвращает метод узловой параметризации сплайна как значение из перечисления <c>KnotParameterizationEnum</c>.

Teigha.DatabaseServices.FitData.StartTangent
Свойство возвращает направление касательной в начале сплайна.
Returns: Возвращает направление касательной. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.FitData.TangentsExist
Свойство позволяет проверить, определены ли касательные на концах сплайна.
Returns: Возвращает <c>true</c>, если касательные на концах сплайна определены.
В противном случае возвращает <c>false</c>.