Teigha.DatabaseServices.RevolveOptionsBuilder
Класс <c>RevolveOptionsBuilder</c> предназначен для редактирования свойств класса <c>RevolveOptions</c>, который является неизменяемым типом значения.

Teigha.DatabaseServices.RevolveOptionsBuilder.#ctor
Конструктор по умолчанию класса <c>RevolveOptionsBuilder</c>.

Teigha.DatabaseServices.RevolveOptionsBuilder.#ctor(Teigha.DatabaseServices.RevolveOptions)
Конструктор класса <c>RevolveOptionsBuilder</c>.
Создает экземпляр с заданными настройками операции вращения.
value: Настройки операции вращения. Тип <c>RevolveOptions</c>.

Teigha.DatabaseServices.RevolveOptionsBuilder.ToRevolveOptions
Метод формирует объект <c>RevolveOptions</c>, используя сформированные в данном объекте параметры операции вращения.
Returns: Возвращает настройки операции вращения. Тип <c>RevolveOptions</c>.

Teigha.DatabaseServices.RevolveOptionsBuilder.CloseToAxis
Свойство <c>CloseToAxis</c> задает опцию замыкания на ось вращения концов незамкнутого профиля перед выполнением операции вращения.
Returns: Возвращает <c>true</c>, если опция включена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RevolveOptionsBuilder.DraftAngle
Свойство <c>DraftAngle</c> представляет угол сужения профиля с увеличением угла поворота вокруг оси вращения.
Returns: Возвращает угол сужения вращаемого профиля в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.RevolveOptionsBuilder.TwistAngle
Свойство <c>TwistAngle</c> представляет угол закручивания профиля при повороте вокруг оси вращения.
Returns: Возвращает угол закручивания в радианах. Тип <c>double</c>.