Teigha.DatabaseServices.RadialDimensionLarge
Класс <c>RadialDimensionLarge</c> представляет радиальный размер с изломом.

Teigha.DatabaseServices.RadialDimensionLarge.#ctor
Конструктор по умолчанию класса <c>RadialDimensionLarge</c>.

Teigha.DatabaseServices.RadialDimensionLarge.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,System.Double,String,DatabaseServices.ObjectId)
Конструктор класса <c>RadialDimensionLarge</c>.
center: Центр измеряемой дуги или окружности. Тип <c>Point3d</c>.
chordPoint: Конец хорды на измеряемой окружности или дуге, к которому подводится размерная линия. Тип <c>Point3d</c>.
overrideCenter: Точка переопределенного центра, от которой строится размерная линия. Тип <c>Point3d</c>.
jogPoint: Точка излома размерной линии при переходе от переопределенного центра к точке хорды. Тип <c>Point3d</c>.
jogAngle: Угол излома между линией, проходящей через переопределенный центр, и линией, проходящей через точку излома.                 Тип <c>double</c>.
dimensionText: Размерный текст для замены текста измеренного значения. Тип <c>String</c>.
dimensionStyle: Идентификатор объекта размерного стиля, который используется для отрисовки размера.

Teigha.DatabaseServices.RadialDimensionLarge.center
Свойство <c>Center</c> представляет центр измеряемой окружности или дуги.
Returns: Возвращает точку центра окружности или дуги. Тип <c>Point3d</c>.

Teigha.DatabaseServices.RadialDimensionLarge.chordPoint
Свойство <c>ChordPoint</c> представляет точку пересечения размерной линии и измеряемой дуги или окружности.
Returns: Возвращает точку пересечения размерной линии и дуги / окружности. Тип <c>Point3d</c>.

Teigha.DatabaseServices.RadialDimensionLarge.JogAngle
Свойство <c>JogAngle</c> представляет угол излома данного размера.
Returns: Возвращает угол излома в радианах.
Тип <c>double</c>.

Teigha.DatabaseServices.RadialDimensionLarge.jogPoint
Свойство <c>JogPoint</c> представляет точку излома линии размера.
Returns: Возвращает точку излома в мировой системе координат (WCS). Тип <c>Point3d</c>.

Teigha.DatabaseServices.RadialDimensionLarge.overrideCenter
Свойство <c>OverrideCenter</c> представляет точку переопределенного центра, из которой строится размерная линия.
Returns: Возвращает точку переопределенного центра размера (в мировой системе координат, WCS).
Тип <c>Point3d</c>.