HostMgd.EditorInput.PromptDoubleOptionsEventArgs
Класс, обеспечивающий данными событие PromptingForDouble
класса Editor.

HostMgd.EditorInput.PromptDoubleOptionsEventArgs.Options
Возвращает параметры приглашения.