Teigha.BoundaryRepresentation.EnumeratorBase
Класс <c>EnumeratorBase</c> является базовым интерфейсным классом для топологических траверсеров (перечислителей) и определяет общий для них функционал.

Teigha.BoundaryRepresentation.EnumeratorBase.MoveNext
Этот метод осуществляет переход траверсера вперед к следующему элементу.
Returns: Возвращает <c>true</c>, если переход выполнен успешно.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.EnumeratorBase.Reset
Метод реализует сброс траверсера, делая текущим первый элемент.

Teigha.BoundaryRepresentation.EnumeratorBase.isNull
Свойство <c>isNull</c> позволяет проверить, является ли данный объект неинициализированным или недействительным (т.е. пустым).
Returns: Возвращает <c>true</c>, если данный траверсер является неинициализированным или недействительным.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.EnumeratorBase.ValidationLevel
Свойство <c>ValidationLevel</c> представляет уровень проверки, который будет использоваться во всех запросах данных, требующих доступа к связанному объекту nanoCAD.
Returns: Возвращает текущий уровень проверки.
Перечисление <c>BoundaryRepresentation.ValidationLevel</c>.