HostMgd.EditorInput.PromptNestedEntityOptions
Класс, представляющий необязательные параметры для
приглашения для вложенного геометрического объекта.

HostMgd.EditorInput.PromptNestedEntityOptions.AllowNone
Возвращает или устанавливает признак того, может ли ввод
состоять только из нажатия на клавишу Enter. Если это
свойство устанволено в true, то такой ввод разрешен.

HostMgd.EditorInput.PromptNestedEntityOptions.NonInteractivePickPoint
Устанавливает или возвращает признак не итерактивной точки.
Применяется при программном выборе вложенного объекта.

HostMgd.EditorInput.PromptNestedEntityOptions.#ctor(String)
Конструктор класса.
message: Приглашающее сообщение

HostMgd.EditorInput.PromptNestedEntityOptions.#ctor(String,String)
Конструктор класса.
messageAndKeywords: Представляет собой строку с сообщением
Формат строки\: "message
globalKeywords: Перечень глобальных значений ключей

HostMgd.EditorInput.PromptNestedEntityOptions.UseNonInteractivePickPoint
Возвращает или устанавливает признак того, должно ли
приглашении попытаться использовать указатель на не
интерактивные точки.