Teigha.LayerManager.LayerFilterCollection
Класс <c>LayerFilterCollection</c> представляет коллекцию объектов <c>LayerFilter</c> в базе данных.

Teigha.LayerManager.LayerFilterCollection.Add(Teigha.LayerManager.LayerFilter)
Метод предназначен для добавления в коллекцию указанного объекта.
value: Объект, который добавляется в коллекцию.  Тип <c>LayerFilter</c>.

Teigha.LayerManager.LayerFilterCollection.Clear
Метод очищает коллекцию, удаляя из нее все объекты.

Teigha.LayerManager.LayerFilterCollection.Contains(Teigha.LayerManager.LayerFilter)
Метод позволяет проверить, содержится ли в коллекции объект, соответствующий аргументу.
value: Искомый объект. Тип <c>LayerFilter</c>.
Returns: Возвращает <c>true</c>, если искомый объект содержится в коллекции.
В противном случае возвращает <c>false</c>.

Teigha.LayerManager.LayerFilterCollection.CopyTo(array&lt;LayerFilter&gt;,System.Int32)
Метод копирует в данную коллекцию объекты из указанного массива.
array: Входной массив копируемых объектов.  Тип <c>array<LayerFilter></c>.
index: Индекс в массиве, начиная с которого объекты массива будут копироваться в данную коллекцию.  Тип <c>int</c>.  Индексация элементов в массиве начинается с нуля.

Teigha.LayerManager.LayerFilterCollection.GetEnumerator
Метод предоставляет объект перечислителя для данной коллекции.
Returns: Возвращает перечислитель коллекции.
Тип <c>IEnumerator</c>.

Teigha.LayerManager.LayerFilterCollection.Remove(Teigha.LayerManager.LayerFilter)
Метод удаляет указанный объект из данной коллекции.
value: Удаляемый объект.  Тип <c>LayerFilter</c>.

Teigha.LayerManager.LayerFilterCollection.Count
Свойство <c>Count</c> представляет текущее количество объектов в данной коллекции.
Returns: Возвращает количество объектов в коллекции.  Тип <c>int</c>.

Teigha.LayerManager.LayerFilterCollection.Item
Свойство <c>Item</c> возвращает элемент коллекции с указанным индексом.
index: Индекс искомого элемента коллекции.  Тип <c>int</c>.
Returns: Возвращает объект, хранящийся в коллекции под индексом <c>index</c>.
Тип <c>LayerFilter</c>.