Teigha.DatabaseServices.Filters.SpatialIndex
Этот класс представляет собой реализацию индекса, учитывающую специфику пространственного индекса.

Teigha.DatabaseServices.Filters.SpatialIndex.#ctor
Конструктор по умолчанию класса <c>SpatialIndex</c>.