Teigha.DatabaseServices.FeatureControlFrame
Класс FeatureControlFrame представляет в базе данных рамки символов допусков формы и расположения.

Teigha.DatabaseServices.FeatureControlFrame.#ctor
Конструктор по умолчанию класса FeatureControlFrame.

Teigha.DatabaseServices.FeatureControlFrame.#ctor(String,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса FeatureControlFrame. Создает экземпляр класса с указанными кодами, точкой вставки и ориентацией в заданной плоскости.
codes: Текст данного символа. Предполагает использование esc-последовательностей для настройки символа. Тип <c>String</c>.
insertionPoint: Точка вставки символа. Тип <c>Point3d</c>.
normalVector: Вектор нормали плоскости, в которой располагается данный символ. Тип <c>Vector3d</c>. Задается в WCS.
x: Направление оси <c>X</c> в указанной плоскости. Тип <c>Vector3d</c>. Задается в WCS.
Для настройки символа FeatureControlFrame допускается использовать следующие управляющие esc-последовательности:

Teigha.DatabaseServices.FeatureControlFrame.GetBoundingPoints
Метод предназначен для получения граничных точек в WCS этого символа допусков.
Returns: Возвращает коллекцию граничных точек прямоугольной рамки символа допусков. Тип Point3dCollection.

Teigha.DatabaseServices.FeatureControlFrame.GetBoundingPolyline
Метод предназначен для получения последовательности несовпадающих угловых точек этого объекта FeatureControlFrame.
Returns: Возвращает последовательность угловых точек данного объекта.  Тип Point3dCollection.

Teigha.DatabaseServices.FeatureControlFrame.GetDimstyleData
Метод позволяет получить запись таблицы размерных стилей с настройками размерного стиля (включая переопределения) этого объекта.
Returns: Возвращает запись таблицы размерных стилей.  Тип DimStyleTableRecord.

Teigha.DatabaseServices.FeatureControlFrame.SetDimstyleData(Teigha.DatabaseServices.DimStyleTableRecord)
Метод позволяет задать для этого объекта настройки размерного стиля, включая переопределения, из указанной записи таблицы размерных стилей.
style: Нерезидентная запись таблицы размерных стилей. Тип DimStyleTableRecord.

Teigha.DatabaseServices.FeatureControlFrame.SetOrientation(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет задать векторы ориентации данного объекта FeatureControlFrame.
norm: Вектор нормали плоскости данного символа допусков. Тип <c>Vector3d</c>.
dir: Направляющий вектор оси <c>X</c> данного символа допусков в указанной плосткости. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.FeatureControlFrame.Dimclrd
Свойство <c>Dimclrd</c> представляет текущее значение системной переменной <c>DIMCLRD</c>, которая задает цвет размерных и выносных линий, рамок и стрелок.
Returns: Возвращает цвет, используемый для отображения данного объекта.  Тип Colors.Color.

Teigha.DatabaseServices.FeatureControlFrame.Dimclrt
Свойство <c>Dimclrt</c> представляет текущее значение системной переменной <c>DIMCLRT</c>, которая задает цвет размерного текста.
Returns: Возвращает цвет размерного текста. Тип Colors.Color.

Teigha.DatabaseServices.FeatureControlFrame.DimensionStyle
Свойство <c>DimensionStyle</c> представляет идентификатор объекта размерного стиля для этого объекта.
Returns: Возвращает идентификатор объекта размерного стиля. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.FeatureControlFrame.DimensionStyleName
Свойство <c>DimensionStyleName</c> возвращает имя размерного стиля данного объекта.
Returns: Возвращает имя размерного стиля данного. Тип <c>String</c>.

Teigha.DatabaseServices.FeatureControlFrame.Dimgap
Свойство <c>Dimgap</c> представляет текущее значение системной переменной <c>DIMGAP</c>, которая определяет зазор между размерным текстом и размерными линиями.
Returns: Возвращает текущее значение системной переменной <c>DIMGAP</c>. Тип <c>double</c>.

Teigha.DatabaseServices.FeatureControlFrame.Dimscale
Свойство <c>Dimscale</c> представляет текущее значение системной переменной <c>DIMSCALE</c>. Эта системная переменная определяет масштабный множитель, применяемый ко всем размерным переменным, которые регулируют размеры, смещения и расстояния.
Returns: Возвращает текущее значение системной переменной <c>DIMSCALE</c>. Тип <c>double</c>.

Teigha.DatabaseServices.FeatureControlFrame.Dimtxsty
Свойство <c>Dimtxsty</c> представляет текущее значение системной переменной <c>DIMTXSTY</c>, которая определяет текстовый стиль размерного текста.
Returns: Возвращает идентификатор объекта текстового стиля размерного текста. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.FeatureControlFrame.Dimtxt
Свойство <c>Dimtxt</c> представляет текущее значение системной переменной <c>DIMTXT</c>, которая определяет высоту размерного текста.
Returns: Возвращает высоту размерного текста как значение системной переменной DIMTXT. Тип <c>double</c>.

Teigha.DatabaseServices.FeatureControlFrame.Direction
Свойство <c>Direction</c> представляет направляющий вектор оси <c>X</c> данного объекта.
Returns: Возвращает направляющий вектор оси <c>X</c>. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.FeatureControlFrame.Location
Свойство <c>Location</c> возвращает точку вставки (WCS) данного объекта.
Returns: Возвращает точку вставки данного объекта. Тип <c>Point3d</c>.

Teigha.DatabaseServices.FeatureControlFrame.Normal
Свойство <c>Normal</c> возвращает вектор нормали плоскости, в которой располагается данный объект.
Returns: Возвращает вектор нормали плоскости. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.FeatureControlFrame.Text
Свойство <c>Text</c> представляет текстовую строку, которая используется данным объектом.
Returns: Возвращает текстовую строку данного объекта.  Тип <c>String</c>.

Teigha.DatabaseServices.FeatureControlFrame.TextStyleId
Свойство <c>TextStyleId</c> представляет идентификатор текстового стиля, который используется данным объектом.
Returns: Возвращает идентификатор текстового стиля. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.FeatureControlFrame.TextStyleName
Свойство <c>TextStyleName</c> представляет имя текстового стиля, который используется данным объектом.
Returns: Возвращает имя текстового стиля. Тип <c>String</c>.