Teigha.Runtime.SystemObjects
Класс <c>SystemObjects</c> предоставляет доступ к системным объектам <c>ClassDictionary</c>, <c>ServiceDictionary</c> и <c>DynamicLinker</c>.

Teigha.Runtime.SystemObjects.ClassDictionary
Свойство <c>ClassDictionary</c> представляет словарь системного объекта.
Returns: Возвращает словарь системного объекта.
Тип <c>Dictionary</c>.

Teigha.Runtime.SystemObjects.DynamicLinker
Свойство <c>DynamicLinker</c> представляет динамический компоновщик системного объекта.
Returns: Возвращает динамический компоновщик. Тип <c>DynamicLinker</c>.

Teigha.Runtime.SystemObjects.ServiceDictionary
Свойство <c>ServiceDictionary</c> представляет словарь служб системного объекта.
Returns: Возвращает словарь служб системного объекта.  Тип <c>Dictionary</c>.