Teigha.DatabaseServices.UnderlayItemCollection
Класс <c>UnderlayItemCollection</c> представляет коллекцию для объектов <c>UnderlayItem</c>.

Teigha.DatabaseServices.UnderlayItemCollection.CopyTo(array&lt; UnderlayItem &gt;,System.Int32)
Метод предназначен для копирования коллекции элементов подложки в указанный массив, начиная с указанного индекса.
arr: Целевой массив, в который копируются элементы подложки. Тип <c>UnderlayItem[]</c>.
index: Начальный индекс массива, начиная с которого в массиве располагаются копируемые элементы. Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayItemCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции.
Returns: Возвращает перечислитель коллекции.
Тип <c>Collections.IEnumerator</c>.

Teigha.DatabaseServices.UnderlayItemCollection.Count
Свойство <c>Count</c> представляет количество элементов в данной коллекции.
Returns: Возвращает количество элементов в коллекции.
Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayItemCollection.Item
Свойство <c>Item</c> представляет элемент коллекции с указанным индексом.
index: Входной индекс искомого элемента коллекции. Тип <c>int</c>.
Returns: Возвращает элемент коллекции под указанным индексом.
Тип <c>UnderlayItem</c>.