Teigha.DatabaseServices.UnitsConverter
Класс <c>UnitsConverter</c> реализует конвертер единиц измерения.

Teigha.DatabaseServices.UnitsConverter.CanConvertFrom(ITypeDescriptorContext,Type)
Метод позволяет проверить, допустимо ли преобразование заданного объекта в указанном контексте.
context: Контекст преобразования. Тип <c>ITypeDescriptorContext</c>.
sourceType: Исходный тип. Тип <c>Type</c>.
Returns: Возвращает <c>true</c>, если преобразование объекта возможно.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.UnitsConverter.ConvertFrom(ITypeDescriptorContext,CultureInfo,Object)
Метод предоставляет объект, полученный в результате преобразования предоставленного объекта в указанном контексте с учетом языковых и региональных настроек.
context: Контекст преобразования. Тип <c>ITypeDescriptorContext</c>.
culture: Региональные и языковые настройки. Тип <c>CultureInfo</c>.
value: Входной объект для преобразования. Тип <c>Object</c>.
Returns: Возвращает результат преобразования. Тип <c>Object</c>.

Teigha.DatabaseServices.UnitsConverter.ConvertTo(ITypeDescriptorContext,CultureInfo,Object,Type)
Метод преобразует заданный объект к указанному типу в указанном контексте с учетом заданных языковых и региональных настроек.
context: Контекст преобразования. Тип <c>ITypeDescriptorContext</c>.
culture: Региональные и языковые настройки. Тип <c>CultureInfo</c>.
value: Входной объект для преобразования. Тип <c>Object</c>.
destinationType: Целевой тип. Тип <c>Type</c>.
Returns: Возвращает результат преобразования.
Тип <c>Object</c>.

Teigha.DatabaseServices.UnitsConverter.GetConversionFactor(Teigha.DatabaseServices.UnitsValue,Teigha.DatabaseServices.UnitsValue)
Метод позволяет вычислить коэффициент преобразования между единицами измерения блока и единицами текущего чертежа.
from: Исходные единицы измерения. Перечисление <c>UnitsValue</c>.
to: Целевые единицы измерения. Перечисление <c>UnitsValue</c>.
Returns: Возвращает коэффициент преобразования между заданными единицами измерения.
Тип <c>double</c>.