Teigha.BoundaryRepresentation.Edge
Класс <c>Edge</c>  является интерфейсным классом для рёбер BREP.
Рёбра являются основными элементами BREP с ассоциированной геометрией - кривыми.

Teigha.BoundaryRepresentation.Edge.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса <c>Edge</c>. Создает экземпляр класса, используя указанный полный путь подобъекта.
fullSubentPath: полный путь подобъекта.

Teigha.BoundaryRepresentation.Edge.GetCurveAsNurb
Метод позволяет получить базовую кривую данного объекта <c>Edge</c> как объект <c>NurbCurve3d</c>.
Returns: Возвращает NURBS кривую.
Тип <c>NurbCurve3d</c>.

Teigha.BoundaryRepresentation.Edge.GetLoopsStartingFrom(Teigha.BoundaryRepresentation.BoundaryLoop)
Метод позволяет получить для данного ребра коллекцию циклов, начиная с указанного цикла.
startFrom: Входной цикл, с которого начинается формирование коллекции циклов данного ребра.
Returns: Возвращает коллекцию циклов данного ребра.
Тип <c>EdgeLoopCollection</c>.

Teigha.BoundaryRepresentation.Edge.Curve
Свойство <c>Curve</c> предоставляет доступ к 3D-кривой, которая связана с данным ребром BREP.
Returns: Возвращает кривую.  Тип <c>Curve3d</c>.

Teigha.BoundaryRepresentation.Edge.IsOrientToCurve
Свойство <c>IsOrientToCurve</c> позволяет проверить, совпадает ли ориентация ребра от вершины 1 до вершины 2 с направлением параметризации базовой 3D-кривой.
Returns: Возвращает <c>true</c>, если и только если ориентация ребра от вершины 1 до вершины 2 совпадает с направлением параметризации базовой 3D-кривой.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.Edge.Loops
Свойство <c>Loops</c> предоставляет доступ ко всем циклам данного ребра BREP.
Returns: Возвращает коллекцию всех циклов данного ребра BREP.
Тип <c>EdgeLoopCollection</c>.

Teigha.BoundaryRepresentation.Edge.Vertex1
Свойство <c>Vertex1</c> предоставляет доступ к начальной вершине данного ребра в его естественной ориентации от вершины 1 к вершине 2.
Returns: Возвращает начальную вершину BREP.
Тип <c>BoundaryRepresentation.Vertex</c>.

Teigha.BoundaryRepresentation.Edge.Vertex2
Свойство <c>Vertex2</c> предоставляет доступ к конечной вершине данного ребра в его естественной ориентации от вершины 1 до вершины 2.
Returns: Возвращает конечную вершину BREP.
Тип <c>BoundaryRepresentation.Vertex</c>.