HostMgd.EditorInput.Editor.IsDragging
Возвращает true, если другое событие стоит в очереди.
Это свойство позволяет проверить, было ли в данный момент
движение мыши, и в этом случае, максимально быстро завершить
обработку события без выполнения требующих времени
вычислений.
На чтение