Teigha.BoundaryRepresentation.Hit
Класс <c>Hit</c> является интерфейсным классом для контекстных попаданий, сгенерированных запросами на пересечение объекта BREP с линией.

Teigha.BoundaryRepresentation.Hit.Equals(Object)
Метод предназначен для проверки равенства данного объекта указанному.
obj: Входной объект, проверяемый на равенство данному объекту.  Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если объекты равны.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.Hit.GetHashCode
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает хеш-код данного объекта.
Тип <c>int</c>.

Teigha.BoundaryRepresentation.Hit.EntityAssociated
Свойство <c>EntityAssociated</c> предоставляет доступ к топологическому объекту, для которого данный объект <c>Hit</c> выполнил проверку на пересечения с линией.
Returns: Возвращает топологический объект.
Тип <c>BoundaryRepresentation.BrepEntity</c>.

Teigha.BoundaryRepresentation.Hit.EntityEntered
Свойство <c>EntityEntered</c> предоставляет доступ к топологическому объекту наименьшей размерности, которому принадлежит линейный сегмент исходной линии, ограниченной соседними точками пересечения.
Returns: Возвращает топологический объект.  Тип <c>BoundaryRepresentation.BrepEntity</c>.
Возвращает NULL, если это последнее пересечение в массиве пересечений, либо линейный сегмент выходит и затем повторно входит в проверяемый объект, т.е. сегмент проходит вне проверяемого объекта.

Teigha.BoundaryRepresentation.Hit.EntityHit
Свойство <c>EntityHit</c> предоставляет доступ к топологическому объекту наименьшей размерности, содержащему данное попадание.
Accesses the dimensionally lowest topological entity that contains this hit.
Note that the start and end points of lines are classified as hits so long as they pass a point containment test.
It is not necessary for the ray they define to pass through a geometric boundary; a hit may reside in the interior of a solid.
Returns: Возвращает топологический объект.
Тип <c>BoundaryRepresentation.BrepEntity</c>.

Teigha.BoundaryRepresentation.Hit.IsBrepChanged
Свойство <c>IsBrepChanged</c> позволяет проверить, изменился ли связанный объект nanoCAD с момента последнего обновления данного топологического объекта.
Returns: Возвращает <c>true</c>, если связанный объект nanoCAD успел измениться с момента последнего обновления данного объекта.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.Hit.IsNull
Свойство <c>IsNull</c> позволяет проверить, является ли данный объект нулевым.
Returns: Возвращает <c>true</c>, если данный объект является нулевым.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.Hit.Point
Свойство <c>Point</c> предоставляет доступ к точке попадания данного объекта.
Returns: Возвращает точку попадания данного объекта.
Тип <c>Point3d</c>.

Teigha.BoundaryRepresentation.Hit.ValidationLevel
Свойство <c>ValidationLevel</c> представляет уровень проверки, который будет использоваться во всех запросах данных, требующих доступа к связанному объекту nanoCAD.
Returns: Возвращает предусмотренный уровень проверки.
Тип <c>BoundaryRepresentation.ValidationLevel</c>.