Teigha.BoundaryRepresentation.Complex
Класс <c>Complex</c> является интерфейсным классом для комплексов в иерархии топологической смежности B-Rep.

Teigha.BoundaryRepresentation.Complex.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса <c>Complex</c>. Создает экземпляр класса по заданному пути подобъекта.
fullSubentPath: Входной полный путь подобъекта.

Teigha.BoundaryRepresentation.Complex.GetShellsStartingFrom(Teigha.BoundaryRepresentation.Shell)
Метод позволяет получить коллекцию оболочек комплекса, которая начинается с указанной начальной оболочки.
startFrom: Начальная оболочка, с которой начинается коллекция оболочек.
Returns: Возвращает коллекцию оболочек комплекса.
Тип <c>ComplexShellCollection</c>.

Teigha.BoundaryRepresentation.Complex.Shells
Свойство <c>Shells</c> представляет коллекцию всех оболочек данного комплекса.
Returns: Возвращает коллекцию всех оболочек комплекса.
Тип <c>ComplexShellCollection</c>.