Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter.#ctor(System.Double,System.Double)
Конструктор структуры <c>DoubleRangeParameter</c>.
n: Близкое расстояние. Тип <c>double</c>.
f: Дальнее расстояние. Тип <c>double</c>.

Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter.Far
Свойство <c>Far</c> представляет расстояние для дальнего тумана.
Returns: Возвращает дистанцию для дальнего тумана. Тип <c>double</c>.

Teigha.DatabaseServices.RenderEnvironment.DoubleRangeParameter.Near
Свойство <c>Near</c> представляет расстояние для ближнего тумана.
Returns: Возвращает дистанцию для ближнего тумана. Тип <c>double</c>.