Teigha.Geometry.Line2d
Класс <c>Line2d</c> представляет бесконечную линию в двумерном пространстве.

Teigha.Geometry.Line2d.#ctor
Конструктор по умолчанию класса <c>Line2d</c>.
Создает бесконечную линию, совпадающую с осью <c>X</c> системы координат.

Teigha.Geometry.Line2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса <c>Line2d</c>.
Строит линию, проходящую через две заданные несовпадающие точки.
point1: Первая заданная точка.  Тип <c>Point2d</c>.
point2: Вторая заданная точка.  Тип <c>Point2d</c>.

Teigha.Geometry.Line2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d)
Конструктор класса <c>Line2d</c>.
Создает бесконечную линию, которая проходит через заданную точку и имеет указанный направляющий вектор.
point: Входная точка. Тип <c>Point2d</c>.
vector: Входной направляющий вектор. Тип <c>Vector2d</c>. Должен иметь ненулевую длину.

Teigha.Geometry.Line2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>Line2d</c>.

Teigha.Geometry.Line2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод позволяет переопределить данную прямую, используя две новых опорных точки.
point1: Первая точка, через которую проходит прямая. Тип <c>Point2d</c>.
point2: Вторая точка, через которую проходит прямая. Тип <c>Point2d</c>.

Teigha.Geometry.Line2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d)
Метод позволяет переопределить данную прямую, используя новые опорную точку и направляющий вектор.
point: Новая точка, через которую проходит прямая. Тип <c>Point2d</c>.
vector: Новый направляющий вектор прямой. Тип <c>Vector2d</c>.