Teigha.DatabaseServices.GeoLocationData
Этот класс хранит данные географического местоположения, включая <c>DesignPoint</c>, <c>UpDirection</c>, <c>NorthDirection</c> в пространстве чертежа, а также широту, долготу и высоту в географическом пространстве.

Teigha.DatabaseServices.GeoLocationData.#ctor
Конструктор класса <c>GeoLocationData</c>.

Teigha.DatabaseServices.GeoLocationData.AddMeshPointMap(System.Int32,Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод добавляет по указанному индексу пару связанных точек - исходную точку и точку назначения.
index: Входной индекс.   Тип <c>int</c>.
sourcePt: Исходная точка.   Тип <c>Point2d</c>.
destPt: Точка назначения. Тип <c>Point2d</c>.

Teigha.DatabaseServices.GeoLocationData.EraseFromDb
Метод предназначен для удаления данного объекта из базы данных.

Teigha.DatabaseServices.GeoLocationData.GetMeshPointMap(System.Int32)
Метод позволяет получить в виде объекта <c>MeshPointMap</c> связанные между собой исходную точку и точку назначения, хранящиеся в сети по указанному индексу.
index: Индекс пары связанных точек. Тип <c>int</c>.
Returns: Возвращает объект <c>MeshPointMap</c>, хранящийся в сети по указанному индексу.

Teigha.DatabaseServices.GeoLocationData.GetMeshPointMaps
Метод позволяет получить коллекцию исходных точек сети <c>GeoMesh</c> и коллекцию точек назначения в виде объекта <c>MeshPointMaps</c>.
Returns: Возвращает коллекции исходных точек и точек назначения в виде объекта <c>MeshPointMaps</c>.

Teigha.DatabaseServices.GeoLocationData.PostToDb
Метод позволяет отправить этот объект в словарь расширений размера или объекта <c>MLeader</c>.
Returns: Возвращает идентификатор полученного объекта. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.GeoLocationData.ResetMeshPointMaps
Этот метод позволяет сбросить сеть <c>GeoMesh</c> в состояние <c>NULL</c>.

Teigha.DatabaseServices.GeoLocationData.SetMeshPointMaps(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Point2dCollection)
Метод позволяет задать для сети <c>GeoMesh</c> новые коллекции исходных точек и точек назначения.
sourcePts: Входная коллекция исходных точек.   Тип <c>Point2dCollection</c>.
destPts: Входная коллекция точек назначения. Тип <c>Point2dCollection</c>.

Teigha.DatabaseServices.GeoLocationData.TransformFromLonLatAlt(Teigha.Geometry.Point3d)
Метод предназначен для преобразования географической точки в координатах ГИС в эквивалентную точку в координатах DWG.
geoPt: Исходная географическая точка в системе координат ГИС. Тип <c>Point3d</c>.
Returns: Возвращает соответствующую точку в координатах модели. Тип <c>Point3d</c>.

Teigha.DatabaseServices.GeoLocationData.TransformToLonLatAlt(System.Double,System.Double,System.Double)
Метод предназначен для преобразования заданных долготы, широты и высоты точки географического пространства в соответствующие
координаты точки DWG.
x: Долгота исходной геоточки DWG. Тип <c>double</c>.
y: Широта  исходной геоточки DWG. Тип <c>double</c>.
z: Высота  исходной геоточки DWG. Тип <c>double</c>.
Returns: Возвращает объект <c>GeoDataLonLatAltInfo</c>, представляющий значения долготы, широты и высоты соответствующей геоточки в координатах ГИС.

Teigha.DatabaseServices.GeoLocationData.TransformToLonLatAlt(Teigha.Geometry.Point3d)
Метод предназначен для преобразования координат указанной точки DWG в соответствующую точку географического пространства в координатах ГИС.
dwgPt: Исходная точка DWG. Тип <c>Point3d</c>.
Returns: Возвращает точку в координатах ГИС. Тип <c>Point3d</c>.

Teigha.DatabaseServices.GeoLocationData.BlockTableRecordId
Свойство обеспечивает доступ к идентификатору записи пространства модели в таблице блоков.
Returns: Возвращает запись пространства модели в таблице блоков. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.GeoLocationData.CoordinateProjectionRadius
Свойство предоставляет доступ к значению радиуса кривизны эллипсоида вращения, который используется в алгоритме коррекции высоты над уровнем моря.
Returns: Возвращает радиус кривизны эллипсоида вращения. Тип <c>double</c>. Измеряется в метрах.

Teigha.DatabaseServices.GeoLocationData.CoordinateSystem
Свойство обеспечивает доступ к строке, представляющей текущую систему координат.
Returns: Возвращает строку, представляющую систему координат. Тип <c>String</c>.

Teigha.DatabaseServices.GeoLocationData.DesignPoint
Свойство обеспечивает доступ к координатам текущей точки DWG данного объекта.
Returns: Возвращает текущую 3D-точку.  Тип <c>Point3d</c>.

Teigha.DatabaseServices.GeoLocationData.DoSeaLevelCorrection
Свойство обеспечивает доступ к флагу, который управляет применением поправки на высоту над уровнем моря к горизонтальным координатам в процессе преобразования локальных координат в координаты сети.
Returns: Возвращает <c>true</c>, если поправки на высоту над уровнем моря учитываются.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GeoLocationData.GeoRSSTag
Свойство обеспечивает доступ к строке GeoRSS.
Returns: Возвращает строку GeoRSS. Тип <c>String</c>.

Teigha.DatabaseServices.GeoLocationData.HorizontalUnits
Свойство обеспечивает доступ к горизонтальным единицам измерения.
Returns: Возвращает горизонтальные единицы измерения.  Значение из перечисления <c>UnitsValue</c>.

Teigha.DatabaseServices.GeoLocationData.HorizontalUnitsScale
Свойство обеспечивает доступ к масштабу для горизонтальных единиц измерения.
Returns: Возвращает масштабный коэффициент. Тип <c>double</c>.

Teigha.DatabaseServices.GeoLocationData.NorthDirection
Свойство возвращает угол направления на истинный север как угловое отклонение от оси X в мировой системе координат.
Returns: Возвращает угол в радианах направления на истинный север в WCS. Тип <c>double</c>.

Teigha.DatabaseServices.GeoLocationData.NorthDirectionVector
Свойство обеспечивает доступ к вектору направления на истинный север в проектных координатах DWG.
Returns: Возвращает направление на истинный север. Тип <c>Vector2d</c>.

Teigha.DatabaseServices.GeoLocationData.NumMeshPoints
Свойство возвращает общее количество точек в сети.
Returns: Возвращает количество точек в сети. Тип <c>int</c>.

Teigha.DatabaseServices.GeoLocationData.ReferencePoint
Свойство обеспечивает доступ к координатам текущей геоточки данного объекта.
Returns: Возвращает геоточку. Тип <c>Point3d</c>.

Teigha.DatabaseServices.GeoLocationData.ScaleEstimationMethod
Свойство обеспечивает доступ к текущему методу оценки масштаба в данном объекте <c>GeoLocationData</c>.
Returns: Возвращает метод оценки масштаба как значение из перечисления <c>Teigha.DatabaseServices.ScaleEstimationMethod</c>.

Teigha.DatabaseServices.GeoLocationData.ScaleFactor
Свойство обеспечивает доступ к масштабному множителю данного объекта.
Returns: Возвращает масштабный множитель. Тип <c>double</c>.

Teigha.DatabaseServices.GeoLocationData.SeaLevelElevation
Свойство обеспечивает доступ к значению высоты над уровнем моря.
Returns: Возвращает значение высоты над уровнем моря. Тип <c>double</c>.

Teigha.DatabaseServices.GeoLocationData.TypeOfCoordinates
Свойство обеспечивает доступ к текущему типу проектных координат.
Returns: Возвращает тип координат из перечисления <c>Teigha.DatabaseServices.TypeOfCoordinates</c>.

Teigha.DatabaseServices.GeoLocationData.UpDirection
Свойство обеспечивает доступ  к направлению вверх в мировой системе координат DWG.
Returns: Возвращает направление вверх в мировой системе координат DWG.  Тип <c>Vector3d</c>.

Teigha.DatabaseServices.GeoLocationData.VerticalUnits
Свойство обеспечивает доступ к типу вертикальных единиц измерения.
Returns: Возвращает тип единиц измерения из перечисления <c>UnitsValue</c>.

Teigha.DatabaseServices.GeoLocationData.VerticalUnitsScale
Свойство обеспечивает доступ к текущему масштабу вертикальных единиц измерения.
Этот коэффициент используется для умножения координат X или Y в базе данных для получения эквивалентного значения в метрах.
Returns: Возвращает масштаб вертикальных единиц измерения. Тип <c>double</c>.