Teigha.BoundaryRepresentation.Face
Класс <c>Face</c> является интерфейсным классом для граней BREP.

Teigha.BoundaryRepresentation.Face.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса <c>Face</c>. Создает экземпляр класса на основе указанного пути подобъекта.
fullSubentPath: Полный путь подобъекта.

Teigha.BoundaryRepresentation.Face.GetArea
Метод вычисляет площадь грани.  Точность вычислений определяется глобальными установками.
Returns: Возвращает площадь грани.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.Face.GetArea(System.Double)
Метод вычисляет площадь грани с указанной требуемой точностью вычислений.
Достигаемая точность вычислений определяется глобальной установкой.
tolRequired: Входная требуемая точность вычислений.  Тип <c>double</c>.
Returns: Возвращает площадь грани.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.Face.GetArea(System.Double,[Out] double%)
Метод вычисляет площадь грани с указанной требуемой точностью вычислений и возвращает фактически достигнутую точность полученной площади.
tolRequired: Входная требуемая точность вычислений.            Тип <c>double</c>.
tolAchieved: Выходная достигнутая точность вычислений площади. Тип <c>double</c>.
Returns: Возвращает площадь грани.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.Face.GetLoopsStartingFrom(Teigha.BoundaryRepresentation.BoundaryLoop)
Метод предназначен для получения коллекции циклов данной грани BREP, начиная с указанного цикла.
startFrom: Входной начальный цикл.  Тип <c>BoundaryLoop</c>.
Returns: Возвращает коллекцию циклов грани.
Тип <c>FaceLoopCollection</c>.

Teigha.BoundaryRepresentation.Face.GetSurfaceAsNurb
Метод позволяет получить базовую поверхность данной грани как подмножество объектов <c>NurbSurface</c>.
Returns: Возвращает базовую NURB поверхность для данной грани.
Тип <c>Geometry.NurbSurface</c>.

Teigha.BoundaryRepresentation.Face.GetSurfaceAsTrimmedNurbs
Метод позволяет получить обрезанное представление базовой поверхности данной грани BREP в пространстве модели.
Returns: Возвращает обрезанное представление базовой поверхности данной грани.
Тип <c>ExternalBoundedSurface[]</c>.

Teigha.BoundaryRepresentation.Face.IsOrientToSurface
Свойство <c>IsOrientToSurface</c> позволяет проверить, ориентирована ли внешняя сторона грани в направлении нормали к поверхности.
Returns: Возвращает <c>true</c>, если ориентация грани и поверхности совпадают.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.Face.Loops
Свойство <c>Loops</c> предоставляет доступ ко всем циклам, связанным с данной гранью.
Returns: Возвращает коллекцию циклов грани.
Тип <c>FaceLoopCollection</c>.

Teigha.BoundaryRepresentation.Face.Surface
Свойство <c>Surface</c> предоставляет доступ к базовой поверхности, связанной с данной гранью.
Returns: Возвращает поверхность данной грани.
Тип <c>Geometry.Surface</c>.