Teigha.DatabaseServices.PlotStyleTableChangedEventArgs
Класс <c>PlotStyleTableChangedEventArgs</c> представляет данные для события <c>PlotStyleTableChanged</c> в диспетчере листов.

Teigha.DatabaseServices.PlotStyleTableChangedEventArgs.Id
Свойство <c>Id</c> представляет идентификатор объекта изменённого листа.
Returns: Возвращает идентификатор объекта изменённого листа.
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.PlotStyleTableChangedEventArgs.NewName
Свойство <c>NewName</c> представляет имя новой таблицы стилей печати, которую только что связали с листом, имеющим идентификатор <c>Id</c>.
Returns: Возвращает имя таблицы стилей печати.
Тип <c>String</c>.