Teigha.Geometry.PlanarEquationCoefficients.#ctor(System.Double,System.Double,System.Double,System.Double)
Конструктор структуры <c>PlanarEquationCoefficients</c>.
Создает экземпляр структуры с указанными параметрами.
a: Коэффициент <c>a</c> в общем уравнении плоскости. Тип <c>double</c>.
b: Коэффициент <c>b</c> в общем уравнении плоскости. Тип <c>double</c>.
c: Коэффициент <c>c</c> в общем уравнении плоскости. Тип <c>double</c>.
d: Коэффициент <c>d</c> в общем уравнении плоскости. Тип <c>double</c>.

Teigha.Geometry.PlanarEquationCoefficients.A
Свойство <c>A</c> представляет коэффициент <c>a</c> в общем уравнении плоскости.
Returns: Возвращает коэффициент <c>a</c> в общем уравнении плоскости.
Тип <c>double</c>.

Teigha.Geometry.PlanarEquationCoefficients.B
Свойство <c>B</c> представляет коэффициент <c>b</c> в общем уравнении плоскости.
Returns: Возвращает коэффициент <c>b</c> в общем уравнении плоскости.
Тип <c>double</c>.

Teigha.Geometry.PlanarEquationCoefficients.C
Свойство <c>C</c> представляет коэффициент <c>c</c> в общем уравнении плоскости.
Returns: Возвращает коэффициент <c>c</c> в общем уравнении плоскости.
Тип <c>double</c>.

Teigha.Geometry.PlanarEquationCoefficients.D
Свойство <c>D</c> представляет коэффициент <c>d</c> в общем уравнении плоскости.
Returns: Возвращает коэффициент <c>d</c> в общем уравнении плоскости.
Тип <c>double</c>.