Teigha.Geometry.CompositeCurve3d
Класс <c>CompositeCurve3d</c> представляет трехмерные составные кривые, которые состоят из произвольного количества подкривых, соединенных конец в конец.

Teigha.Geometry.CompositeCurve3d.#ctor(array&lt;Curve3d&gt;)
Конструктор класса <c>CompositeCurve3d</c>.
Создает составную кривую из кривых в предоставленном массиве.
curves: Массив кривых, из которых предполагается создание составной кривой.

Teigha.Geometry.CompositeCurve3d.Create(IntPtr,System.Boolean)
Метод предназначен для создания составной кривой на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, из которого требуется создать данный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора.  Тип <c>bool</c>.
Returns: Возвращает созданную составную кривую.
Тип <c>CompositeCurve3d</c>.

Teigha.Geometry.CompositeCurve3d.GetCurves
Метод позволяет получить массив подкривых, которые составляют данную составную кривую.
Returns: Возвращает массив подкривых, составляющих данный объект.
Тип <c>Curve3d[]</c>.

Teigha.Geometry.CompositeCurve3d.GlobalToLocalParameter(System.Double)
Метод позволяет получить локальное значение параметра подкривой, которое соответствует переданному значению глобального параметра составной кривой.
value: Значение параметра точки на составной кривой.
Returns: Возвращает составной параметр, который включает значение параметра подкривой и индекс этой подкривой.
Тип <c>CompositeParameter</c>.

Teigha.Geometry.CompositeCurve3d.LocalToGlobalParameter(Teigha.Geometry.CompositeParameter)
Метод позволяет получить значение глобального параметра составной кривой, которое соответствует переданному локальному значению параметра подкривой.
value: Значение локального параметра подкривой.
Returns: Возвращает значение параметра точки на составной кривой.
Тип <c>double</c>.