Teigha.DatabaseServices.MInsertBlock
Класс <c>MInsertBlock</c> представляет в базе данных массивы вхождений блоков (<c>MInserts</c>).

Teigha.DatabaseServices.MInsertBlock.#ctor
Конструктор по умолчанию класса <c>MInsertBlock</c>.

Teigha.DatabaseServices.MInsertBlock.#ctor(Teigha.Geometry.Point3d,DatabaseServices.ObjectId,short,short,System.Double,System.Double)
Конструктор класса <c>MInsertBlock</c>.
position: Положение данного объекта <c>MInsertBlock</c>. Тип <c>Point3d</c>.
blockTableRecord: Запись в таблице блоков. Тип <c>DatabaseServices.ObjectId</c>.
columns: Количество столбцов изображения <c>BlockTableRecord</c>, отображаемых данным объектом <c>MInsertBlock</c>. Тип <c>short</c>.
rows: Количество строк изображения <c>BlockTableRecord</c>, отображаемых данным объектом <c>MInsertBlock</c>.  Тип <c>short</c>.
colSpacing: Расстояние между столбцами изображения <c>BlockTableRecord</c>, отображаемых данным объектом <c>MInsertBlock</c>.  Тип <c>double</c>.
rowSpacing: Расстояние между строками изображения <c>BlockTableRecord</c>, отображаемых данным объектом <c>MInsertBlock</c>.  Тип <c>double</c>.

Teigha.DatabaseServices.MInsertBlock.Columns
Свойство представляет количество столбцов изображения <c>BlockTableRecord</c> для отображения данным объектом.
Returns: Возвращает количество столбцов. Тип <c>short</c>.

Teigha.DatabaseServices.MInsertBlock.ColumnSpacing
Свойство представляет расстояние между столбцами изображения <c>BlockTableRecord</c>, отображаемого данным объектом.
Returns: Возвращает расстояние между столбцами. Тип <c>double</c>.

Teigha.DatabaseServices.MInsertBlock.Rows
Свойство представляет количество строк изображения <c>BlockTableRecord</c> для отображения данным объектом.
Returns: Возвращает количество строк. Тип <c>short</c>.

Teigha.DatabaseServices.MInsertBlock.RowSpacing
Свойство представляет расстояние между строками изображения <c>BlockTableRecord</c>, отображаемого данным объектом.
Returns: Возвращает расстояние между строками. Тип <c>double</c>.