HostMgd.EditorInput.PromptPointResult
Класс, содержащий результаты ввода точки после приглашения.

HostMgd.EditorInput.PromptPointResult.ToString(IFormatProvider)
Возвращает строку, соответствующую введенной точке в
соответствии с заданным форматом, зависящим от локализации.
provider: Формат, зависящей от локализации

HostMgd.EditorInput.PromptPointResult.Value
Возвращает точку, которую пользователь ввел.