Teigha.Geometry.ExternalBoundedSurface
Класс <c>ExternalBoundedSurface</c> представляет ограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.

Teigha.Geometry.ExternalBoundedSurface.#ctor
Конструктор по умолчанию класса <c>ExternalBoundedSurface</c>.

Teigha.Geometry.ExternalBoundedSurface.#ctor(IntPtr,Teigha.Geometry.ExternalEntityKind)
Конструктор класса <c>ExternalBoundedSurface</c>.
Создает объект на основе указателя на определение внешней поверхности и сведений о системе, в которой было создано ее определение.
surfaceDefinition: Входное определение внешней поверхности. Тип <c>IntPtr</c>.
surfaceKind: Информация о системе, в которой было создано определение внешней ограниченной поверхности. Перечисление <c>ExternalEntityKind</c>.

Teigha.Geometry.ExternalBoundedSurface.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>ExternalBoundedSurface</c>.

Teigha.Geometry.ExternalBoundedSurface.GetContours
Метод предоставляет доступ к геометрии криволинейной границы на поверхности.
Returns: Возвращает массив контуров криволинейной границы. Тип <c>CurveBoundary[]</c>.

Teigha.Geometry.ExternalBoundedSurface.Set(IntPtr,Teigha.Geometry.ExternalEntityKind)
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
surfaceDef: Указатель на определение внешней ограниченной поверхности. Тип <c>IntPtr</c>.
surfaceKind: Информация о системе, в которой было создано определение внешней ограниченной поверхности. Перечисление <c>ExternalEntityKind</c>.

Teigha.Geometry.ExternalBoundedSurface.SetToOwnSurface
Метод делает этот объект владельцем данных своего определения.

Teigha.Geometry.ExternalBoundedSurface.BaseSurface
Свойство <c>BaseSurface</c> предоставляет доступ к геометрии базовой неограниченной поверхности.
Returns: Возвращает базовую неограниченную поверхность для данного объекта. Тип <c>Surface</c>.

Teigha.Geometry.ExternalBoundedSurface.ExternalBaseSurface
Свойство <c>ExternalBaseSurface</c> представляет внешнюю базовую поверхность в ее исходном виде.
Returns: Возвращает внешнюю базовую поверхность. Тип <c>Surface</c>.

Teigha.Geometry.ExternalBoundedSurface.ExternalSurfaceDefinition
Свойство <c>ExternalSurfaceDefinition</c> представляет определение внешней поверхности, связанной с данным объектом.
Returns: Возвращает указатель на определение внешней поверхности. Тип <c>IntPtr</c>.

Teigha.Geometry.ExternalBoundedSurface.ExternalSurfaceKind
Свойство <c>ExternalSurfaceKind</c> представляет информацию о системе, в которой было создано определение внешней ограниченной поверхности.
Returns: Возвращает информацию о системе, в которой было создано определение данного объекта.
Тип <c>Geometry.ExternalEntityKind</c>.

Teigha.Geometry.ExternalBoundedSurface.IsCone
Свойство <c>IsCone</c> позволяет проверить, является ли неограниченная базовая поверхность данного объекта конусом.
Returns: Возвращает <c>true</c>, если неограниченная базовая поверхность является конусом.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalBoundedSurface.IsCylinder
Свойство <c>IsCylinder</c> позволяет проверить, является ли неограниченная базовая поверхность данного объекта цилиндром.
Returns: Возвращает <c>true</c>, если неограниченная базовая поверхность является цилиндром.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalBoundedSurface.IsDefined
Свойство <c>IsDefined</c> позволяет проверить, является ли данный объект определенным.
Returns: Возвращает <c>true</c>, если данный объект имеет определение поверхности.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalBoundedSurface.IsEllipCone
Свойство <c>IsEllipCone</c> позволяет проверить, является ли неограниченная базовая поверхность данного объекта эллиптическим конусом.
Returns: Возвращает <c>true</c>, если неограниченная базовая поверхность данного объекта является эллиптическим конусом.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalBoundedSurface.IsEllipCylinder
Свойство <c>IsEllipCylinder</c> позволяет проверить, является ли неограниченная базовая поверхность данного объекта эллиптическим цилиндром.
Returns: Возвращает <c>true</c>, если неограниченная базовая поверхность данного объекта является эллиптическим цилиндром.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalBoundedSurface.IsExternalSurface
Свойство <c>IsExternalSurface</c> позволяет убедиться, что базовая поверхность данного объекта является внешней поверхностью.
Returns: Возвращает <c>true</c>, если базовая поверхность данного объекта является внешней поверхностью.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalBoundedSurface.IsNurbs
Свойство <c>IsNurbs</c> позволяет проверить, является ли неограниченная базовая поверхность данного объекта NURBS поверхностью.
Returns: Возвращает <c>true</c>, если базовая поверхность данного объекта является NURBS поверхностью.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalBoundedSurface.IsOwnerOfSurface
Свойство <c>IsOwnerOfSurface</c> позволяет проверить, что данный объект является владельцем данных своего определения.
Returns: Возвращает <c>true</c>, если данный объект является владельцем данных своего определения.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalBoundedSurface.IsPlane
Свойство <c>IsPlane</c>  позволяет проверить, является ли неограниченная базовая поверхность данного объекта плоскостью.
Returns: Возвращает <c>true</c>, если базовая поверхность данного объекта является плоскостью.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalBoundedSurface.IsSphere
Свойство <c>IsSphere</c> позволяет проверить, является ли неограниченная базовая поверхность данного объекта сферой.
Returns: Возвращает <c>true</c>, если базовая поверхность данного объекта является сферой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalBoundedSurface.IsTorus
Свойство <c>IsTorus</c> позволяет проверить, является ли неограниченная базовая поверхность данного объекта тором.
Returns: Возвращает <c>true</c>, если базовая поверхность данного объекта является тором.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalBoundedSurface.NumContours
Свойство <c>NumContours</c> представляет количество криволинейных границ на этой поверхности.
Returns: Возвращает  количество криволинейных границ на этой внешней ограниченной поверхности.
Тип <c>int</c>.