Teigha.BoundaryRepresentation.Node
Класс <c>Node</c> является интерфейсным классом для узлов сети.

Teigha.BoundaryRepresentation.Node.#ctor
Конструктор по умолчанию класса <c>Node</c>.

Teigha.BoundaryRepresentation.Node.Point
Свойство <c>Point</c> представляет базовую точку узла сети.
Returns: Возвращает базовую точку узла сети.
Тип <c>Point3d</c>.