Teigha.DatabaseServices.ObjectOverrule
Этот класс переопределяет подмножество операций для объекта базы данных.  Он является базовым для классов, производных от OdDbObject, и используется для настройки их поведения.

Teigha.DatabaseServices.ObjectOverrule.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.ObjectOverrule.Cancel(Teigha.DatabaseServices.DBObject)
Метод отменяет переопределение.А
dbObject: Объект DBObject.

Teigha.DatabaseServices.ObjectOverrule.Close(Teigha.DatabaseServices.DBObject)
Метод вызывает соответствующий метод OdDbObjectOverrule.Сlose().
dbObject: Объект DBObject базы данных, к которому применяется переопределение.

Teigha.DatabaseServices.ObjectOverrule.DeepClone(Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.IdMapping,System.Boolean)
Метод вызывает соответствующий метод OdDbObjectOverrule.DeepClone().
dbObject: Объект DBObject базы данных, к которому применяется переопределение.
ownerObject: Объект DBObject базы данных, к которому следует добавить клоны.
idMap: Текущий идентификатор мэппинга IdMapping.
isPrimary: Флаг, указывающий, является ли данный объект первичным или дочерним. Тип bool.
Returns: Возвращает склонированный объект базы данных, тип DBObject.

Teigha.DatabaseServices.ObjectOverrule.Erase(Teigha.DatabaseServices.DBObject,System.Boolean)
Метод вызывает соответствующий метод OdDbObjectOverrule.Erase().
dbObject: Объект DBObject базы данных, к которому применяется переопределение.
erasing: Логический флаг, определяющий состояние удаления.  Тип bool.

Teigha.DatabaseServices.ObjectOverrule.Open(Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.OpenMode)
Метод вызывает соответствующий метод OdDbObjectOverrule.Open().
dbObject: Объект DBObject базы данных, к которому применяется переопределение.
mode: Режим открытия объекта из перечисления OpenMode.

Teigha.DatabaseServices.ObjectOverrule.SetCustomFilter
Метод включает использование метода IsApplicable, чтобы установить, должно ли к данному объекту
применяться переопределение.

Teigha.DatabaseServices.ObjectOverrule.SetExtensionDictionaryEntryFilter(String)
Метод реализует предварительную фильтрацию объектов в словаре расширений прежде чем применять переопределения.
entryName: Имя искомой записи в словаре расширений, тип String.

Teigha.DatabaseServices.ObjectOverrule.SetIdFilter(array&lt;ObjectId&gt;)
Метод включает предварительную фильтрацию объектов по списку ObjectId прежде чем применять переопределения.
ids: Массив идентификаторов ObjectId.

Teigha.DatabaseServices.ObjectOverrule.SetNoFilter
Метод отключает использование любых методов предварительной фильтрации объектов перед вызовом переопределений (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter, а также IsApplicable).

Teigha.DatabaseServices.ObjectOverrule.SetXDataFilter(String)
Метод включает предварительную фильтрацию переопределяемых объектов по расширенным данным (xdata).
<p>Метод используется в тех случаях, когда nanoCAD должен выполнять поиск xdata с RegisteredApplicationName для переопределяемого объекта перед вызовом любого из ваших переопределений.</p>
registeredApplicationName: Имя зарегистрированного приложения, тип String.

Teigha.DatabaseServices.ObjectOverrule.WblockClone(Teigha.DatabaseServices.DBObject,Teigha.Runtime.RXObject,Teigha.DatabaseServices.IdMapping,System.Boolean)
Данный метод вызывает соответствующий метод OdDbObjectOverrule.WblockClone().
dbObject: Объект DBObject базы данных, к которому применяется переопределение.
ownerObject: Объект RXObject базы данных, для которого клоны станут дочерними объектами.
idMap: Текущий идентификатор мэппинга IdMapping.
isPrimary: Флаг, определяющий, является ли данный объект первичным или дочерним. Тип bool.