HostMgd.EditorInput.PromptIntegerOptions
Класс, представляющий необязательные параметры для
приглашения ввода целого числа.

HostMgd.EditorInput.PromptIntegerOptions.DefaultValue
Возвращает или устанавливает значение по умолчанию. Значение
по умолчанию используетс при нажатии клавиши Enter без ввода
значения.

HostMgd.EditorInput.PromptIntegerOptions.LowerLimit
Возвращает или устанавливает минимально допустимое значение
при вводе.

HostMgd.EditorInput.PromptIntegerOptions.#ctor(String)
Конструктор.
message: Приглашающее сообщение

HostMgd.EditorInput.PromptIntegerOptions.#ctor(String,String)
Конструктор.
messageAndKeywords: Приглашающая строка с ключевыми словами
globalKeywords: Строка ключевых слов (глобальные имена)

HostMgd.EditorInput.PromptIntegerOptions.#ctor(String,String,System.Int32,System.Int32)
\ \
Конструктор.
messageAndKeywords: Приглашающая строка с ключевыми словами
globalKeywords: Строка ключевых слов (глобальные имена)
lowerLimit: Нижний предел значения
upperLimit: Верхий предел значения

HostMgd.EditorInput.PromptIntegerOptions.UpperLimit
Возвращает или устанавливает максимально допустимое значение
при вводе.