Teigha.LayerManager.LayerFilterDisplayImages.#ctor(IntPtr,System.Int32,System.Int32)
Конструктор структуры <c>LayerFilterDisplayImages</c>. Создает экземпляр структуры с указанными параметрами.
imageListHandle: Дескриптор списка изображений. Тип <c>IntPtr</c>.
imageIndex: Индекс изображения.            Тип <c>int</c>.
selectedImageIndex: Индекс выбранного изображения. Тип <c>int</c>.

Teigha.LayerManager.LayerFilterDisplayImages.ImageIndex
Свойство <c>ImageIndex</c> представляет индекс обычного изображения в списке изображений.
Returns: Возвращает индекс изображения в списке.
Тип <c>int</c>.

Teigha.LayerManager.LayerFilterDisplayImages.ImageListHandle
Свойство <c>ImageListHandle</c> представляет дескриптор списка изображений, содержащего обычное и выбранное изображение.
Returns: Возвращает дескриптор списка изображений.
Тип <c>IntPtr</c>.

Teigha.LayerManager.LayerFilterDisplayImages.SelectedImageIndex
Свойство <c>SelectedImageIndex</c> представляет индекс выбранного изображения в списке изображений.
Returns: Возвращает индекс выбранного изображения.
Тип <c>int</c>.