Teigha.DatabaseServices.TableStyle
Класс <c>TableStyle</c> представляет в базе данных табличные стили.

Teigha.DatabaseServices.TableStyle.#ctor
Конструктор по умолчанию класса <c>TableStyle</c>.

Teigha.DatabaseServices.TableStyle.Alignment(Teigha.DatabaseServices.RowType)
Метод позволяет определить тип выравнивания содержимого в ячейках строк указанного типа.
rowType: Тип строки. Перечисление <c>RowType</c>.
Returns: Возвращает тип выравнивания содержимого в ячейках. Перечисление <c>CellAlignment</c>.

Teigha.DatabaseServices.TableStyle.BackgroundColor(Teigha.DatabaseServices.RowType)
Метод позволяет определить цвет фона в строке указанного типа.
rowType: Тип строки. Перечисление Тип <c>RowType</c>.
Returns: Возвращает цвет фона в строке. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.TableStyle.CellClass(String)
Метод позволяет определить класс ячейки по имени стиля ячейки.
styleName: Имя стиля ячейки. Тип <c>String</c>.
Returns: Возвращает класс ячейки. Значение из перечисления <c>DatabaseServices.CellClass</c>.

Teigha.DatabaseServices.TableStyle.Color(Teigha.DatabaseServices.RowType)
Метод позволяет получить цвет текста в строке указанного типа.
rowType: Тип строки. Перечисление <c>RowType</c>.
Returns: Возвращает цвет текста в строке. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.TableStyle.DataType(Teigha.DatabaseServices.RowType)
Метод позволяет получить тип данных в строке указанного типа.
rowType: Тип строки. Перечисление <c>RowType</c>.
Returns: Возвращает тип данных в строке согласно типу строки.
Тип <c>DatabaseServices.DataType</c>.

Teigha.DatabaseServices.TableStyle.Format(Teigha.DatabaseServices.RowType)
Метод предназначен для получения формата, назначенного для строк указанного типа.
rowType: Тип строки. Перечисление <c>RowType</c>.
Returns: Возвращает пустую строку. Тип <c>String</c>.

Teigha.DatabaseServices.TableStyle.GridColor(Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.RowType)
Метод позволяет получить цвет указанного типа линий сетки в строке заданного типа.
gridLineType: Тип линий сетки. Перечисление <c>GridLineType</c>.
rowType: Тип строки.      Перечисление <c>RowType</c>.
Returns: Возвращает цвет линий сетки. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.TableStyle.GridLineWeight(Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.RowType)
Метод позволяет получить вес (толщину) линий, используемый в заданном сочетании типа линий сетки и типа строк таблицы.
gridLineType: Тип линий сетки. Перечисление <c>GridLineType</c>.
rowType: Тип строки.      Перечисление <c>RowType</c>.
Returns: Возвращает вес (толщину) линий. Перечисление <c>LineWeight</c>.

Teigha.DatabaseServices.TableStyle.GridVisibility(Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.RowType)
Метод позволяет выяснить, отображается ли указанный тип линий сетки в строках заданного типа.
gridLineType: Тип линий сетки. Перечисление <c>GridLineType</c>.
rowType: Тип строки.      Перечисление <c>RowType</c>.
Returns: Возвращает <c>true</c>, если линии сетки отображаются.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.TableStyle.IsBackgroundColorNone(Teigha.DatabaseServices.RowType)
Метод позволяет проверить, отображается ли цвет фона в строках указанного типа.
rowType: Тип строки. Перечисление <c>RowType</c>.
Returns: Возвращает <c>true</c>, если цвет фона не отображается.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.TableStyle.Margin(Teigha.DatabaseServices.CellMargins,String)
Метод позволяет получить величину поля указанного типа в заданном стиле ячейки.
cellMargin: Тип поля ячейки. Перечисление <c>CellMargins</c>.
styleName: Имя стиля ячейки таблицы. Тип <c>String</c>.
Returns: Возвращает величину поля. Тип <c>double</c>.

Teigha.DatabaseServices.TableStyle.PostTableStyleToDatabase(DatabaseServices.Database,String)
Метод добавляет табличный стиль в указанную базу данных.
databasePointer: База данных, в которую добавляется табличный стиль. Тип <c>DatabaseServices.Database</c>.
styleName: Имя добавляемого табличного стиля. Тип <c>String</c>.
Returns: Возвращает идентификатор добавленного табличного стиля.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.TableStyle.SetAlignment(Teigha.DatabaseServices.CellAlignment,System.Int32)
Метод позволяет задать выравнивание в ячейках строк указанных типов.
alignment: Выравнивание в ячейках строки. Перечисление <c>CellAlignment</c>.
rowTypes: Один или комбинация типов строк таблицы, для которых задается выравнивание. Тип <c>int</c>. См. перечисление <c>RowType</c>.

Teigha.DatabaseServices.TableStyle.SetBackgroundColor(Colors.Color,System.Int32)
Метод позволяет задать цвет фона в ячейках строк указанного типа.
color: Цвет фона. Тип <c>Teigha.Colors.Color</c>.
rowTypes: Один или комбинация нескольких типов строк таблицы, для которых задается выравнивание. Тип <c>int</c>. См. перечисление <c>RowType</c>.

Teigha.DatabaseServices.TableStyle.SetBackgroundColorNone(System.Boolean,System.Int32)
Метод позволяет задать режим отображения цвета фона в строках указанного типа.
value: Флаг отключения отображения фонового цвета. Тип <c>bool</c>. Если принимает значение <c>true</c>, цвет фона подавляется и наоборот.
rowTypes: Один или комбинация нескольких типов строк таблицы. Тип <c>int</c>. См. перечисление <c>RowType</c>.

Teigha.DatabaseServices.TableStyle.SetCellClass(DatabaseServices.CellClass,String)
Метод позволяет задать класс ячейкам с указанным стилем ячейки.
cellClass: Класс ячейки. Тип <c>DatabaseServices.CellClass</c>.
styleName: Имя стиля ячейки. Тип <c>String</c>.

Teigha.DatabaseServices.TableStyle.SetColor(Colors.Color,System.Int32)
Метод позволяет задать цвет текста в строках указанного типа.
color: Цвет текста. Тип <c>Teigha.Colors.Color</c>.
rowTypes: Один или комбинация нескольких типов строк таблицы. Тип <c>int</c>. См. перечисление <c>RowType</c>.

Teigha.DatabaseServices.TableStyle.SetDataType(DatabaseServices.DataType,DatabaseServices.UnitType,Teigha.DatabaseServices.RowType)
Метод позволяет задать тип данных и тип единиц измерения в строках заданного типа.
nDataType: Входной тип данных. Тип <c>DatabaseServices.DataType</c>.
nUnitType: Входной тип единиц изверения. Тип <c>DatabaseServices.UnitType</c>.
rowTypes: Один или комбинация нескольких типов строк таблицы. Тип <c>int</c>. См. перечисление <c>RowType</c>.

Teigha.DatabaseServices.TableStyle.SetFormat(String,Teigha.DatabaseServices.RowType)
Метод позволяет задать формат в ячейках строк заданного типа. В текущей версии не реализован.
pFormat: Задаваемый формат ячеек. Тип <c>String</c>.
rowTypes: Один или комбинация нескольких типов строк таблицы. Тип <c>int</c>. См. перечисление <c>RowType</c>.

Teigha.DatabaseServices.TableStyle.SetGridColor(Colors.Color,System.Int32,System.Int32)
Метод позволяет задать цвет сетки для указанного сочетания типов линий сетки и типов строк таблицы.
color: Новый цвет сетки. Тип <c>Teigha.Colors.Color</c>.
gridLineTypes: Тип линий сетки (или логическая комбинация нескольких типов). Тип <c>int</c>. См. перечисление <c>GridLineType</c>.
rowTypes: Тип строк таблицы (или логическая комбинация нескольких типов). Тип <c>int</c>. См. перечисление <c>RowType</c>.

Teigha.DatabaseServices.TableStyle.SetGridLineWeight(Teigha.DatabaseServices.LineWeight,System.Int32,System.Int32)
Метод позволяет задать вес (толщину) линий для указанных типов линий сетки и типов строк.
lineWeight: Новый вес (толщина) линий. Перечисление <c>LineWeight</c>.
gridLineTypes: Тип линий сетки   (или логическая комбинация нескольких типов). Тип <c>int</c>. См. перечисление <c>GridLineType</c>.
rowTypes: Тип строк таблицы (или логическая комбинация нескольких типов). Тип <c>int</c>. См. перечисление <c>RowType</c>.

Teigha.DatabaseServices.TableStyle.SetGridVisibility(System.Boolean,System.Int32,System.Int32)
Метод позволяет задать видимость сетки для указанных типов линий сетки и типов строк.
visible: Флаг видимости. Тип <c>bool</c>.
gridLineTypes: Тип линий сетки (или логическая комбинация нескольких типов). Тип <c>int</c>. См. перечисление <c>GridLineType</c>.
rowTypes: Тип строк таблицы (или логическая комбинация нескольких типов). Тип <c>int</c>. См. перечисление <c>RowType</c>.

Teigha.DatabaseServices.TableStyle.SetMargin(Teigha.DatabaseServices.CellMargins,System.Double,String)
Метод позволяет задать величину поля ячейки таблицы для указанного типа поля в заданном стиле ячейки.
cellMargin: Тип поля. Перечисление <c>CellMargins</c>.
margin: Величина поля. Тип <c>double</c>.
styleName: Имя стиля ячейки. Тип <c>String</c>.

Teigha.DatabaseServices.TableStyle.SetTextHeight(System.Double,System.Int32)
Метод позволяет задать высоту текста для строк указанного типа.
height: Высота текста. Тип <c>double</c>.
rowTypes: Тип строки таблицы (или логическая комбинация нескольких типов). Тип <c>int</c>. См. перечисление <c>RowType</c>.

Teigha.DatabaseServices.TableStyle.SetTextStyle(DatabaseServices.ObjectId,System.Int32)
Метод позволяет задать текстовый стиль для строк указанного типа.
id: Идентификатор объекта текстового стиля. Тип <c>DatabaseServices.ObjectId</c>.
rowTypes: Тип строки таблицы (или логическая комбинация нескольких типов). Тип <c>int</c>. См. перечисление <c>RowType</c>.

Teigha.DatabaseServices.TableStyle.SetTextStyle(DatabaseServices.ObjectId,String)
Метод позволяет задать текстовый стиль для указанного стиля ячейки.
id: Идентификатор объекта текстового стиля. Тип <c>DatabaseServices.ObjectId</c>.
styleName: Имя стиля ячейки таблицы. Тип <c>String</c>.

Teigha.DatabaseServices.TableStyle.TextHeight(Teigha.DatabaseServices.RowType)
Метод позволяет получить высоту текста, назначенную для строк указанного типа.
rowType: Тип строки таблицы. Перечисление <c>RowType</c>.
Returns: Возвращает высоту текста. Тип <c>double</c>.

Teigha.DatabaseServices.TableStyle.TextHeight(String)
Метод позволяет получить высоту текста в указанном стиле ячейки.
cellStyle: Имя стиля ячейки. Тип <c>String</c>.
Returns: Возвращает высоту текста в ячейке. Тип <c>double</c>.

Teigha.DatabaseServices.TableStyle.TextStyle(Teigha.DatabaseServices.RowType)
Метод позволяет получить стиль текста в строках указанного типа.
rowType: Тип строки таблицы. Перечисление <c>RowType</c>.
Returns: Возвращает идентификатор текстового стиля. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.TableStyle.TextStyle(String)
Метод позволяет получить текстовый стиль, предусмотренный в указанном стиле ячейки.
styleName: Имя стиля ячейки таблицы. Тип <c>String</c>.
Returns: Возвращает идентификатор текстового стиля. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.TableStyle.UnitType(Teigha.DatabaseServices.RowType)
Метод позволяет получить тип единиц измерения, назначенный для строк указанного типа.
rowType: Тип строки таблицы. Перечисление <c>RowType</c>.
Returns: Возвращает тип единиц измерения. Перечисление <c>DatabaseServices.UnitType</c>.

Teigha.DatabaseServices.TableStyle.BitFlags
Свойство <c>BitFlags</c> представляет битовые флаги направления заполнения таблицы, предусмотренные данным стилем таблицы.
Returns: Возвращает битовые флаги направления заполнения таблицы.
Тип <c>int</c>.

Teigha.DatabaseServices.TableStyle.CellStyles
Свойство <c>CellStyles</c> представляет массив стилей ячеек, связанных с данным табличным стилем.
Returns: Возвращает массив стилей ячеек. Тип <c>ArrayList</c>.

Teigha.DatabaseServices.TableStyle.Description
Свойство <c>Description</c> представляет описание данного табличного стиля.
Returns: Возвращает описание стиля. Тип <c>String</c>.

Teigha.DatabaseServices.TableStyle.FlowDirection
Свойство <c>FlowDirection</c> представляет направление, в котором таблица заполняется содержимым.
Returns: Возвращает направление заполнения таблицы. Перечисление <c>DatabaseServices.FlowDirection</c>.

Teigha.DatabaseServices.TableStyle.HorizontalCellMargin
Свойство <c>HorizontalCellMargin</c> представляет величину горизонтального поля ячейки.
Returns: Возвращает размер горизонтального поля ячейки. Тип <c>double</c>.

Teigha.DatabaseServices.TableStyle.IsHeaderSuppressed
Свойство <c>IsHeaderSuppressed</c> представляет состояние флага подавления строки заголовков столбцов.
Returns: Возвращает <c>true</c>, если строка заголовков столбцов подавлена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.TableStyle.IsTitleSuppressed
Свойство <c>IsTitleSuppressed</c> представляет состояние флага подавления наименования таблицы.
Returns: Возвращает <c>true</c>, если строка наименования таблицы подавлена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.TableStyle.Name
Свойство <c>Name</c> представляет имя данного стиля таблицы.
Returns: Возвращает имя стиля таблицы.
Тип <c>String</c>.

Teigha.DatabaseServices.TableStyle.Template
Свойство <c>Template</c> представляет шаблон данного табличного стиля.
Returns: Возвращает идентификатор шаблона табличного стиля. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.TableStyle.VerticalCellMargin
Свойство <c>VerticalCellMargin</c> представляет величину вертикального поля ячейки.
Returns: Возвращает величину вертикального поля ячейки.
Тип <c>double</c>.