Teigha.DatabaseServices.ObjectContextCollectionEnumerator
Этот класс представляет перечислитель для коллекции объектов <c>ObjectContext</c>.

Teigha.DatabaseServices.ObjectContextCollectionEnumerator.IEnumerator_get_Current
Метод позволяет получить текущий элемент коллекции.
Returns: Возвращает элемент коллекции. Тип <c>Object</c>.

Teigha.DatabaseServices.ObjectContextCollectionEnumerator.MoveNext
Метод обеспечивает переход перечислителя к следующему объекту <c>ObjectContext</c> в данной коллекции.
Returns: Возвращает <c>true</c>, если переход к следующему объекту <c>ObjectContext</c> выполнен успешно.
Если достигнут конец коллекции, возвращает <c>false</c>.

Teigha.DatabaseServices.ObjectContextCollectionEnumerator.Reset
Метод обеспечивает переход перечислителя в начало коллекции.

Teigha.DatabaseServices.ObjectContextCollectionEnumerator.Current
Свойство представляет элемент коллекции, на котором установлен указатель перечислителя.
Returns: Возвращает элемент коллекции под указателем перечислителя.  Тип <c>ObjectContext</c>.