HostMgd.EditorInput.Editor.PromptForEntityEnding
Событие, возникающее после завершения операции выбора
геометрического объекта
Порядок возникновения событий:
№  Событие
1  PromptingForEntity.
2  PromptForEntityEnding (информация ).
3  PromptedForEntity.