Teigha.DatabaseServices.UnderlayDefinition
Класс <c>UnderlayDefinition</c> является абстрактным классом, который обеспечивает связь с внешним содержимым подложки.

Teigha.DatabaseServices.UnderlayDefinition.GetDictionaryKey(Type)
Метод позволяет получить имя словаря с объектами <c>UnderlayDefinition</c> в словаре именованных объектов.
underlayDefinitionType: Входной дескриптор класса типа подложки, для которого требуется получить имя словаря. Тип <c>Type</c>.
Returns: Возвращает имя словаря. Тип <c>String</c>.

Teigha.DatabaseServices.UnderlayDefinition.Load(String)
Метод позволяет загрузить файл, на который ссылается эта подложка.
password: Необязательный пароль, который может потребоваться для открытия файла. Тип <c>String</c>.

Teigha.DatabaseServices.UnderlayDefinition.SetUnderlayItem(String,String,Teigha.DatabaseServices.UnderlayItem)
Метод позволяет задать имя элемента подложки, на который должна ссылаться эта подложка, и выгружает предыдущий элемент подложки, на который имелась ссылка.
sourceFileName: Путь к исходному файлу. Тип <c>String</c>.
activeFileName: Путь к активному файлу. Тип <c>String</c>.
item: Элемент, на который создается ссылка. Тип <c>UnderlayItem</c>.

Teigha.DatabaseServices.UnderlayDefinition.Unload
Метод позволяет выгрузить файл подложки.

Teigha.DatabaseServices.UnderlayDefinition.ActiveFileName
Свойство <c>ActiveFileName</c> представляет полный путь к файлу, на который ссылается данная подложка.
Returns: Полный путь к файлу. Тип <c>String</c>.

Teigha.DatabaseServices.UnderlayDefinition.ItemName
Свойство <c>ItemName</c> представляет имя элемента, на который ссылается эта подложка.
Returns: Возвращает имя элемента. Тип <c>String</c>.

Teigha.DatabaseServices.UnderlayDefinition.Loaded
Свойство <c>Loaded</c> позволяет определить, загружена ли в данный момент эта подложка.
Returns: Возвращает <c>true</c>, если данная подложка загружена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.UnderlayDefinition.SourceFileName
Свойство <c>SourceFileName</c> представляет полное или относительное имя исходного файла, на который ссылается эта подложка.
Returns: Возвращает полное или относительное имя файла. Тип <c>String</c>.

Teigha.DatabaseServices.UnderlayDefinition.UnderlayItem
Свойство <c>UnderlayItem</c> представляет элемент, на который ссылается эта подложка.
Returns: Возвращает элемент, на который ссылается подложка.
Тип <c>DatabaseServices.UnderlayItem</c>.