Teigha.DatabaseServices.PdfReference
Класс <c>PdfReference</c> реализует функционал для работы со ссылками на контент в формате PDF.

Teigha.DatabaseServices.PdfReference.#ctor
Конструктор по умолчанию класса <c>PdfReference</c>.