Teigha.BoundaryRepresentation.Mesh2dElement2dEnumerator
Класс <c>Mesh2dElement2dEnumerator</c> представляет перечислитель объектов <c>Element2d</c> двумерной сети <c>Mesh2d</c>.

Teigha.BoundaryRepresentation.Mesh2dElement2dEnumerator.Current
Свойство <c>Current</c> предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип <c>Element2d</c>.