Teigha.DatabaseServices.Filters.LayerIndex
Этот класс представляет собой реализацию индекса для фильтра слоев.

Teigha.DatabaseServices.Filters.LayerIndex.#ctor
Конструктор класса <c>LayerIndex</c> по умолчанию.

Teigha.DatabaseServices.Filters.LayerIndex.Compute(Teigha.DatabaseServices.LayerTable,Teigha.DatabaseServices.BlockTableRecord)
Метод предназначен для вычисления данного фильтра, используя указанные таблицу слоев и запись таблицы блоков.
pLT: Входная таблица слоев в объекте <c>Database</c>. Тип <c>LayerTable</c>.
record: Входная запись таблицы блоков, для которой должен быть вычислен фильтр. Тип <c>BlockTableRecord</c>.