HostMgd.EditorInput.Editor.GetCommandVersion
Эта функция используется для запроса требуемой версии команды
в процессе ее выполнения в текущем документе. Этот запрос
выполняется запросом версии в стеке версий команд.