HostMgd.EditorInput.PromptResult
Это базовый класс для классов, которые содержат результат,
введенный после приглашения.

HostMgd.EditorInput.PromptResult.Status
Возвращает статус результата операции после приглашения.

HostMgd.EditorInput.PromptResult.StringResult
Возвращает необязательную строку с результатом опеации после
приглашения. Это значение устанавливается, если статус
операции С PromptStatus.Keyword, или после приглашения как
первичный результат возвращается строка.

HostMgd.EditorInput.PromptResult.ToString(IFormatProvider)
Возвращает строку, соответствующую введенному вещественному
числу в соответствии с заданным форматом, зависящим от
локализации.
provider: Формат, зависящей от локализации