Teigha.DatabaseServices.Spline
Класс <c>Spline</c> представляет объекты <c>Spline</c> в базе данных.

Teigha.DatabaseServices.Spline.#ctor
Конструктор по умолчанию класса <c>Spline</c>.

Teigha.DatabaseServices.Spline.#ctor(System.Int32,System.Boolean,System.Boolean,System.Boolean,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.DoubleCollection,System.Double,System.Double)
Конструктор класса <c>Spline</c>. Создает экземпляр класса с указанными параметрами.
degree: Степень сплайна (его порядок). Тип <c>int</c>.
rational: Флаг, определяющий, является ли сплайн рациональным. Тип <c>bool</c>.
closed: Флаг, определяющий, является ли сплайн замкнутым. Тип <c>bool</c>.
periodic: Флаг, определяющий, является ли сплайн периодическим. Тип <c>bool</c>.
controlPoints: Коллекция управляющих вершин сплайна. Тип <c>Point3dCollection</c>.
knots: Узловой вектор сплайна. Тип <c>DoubleCollection</c>.
weights: Коллекция весов в управляющих вершинах. Тип <c>DoubleCollection</c>.
controlPointTolerance: Допуск для управляющих вершин сплайна. Тип <c>double</c>.
knotTolerance: Допуск для значений узлов сплайна. Тип <c>double</c>.

Teigha.DatabaseServices.Spline.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double)
Конструктор класса <c>Spline</c>. Создает сплайн, геометрически представляющий эллиптическую дугу с заданными параметрами.
center: Центр эллиптической дуги. Тип <c>Point3d</c>.
unitNormal: Нормаль плоскости эллиптической дуги. Тип <c>Vector3d</c>.
majorAxis: Направление главной оси эллипса. Тип <c>Vector3d</c>.
radiusRatio: Отношение малого и большого радиусов эллипса. Тип <c>double</c>.
startAngle: Угол для начальной точки дуги (в радианах). Тип <c>double</c>.
endAngle: Угол для конечной  точки дуги (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.Spline.#ctor(Teigha.Geometry.Point3dCollection,System.Int32,System.Double)
Конструктор класса <c>Spline</c>. Создает экземпляр класса, который аппроксимирует кривой указанного порядка переданный массив определяющих точек в пределах заданного допуска. Направления касательных на концах сплайна определяются автоматически.
point: Массив определяющих точек. Тип <c>Point3dCollection</c>.
order: Порядок сплайна. Тип <c>int</c>.
fitTolerance: Точность аппроксимации определяющих точек. Тип <c>double</c>.

Teigha.DatabaseServices.Spline.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Int32,System.Double)
Конструктор класса <c>Spline</c>. Создает экземпляр класса, который аппроксимирует переданный массив определяющих точек сплайном указанного порядка в пределах заданного допуска. Направления касательных на концах сплайна настраиваются входными параметрами.
point: Массив определяющих точек. Тип <c>Point3dCollection</c>.
startTangent: Направление касательной в начальной точке сплайна. Тип <c>Vector3d</c>.
endTangent: Направление касательной в конечной точке сплайна. Тип <c>Vector3d</c>.
order: Порядок сплайна. Тип <c>int</c>.
fitTolerance: Точность аппроксимации. Тип <c>double</c>.

Teigha.DatabaseServices.Spline.ElevateDegree(System.Int32)
Метод позволяет увеличить степень данного сплайна до указанного значения.
newDegree: Новое значение степени сплайна. Тип <c>int</c>.

Teigha.DatabaseServices.Spline.GetControlPointAt(System.Int32)
Метод предоставляет управляющую вершину данного объекта <c>Spline</c> по её индексу.
index: Индекс управляющей вершины сплайна. Тип <c>int</c>.
Returns: Возвращает управляющую вершину сплайна. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Spline.GetFitPointAt(System.Int32)
Метод предоставляет указанную по индексу определяющую точку данного сплайна.
index: Индекс точки в массиве определяющих точек сплайна. Тип <c>int</c>.
Returns: Возвращает определяющую точку с указанным индексом. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Spline.InsertFitPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет вставить указанную точку в массив определяющих точек данного сплайна по заданному индексу.
index: Индекс в массиве определяющих точек. Тип <c>int</c>.
point: Вставляемая определяющая точка. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Spline.InsertKnot(System.Double)
Метод позволяет вставить новый узел в узловой вектор сплайна в позицию, определенную предоставленным значением параметра.
value: Значение вставляемого узла. Тип <c>double</c>.

Teigha.DatabaseServices.Spline.PurgeFitData
Метод предназначен для удаления из данного объекта данных аппроксимации, если сплайн построен методом определяющих точек.

Teigha.DatabaseServices.Spline.RemoveFitPointAt(System.Int32)
Метод предназначен для удаления из данного сплайна определяющей точки с указанным индексом.
index: Индекс определяющей точки. Тип <c>int</c>.

Teigha.DatabaseServices.Spline.SetControlPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет изменить координаты управляющей вершины данного сплайна с заданным индексом.
index: Индекс новой управляющей вершины. Тип <c>int</c>.
point: Новое положение управляющей вершины в мировой системе координат (WCS). Тип <c>Point3d</c>.

Teigha.DatabaseServices.Spline.SetFitPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет изменить координаты определяющей точки данного сплайна с заданным индексом.
index: Индекс определяющей точки. Тип <c>int</c>.
point: Новое положение определяющей точки в мировой системе координат (WCS). Тип <c>Point3d</c>.

Teigha.DatabaseServices.Spline.SetWeightAt(System.Int32,System.Double)
Метод позволяет изменить вес управляющей вершины с указанным индексом.
index: Индекс управляющей вершины. Тип <c>int</c>.
weight: Новое значение веса управляющей вершины. Тип <c>double</c>.

Teigha.DatabaseServices.Spline.ToPolyline
Метод позволяет получить полилинию, которая аппроксимирует данный сплайн.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип <c>Curve</c>.

Teigha.DatabaseServices.Spline.ToPolyline(System.Boolean,System.Boolean)
Метод предназначен для аппроксимации данного сплайна полилинией.
Входные аргументы метода позволяют в случае плоского сплайна разрешить использование дуг и приведение результата к типу <c>Polyline</c>.
bConvertAsArcs: Флаг, определяющий, следует ли сегменты полилинии конвертировать в дуги, если сплайн плоский.  Тип <c>bool</c>.
bToLWPolyline: Флаг, определяющий, следует ли привести результат аппроксимации к типу <c>Polyline</c>, если сплайн плоский. Тип <c>bool</c>.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип <c>Curve</c>.

Teigha.DatabaseServices.Spline.ToPolyline(unsigned int)
Метод предназначен для аппроксимации данного сплайна полилинией.
Аргумент метода позволяет ограничить сверху количество вершин создаваемой полилинии.
numOfVertices: Ограничение сверху на количество вершин у создаваемой полилинии. Тип <c>unsigned int</c>.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип <c>Curve</c>.

Teigha.DatabaseServices.Spline.ToPolyline(unsigned int,System.Boolean,System.Boolean)
Метод предназначен для аппроксимации данного сплайна полилинией.
Входные аргументы метода позволяют ограничить сверху количество вершин создаваемой полилинии, а в случае плоского сплайна разрешить использование круглых дуг и приведение результата к типу <c>Polyline</c>.
numOfVertices: Ограничение сверху на количество вершин у создаваемой полилинии. Тип <c>unsigned int</c>. Передаваемое значение не может быть меньше количества определяющих точек сплайна.
bConvertAsArcs: Флаг, определяющий, следует ли сегменты полилинии конвертировать в круглые дуги, если сплайн плоский.  Тип <c>bool</c>.
bToLWPolyline: Флаг, определяющий, следует ли приводить результат аппроксимации к типу <c>Polyline</c>, если сплайн плоский. Тип <c>bool</c>.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип <c>Curve</c>.

Teigha.DatabaseServices.Spline.ToPolylineWithPrecision(System.Int32)
Метод предназначен для аппроксимации данного сплайна полилинией с настраиваемой точностью.
precision: Входная точность для процедуры аппроксимации. Тип <c>int</c>.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип <c>Curve</c>.

Teigha.DatabaseServices.Spline.ToPolylineWithPrecision(System.Int32,System.Boolean,System.Boolean)
Метод предназначен для аппроксимации данного сплайна полилинией.
Аргументы метода позволяют настраивать точность аппроксимации и управлять типом получаемой полилинии.
precision: Входная точность для процедуры аппроксимации. Тип <c>int</c>.
bConvertAsArcs: Флаг, определяющий, следует ли сегменты полилинии конвертировать в круглые дуги, если сплайн плоский.  Тип <c>bool</c>.
bToLWPolyline: Флаг, определяющий, следует ли приводить результат аппроксимации к типу <c>Polyline</c>, если сплайн плоский. Тип <c>bool</c>.
Returns: Возвращает результат аппроксимации сплайна полилинией. Тип <c>Curve</c>.

Teigha.DatabaseServices.Spline.UpdateFitData
Метод обновляет данные аппроксимации сплайна.

Teigha.DatabaseServices.Spline.WeightAt(System.Int32)
Метод позволяет получить значение веса по указанному индексу.
index: Входной индекс. Тип <c>int</c>.
Returns: Возвращает значение веса. Тип <c>double</c>.

Teigha.DatabaseServices.Spline.Degree
Свойство <c>Degree</c> представляет степень данного сплайна.
Returns: Возвращает степень сплайна. Тип <c>int</c>.

Teigha.DatabaseServices.Spline.EndFitTangent
Свойство <c>EndFitTangent</c> представляет касательный вектор в конечной определяющей точке.
Returns: Возвращает касательный вектор. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Spline.FitData
Свойство <c>FitData</c> представляет данные подгонки этого сплайна.
Returns: Возвращает данные подгонки в виде объекта <c>DatabaseServices.FitData</c>.

Teigha.DatabaseServices.Spline.FitTolerance
Свойство <c>FitTolerance</c> представляет точность аппроксимации для данного сплайна.
Returns: Возвращает точность аппроксимации. Тип <c>double</c>.

Teigha.DatabaseServices.Spline.HasFitData
Свойство <c>HasFitData</c> позволяет выяснить, был ли данный сплайн создан методом определяющих точек.
Returns: Возвращает <c>true</c>, если сплайн был создан методом определяющих точек.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Spline.IsNull
Свойство <c>IsNull</c> позволяет проверить, что у данного сплайна нет управляющих вершин.
Returns: Возвращает <c>true</c>, если у данного сплайна нет управляющих вершин.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Spline.IsPlanar
Свойство <c>IsPlanar</c> позволяет проверить, что данный сплайн является плоским.
Returns: Возвращает <c>true</c>, если сплайн является плоским.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Spline.IsRational
Свойство <c>IsRational</c> позволяет проверить, является ли данный сплайн рациональным.
Returns: Возвращает <c>true</c>, если сплайн является рациональным.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Spline.NumControlPoints
Свойство <c>NumControlPoints</c> представляет количество управляющих вершин у данного сплайна.
Returns: Возвращает количество управляющих вершин. Тип <c>int</c>.

Teigha.DatabaseServices.Spline.NumFitPoints
Свойство <c>NumFitPoints</c> представляет количество определяющих точек у данного сплайна.
Returns: Возвращает количество определяющих точек. Тип <c>int</c>.

Teigha.DatabaseServices.Spline.NurbsData
Свойство <c>NurbsData</c> представляет данные NURBS этого сплайна, включающие узлы, значения веса, значения допуска для узлов и управляющих вершин точек и т.д.
Returns: Возвращает данные NURBS сплайна. Тип <c>DatabaseServices.NurbsData</c>.

Teigha.DatabaseServices.Spline.StartFitTangent
Свойство <c>StartFitTangent</c> представляет касательный вектор в начальной определяющей точке.
Returns: Возвращает касательный вектор. Тип <c>Vector3d</c>.