Teigha.DatabaseServices.NurbsData.Equals(Object)
Метод предназначен для проверки идентичности двух объектов.
obj: Входной объект, с которым проверяется равенство. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если оба объекта не являются нулевыми, имеют одинаковый тип и идентичные параметры.
В противном случае возвращает <c>false</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться согласованно с сохранением общей логики.
Если <c>Equals</c> возвращает <c>true</c>, хеш-коды обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод <c>Equals()</c> из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать
<c>NurbsData.GetHashCode()</c>, в то время как метод <c>Equals()</c> может быть переопределен в производном классе.

Teigha.DatabaseServices.NurbsData.GetControlPoints
Метод возвращает коллекцию управляющих вершин данного объекта.
Returns: Возвращает коллекцию управляющих вершин.
Тип <c>Point3dCollection</c>.

Teigha.DatabaseServices.NurbsData.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Returns: Возвращает хеш-код данного объекта.  Тип <c>int</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться согласованно с сохранением общей логики.
Если <c>Equals</c> возвращает <c>true</c>, хеш-коды обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.
Иногда используется метод <c>Equals()</c> из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать
<c>NurbsData.GetHashCode()</c>, в то время как метод <c>Equals()</c> может быть переопределен в производном классе.

Teigha.DatabaseServices.NurbsData.GetKnots
Метод возвращает узловой вектор данного объекта.
Returns: Возвращает узловой вектор данного объекта. Тип <c>DoubleCollection</c>.

Teigha.DatabaseServices.NurbsData.GetWeights
Метод предоставляет коллекцию значений весов NURBS.
Returns: Возвращает коллекцию весов NURBS.
Тип <c>DoubleCollection</c>.

Teigha.DatabaseServices.NurbsData.IsEqualTo(Teigha.DatabaseServices.NurbsData)
Метод позволяет проверить, что данный объект идентичен другому объекту <c>NurbsData</c>.
other: Другой объект, с которым проверяется равенство. Тип <c>NurbsData</c>.
Returns: Возвращает <c>true</c>, если данный объект идентичен объекту <c>other</c>.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.NurbsData.IsEqualTo(Teigha.DatabaseServices.NurbsData,Teigha.Geometry.Tolerance)
Метод позволяет проверить, что данный объект идентичен другому объекту <c>NurbsData</c> в пределах указанного допуска.
other: Другой объект, с которым проверяется равенство. Тип <c>NurbsData</c>.
tolerance: Допуск для сравнения на равенство. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если данный объект идентичен объекту <c>other</c> в пределах указанного допуска.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.NurbsData.Closed
Свойство позволяет убедиться, что сплайн является замкнутым.
Returns: Возвращает <c>true</c>, если сплайн является замкнутым.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.NurbsData.ControlPointTolerance
Свойство возвращает значение допуска, используемое для операций с управляющими вершинами NURBS.
Returns: Возвращает значение допуска для управляющих вершин. Тип <c>double</c>.

Teigha.DatabaseServices.NurbsData.Degree
Свойство возвращает степень кривой NURBS.
Returns: Возвращает степень кривой NURBS. Тип <c>int</c>.

Teigha.DatabaseServices.NurbsData.KnotTolerance
Свойство возвращает значение допуска, используемое для операций с узлами NURBS.
Returns: Возвращает значение допуска для операций с узлами NURBS.
Тип <c>double</c>.

Teigha.DatabaseServices.NurbsData.Periodic
Свойство позволяет проверить, является ли сплайн периодическим.
Returns: Возвращает <c>true</c>, если сплайн является периодическим.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.NurbsData.Rational
Свойство позволяет проверить, является ли сплайн рациональным.
Returns: Возвращает <c>true</c>, если сплайн является рациональным.
В противном случае возвращает <c>false</c>.