HostMgd.EditorInput.PromptForSelectionEndingEventArgs
Класс, обеспечивающий данными событие
PromptForSelectionEnding класса Editor.

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.Add(HostMgd.EditorInput.SelectedObject)
Добавляет геометрический объект к выбранному набору.

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.AddSubEntity(HostMgd.EditorInput.SelectedSubObject)
Добавляет геометрический подобъект к выбранному подобъекту.

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.Flags
Предоставляет дополнительную информацию в случае, если в
данный момент производится процесс выбора.

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.Remove(System.Int32)
Удаляет объект по значению индекса, являющегося параметром
метода.
index: Индекс удаляемого элемента

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.RemoveSubEntity(System.Int32,System.Int32)
Удаляет геометрический подобъект, заданный индексами,
указанными в параметрах метода.
entityIndex: Индекс геометрического объекта, в котром
subEntityIndex: Индекс подобъекта

HostMgd.EditorInput.PromptForSelectionEndingEventArgs.Selection
Возвращает множество выбранных объектов, полученных после
приглашения.