HostMgd.EditorInput.InputPointContext.GetKeyPointEntities
Возвращает геометрические объекты, которые отвечают за
вычисление osnappedPoint. Обычно результат содержит один
геометрический объект, за исключением точки пересечения двух
дуг (в этом случае keyPointEntities содержит два
геометрических объекта); плюс один геометрический объект на
каждый элемент массива alignmentPaths.