Teigha.DatabaseServices.ProxyObject
Класс <c>ProxyObject</c> является базовым классом для прокси-объектов в базе данных.

Teigha.DatabaseServices.ProxyObject.GetReferences
Метод предоставляет коллекцию идентификаторов объектов, на которые ссылается этот прокси-объект.
Returns: Возвращает коллекцию идентификаторов объектов, на которые в данном прокси-объекте имеются ссылки.
Тип <c>DBObjectReferenceCollection</c>.

Teigha.DatabaseServices.ProxyObject.ResurrectMeNow(DatabaseServices.ObjectId)
Метод <c>ResurrectMeNow</c> предназначен для восстановления объекта, представленного в чертеже своим прокси-объектом.
id: Входной идентификатор прокси-объекта.

Teigha.DatabaseServices.ProxyObject.ApplicationDescription
Свойство <c>ApplicationDescription</c> обеспечивает доступ к описанию приложения объекта, представленного данным  прокси-объектом.
Returns: Возвращает описание приложения.  Тип <c>String</c>.

Teigha.DatabaseServices.ProxyObject.OriginalClassName
Свойство <c>OriginalClassName</c> представляет имя класса объекта, представленного данным прокси-объектом.
Returns: Возвращает имя класса. Тип <c>String</c>.

Teigha.DatabaseServices.ProxyObject.OriginalDxfName
Свойство <c>OriginalDxfName</c> представляет DXF-имя объекта, представленного данным прокси-объектом.
Returns: Возвращает DXF-имя объекта. Тип <c>String</c>.

Teigha.DatabaseServices.ProxyObject.ProxyFlags
Свойство <c>ProxyFlags</c> представляет множество операций, допустимых для данного прокси-объекта, в виде комбинации битовых флагов.
Returns: Возвращает комбинацию битовых флагов. Тип <c>int</c>.