Teigha.DatabaseServices.SubentityOverrule
Этот класс переопределяет подмножество связанных с подобъектом операций, которые определяет объект.
Используется в качестве базового класса для настройки поведения классов, производных от Entity.

Teigha.DatabaseServices.SubentityOverrule.AddSubentPaths(Teigha.DatabaseServices.Entity,array&lt;FullSubentityPath&gt;)
Данный метод переопределяет метод Entity.AddsubentPaths() и вызывает его при реализации по умолчанию.
entity: Объект чертежа, тип Entity.
paths: Массив полных путей подобъектов FullSubentityPath[], которые идентифицируют подобъекты, добавляемые к объекту entity.

Teigha.DatabaseServices.SubentityOverrule.DeleteSubentPaths(Teigha.DatabaseServices.Entity,array&lt;FullSubentityPath&gt;)
Данный метод переопределяет метод Entity.DeleteSubentPaths() и вызывает его при реализации по умолчанию.
entity: Объект чертежа, тип Entity.
paths: Массив полных путей подобъектов FullSubentityPath[], которые идентифицируют подобъекты, предполагаемые к удалению из объекта entity.

Teigha.DatabaseServices.SubentityOverrule.GetCompoundObjectTransform(Teigha.DatabaseServices.Entity)
Данный метод переопределяет свойство Entity.CompoundObjectTransform и вызывает его при реализации по умолчанию.
entity: Объект чертежа, тип Entity.

Teigha.DatabaseServices.SubentityOverrule.GetGripPointsAtSubentPath(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath,Teigha.DatabaseServices.GripDataCollection,System.Double,System.Int32,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.GetGripPointsFlags)
Данный метод переопределяет метод Entity.GetGripPointsAtSubentityPath() и вызывает его при реализации по умолчанию.

Teigha.DatabaseServices.SubentityOverrule.GetGsMarkersAtSubentPath(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath)
Данный метод переопределяет метод Entity.GetGraphicsMarkersAtSubentityPathIntPtr() и вызывает его в случае реализации по умолчанию.
entity: Объект чертежа, тип Entity.
subPath: Полный путь к подобъекту. Тип FullSubentityPath.

Teigha.DatabaseServices.SubentityOverrule.GetSubentClassId(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath)
Данный метод переопределяет свойство Entity.ClassId и вызывает его в случае реализации по умолчанию.
entity: Объект чертежа, тип Entity.
path: Полный путь к подобъекту. Тип FullSubentityPath.

Teigha.DatabaseServices.SubentityOverrule.GetSubentPathGeomExtents(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath)
Данный метод переопределяет метод Entity.GetSubentityGeometricExtents() и вызывает его в случае реализации по умолчанию.
entity: Объект чертежа, тип Entity.
path: Полный путь к подобъекту. Тип FullSubentityPath.
Returns: Возвращает объект Extents3d с данными о габаритах подобъекта.

Teigha.DatabaseServices.SubentityOverrule.GetSubentPathsAtGsMarker(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SubentityType,IntPtr,Teigha.Geometry.Point3d,Teigha.Geometry.Matrix3d,array&lt;ObjectId&gt;)
Данный метод переопределяет метод Entity.GetSubentityPathsAtGraphicsMarker() и вызывает его в случае реализации по умолчанию.
entity: Объект чертежа, тип Entity.
type: Тип подобъекта, SubentityType.
gsMark: Маркер GS, представляющий конкретный подобъект. Тип IntPtr.
pickPoint: Координаты точки, выделенной во время выбора объекта. Тип Point3d в мировой системе координат (WCS).
viewXform: Матрица преобразования из мировой системы координат (WCS) в систему координат дисплея (DCS). Тип Matrix3d.

Teigha.DatabaseServices.SubentityOverrule.MoveGripPointsAtSubentPaths(Teigha.DatabaseServices.Entity,array&lt;FullSubentityPath&gt;,Teigha.DatabaseServices.GripDataCollection,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.MoveGripPointsFlags)
Данный метод переопределяет метод Entity.MoveGripPointsAtSubentityPaths() и вызывает его в случае реализации по умолчанию.
entity: Объект чертежа, тип Entity.
path: Массив полных путей объектов, идентифицирующих подобъекты, которые подлежат перемещению. Тип FullSubentityPath[].
grips: Массив указателей на ручки, которые подлежат перемещению. Тип GripDataCollection.
offset: Вектор, определяющий направление и величину перемещения ручек. Тип Vector3d.
bitFlags: Маска из одного или нескольких флагов из перечисления MoveGripPointsFlags.

Teigha.DatabaseServices.SubentityOverrule.OnSubentGripStatusChanged(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.GripStatus,Teigha.DatabaseServices.FullSubentityPath)
Данный метод переопределяет метод Entity.SetSubentityGripStatus() и вызывает его в случае реализации по умолчанию.
entity: Объект чертежа, тип Entity.
status: Состояние ручки из перечисления GripStatus.
subentity: Полный путь к подобъекту. Тип FullSubentityPath.

Teigha.DatabaseServices.SubentityOverrule.SetCustomFilter
Этот метод включает использование метода IsApplicable, чтобы устанавливать применимость объектного переопределения.

Teigha.DatabaseServices.SubentityOverrule.SetExtensionDictionaryEntryFilter(String)
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
entryName: Имя записи, String.

Teigha.DatabaseServices.SubentityOverrule.SetIdFilter(array&lt;ObjectId&gt;)
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
ids: Входной массив идентификаторов объектов ObjectId[].

Teigha.DatabaseServices.SubentityOverrule.SetNoFilter
Этот метод отключает все методы предварительной фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метод IsApplicable, перед применением объектных переопределений.

Teigha.DatabaseServices.SubentityOverrule.SetXDataFilter(String)
Метод включает использование расширенных данных в условии применимости объектного переопределения.
Ваши переопределения будут вызываться только для тех объектов, у которых в расширенных данных будет присутствовать registeredApplicationName.
registeredApplicationName: Имя зарегистрированного приложения, String.

Teigha.DatabaseServices.SubentityOverrule.SubentPtr(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath)
Этот метод переопределяет метод Entity.GetSubentity() и вызывает его в случае реализации по умолчанию.
entity: Объект чертежа, Entity.
id: Массив полных путей FullSubentityPath, идентифицирующий подобъекты.
Returns: Возвращает объект Entity.

Teigha.DatabaseServices.SubentityOverrule.TransformSubentPathsBy(Teigha.DatabaseServices.Entity,array&lt;FullSubentityPath&gt;,Teigha.Geometry.Matrix3d)
Этот метод переопределяет метод Entity.TransformSubentityPathsBy() и вызывает его в случае реализации по умолчанию.
entity: Объект чертежа, тип Entity.
paths: Массив полных путей объектов, идентифицирующих подобъекты, которые подлежат преобразованию. Тип FullSubentityPath[].
xform: Матрица преобразования, применяемая к каждому подобъекту. Тип Matrix3d.