Teigha.DatabaseServices.Polyline2d
Класс Polyline2d представляет объект 2D-полилинии в nanoCAD.

Teigha.DatabaseServices.Polyline2d.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.Polyline2d.#ctor(Teigha.DatabaseServices.Poly2dType,Teigha.Geometry.Point3dCollection,System.Double,System.Boolean,System.Double,System.Double,Teigha.Geometry.DoubleCollection)
Конструктор.
type: Тип полилинии из перечисления Poly2dType.
vertices: Коллекция вершин полилинии, тип Point3dCollection.
elevation: Уровень полилинии, тип double.
closed: Замкнутость полилинии, тип bool.  Если замкнутая, равен true, в противном случае - false.
startWidth: Начальная толщина, тип double.
endWidth: Конечная толщина, тип double.
bulges: Коллекция прогибов, тип DoubleCollection.

Teigha.DatabaseServices.Polyline2d.AppendVertex(Teigha.DatabaseServices.Vertex2d)
Метод добавляет новую вершину Vertex2d в список вершин полилинии.
vertexToAppend: Добавляемая вершина, тип Vertex2d.
Returns: Возвращает ObjectId новой вершины полилинии.

Teigha.DatabaseServices.Polyline2d.ConvertToPolyType(Teigha.DatabaseServices.Poly2dType)
Метод предназначен для преобразования полилинии в тип, указанный значением аргумента.
newVal: Новый тип полилинии из перечисления Poly2dType.

Teigha.DatabaseServices.Polyline2d.CurveFit
Метод создает гладкую кривую, состоящую из пар дуг, соединяющих каждую пару вершин. Эта операция эквивалентна коменде PEDIT с опцией "Fit".

Teigha.DatabaseServices.Polyline2d.GetEnumerator
Метод предназначен для получения перечислителя коллекции.
Returns: Возвращает перечислитель, тип System.Collections.IEnumerator.

Teigha.DatabaseServices.Polyline2d.InsertVertexAt(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.Vertex2d)
Этот метод вставляет объект Vertex2d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины Vertex2d, у которой objectId равен vertexId.
vertexId: Идентификатор ObjectId вершины полилинии, после которой должна быть вставлена новая вершина. Чтобы вставить вершину в начало полилинии, в аргументе vertexId следует передать Null.
newVertex: указатель на добавляемую вершину, тип Vertex2d.
Returns: Возвращает ObjectId новой вершины полилинии.

Teigha.DatabaseServices.Polyline2d.InsertVertexAt(Teigha.DatabaseServices.Vertex2d,Teigha.DatabaseServices.Vertex2d)
Эта функция вставляет объект Vertex2d, заданный аргументом newVertex, в список вершин полилинии непосредственно после вершины indexVertex.
indexVertex: Вершина полилинии Vertex2d, после которой должна быть вставлена новая вершина. Чтобы вставить новую вершину в начало полилинии, в аргументе indexVertex следует передать Null.
newVertex: Вставляемая вершина, тип Vertex2d.

Teigha.DatabaseServices.Polyline2d.NonDBAppendVertex(Teigha.DatabaseServices.Vertex2d)
Метод добавляет объект Vertex2d в список вершин полилинии и делает полилинию владельцем вершины.
Полилиния не должна быть резидентной в базе данных.
vertexToAppend: Добавляемая в полилинию вершина, тип Vertex2d.

Teigha.DatabaseServices.Polyline2d.SplineFit
Метод выполняет аппроксимацию полилинии сплайном.

Teigha.DatabaseServices.Polyline2d.SplineFit(Teigha.DatabaseServices.Poly2dType,System.Int32)
Метод выполняет аппроксимацию полилинии сплайном с указанием его типа и количества сегментов сплайна.
value: Тип нового сплайна из перечисления Poly2dType.
segments: Количество сегментов аппроксимирующего сплайна.

Teigha.DatabaseServices.Polyline2d.Straighten
Метод удаляет из полилинии все вершины сплайна и аппроксимирующей кривой и определяет все оставшиеся вершины в качестве простых вершин.
Эта операция эквивалентна команде PEDIT с опцией "Decurve".

Teigha.DatabaseServices.Polyline2d.VertexPosition(Teigha.DatabaseServices.Vertex2d)
Метод предназначен для получения координат вершины в мировой системе координат (WCS).
Метод извлекает координаты X и Y из вершины, а координату Z - из полилинии, после чего применяет преобразование из системы координат полилинии (OCS) в WCS для получения позиции в мировой системе координат.
vertex: Вершина Vertex2d, положение которой требуется определить в мировой системе координат.
Returns: Возвращает экземпляр Point3d.

Teigha.DatabaseServices.Polyline2d.Closed
Свойство позволяет определить, является ли данная полилиния замкнутой.
Returns: Возвращает true, если данная полилиния является замкнутой, и false в противном случае.

Teigha.DatabaseServices.Polyline2d.LinetypeGenerationOn
Свойство определяет, включена ли для данной полилинии генерация типа линии.
Returns: Возвращает true, если генерация типа линии включена, и false, если отключена.

Teigha.DatabaseServices.Polyline2d.ConstantWidth
Свойство предоставляет доступ к значению толщины полилинии.
Returns: Возвращает толщину полилинии, тип double.

Teigha.DatabaseServices.Polyline2d.DefaultEndWidth
Свойство предоставляет доступ к значению по умолчанию конечной ширины сегмента этой полилинии.
Это значение используется как конечная ширина по умолчанию для всех вершин полилинии.
Returns: Возвращает конечную ширину сегмента полилинии как значение типа double.

Teigha.DatabaseServices.Polyline2d.DefaultStartWidth
Свойство предосталяет доступ к значению по умолчанию начальной ширины сегмента полилинии.
Это значение используется как начальная ширина по умолчанию для всех вершин полилинии.
Returns: Возвращает начальную ширину сегмента полилинии как значение типа double.

Teigha.DatabaseServices.Polyline2d.Elevation
Свойство предоставляет доступ к знгачению уровня полилинии.
Returns: Возвращает уровень полилинии, тип double.

Teigha.DatabaseServices.Polyline2d.Length
Свойство предоставляет доступ к текущему значению длины полилинии.
Returns: Возвращает длину полилинии как значение типа double.

Teigha.DatabaseServices.Polyline2d.Normal
Свойство обеспечивает доступ к вектору нормали плоскости, в которой располагается полилиния.
Returns: Возвращает вектор типа Vector3d.

Teigha.DatabaseServices.Polyline2d.PolyType
Свойство предоставляет доступ к типу аппроксимации для данной полилинии в виде элемента перечисления Poly2dType.
Returns: Возвращает значение из перечисления Poly2dType.

Teigha.DatabaseServices.Polyline2d.Thickness
Свойство предоставляет доступ к толщине полилинии.
Returns: Возвращает толщину полилинии, тип double.