Teigha.Runtime.WrapperAttribute
Класс <c>WrapperAttribute</c> определяет атрибут, который идентифицирует соответствующий обернутый класс NRX или член класса.

Teigha.Runtime.WrapperAttribute.#ctor(String)
Конструктор класса <c>WrapperAttribute</c>.
Создает экземпляр класса с указанной входной строкой.
wrappedClass: Входная строка. Тип <c>String</c>.

Teigha.Runtime.WrapperAttribute.WrappedClass
Свойство <c>WrappedClass</c> представляет строковое значение атрибута.
Returns: Возвращает строковое значение атрибута. Тип <c>String</c>.