Teigha.DatabaseServices.XrefPreXrefLockFileEventArgs
Класс <c>XrefPreXrefLockFileEventArgs</c> представляет данные для события <c>XrefPreXrefLockFile</c> в базе данных.

Teigha.DatabaseServices.XrefPreXrefLockFileEventArgs.btrId
Свойство <c>btrId</c> представляет идентификатор объекта записи таблицы блоков.
Returns: Возвращает идентификатор объекта записи таблицы блоков.
Тип <c>ObjectId</c>.