Teigha.DatabaseServices.PolygonMesh
Класс PolygonMesh представляет полигональную сеть в nanoCAD.

Teigha.DatabaseServices.PolygonMesh.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.PolygonMesh.#ctor(Teigha.DatabaseServices.PolyMeshType,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,System.Boolean,System.Boolean)
Данный конструктор создает новый объект PolygonMesh с переданными в аргументах параметрами.
type: Геометрический тип сети из перечисления PolyMeshType.
size: Количество вершин в направлении M, тип int.
sizeValue: Количество вершин в направлении N, тип int.
vertices: Коллекция вершин данного объекта, тип Point3dCollection.
closedValue: Флаг замкнутости сети в направлении M, тип bool.
closed: Флаг замкнутости сети в направлении N, bool.

Teigha.DatabaseServices.PolygonMesh.AppendVertex(Teigha.DatabaseServices.PolygonMeshVertex)
Метод предназначен для добавления вершины PolygonMeshVertex в список вершин сети PolygonMesh.
toAppend: Вершина PolygonMeshVertex, добавляемая в сеть.
Returns: Возвращает ObjectId вершины.

Teigha.DatabaseServices.PolygonMesh.ConvertToPolyMeshType(Teigha.DatabaseServices.PolyMeshType)
Метод предназначен для преобразования сети PolygonMesh в заданный тип, используя метод SurfaceFit().
newVal: Новый тип сети из перечисления PolyMeshType.

Teigha.DatabaseServices.PolygonMesh.GetEnumerator
Метод предназначен для получения объекта перечислителя для этой коллекции.
Returns: Возвращает объект System.Collections.IEnumerator.

Teigha.DatabaseServices.PolygonMesh.MakeMClosed
Метод реализует замыкание сети PolygonMesh в направлении M.

Teigha.DatabaseServices.PolygonMesh.MakeMOpen
Метод делает сеть PolygonMesh незамкнутой в направлении М.

Teigha.DatabaseServices.PolygonMesh.MakeNClosed
Метод реализует замыкание сети PolygonMesh в направлении N.

Teigha.DatabaseServices.PolygonMesh.MakeNOpen
Метод делает сеть PolygonMesh незамкнутой в направлении N.

Teigha.DatabaseServices.PolygonMesh.Straighten
Метод удаляет все опорные вершины сплайна и восстанавливает исходную полигональную сеть контрольных точек.

Teigha.DatabaseServices.PolygonMesh.SurfaceFit
Метод аппроксимирует гладкой поверхностью сеть контрольных точек, определяемую вершинами этой полигональной сети.
Результат эквивалентен команде PEDIT с опцией "Smooth surface".

Teigha.DatabaseServices.PolygonMesh.SurfaceFit(Teigha.DatabaseServices.PolyMeshType,System.Int32,System.Int32)
Метод аппроксимирует гладкой поверхностью сеть контрольных точек, определяемую вершинами этой полигональной сети.
Результат эквивалентен команде PEDIT с опцией "Smooth surface".
surfType: Тип поверхности из перечисления PolyMeshType (переопределяет системную переменную SURFTYPE).
surfU: Поверхностная плотность M (переопределяет системную переменную SURFU), тип int.
surfV: Поверхностная плотность N (переопределяет системную переменную SURFV), тип int.

Teigha.DatabaseServices.PolygonMesh.IsMClosed
Свойство позволяет определить, является ли сеть замкнутой в направлении M.
Returns: Возвращает true, если сеть является замкнутой в направлении M. В противном случае возврщает false.

Teigha.DatabaseServices.PolygonMesh.IsNClosed
Свойство позволяет определить, является ли сеть замкнутой в направлении N.
Returns: Возвращает true, если сеть является замкнутой в направлении N. В противном случае возврщает false.

Teigha.DatabaseServices.PolygonMesh.MSize
Свойство предоставляет доступ к количеству вершин в направлении M.
Returns: Возвращает или задает значение M, тип short.

Teigha.DatabaseServices.PolygonMesh.NSize
Свойство предоставляет доступ к количеству вершин в направлении N.
Returns: Возвращает или задает значение N, тип short.

Teigha.DatabaseServices.PolygonMesh.MSurfaceDensity
Свойство предоставляет доступ к поверхностной плотности сети в направлении M.
Returns: Возвращает или задает поверхностную плотность сети в направлении M.

Teigha.DatabaseServices.PolygonMesh.NSurfaceDensity
Свойство предоставляет доступ к поверхностной плотности сети в направлении N.
Returns: Возвращает или задает поверхностную плотность сети в направлении M.

Teigha.DatabaseServices.PolygonMesh.PolyMeshType
Свойство предоставляет доступ к типу PolyMeshType сети PolygonMesh.
Returns: Возвращает тип PolyMeshType сети.