Teigha.DatabaseServices.MeshDataCollection.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Int32Collection,Teigha.Colors.EntityColorCollection,Teigha.DatabaseServices.ObjectIdCollection)
Конструктор структуры <c>MeshDataCollection</c>.
pts: Массив вершин сети. Тип <c>Point3dCollection</c>.
faces: Массив граней сети. Тип <c>Int32Collection</c>.
colors: Массив цветов граней. Тип <c>EntityColorCollection</c>.
materialIds: Массив идентификаторов материалов. Тип <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.MeshDataCollection.ColorArray
Свойство представляет коллекцию цветов граней сети.
Returns: Возвращает массив цветов граней.  Тип <c>EntityColorCollection</c>.

Teigha.DatabaseServices.MeshDataCollection.FaceArray
Свойство представляет коллекцию граней сети.
Returns: Возвращает массив граней сети. Тип <c>Int32Collection</c>.

Teigha.DatabaseServices.MeshDataCollection.MaterialIdArray
Свойство представляет коллекцию идентификаторов материалов.
Returns: Возвращает массив идентификаторов объектов-материалов.
Тип <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.MeshDataCollection.VertexArray
Свойство представляет коллекцию 3D-точек в вершинах сети.
Returns: Возвращает коллекцию 3D-точек в вершинах сети.
Тип <c>Point3dCollection</c>.