HostMgd.EditorInput.PointMonitorEventArgs
Класс обеспечивает данными событие PointMonitor класса
Editor.

HostMgd.EditorInput.PointMonitorEventArgs.AppendToolTipText(System.String)
Добавляет текст подсказки инструмента, заданный параметром
метода, для события.
value: Добавляемый элемент

HostMgd.EditorInput.PointMonitorEventArgs.Context
Возвращает объект, который обеспечивает событие входными
данными.