Teigha.Geometry.EllipticalArc3d
Класс <c>EllipticalArc3d</c> представляет трехмерные эллиптические дуги и полные эллипсы в 3D-пространстве.

Teigha.Geometry.EllipticalArc3d.#ctor
Конструктор по умолчанию класса <c>EllipticalArc3d</c>.

Teigha.Geometry.EllipticalArc3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double)
Конструктор класса <c>EllipticalArc3d</c>.
Создает эллипс с указанными центром, осями и радиусами.
center: Центр эллипса. Тип <c>Point3d</c>.
majorAxis: Большая ось эллипса. Тип <c>Vector3d</c>.
minorAxis: Малая ось эллипса. Тип <c>Vector3d</c>.
majorRadius: Большой радиус эллипса. Тип <c>double</c>.
minorRadius: Малый радиус эллипса. Тип <c>double</c>.

Teigha.Geometry.EllipticalArc3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Конструктор класса <c>EllipticalArc3d</c>.
Создает эллипс или эллиптическую дугу с указанными центром, осями, радиусами, начальным и конечным углами.
center: Центр эллипса. Тип <c>Point3d</c>.
majorAxis: Большая ось эллипса. Тип <c>Vector3d</c>.
minorAxis: Малая ось эллипса.   Тип <c>Vector3d</c>.
majorRadius: Большой радиус эллипса. Тип <c>double</c>.
minorRadius: Малый радиус эллипса.   Тип <c>double</c>.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип <c>double</c>.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной  точки дуги). Тип <c>double</c>.

Teigha.Geometry.EllipticalArc3d.ClosestPointToPlane(Teigha.Geometry.PlanarEntity)
Метод вычисляет точку на эллиптической дуге, которая находится ближе всего к указанной плоскости, и точку на этой плоскости, которая находится ближе всего к эллиптической дуге. Геометрические вычисления выполняются с точностью по умолчанию.
plane: Плоский объект, по отношению к которому вычисляется ближайшая точка на данной эллиптической дуге.  Тип <c>PlanarEntity</c>.
Returns: Возвращает массив из двух элементов. Тип <c>Point3d[]</c>.
Первый элемент представляет точку на плоскости <c>plane</c>, а второй — ближайшую к ней точку на данной эллиптической дуге.

Teigha.Geometry.EllipticalArc3d.ClosestPointToPlane(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод вычисляет точку на эллиптической дуге, которая находится ближе всего к указанной плоскости, и точку на этой плоскости, которая находится ближе всего к эллиптической дуге. Геометрические вычисления выполняются с заданной точностью.
plane: Плоский объект, по отношению к которому вычисляется ближайшая точка на данной эллиптической дуге.  Тип <c>PlanarEntity</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив из двух элементов. Тип <c>Point3d[]</c>.
Первый элемент представляет точку на плоскости <c>plane</c>, а второй — ближайшую к ней точку на данной эллиптической дуге.

Teigha.Geometry.EllipticalArc3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>EllipticalArc3d</c>.

Teigha.Geometry.EllipticalArc3d.GetPlane
Метод позволяет получить бесконечную плоскость, в которой располагается данная эллиптическая дуга (или эллипс).
Returns: Возвращает 3D-плоскость, в которой располагается данный объект.
Тип <c>Plane</c>.

Teigha.Geometry.EllipticalArc3d.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод вычисляет точки пересечения данной дуги с указанным линейным объектом.
Используется геометрическая точность по умолчанию.
line: Линейный объект, точки пересечения с которым требуется вычислить. Тип <c>LinearEntity3d</c>.
Returns: Возвращает массив из двух элементов. Тип <c>Point3d[]</c>.
Первый элемент соответствует первой точке пересечения, а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc3d.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод вычисляет точки пересечения данной дуги с указанным линейным объектом, используя заданную геометрическую точность.
line: Линейный объект, точки пересечения с которым требуется вычислить. Тип <c>LinearEntity3d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив из двух элементов. Тип <c>Point3d[]</c>.
Первый элемент соответствует первой точке пересечения, а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc3d.IntersectWith(Teigha.Geometry.PlanarEntity)
Метод вычисляет точки пересечения данной дуги с указанным плоским объектом.
Используется геометрическая точность по умолчанию.
plane: Плоский объект, точки пересечения с которым требуется вычислить. Тип <c>PlanarEntity</c>.
Returns: Возвращает массив из двух элементов. Тип <c>Point3d[]</c>.
Первый элемент соответствует первой точке пересечения, а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc3d.IntersectWith(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод вычисляет точки пересечения данной дуги с указанным плоским объектом, используя заданную геометрическую точность.
plane: Плоский объект, точки пересечения с которым требуется вычислить. Тип <c>PlanarEntity</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив из двух элементов. Тип <c>Point3d[]</c>.
Первый элемент соответствует первой точке пересечения, а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc3d.IsCircular
Метод позволяет проверить, является ли данная дуга круглой.
Используется геометрическая точность по умолчанию.
Returns: Возвращает <c>true</c>, если в пределах используемой геометрической точности данную эллиптическую дугу можно считать круглой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.EllipticalArc3d.IsCircular(Teigha.Geometry.Tolerance)
Метод позволяет проверить, можно ли в пределах указанной геометрической точности считать данную эллиптическую дугу круглой.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах используемой геометрической точности данную эллиптическую дугу можно считать круглой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.EllipticalArc3d.IsInside(Teigha.Geometry.Point3d)
Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах точности по умолчанию.
pointValue: Проверяемая точка. Тип <c>Point3d</c>.
Returns: Возвращает <c>true</c>, если в пределах используемой точности можно считать, что проверяемая точка находится в пределах полного эллипса.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.EllipticalArc3d.IsInside(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах заданной точности.
pointValue: Проверяемая точка. Тип <c>Point3d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах используемой точности можно считать, что проверяемая точка находится в пределах полного эллипса.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.EllipticalArc3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d)
Метод позволяет найти на данной дуге и указанной линии такие точки, которые совпадают при проецировании на указанную плоскость.
Используется геометрическая точность по умолчанию.
line: Трехмерный линейный объект, с которым вычисляется пересечение. Тип <c>LinearEntity3d</c>.
projectionDirection: Направление проецирования. Тип <c>Vector3d</c>.
Returns: Возвращает массив из четырех элементов. Тип <c>Point3d[]</c>. Элементы массива представляют следующие точки:
* 0 — первая точка пересечения на эллиптической дуге.
* 1 — вторая точка пересечения на эллиптической дуге (если она существует).
* 2 — первая точка пересечения на линии.
* 3 — вторая точка пересечения на линии (если она существует).
В случае отсутствия точек пересечения метод возвращает <c>null</c>.

Teigha.Geometry.EllipticalArc3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет найти на данной дуге и указанной линии такие точки, которые совпадают при проецировании на указанную плоскость.
Используется заданная геометрическая точность.
line: Трехмерный линейный объект, с которым вычисляется пересечение. Тип <c>LinearEntity3d</c>.
projectionDirection: Направление проецирования. Тип <c>Vector3d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив из четырех элементов. Тип <c>Point3d[]</c>. Элементы массива представляют следующие точки:
* 0 — первая точка пересечения на эллиптической дуге.
* 1 — вторая точка пересечения на эллиптической дуге (если она существует).
* 2 — первая точка пересечения на линии.
* 3 — вторая точка пересечения на линии (если она существует).
В случае отсутствия точек пересечения метод возвращает <c>null</c>.

Teigha.Geometry.EllipticalArc3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double)
Метод позволяет переопределить данную дугу, используя новые центр, оси и радиусы.
center: Центр эллипса. Тип <c>Point3d</c>.
majorAxis: Большая ось эллипса. Тип <c>Vector3d</c>.
minorAxis: Малая ось эллипса. Тип <c>Vector3d</c>.
majorRadius: Большой радиус эллипса. Тип <c>double</c>.
minorRadius: Малый радиус эллипса. Тип <c>double</c>.

Teigha.Geometry.EllipticalArc3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double)
Метод позволяет переопределить данную дугу, используя новые центр, оси, радиусы, начальный и конечный углы.
center: Центр эллипса. Тип <c>Point3d</c>.
majorAxis: Большая ось эллипса. Тип <c>Vector3d</c>.
minorAxis: Малая ось эллипса. Тип <c>Vector3d</c>.
majorRadius: Большой радиус эллипса. Тип <c>double</c>.
minorRadius: Малый радиус эллипса. Тип <c>double</c>.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип <c>double</c>.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной  точки дуги). Тип <c>double</c>.

Teigha.Geometry.EllipticalArc3d.SetAngles(System.Double,System.Double)
Метод позволяет переопределить начальный и конечный углы у данной эллиптической дуги.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип <c>double</c>.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной точки дуги).  Тип <c>double</c>.

Teigha.Geometry.EllipticalArc3d.SetAxes(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить направления большой и малой осей у данной эллиптической дуги.
majorAxis: Новое направление большой оси эллиптической дуги. Тип <c>Vector3d</c>.
minorAxis: Новое направление малой оси   эллиптической дуги. Тип <c>Vector3d</c>.

Teigha.Geometry.EllipticalArc3d.Center
Свойство <c>Center</c> предоставляет доступ к точке центра данной эллиптической дуги.
Returns: Возвращает точку центра дуги. Тип <c>Point3d</c>.

Teigha.Geometry.EllipticalArc3d.EndAngle
Свойство <c>EndAngle</c> представляет конечный угол данной эллиптической дуги.
Returns: Возвращает конечный угол эллиптической дуги. Тип <c>double</c>.

Teigha.Geometry.EllipticalArc3d.EndPoint
Свойство <c>EndPoint</c> представляет конечную точку данной эллиптической дуги.
Returns: Возвращает конечную точку эллиптической дуги. Тип <c>Point3d</c>.

Teigha.Geometry.EllipticalArc3d.MajorAxis
Свойство <c>MajorAxis</c> представляет направление большой оси данной эллиптической дуги.
Returns: Возвращает направление большой оси эллиптической дуги.
Тип <c>Vector3d</c>.

Teigha.Geometry.EllipticalArc3d.MajorRadius
Свойство <c>MajorRadius</c> предоставляет доступ к значению большого радиуса данной эллиптической дуги.
Returns: Возвращает значение большого радиуса эллиптической дуги.
Тип <c>double</c>.

Teigha.Geometry.EllipticalArc3d.MinorAxis
Свойство <c>MinorAxis</c> представляет направление малой оси данной эллиптической дуги.
Returns: Возвращает направление малой оси эллиптической дуги.
Тип <c>Vector3d</c>.

Teigha.Geometry.EllipticalArc3d.MinorRadius
Свойство <c>MinorRadius</c> предоставляет доступ к значению малого радиуса данной эллиптической дуги.
Returns: Возвращает значение малого радиуса данной эллиптической дуги.
Тип <c>double</c>.

Teigha.Geometry.EllipticalArc3d.Normal
Свойство <c>Normal</c> представляет единичный вектор нормали плоскости данного объекта.
Returns: Возвращает направление нормали плоскости данного объекта.
Тип <c>Vector3d</c>.

Teigha.Geometry.EllipticalArc3d.StartAngle
Свойство <c>StartAngle</c> представляет значение начального угла данной эллиптической дуги.
Returns: Возвращает значение начального угла эллиптической дуги.
Тип <c>double</c>.

Teigha.Geometry.EllipticalArc3d.StartPoint
Свойство <c>StartPoint</c> представляет положение начальной точки данной эллиптической дуги.
Returns: Возвращает начальную точку эллиптической дуги.
Тип <c>Point3d</c>.