Teigha.Geometry.Vector3d
Этот класс представляет векторы в трехмерном пространстве.

Teigha.Geometry.Vector3d.#ctor(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Vector2d)
Этот конструктор создает трехмерный вектор, определяемый заданным двумерным вектором в системе координат заданного плоского объекта.
plane: Входной плоский объект. Тип PlanarEntity.
vector2d: Входной двумерный вектор. Тип Vector2d.

Teigha.Geometry.Vector3d.#ctor(System.Double,System.Double,System.Double)
Конструктор создает трехмерный вектор с заданными компонентами x, y и z.
x: X-компонента вектора. Тип double.
y: Y-компонента вектора. Тип double.
z: Z-компонента вектора. Тип double.

Teigha.Geometry.Vector3d.#ctor(array&lt;double&gt;)
Конструктор создает вектор, используя в качестве его компонент первые три элемента заданного массива.
xyz: Входной массив компонент создаваемого вектора. Тип double[].

Teigha.Geometry.Vector3d.Add(Teigha.Geometry.Vector3d)
Метод реализует сложение данного вектора с заданным 3D-вектором.
v: Входной вектор. Тип Vector3d.
Returns: Возвращает сумму двух трехмерных векторов как объект типа Vector3d.

Teigha.Geometry.Vector3d.AngleOnPlane(Teigha.Geometry.PlanarEntity)
Метод определяет угол между ортогональной проекцией этого вектора на заданный плоский объект и нулевым базисным вектором v0 этого плоского объекта, который возвращает метод PlanarEntity.GetCoordinateSystem(p, v0, v1).
plane: Входной геометрический плоский объект. Тип PlanarEntity.
Returns: Возвращает угол между векторами в плоскости plane. Тип double.

Teigha.Geometry.Vector3d.Convert2d(Teigha.Geometry.PlanarEntity)
Метод позволяет получить представление данного трехмерного вектора в виде 2D-вектора в системе координат входного плоского объекта.
Предполагается, что данный вектор параллелен заданной плоскости.
plane: Входной плоский объект. Тип PlanarEntity.
Returns: Возвращает двумерный вектор. Тип Vector2d.

Teigha.Geometry.Vector3d.CrossProduct(Teigha.Geometry.Vector3d)
Метод реализует векторное произведение данного вектора и входного 3D-вектора.
vector: Входной 3D-вектор. Тип Vector3d.
Returns: Возвращает результат векторного произведения в виде объекта Vector3d.

Teigha.Geometry.Vector3d.DivideBy(System.Double)
Метод реализует деление компонент данного вектора на входное вещественное значение.
value: Входное значение делителя. Тип double.
Returns: Возвращает трехмерный вектор. Тип Vector3d.

Teigha.Geometry.Vector3d.DotProduct(Teigha.Geometry.Vector3d)
Метод реализует скалярное произведение данного вектора с входным 3D-вектором.
v: Входной трехмерный вектор. Тип Vector3d.
Returns: Возвращает результат скалярного произведения векторов.  Тип double.

Teigha.Geometry.Vector3d.Equals(Object)
Метод реализует проверку равенства данного вектора и входного объекта.
obj: Входной объект, с которым выполняется сравнение. Тип Object.
Returns: Возвращает true, если данный вектор равен входному объекту obj. В противном случае возвращает false.

Teigha.Geometry.Vector3d.GetAngleTo(Teigha.Geometry.Vector3d)
Метод вычисляет угол в интервале [0, Pi] между данным вектором и входным вектором.
vector: Входной трехмерный вектор. Тип Vector3d.
Returns: Возвращает угол между двумя трехмерными векторами в интервале [0, Pi].  Тип double.

Teigha.Geometry.Vector3d.GetAngleTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет определить угол в интервале [0, 2*Pi] между данным вектором и входным вектором vector. Результат зависит от взаимной ориентации указанных векторов относительно вспомогательного входного вектора referenceVector.
vector: Входной вектор, до которого измеряется угол. Тип Vector3d.
referenceVector: Вспомогательный входной вектор. Тип Vector3d.
Returns: Возвращает угол между векторами (в радианах) в интервале значений [0, 2*Pi]. Тип double.

Teigha.Geometry.Vector3d.GetHashCode
Метод позволяет получить хеш-код данного объекта.
Returns: Возвращает хеш-код данного объекта. Тип int.

Teigha.Geometry.Vector3d.GetNormal(Teigha.Geometry.Tolerance)
Метод позволяет получить единичный вектор, сонаправленный данному вектору.
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает единичный вектор. Тип Vector3d.

Teigha.Geometry.Vector3d.GetNormal
Метод позволяет получить единичный вектор, сонаправленный данному вектору.
Используется точность Tolerance.Global.
Returns: Возвращает единичный вектор. Тип Vector3d.

Teigha.Geometry.Vector3d.GetPerpendicularVector
Метод создает единичный 3D-вектор, который перпендикулярен данному.
Returns: Возвращает 3D-вектор единичной длины. Тип Vector3d.

Teigha.Geometry.Vector3d.IsCodirectionalTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору в пределах заданной точности.
vector: Входной вектор для сравнения на сонаправленность. Тип Vector3d.
tolerance: Входная точность для сравнения векторов. Тип Tolerance.
Returns: Возвращает true, если в пределах заданной точности оба вектора можно считать сонаправленными. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsCodirectionalTo(Teigha.Geometry.Vector3d)
Метод позволяет проверить, является ли данный вектор сонаправленным входному вектору.
vector: Входной вектор для сравнения на сонаправленность. Тип Vector3d.
Returns: Возвращает true, если векторы можно считать сонаправленными. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsEqualTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, совпадает ли данный вектор с входным вектором в пределах заданной точности.
vector: Входной вектор для сравнения. Тип Vector3d.
tolerance: Входная точность для сравнения векторов. Тип Tolerance.
Returns: Возвращает true, если в пределах заданной точности оба вектора можно считать равными. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsEqualTo(Teigha.Geometry.Vector3d)
Метод позволяет проверить, совпадает ли данный вектор с входным вектором.
vector: Входной вектор для сравнения. Тип Vector3d.
Returns: Возвращает true, если векторы можно считать совпадающими. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsParallelTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, параллелен ли данный вектор входному вектору в пределах заданной точности.
vector: Входной вектор для сравнения. Тип Vector3d.
tolerance: Входная точность для сравнения векторов. Тип Tolerance.
Returns: В случае параллельности векторов возвращает true. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsParallelTo(Teigha.Geometry.Vector3d)
Метод позволяет проверить, параллелен ли данный вектор входному вектору.
vector: Входной вектор для сравнения. Тип Vector3d.
Returns: В случае параллельности векторов возвращает true. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsPerpendicularTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод проверяет перпендикулярность данного вектора входному вектору в пределах заданной точности tolerance.
vector: Входной вектор для сравнения. Тип Vector3d.
tolerance: Входная точность для сравнения. Тип Tolerance.
Returns: В случае перпендикулярности векторов возвращает true. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsPerpendicularTo(Teigha.Geometry.Vector3d)
Метод проверяет перпендикулярность данного вектора входному вектору.
vector: Входной вектор для сравнения. Тип Vector3d.
Returns: В случае перпендикулярности векторов возвращает true. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsUnitLength(Teigha.Geometry.Tolerance)
Метод проверяет, является ли данный вектор единичным в пределах заданной точности.
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает true, если в пределах точности tolerance данный вектор можно считать единичным.
В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsUnitLength
Метод проверяет, является ли данный вектор единичным.
Returns: Возвращает true, если данный вектор можно считать единичным.
В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsZeroLength(Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данный вектор нулевым в пределах заданной точности.
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает true, если данный вектор можно считать нулевым. В противном случае возвращает false.

Teigha.Geometry.Vector3d.IsZeroLength
Метод позволяет проверить, является ли данный вектор нулевым.
Returns: Возвращает true, если данный вектор можно считать нулевым. В противном случае возвращает false.

Teigha.Geometry.Vector3d.Mirror(Teigha.Geometry.Vector3d)
Метод позволяет получить 3D-вектор, который является результатом зеркального отражения данного вектора относительно заданной плоскости.
normalToPlane: Входной вектор нормали плоскости зеркального отражения. Тип Vector3d.
Returns: Возвращает вектор, являющийся зеркальным отражением данного вектора. Тип Vector3d.

Teigha.Geometry.Vector3d.MultiplyBy(System.Double)
Метод реализует умножение данного вектора на заданное число.
value: Входной множитель. Тип double.
Returns: Возвращает вектор типа Vector3d.

Teigha.Geometry.Vector3d.Negate
Метод создает вектор, обратный данному.
Returns: Возвращает вектор, обратный данному.  Тип Vector3d.

Teigha.Geometry.Vector3d.OrthoProjectTo(Teigha.Geometry.Vector3d)
Метод строит 3D-вектор, который является ортогональной проекцией данного вектора на заданную плоскость, проходящую через начало координат.
planeNormal: Входной вектор нормали плоскости проецирования. Тип Vector3d.
Returns: Возвращает спроецированный вектор. Тип Vector3d.

Teigha.Geometry.Vector3d.ProjectTo(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод строит трехмерный вектор, который является результатом параллельной проекции данного вектора на указанную плоскость в заданном направлении.
planeNormal: Входной вектор нормали плоскости. Тип Vector3d.
projectDirection: Входное направление проецирования. Тип Vector3d.
Returns: Возвращает результат параллельного проецирования на указанную плоскость. Тип Vector3d.

Teigha.Geometry.Vector3d.RotateBy(System.Double,Teigha.Geometry.Vector3d)
Метод создает трехмерный вектор, который образуется в результате вращения данного вектора вокруг заданной оси на заданный угол.
angle: Угол поворота в радианах. Тип double.
axis: Направляющий вектор оси вращения. Тип Vector3d.
Returns: Возвращает трехмерный вектор. Тип Vector3d.

Teigha.Geometry.Vector3d.Subtract(Teigha.Geometry.Vector3d)
Метод реализует вычитание указанного вектора из данного вектора.
v: Вычитаемый вектор. Тип Vector3d.
Returns: Возвращает результат векторного вычитания. Тип Vector3d.

Teigha.Geometry.Vector3d.ToArray
Метод позволяет создать массив типа double, содержащий значения координат X, Y и Z данного вектора.
Returns: Возвращает массив с координатами данного вектора. Тип double[].

Teigha.Geometry.Vector3d.ToString
Метод реализует эквивалентное представление данного вектора в виде текстовой строки.
Returns: Возвращает строковое представление данного вектора. Тип String.

Teigha.Geometry.Vector3d.ToString(IFormatProvider)
Метод реализует эквивалентное представление данного вектора в виде текстовой строки с учетом региональных и языковых настроек.
provider: Провайдер региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает строковое представление данного вектора. Тип String.

Teigha.Geometry.Vector3d.ToString(String,IFormatProvider)
Метод реализует эквивалентное представление данного вектора в виде текстовой строки в предписанном формате и с учетом региональных и языковых настроек.
format: Входной формат строки. Тип String.
provider: Провайдер региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает строковое представление данного вектора. Тип String.

Teigha.Geometry.Vector3d.TransformBy(Teigha.Geometry.Matrix3d)
Метод реализует геометрическое преобразование данного вектора, которое определено входной матрицей Matrix3d.
leftSide: Входная матрица геометрического пребразования. Тип Matrix3d.
Returns: Возвращает результат геометрического преобразования данного вектора. Тип Vector3d.

Teigha.Geometry.Vector3d.Coordinate
Свойство предоставляет доступ к координате данного вектора, заданной её индексом.
index: Индекс координаты; тип int. 0 – координата X, 1 – координата Y, 2 - координата Z.
Returns: Возвращает значение координаты. Тип double

Teigha.Geometry.Vector3d.LargestElement
Свойство возвращает индекс оси с наибольшим значением координаты у данного вектора.
Returns: Возвращает индекс оси 0, 1 или 2. Тип double.

Teigha.Geometry.Vector3d.Length
Свойство возвращает длину данного вектора.
Returns: Возвращает длину вектора. Тип double.

Teigha.Geometry.Vector3d.LengthSqrd
Свойство возвращает квадрат длины данного вектора.
Returns: Возвращает квадрат евклидовой длины данного вектора. Тип double.

Teigha.Geometry.Vector3d.X
Свойство возвращает значение X-координаты данного вектора.
Returns: Возвращает значение координаты X данного вектора. Тип double.

Teigha.Geometry.Vector3d.Y
Свойство возвращает значение Y-координаты данного вектора.
Returns: Возвращает значение координаты Y данного вектора. Тип double.

Teigha.Geometry.Vector3d.Z
Свойство возвращает значение Z-координаты данного вектора.
Returns: Возвращает значение координаты Z данного вектора. Тип double.

Teigha.Geometry.Vector3d.XAxis
Свойство возвращает направление оси X.
Returns: Возвращает направление оси X. Тип Vector3d.

Teigha.Geometry.Vector3d.YAxis
Свойство возвращает направление оси Y.
Returns: Возвращает направление оси Y. Тип Vector3d.

Teigha.Geometry.Vector3d.ZAxis
Свойство возвращает направление оси Z.
Returns: Возвращает направление оси Z. Тип Vector3d.