Teigha.DatabaseServices.GraphNode
Класс <c>GraphNode</c> реализует базовый объект узла ориентированного графа.

Teigha.DatabaseServices.GraphNode.#ctor
Конструктор по умолчанию класса <c>GraphNode</c>.

Teigha.DatabaseServices.GraphNode.AddRefTo(Teigha.DatabaseServices.GraphNode)
Метод создаёт в данном объекте <c>GraphNode</c> исходящее ребро (исходящую ссылку) на указанный узел <c>GraphNode</c>.
outGoingNode: Конечный узел нового ребра.  Тип <c>GraphNode</c>.

Teigha.DatabaseServices.GraphNode.Clear(unsigned char)
Метод предназначен для очистки в данном объекте <c>GraphNode</c> указанных битовых флагов.
flags: Комбинация битовых флагов для очистки.  Тип <c>unsigned char</c>.

Teigha.DatabaseServices.GraphNode.CycleIn(System.Int32)
Метод возвращает указанную по индексу входящую циклическую ссылку этого объекта <c>GraphNode</c>.
index: Входной индекс циклической ссылки. Тип <c>int</c>.
Returns: Возвращает  входящую циклическую ссылку. Тип <c>GraphNode</c>.
Если указанный индекс недействителен, возвращает нулевой указатель.

Teigha.DatabaseServices.GraphNode.CycleOut(System.Int32)
Метод возвращает указанную по индексу исходящую циклическую ссылку этого объекта <c>GraphNode</c>.
index: Индекс циклической ссылки. Тип <c>int</c>.
Returns: Возвращает исходящую циклическую ссылку. Тип <c>GraphNode</c>.
Если указанный индекс недействителен, возвращает нулевой указатель.

Teigha.DatabaseServices.GraphNode.DisconnectAll
Метод предназначен для удаления всех входящих и исходящих ссылок этого объекта GraphNode.

Teigha.DatabaseServices.GraphNode.In(System.Int32)
Метод позволяет получить указанную по индексу входящую ссылку данного узла <c>GraphNode</c>.
index: Индекс искомой ссылки. Тип <c>int</c>.
Returns: Возвращает входящую ссылку данного узла. Тип <c>GraphNode</c>.
Если индекс недействителен, возвращает нулевой указатель.

Teigha.DatabaseServices.GraphNode.IsMarkedAs(System.Int32)
Метод позволяет проверить, что все указанные битовые флаги в этом объекте <c>GraphNode</c> установлены.
flag: Битовые флаги. Тип <c>int</c>.
Returns: Возвращает <c>true</c>, только если  в этом объекте <c>GraphNode</c> установлены все указанные битовые флаги.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GraphNode.MarkAs(unsigned char)
Метод позволяет установить набор указанных битовых флагов в данном объекте <c>GraphNode</c>.
flags: Битовые флаги. Тип <c>unsigned char</c>.

Teigha.DatabaseServices.GraphNode.MarkTree(unsigned char,Teigha.DatabaseServices.GraphNodeCollection)
Метод позволяет установить указанные флаги в данном узле <c>GraphNode</c> и во всех его вложенных исходящих узлах <c>GraphNode</c>.
flags: Входные значения битовых флагов, которые должны быть установлены. Тип <c>unsigned char</c>.
appendedTo: Входная коллекция, в которую опционально должны быть добавлены данный узел и все его вложенные исходящие узлы.

Teigha.DatabaseServices.GraphNode.Out(System.Int32)
Метод позволяет получить указанную по индексу исходящую ссылку данного узла <c>GraphNode</c>.
index: Индекс искомой ссылки. Тип <c>int</c>.
Returns: Возвращает исходящую ссылку данного узла. Тип <c>GraphNode</c>.
Если индекс недействителен, возвращает нулевой указатель.

Teigha.DatabaseServices.GraphNode.RemoveRefTo(Teigha.DatabaseServices.GraphNode)
Метод предназначен для удаления в данном узле исходящей ссылки на указанный объект GraphNode.
nodeToRemoveReference: Удаляемая исходящая ссылка. Тип <c>GraphNode</c>.

Teigha.DatabaseServices.GraphNode.SetEdgeGrowthRate(System.Int32,System.Int32)
Метод позволяет задать количество исходящих и входящих ребер, под которые одновременно резервируется память на узле графа.
outEdgeRate: Количество исходящих ребер, под которые одновременно выделяется память.
inEdgeRate: Количество входящих ребер, под которые одновременно выделяется память.

Teigha.DatabaseServices.GraphNode.Data
Свойство предоставляет доступ к данным, которые связаны с данным узлом графа.
Returns: Возвращает указатель на данные. Тип <c>IntPtr</c>.

Teigha.DatabaseServices.GraphNode.IsCycleNode
Свойство позволяет определить, является ли данный узел графа частью циклической ссылки, т.е. узлом цикла.
Returns: Возвращает <c>true</c>, если данный узел является частью цикла.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GraphNode.NextCycleNode
Свойство возвращает следующую исходящую циклическую ссылку данного узла.
Returns: Возвращает следующую исходящую циклическую ссылку данного узла. Тип <c>GraphNode</c>.

Teigha.DatabaseServices.GraphNode.NumCycleIn
Свойство возвращает количество входящих циклических ссылок в данном узле графа.
Returns: Возвращает количество входящих циклических ссылок. Тип <c>int</c>.

Teigha.DatabaseServices.GraphNode.NumCycleOut
Свойство возвращает количество исходящих циклических ссылок в данном узле графа.
Returns: Возвращает количество исходящих циклических ссылок. Тип <c>int</c>.

Teigha.DatabaseServices.GraphNode.NumIn
Свойство возвращает количество входящих ссылок в данном узле.
Returns: Возвращает количество входящих ссылок. Тип <c>int</c>.

Teigha.DatabaseServices.GraphNode.NumOut
Свойство возвращает количество исходящих ссылок в данном узле.
Returns: Возвращает количество исходящих ссылок. Тип <c>int</c>.

Teigha.DatabaseServices.GraphNode.Owner
Свойство возвращает объект <c>Graph</c>, которому принадлежит данный узел.
Returns: Возвращает владельца данного узла.  Тип <c>Graph</c>.