Teigha.DatabaseServices.Sun
Класс <c>Sun</c> представляет свойства, связанные с объектом солнца.

Teigha.DatabaseServices.Sun.#ctor
Конструктор по умолчанию класса <c>Sun</c>.

Teigha.DatabaseServices.Sun.Altitude
Свойство <c>Altitude</c> представляет высоту солнца над горизонтом.
Returns: Возвращает высоту солнца в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.Sun.Azimuth
Свойство <c>Azimuth</c> представляет азимут солнца.
Returns: Возвращает азимут солнца (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.Sun.DateTime
Свойство <c>DateTime</c> представляет дату и время, используемые для калькулятора солнечных углов.
Returns: Возвращает дату и время.
Тип <c>System.DateTime</c>.

Teigha.DatabaseServices.Sun.Intensity
Свойство <c>Intensity</c> представляет значение интенсивности солнечного освещения.
Returns: Возвращает интенсивность солнечного освещения. Тип <c>double</c>.

Teigha.DatabaseServices.Sun.IsDaylightSavingsOn
Свойство <c>IsDaylightSavingsOn</c> представляет статус флага учета перехода на летнее время, который используется калькулятором солнечных углов.
Returns: Возвращает <c>true</c>, если учет перехода на летнее время включен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Sun.IsOn
Свойство <c>IsOn</c> представляет состояние флага учета солнечного освещения.
Returns: Возвращает <c>true</c>, если солнечное освещение учитывается.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Sun.ShadowParameters
Свойство <c>ShadowParameters</c> представляет параметры теней, связанных с солнечным освещением.
Returns: Возвращает параметры теней как объект типа <c>GraphicsInterface.ShadowParameters</c>.

Teigha.DatabaseServices.Sun.SunColor
Свойство <c>SunColor</c> представляет цвет солнечного освещения.
Returns: Возвращает цвет солнечного освещения. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.Sun.SunDirection
Свойство <c>SunDirection</c> представляет направление от солнца к модели.
Returns: Возвращает направление от солнца к модели.  Тип <c>Vector3d</c>.