Teigha.DatabaseServices.DbHomeView
Этот класс представляет исходный вид в системе управления ориентацией модели.

Teigha.DatabaseServices.DbHomeView.#ctor(IntPtr,System.Boolean)
Конструктор класса DbHomeView.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Флаг автоудаления исходного объекта. Тип bool.

Teigha.DatabaseServices.DbHomeView.Clone
Метод предназначен для клонирования данного объекта DbHomeView.
Returns: Возвращает результат клонирования. Тип Object.

Teigha.DatabaseServices.DbHomeView.Equals(Object)
Метод предназначен для проверки на равенство данного объекта с указанным объектом.
obj: Объект, с которым выполняет проверка на равенство.  Тип Object.
Returns: Возвращает <c>true</c>, если объекты эквивалентны.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DbHomeView.ToggleDefaultSettings
Метод предназначен для приведения данного объекта к настройкам по умолчанию.