Teigha.DatabaseServices.Filters.SpatialFilter
Этот класс реализует объекты пространственного фильтра в экземпляре базы данных.

Teigha.DatabaseServices.Filters.SpatialFilter.#ctor
Конструктор класса SpatialFilter по умолчанию..

Teigha.DatabaseServices.Filters.SpatialFilter.ClipVolumeIntersectsExtents(Teigha.DatabaseServices.Extents3d)
Метод позволяет определить, пересекается ли область данного пространственного фильтра <c>SpatialFilter</c> с указанным ограничивающим 3D-боксом.
ext: Входной ограничивающий бокс (прямоугольный параллелепипед, ориентированный по осям системы координат).
Returns: Возвращает <c>true</c>, если факт пересечения областей установлен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Filters.SpatialFilter.GetQueryBounds
Метод предназначен для получения ограничивающего бокса данного фильтра <c>SpatialFilter</c>.
Returns: Возвращает ограничивающий бокс данного фильтра. Тип <c>Extents3d</c>.

Teigha.DatabaseServices.Filters.SpatialFilter.GetQueryBounds(Teigha.DatabaseServices.BlockReference)
Метод не реализован.
blockReference: Вхождение блока. Тип <c>BlockReference</c>.
Returns: Возвращает ограничивающий бокс. Тип <c>Extents3d</c>.

Teigha.DatabaseServices.Filters.SpatialFilter.GetVolume
Этот метод позволяет получить описание объема данного пространственного фильтра в виде объекта <c>SpatialFilterVolume</c>.
Returns: Возвращает объем данного пространственного фильтра. Тип <c>SpatialFilterVolume</c>.

Teigha.DatabaseServices.Filters.SpatialFilter.SetPerspectiveCamera(Teigha.Geometry.Point3d)
Метод позволяет задать положение перспективной камеры в указанной 3D-точке.
fromPoint: Точка установки перспективной камеры.  Тип <c>Point3d</c>.

Teigha.DatabaseServices.Filters.SpatialFilter.ClipSpaceToWorldCoordinateSystemTransform
Свойство <c>ClipSpaceToWorldCoordinateSystemTransform</c> возвращает геометрическое преобразование точек граничной области данного фильтра из их системы координат (какой бы она ни была) в мировую систему координат WCS.
Returns: Возвращает геометрическое преобразование координат точек граничной области в мировую систему координат WCS.
Тип <c>Matrix3d</c>.

Teigha.DatabaseServices.Filters.SpatialFilter.Definition
Свойство <c>Definition</c> предоставляет доступ к определению данного пространственного фильтра <c>SpatialFilter</c>.
Returns: Возвращает определение данного пространственного фильтра. Тип <c>SpatialFilterDefinition</c>.

Teigha.DatabaseServices.Filters.SpatialFilter.HasPerspectiveCamera
Свойство <c>HasPerspectiveCamera</c> позволяет определить, задана ли перспективная камера для данного фильтра <c>SpatialFilter</c>.
Returns: Возвращает <c>true</c>, если перспективная камера задана.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Filters.SpatialFilter.OriginalInverseBlockTransform
Свойство <c>OriginalInverseBlockTransform</c> возвращает обратное геометрическое преобразование блока для связанного вхождения блока BlockReference, когда данный пространственный фильтр был задан в последний раз.
Returns: Возвращает обратное геометрическое преобразование блока. Тип <c>Matrix3d</c>.