Teigha.DatabaseServices.MeshPointMaps.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Point2dCollection)
Конструктор структуры <c>MeshPointMaps</c>.
sourcePts: Исходные точки.   Тип <c>Point2dCollection</c>.
destPts: Точки назначения. Тип <c>Point2dCollection</c>.

Teigha.DatabaseServices.MeshPointMaps.DestPonints
Свойство <c>DestPonints</c> представляет коллекцию точек назначения.
Returns: Возвращает коллекцию точек назначения. Тип <c>Point2dCollection</c>.

Teigha.DatabaseServices.MeshPointMaps.SourcePonints
Свойство <c>SourcePonints</c> представляет коллекцию исходных точек.
Returns: Возвращает коллекцию исходных точек. Тип <c>Point2dCollection</c>.