Teigha.DatabaseServices.Transaction
Класс реализует поддержку транзакций. Транзакции помогают расширить спектр связанных с объектом операций и избежать нежелательных конфликтных ситуаций. Кроме того, они повышают производительность, позволяя отложить операции закрытия всех открытых объектов до момента завершения транзакции.

Teigha.DatabaseServices.Transaction.#ctor(IntPtr,System.Boolean)
Конструктор.

Teigha.DatabaseServices.Transaction.Abort
Этот метод прерывает текущую открытую транзакцию.

Teigha.DatabaseServices.Transaction.AddNewlyCreatedDBObject(Teigha.DatabaseServices.DBObject,System.Boolean)
Метод добавляет в транзакцию объект из вновь созданной записи в базе данных.
obj: Добавляемый или удаляемый объект. Тип DBObject.
add: Флаг, указывающий, следует ли добавлять (значение true) или же удалять (значение false) объект.

Teigha.DatabaseServices.Transaction.Commit
Этот метод фиксирует изменения, внесенные во все открытые во время транзакции объекты DBObjects, а затем закрывает эти объекты.

Teigha.DatabaseServices.Transaction.GetAllObjects
Метод формирует коллекцию всех объектов, открытых в этой транзакции на данный момент.
Returns: Возвращает коллекцию объектов, тип DBObjectCollection.

Teigha.DatabaseServices.Transaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode)
Этот метод вызывает метод Open() верхней в стеке транзакции с передачей ему всех полученных аргументов, что избавляет от необходимости явным образом использовать указатель на эту транзакцию.
id: Идентификатор объекта, тип ObjectId.
mode: Режим доступа к объекту из перечисления OpenMode.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.Transaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean)
Этот метод вызывает метод Open() верхней транзакции.
Аргументы метода позволяют задать режим открытия объектов, а также включить доступ к удаленным объектам.
id: Идентификатор объекта, тип ObjectId.
mode: Режим доступа к объекту из перечисления OpenMode.
openErased: Флаг, указывающий, следует ли получать удаленные объекты.  Значение true позволяет открыть удаленный объект.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.Transaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Этот метод вызывает метод Open() верхней транзакции.
Аргументы метода позволяют задать режим открытия объектов, а также включить доступ к удаленным объектам и заблокированным слоям.
id: Идентификатор объекта, тип ObjectId.
mode: Режим доступа к объекту из перечисления OpenMode.
openErased: Флаг, указывающий, следует ли получать удаленные объекты.  Значение true позволяет открыть удаленный объект.
forceOpenOnLockedLayer: Флаг, указывающий, следует ли открывать заблокированные слои.  Значение true позволяет открыть объект на заблокированном слое.
Returns: Возвращает объект DBObject.

Teigha.DatabaseServices.Transaction.TransactionManager
Свойство предоставляет доступ к менеджеру транзакций, с которым связана данная транзакция.
Returns: Возвращает объект DatabaseServices.TransactionManager.