Teigha.DatabaseServices.XrefGraph
Класс <c>XrefGraph</c> представляет дерево внешних ссылок базы данных.

Teigha.DatabaseServices.XrefGraph.GetXrefNode(DatabaseServices.ObjectId)
Метод позволяет получить объект <c>XrefGraphNode</c>, соответствующий указанному идентификатору объекта.
btrId: Идентификатор объекта записи <c>BlockTableRecord</c>.
Returns: Возвращает объект <c>XrefGraphNode</c>, если узел найден, или <c>null</c> в противном случае.

Teigha.DatabaseServices.XrefGraph.GetXrefNode(System.Int32)
Метод позволяет получить объект <c>XrefGraphNode</c> по указанному индексу узла.
idx: Индекс искомого узла. Тип <c>int</c>.
Returns: Возвращает объект <c>XrefGraphNode</c>, если узел найден, или <c>null</c> в противном случае.

Teigha.DatabaseServices.XrefGraph.GetXrefNode(DatabaseServices.Database)
Метод позволяет получить объект <c>XrefGraphNode</c>, соответствующий указанной базе данных.
db: База данных, для которой требуется найти узел. Тип <c>DatabaseServices.Database</c>.
Returns: Возвращает объект <c>XrefGraphNode</c>, если узел найден, или <c>null</c> в противном случае.

Teigha.DatabaseServices.XrefGraph.GetXrefNode(String)
Метод позволяет получить объект <c>XrefGraphNode</c> с указанным именем.
name: Имя узла. Тип <c>String</c>.
Returns: Возвращает объект <c>XrefGraphNode</c>, если узел найден, или <c>null</c> в противном случае.

Teigha.DatabaseServices.XrefGraph.MarkUnresolvedTrees
Метод позволяет пометить флагом <c>GraphNode.UnresTree</c> все неразрешимые внешние ссылки и их вложенные внешние ссылки.
Не реализован.
Returns: Возвращает <c>true</c>, если граф содержит неразрешимые внешние ссылки.
В противном случае возвращает <c>false</c> (значение по умолчанию).

Teigha.DatabaseServices.XrefGraph.HostDrawing
Свойство <c>HostDrawing</c> представляет корневой узел графа внешних ссылок, связанный с главным чертежом.
Returns: Возвращает корневой узел графа внешних ссылок, связанный с главным чертежом.
Тип <c>XrefGraphNode</c>.