Teigha.DatabaseServices.TransformOverrule
Этот класс переопределяет подмножество операций, связанных с 3D-преобразованиями объекта.
Используется в качестве базового для настройки поведения наследников класса Entity.

Teigha.DatabaseServices.TransformOverrule.CloneMeForDragging(Teigha.DatabaseServices.Entity)
Метод проверяет необходимость создавать для операций перетаскивания клон указанного объекта.
entity: Проверяемый объект чертежа. Тип Entity.

Teigha.DatabaseServices.TransformOverrule.Explode(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.DBObjectCollection)
Метод взрывает указанный в аргументе объект с получением множества более простых объектов.
entity: Взрываемый объект. Тип Entity.
entitySet: Коллекция, в которую добавляются объекты, порождаемые взрывом объекта entity. Коллекция может содержать элементы перед выполнением метода; новые элементы добавляются в конец коллекции.

Teigha.DatabaseServices.TransformOverrule.GetTransformedCopy(Teigha.DatabaseServices.Entity,Teigha.Geometry.Matrix3d)
Метод создает копию указанного объекта и применяет к этой копии заданное геометрическое 3D-преобразование.
entity: Копируемый объект, тип Entity.
transform: Матрица 3D-преобразования, которое применяется к объекту-копии.

Teigha.DatabaseServices.TransformOverrule.HideMeForDragging(Teigha.DatabaseServices.Entity)
Метод проверяет, должен ли указанный объект быть скрытым для операций перетаскивания.
entity: Проверяемый объект чертежа, тип Entity.
Returns: Возвращает true, если объект entity должен быть скрыт для операции перетаскивания, в противном случае возвращает false.

Teigha.DatabaseServices.TransformOverrule.SetCustomFilter
Этот метод включает использование метода IsApplicable, чтобы устанавливать применимость объектного переопределения.

Teigha.DatabaseServices.TransformOverrule.SetExtensionDictionaryEntryFilter(String)
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
entryName: Имя записи в словаре расширений, тип String.

Teigha.DatabaseServices.TransformOverrule.SetIdFilter(array&lt;ObjectId&gt;)
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
ids: Массив идентификаторов объектов. Тип ObjectId[].

Teigha.DatabaseServices.TransformOverrule.SetNoFilter
Метод отключает все методы предварительной фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метод IsApplicable, перед применением объектных переопределений.

Teigha.DatabaseServices.TransformOverrule.SetXDataFilter(String)
Метод включает использование расширенных данных в условии применимости объектного переопределения.
registeredApplicationName: String

Teigha.DatabaseServices.TransformOverrule.TransformBy(Teigha.DatabaseServices.Entity,Teigha.Geometry.Matrix3d)
Метод предназначен для выполнения 3D-преобразования заданного объекта с использованием указанной матрицы преобразования.
entity: Объект чертежа, у которому применяется 3D-преобразование. Тип Entity.
transform: Матрица 3D-преобразования. Тип Matrix3d.