HostMgd.EditorInput.PromptPointOptionsEventArgs
Класс, обеспечивающий данными событие PromptingForPoint
класса Editor.

HostMgd.EditorInput.PromptPointOptionsEventArgs.Options
Возвращает входные параметры приглашения.