Teigha.Geometry.Interval
Класс <c>Interval</c> представляет конечный, бесконечный или полубесконечный интервал на действительной оси, границы которого определены с некоторой заданной точностью.

Teigha.Geometry.Interval.#ctor(System.Double)
Конструктор класса <c>Interval</c>.
Создает бесконечный (в обоих направлениях) интервал и определяет точность для задания границ.
tolerance: Входная точность определения границ интервала.

Teigha.Geometry.Interval.#ctor(System.Double,System.Double,System.Double)
Конструктор класса <c>Interval</c>.
Создает конечный интервал с указанными нижней и верхней границами, а также с заданной точностью определения границ.
lower: Нижняя  граница интервала. Тип <c>double</c>.
upper: Верхняя граница интервала. Тип <c>double</c>.
tolerance: Заданная точность определения границ. Тип <c>double</c>.

Teigha.Geometry.Interval.#ctor(System.Int32,System.Double,System.Double)
Конструктор класса <c>Interval</c>.
Создает полубесконечный интервал с указанной верхней границей и заданной точностью определения границ.
Возможно также создать интервал, ограниченный снизу.
boundedBelow: Флаг, который определяет, что интервал является ограниченным снизу. Тип <c>int</c>.
bound: Значение верхней и, возможно, нижней границы. Тип <c>double</c>.
tolerance: Заданная точность определения границ. Тип <c>double</c>.

Teigha.Geometry.Interval.#ctor(Teigha.Geometry.Interval)
Конструктор класса <c>Interval</c>. Создает экземпляр класса, являющийся копией указанного интервала.
other: Входной интервал, копию которого требуется создать. Тип <c>Interval</c>.

Teigha.Geometry.Interval.Contains(System.Double)
Метод позволяет проверить, принадлежит ли указанное значение данному интервалу с учетом используемой точности.
value: Проверяемое значение. Тип <c>double</c>.
Returns: Возвращает <c>true</c>, если значение <c>value</c> принадлежит данному интервалу.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.Contains(Teigha.Geometry.Interval)
Метод позволяет проверить, принадлежит ли указанный интервал данному интервалу с учетом используемой точности задания границ.
otherInterval: Проверяемый интервал. Тип <c>Interval</c>.
Returns: Возвращает <c>true</c>, если интервал <c>otherInterval</c> включается в данный интервал.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.GetBounds
Метод предоставляет границы данного интервала.
Returns: Возвращает массив из двух элементов. Тип <c>double[]</c>.
Элемент с нулевым индексом определяет нижнюю границу, а следующий элемент определяет верхнюю.

Teigha.Geometry.Interval.GetMerge(Teigha.Geometry.Interval)
Метод реализует слияние данного интервала с указанным интервалом.
Результатом является наименьший интервал, который включает в себя оба интервала.
otherInterval: Входной интервал. Тип <c>Interval</c>.
Returns: Возвращает наименьший интервал, который включает в себя как данный интервал, так и интервал <c>otherInterval</c>.
Тип <c>Interval</c>.

Teigha.Geometry.Interval.IntersectWith(Teigha.Geometry.Interval)
Метод позволяет получить интервал, являющийся пересечением данного и указанного интервалов с учетом настроенной точности определения границ.
otherInterval: Входной интервал. Тип <c>Interval</c>.
Returns: Возвращает интервал, являющийся пересечением данного интервала и интервала <c>otherInterval</c>.
Тип <c>Interval</c>. В случае непересекающихся интервалов возвращает NULL.

Teigha.Geometry.Interval.IsContinuousAtUpper(Teigha.Geometry.Interval)
Метод позволяет проверить, совпадает ли верхняя граница данного интервала с нижней границей указанного интервала в пределах заданной точности определения границ.
otherInterval: Проверяемый интервал. Тип <c>Interval</c>.
Returns: Возвращает <c>true</c>, если данный интервал ограничен сверху, интервал <c>otherInterval</c> ограничен снизу, а верхняя граница данного интервала совпадает с нижней границей интервала <c>otherInterval</c> в пределах точности определения границ, настроенной в данном интервале.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.IsDisjoint(Teigha.Geometry.Interval)
Метод позволяет убедиться, что в пределах заданной точности данный интервал не пересекается с указанным интервалом.
otherInterval: Проверяемый интервал. Тип <c>Interval</c>.
Returns: Возвращает <c>true</c>, если данный интервал не пересекается с интервалом <c>otherInterval</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.IsEqualAtLower(System.Double)
Метод проверяет, совпадает ли нижняя граница данного интервала с указанным значением в пределах заданной точности.
value: Проверяемое значение. Тип <c>double</c>.
Returns: Возвращает <c>true</c>, если данный интервал ограничен снизу, и его нижняя граница равна значению <c>value</c> в пределах заданной в данном объекте точности определения границ.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.IsEqualAtLower(Teigha.Geometry.Interval)
Метод проверяет, совпадают ли нижние границы данного и указанного интервалов в пределах заданной точности.
otherInterval: Проверяемый интервал. Тип <c>Interval</c>.
Returns: Возвращает <c>true</c>, если нижние границы двух интервалов совпадают в пределах заданной в данном объекте точности, либо если оба интервала не ограничены снизу. В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.IsEqualAtUpper(System.Double)
Метод проверяет, совпадает ли верхняя граница данного интервала с указанным значением в пределах заданной точности.
value: Проверяемое значение. Тип <c>double</c>.
Returns: Возвращает <c>true</c>, если данный интервал ограничен сверху, и его верхняя граница равна значению <c>value</c> в пределах заданной в данном объекте точности определения границ.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.IsEqualAtUpper(Teigha.Geometry.Interval)
Метод проверяет, совпадают ли верхние границы данного и указанного интервалов в пределах заданной точности.
otherInterval: Проверяемый интервал. Тип <c>Interval</c>.
Returns: Возвращает <c>true</c>, если верхние границы двух интервалов совпадают в пределах заданной в данном объекте точности, либо если оба интервала не ограничены сверху. В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.IsOverlapAtUpper(Teigha.Geometry.Interval,Teigha.Geometry.Interval)
Метод позволяет проверить, перекрывается ли данный интервал по верхней границе с указанным интервалом.
otherInterval: Проверяемый интервал. Тип <c>Interval</c>.
overlap: Интервал перекрытия. Тип <c>Interval</c>. Значение действительно, только если метод возвращает <c>true</c>.
Returns: Возвращает <c>true</c>, если данный интервал по своей верхней границе перекрывается с указанным интервалом.
В противном случае возвращает <c>false</c>.
Если метод возвращает <c>true</c>, то действительный интервал перекрытия передается через параметр <c>overlap</c>.

Teigha.Geometry.Interval.IsPeriodicallyOn(System.Double,[Out]double%)
Метод позволяет проверить, является ли указанное значение периодическим на этом интервале с заданным периодом.
period: Входное значение периода. Тип <c>double</c>.
value: Выходное значение. Тип <c>double</c>. Если метод возвращает <c>true</c>, то <c>value</c> получает значение, которое с периодом <c>period</c> целое количество раз попадает в данный интервал.
Returns: Возвращает <c>true</c>, если существует положительное целое число <c>N</c>, такое что значение <c>value + N * period</c> принадлежит данному интервалу. В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.Subtract(Teigha.Geometry.Interval)
Метод вычитает указанный интервал из данного интервала.
otherInterval: Вычитаемый интервал. Тип <c>Interval</c>.
Returns: Возвращает массив из двух интервалов, образование которых возможно в результате операции вычитания. Тип <c>Interval[]</c>.
Элемент с индексом 0 представляет левый или единственный интервал, образующийся в результате операции вычитания.
Если результатом являются два интервала, то элемент с индексом 1 представляет правый интервал.
Два интервала образуются только в том случае, если <c>otherInterval</c> полностью включен в данный интервал, не касаясь его границ своими концами.

Teigha.Geometry.Interval.Element
Свойство <c>Element</c> представляет границу данного интервала.
Returns: Возвращает границу данного интервала. Тип <c>double</c>.

Teigha.Geometry.Interval.IsBounded
Свойство <c>IsBounded</c> позволяет проверить, является ли данный интервал ограниченным с обеих сторон.
Returns: Возвращает <c>true</c>, если данный интервал является ограниченным как сверху, так и снизу.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.IsBoundedAbove
Свойство <c>IsBoundedAbove</c> позволяет проверить, является ли данный интервал ограниченным сверху.
Returns: Возвращает <c>true</c>, если данный интервал является ограниченным сверху.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.IsBoundedBelow
Свойство <c>IsBoundedBelow</c> позволяет проверить, является ли данный интервал ограниченным снизу.
Returns: Возвращает <c>true</c>, если данный интервал является ограниченным снизу.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.IsSingleton
Свойство <c>IsSingleton</c> позволяет проверить, не является ли данный интервал синглтоном (вырожденным в точку).
Возвращает true, если этот интервал ограничен и нижняя граница равна верхней границе в пределах допуска. В противном случае возвращает false.
Returns: Возвращает <c>true</c>, если интервал ограничен, а его нижняя граница совпадает с верхней в пределах заданной в этом объекте точности определения границ. В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.IsUnbounded
Свойство <c>IsUnbounded</c> позволяет убедиться, что данный интервал является неограниченным по крайней мере с одной из сторон.
Returns: Возвращает <c>true</c>, если интервал не является ограниченным по крайней мере в одном из двух направлений.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Interval.Length
Свойство <c>Length</c> возвращает длину данного интервала, если он ограничен, и <c>-1</c> в противном случае.
Returns: Возвращает длину данного интервала, если он ограничен, и <c>-1</c> в противном случае.
Тип <c>double</c>.

Teigha.Geometry.Interval.LowerBound
Свойство <c>LowerBound</c> представляет нижнюю границу данного интервала.
Возвращаемое значение имеет смысл только в случае интервала, ограниченного снизу.
Returns: Возвращает нижнюю границу данного интервала.
Тип <c>double</c>.

Teigha.Geometry.Interval.Tolerance
Свойство <c>Tolerance</c> представляет точность, используемую для определения границ данного интервала.
Returns: Возвращает точность, используемую для определения границ данного интервала.
Тип <c>double</c>.

Teigha.Geometry.Interval.Unbounded
Свойство <c>Unbounded</c> возвращает интервал, неограниченный с какой-либо одной стороны.
Returns: Возвращает интервал, неограниченный с какой-либо одной стороны.
Тип <c>Interval</c>.

Teigha.Geometry.Interval.UpperBound
Свойство <c>UpperBound</c> представляет верхнюю границу данного интервала.
Returns: Возвращает верхнюю границу данного интервала.
Тип <c>double</c>.