HostMgd.EditorInput.PromptEntityOptions
Класс, представляющий необязательные параметры приглашения
для ввода геометрического объекта.

HostMgd.EditorInput.PromptEntityOptions.AddAllowedClass(System.Type,System.Boolean)
Метод добавляет тип к внутреннему списку классов, разрешённых
для выбора. Если параметр exactMatch установлен в true, то
только объекты точно тех типов, которые есть в списке,
разрешены для выбора. В противном случае, разрешены к выбору
как объекты точно тех типов, которые есть в списке, так и
объекты, относящиеся к любым производным классам.
exactMatch: Параметр для задания точного или неточного
type: Тип класса

HostMgd.EditorInput.PromptEntityOptions.AllowNone
Возвращает или устанавливает признак того, разрешен ли ввод
только Enter.
Значение true означает, что ввод только Enter разрешен, и
false в противном случае.

HostMgd.EditorInput.PromptEntityOptions.AllowObjectOnLockedLayer
Возвращает или устанавливает признак, разрешен ли выбор
геометрических объектов на заблокированных слоях.

HostMgd.EditorInput.PromptEntityOptions.#ctor(String)
Конструктор.
message: Приглашающее сообщение

HostMgd.EditorInput.PromptEntityOptions.#ctor(String,String)
Конструктор.
messageAndKeywords: Приглашающая строка с ключевыми словами
globalKeywords: Ключевые слова (глобальные имена)

HostMgd.EditorInput.PromptEntityOptions.RemoveAllowedClass(System.Type)
Метод удаляет класс, определенный параметром type из списка
классов, разрешенных для выбора.
type: Тип класса

HostMgd.EditorInput.PromptEntityOptions.SetRejectMessage(String)
Метод устанавливает строку сообщения, которая будет
выводиться, если выбираемый графический объект не разрешен
для выбора.
message: Приглашающее сообщение