Teigha.DatabaseServices.AssocArray
Класс AssocArray представляет массив ассоциативных действий, вычисление которых позволяет управлять элементами ассоциативного массива или их расположением.

Teigha.DatabaseServices.AssocArray.AddSourceEntity(Teigha.DatabaseServices.ObjectId,Teigha.Geometry.Point3d)
Метод добавляет указанный геометрический объект в список исходных элементов ассоциативного массива.
sourceEntity: Идентификатор добавляемого исходного объекта.  Тип ObjectId.
basePoint: Точка, которая используется для позиционирования вновь добавленного исходного объекта. Тип Point3d.

Teigha.DatabaseServices.AssocArray.CreateArray(Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.VertexRef,Teigha.DatabaseServices.AssocArrayParameters)
Метод позволяет создать объект AssocArray с заданными исходными объектами, базовой точкой и параметрами.
Returns: Возвращает новый экземпляр класса AssocArray.

Teigha.DatabaseServices.AssocArray.DeleteItem(Teigha.DatabaseServices.ItemLocator,System.Boolean)
Метод позволяет пометить указанный по индексу элемент ассоциативного массива для удаления или для отмены удаления.
index: Индекс элемента массива. Тип ItemLocator.
bErase: Флаг, указывающий, следует ли стереть (значение true) или отменить удаление элемента по указанному индексу (значение false). Тип bool.

Teigha.DatabaseServices.AssocArray.Explode(Teigha.DatabaseServices.ObjectId)
Метод создает коллекцию ObjectId объектов, образованных в результате разбиения на подобъекты входного ассоциативного массива.
entity: Идентификатор разбиваемого на подобъекты массива.  Тип ObjectId.
Returns: Возвращает коллекцию идентификаторов объектов, полученных в результате разбиения на подобъекты.  Тип ObjectIdCollection.

Teigha.DatabaseServices.AssocArray.GetAssociativeArray(Teigha.DatabaseServices.ObjectId)
Метод позволяет найти ассоциативный массив AssocArray, в котором участвует заданный объект.
entity: Идентификатор объекта, для которого ищется ассоциативный массив.  Тип ObjectId.
Returns: Возвращает найденный ассоциативный массив. Тип AssocArray. Если ассоциативный массив не существует, возвращает Null.

Teigha.DatabaseServices.AssocArray.GetItemTransform(Teigha.DatabaseServices.ItemLocator)
Метод извлекает матрицу преобразования, которая применяется к элементу ассоциативного массива с указанным локатором ItemLocator.
index: Локатор элемента ассоциативного массива.  Тип ItemLocator.
Returns: Возвращает матрицу геометрического преобразования для указанного элемента массива.  Тип Matrix3d.

Teigha.DatabaseServices.AssocArray.GetParameters
Метод позволяет получить объект параметров данного ассоциативного массива.
Returns: Возвращает параметры ассоциативного массива. Тип <c>AssocArrayParameters</c>.

Teigha.DatabaseServices.AssocArray.IsAssociativeArray(Teigha.DatabaseServices.ObjectId)
Метод позволяет проверить, является ли указанный объект ассоциативным массивом.
entity: Идентификатор проверяемого объекта.  Тип ObjectId.
Returns: Возвращает <c>true</c>, если проверяемый объект является ассоциативным массивом. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocArray.IsErased(Teigha.DatabaseServices.ItemLocator)
Метод проверяет, помечен ли как удаленный указанный элемент ассоциативного массива.
index: Индекс элемента ассоциативного массива.  Тип ItemLocator.
Returns: Возвращает <c>true</c>, если указанный элемент помечен как удаленный. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocArray.RemoveSourceEntity(Teigha.DatabaseServices.ObjectId)
Метод удаляет исходный объект с заданным ObjectId и обновляет каждый элемент ассоциативного массива, которым управляет соответствующее действие.
sourceEntity: Идентификатор удаляемого из массива исходного объекта.  Тип ObjectId.

Teigha.DatabaseServices.AssocArray.ReplaceItems(array&lt;ItemLocator&gt;,Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.VertexRef)
Метод заменяет указанные по индексу элементы ассоциативного массива новыми объектами из входной коллекции с заданной базовой точкой.
indices: Локаторы заменяемых элементов ассоциативного массива.  Тип ItemLocator[].
substEntities: Коллекция ObjectId новых объектов.  Тип ObjectIdCollection.
basePoint: Базовая точка новых объектов.  Тип VertexRef.

Teigha.DatabaseServices.AssocArray.ResetItems
Метод удаляет любые переопределения (положение, ориентация или замена объекта) для всех элементов данного ассоциативного массива.

Teigha.DatabaseServices.AssocArray.TransformItemBy(Teigha.DatabaseServices.ItemLocator,Teigha.Geometry.Matrix3d)
Метод применяет заданное геометрическое 3D-преобразование к указанному элементу ассоциативного массива.
index: Индекс элемента ассоциативного массива, к которому применяется геометрическое преобразование.  Тип ItemLocator.
transform: Матрица геометрического 3D-преобразования. Тип Matrix3d.

Teigha.DatabaseServices.AssocArray.getItemLocators(array&lt;FullSubentityPath&gt;)
Метод извлекает список локаторов элементов для указанного списка путей подобъектов данного ассоциативного массива.
subPaths: Массив полных путей подъобъектов в ассоциативном массиве.  Тип FullSubentityPath[].
Returns: Возвращает массив локаторов элементов ассоциативного массива. Тип ItemLocator[].

Teigha.DatabaseServices.AssocArray.getItems(System.Boolean)
Метод извлекает в массив локаторы элементов данного ассоциативного массива.
skipErased: Данный флаг определяет, следует ли пропускать удаленные элементы массива.  Тип bool.
Returns: Возвращает массив локаторов для элементов данного ассоциативного массива.  Тип ItemLocator[].

Teigha.DatabaseServices.AssocArray.EntityId
Свойство предоставляет идентификатор ObjectId ассоциативного массива.
Returns: Возвращает ObjectId ассоциативного массива.

Teigha.DatabaseServices.AssocArray.SourceEntities
Свойство обеспечивает доступ к коллекции ObjectId исходных объектов, образующих элементы ассоциативного массива.
Returns: Возвращает коллекцию идентификаторов исходных объектов. Тип ObjectIdCollection.