Teigha.Geometry.SurfaceSurfaceIntersectorConfiguration
Перечисление <c>SurfaceSurfaceIntersectorConfiguration</c> определяет конфигурации окрестности поверхности, расположенной слева или справа от кривой пересечения двух поверхностей, по отношению к второй поверхности.