Teigha.DatabaseServices.RasterVariables
Класс <c>RasterVariables</c> представляет объекты <c>RasterVariables</c> в базе данных.

Teigha.DatabaseServices.RasterVariables.#ctor
Конструктор по умолчанию класса <c>RasterVariables</c>.

Teigha.DatabaseServices.RasterVariables.ImageFrame
Свойство <c>ImageFrame</c> представляет переменную, которая определяет тип отображения рамки изображения.
Returns: Возвращает тип отображения рамки. Значение из перечисления <c>FrameSetting</c>.

Teigha.DatabaseServices.RasterVariables.ImageQuality
Свойство <c>ImageQuality</c> представляет качество отображения растрового изображения.
Returns: Возвращает настройку качества изображения. Значение из перечисления <c>DatabaseServices.ImageQuality</c>.

Teigha.DatabaseServices.RasterVariables.UserScale
Свойство <c>UserScale</c> представляет единицы измерения в реальном пространстве, соответствующие единицам чертежа.
Returns: Возвращает единицы измерения в реальном пространстве. Значение из перечисления <c>Unit</c>.