Teigha.LayerManager.RelationalExpression
Класс <c>RelationalExpression</c> представляет реляционное выражение вида <c>variable <op> constant</c>, где <c>op</c> — это либо оператор <c>==</c>, либо <c>!=</c>.

Teigha.LayerManager.RelationalExpression.Constant
Свойство <c>Constant</c> возвращает имя константы реляционного выражения.
Returns: Возвращает имя константы реляционного выражения.
Тип <c>String</c>.

Teigha.LayerManager.RelationalExpression.Variable
Свойство <c>Variable</c> представляет имя переменной реляционного выражения.
Returns: Возвращает имя переменной реляционного выражения.
Тип <c>String</c>.