Teigha.DatabaseServices.AssocManager
Этот класс представляет менеджер ассоциативных связей, который глобально управляет структурой ассоциативных связей.

Teigha.DatabaseServices.AssocManager.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.AssocManager.AddGlobalEvaluationCallback(Object,System.Int32)
Метод добавляет указанный обратный вызов в глобальный объект AssocEvaluationMultiCallback. Не реализован.
callback: Пользовательский обратный вызов, на который будет ссылаться объект AssocEvaluationMultiCallback. Тип Object.
order: Порядок выполнения пользовательских обратных вызовов. Тип int.

Teigha.DatabaseServices.AssocManager.AuditAssociativeData(Teigha.DatabaseServices.Database,System.Boolean)
Метод проверяет ассоциативные данные в базе данных и пытается устранить ошибки в случае их обнаружения. Не реализован.
database: База данных, в которой необходимо проверять ассоциативные данные.
traverseWholeDatabase: Если принимает значение <c>true</c>, то будут загружаться в память и проверяться все объекты в базе данных. Тип <c>bool</c>.

Teigha.DatabaseServices.AssocManager.EvaluateTopLevelNetwork(Teigha.DatabaseServices.Database,Object,System.Int32)
Метод обновляет ассоциативную сеть верхнего уровня (представленную объектом AssocNetwork) указанной базы данных, используя обратный вызов глобального обновления.
database: База данных, ассоциативную сеть верхнего уровня требуется обновить (перевычислить).
callback: Пользовательский обратный вызов, на который будет ссылаться объект AssocEvaluationMultiCallback.
callbackOrder: Порядок выполнения пользовательских обратных вызовов. Чем меньше значение порядка, тем раньше выполняется обратный вызов.  Тип <c>int</c>.
Returns: Возвращает <c>true</c>, если обновление ассоциативной сети завершается успешно.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocManager.HasAssocNetwork(Teigha.DatabaseServices.Database)
Метод проверяет, имеет ли указанная база данных глобальную ассоциативную сеть (представленную объектом AssocNetwork). Не реализован.
database: Проверяемая база данных. Тип Teigha.DatabaseServices.Database.
Returns: Возвращает <c>true</c>, если база данных <c>database</c> имеет глобальную ассоциативную сеть.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocManager.Initialize
Внутренний метод инициализации ассоциативного фреймворка.

Teigha.DatabaseServices.AssocManager.RemoveGlobalEvaluationCallback(Object)
Метод удаляет указанный пользовательский обратный вызов обновления из глобального объекта AssocEvaluationMultiCallback.
callback: Удаляемый пользовательский обратный вызов. Тип <c>Object</c>.