Teigha.DatabaseServices.DbDictionaryEnumerator
Класс DbDictionaryEnumerator представляет перечислитель для коллекции объектов DBDictionaryEntry.

Teigha.DatabaseServices.DbDictionaryEnumerator.MoveNext
Метод выполняет переход перечислителя к следующей записи в коллекции, в случае успеха возвращает <c>true</c>.
Returns: Возвращает <c>true</c>, если запись найдена. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DbDictionaryEnumerator.Reset
Реинициализирует перечислитель, сбрасывая его текущий индекс к значению -1.

Teigha.DatabaseServices.DbDictionaryEnumerator.Current
Свойство обеспечивает доступ к текущей записи перечислителя.
Returns: Возвращает текущую запись коллекции. Тип DBDictionaryEntry.

Teigha.DatabaseServices.DbDictionaryEnumerator.Entry
Свойство обеспечивает доступ к записи коллекции, на которую указывает свойство Entry перечислителя.
Returns: Возвращает запись коллекции, указанную в свойстве Entry. Тип DBDictionaryEntry.

Teigha.DatabaseServices.DbDictionaryEnumerator.Key
Свойство возвращает значение ключа текущей записи перечислителя.
Returns: Возвращает ключ записи. Тип String.

Teigha.DatabaseServices.DbDictionaryEnumerator.Value
Свойство возвращает значение текущей записи перечислителя.
Returns: Возвращает значение текущей записи перечислителя. Тип DatabaseServices.ObjectId.