Teigha.DatabaseServices.ObjectIdCollection
Класс представляет коллекцию идентификаторов объектов <c>ObjectId</c>.

Teigha.DatabaseServices.ObjectIdCollection.#ctor
Конструктор по умолчанию класса <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.ObjectIdCollection.#ctor(array&lt;ObjectId&gt;)
Конструктор класса <c>ObjectIdCollection</c>. Создает коллекцию из массива идентификаторов объектов <c>ObjectId</c>.
values: Входной массив идентификаторов объектов. Тип <c>ObjectId[]</c>.

Teigha.DatabaseServices.ObjectIdCollection.Add(Teigha.DatabaseServices.ObjectId)
Метод позволяет добавить в коллекцию указанный идентификатор объекта.
value: Добавляемый идентификатор объекта. Тип <c>ObjectId</c>.
Returns: Возвращает индекс вновь добавленного элемента коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.ObjectIdCollection.Clear
Метод предназначен для удаления из коллекции всех элементов.

Teigha.DatabaseServices.ObjectIdCollection.Contains(Teigha.DatabaseServices.ObjectId)
Метод позволяет проверить, содержит ли данная коллекция указанный объект <c>ObjectId</c>.
value: Проверяемый идентификатор объекта. Тип <c>ObjectId</c>.
Returns: Возвращает <c>true</c>, если идентификатор <c>value</c> в коллекции присутствует.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.ObjectIdCollection.CopyTo(array&lt;ObjectId&gt;,System.Int32)
Метод предназначен для копирования этой коллекции идентификаторов объектов в указанный массив по указанному индексу.
a: Целевой массив. Тип <c>ObjectId[]</c>.
index: Индекс в массиве <c>a</c>, начиная с которого в массиве сохраняются идентификаторы объектов из данной коллекции.

Teigha.DatabaseServices.ObjectIdCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает объект перечислителя. Тип <c>System.Collections.IEnumerator</c>.

Teigha.DatabaseServices.ObjectIdCollection.IndexOf(Teigha.DatabaseServices.ObjectId)
Метод предоставляет индекс идентификатора объекта в данной коллекции, соответствующий указанному идентификатору объекта.
value: Входной идентификатор объекта, для которого ищется индекс. Тип <c>ObjectId</c>.
Returns: Возвращает индекс идентификатора объекта. Тип <c>int</c>.
Если искомый идентификатор в коллекции отсутствует, метод возвращает -1.

Teigha.DatabaseServices.ObjectIdCollection.Insert(System.Int32,Teigha.DatabaseServices.ObjectId)
Метод позволяет вставить указанный идентификатор объекта в коллекцию по указанному индексу.
index: Индекс позиции добавляемого элемента. Тип <c>int</c>.
value: Добавляемый идентификатор объекта. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.ObjectIdCollection.Remove(Teigha.DatabaseServices.ObjectId)
Метод удаляет из коллекции элемент, соответствующий аргументу.
value: Идентификатор объекта, который следует удалить из коллекции. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.ObjectIdCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции идентификатор объекта с указанным индексом.
index: Индекс удаляемого элемента коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.ObjectIdCollection.Count
Свойство представляет общее количество идентификаторов объектов в этой коллекции.
Returns: Возвращает общее количество элементов в коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.ObjectIdCollection.Item
Свойство предоставляет доступ к элементу коллекции по его индексу.
index: Индекс элемента коллекции. Тип <c>int</c>.
Returns: Возвращает элемент коллекции. Тип <c>ObjectId</c>.