Teigha.DatabaseServices.WblockNoticeEventArgs
Класс <c>WblockNoticeEventArgs</c> представляет данные для события <c>WblockNotice</c> базы данных.

Teigha.DatabaseServices.WblockNoticeEventArgs.To
Свойство <c>To</c> представляет базу данных, в которую записываются данные.
Returns: Возвращает целевую базу данных. Тип <c>Database</c>.