Teigha.DatabaseServices.DBObjectCollection
Класс представляет интерфейс к коллекции объектов DBObject.

Teigha.DatabaseServices.DBObjectCollection.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.DBObjectCollection.#ctor(IntPtr,System.Boolean)
Конструктор.

Teigha.DatabaseServices.DBObjectCollection.Add(Teigha.DatabaseServices.DBObject)
Добавляет в коллекцию указанный объект и возвращает индекс нового элемента коллекции (отсчитываемый от нуля).
value: Добавляемый в коллекцию объект типа DBObject.
Returns: Возвращает отсчитываемый от нуля индекс добавленного в коллекцию элемента.

Teigha.DatabaseServices.DBObjectCollection.Clear
Метод удаляет из коллекции все элементы.

Teigha.DatabaseServices.DBObjectCollection.Contains(Teigha.DatabaseServices.DBObject)
Метод осуществляет поиск заданного объекта в коллекции.
value: Искомый объект типа DBObject.
Returns: Возвращает true, если совпадающий с аргументом объект типа DBObject в коллекции найден.  В противном случае возарвщвет false.

Teigha.DatabaseServices.DBObjectCollection.CopyTo(array&lt;DBObject&gt;,System.Int32)
Копирует в коллекцию объекты из массива указанного массива.
array: Массив объектов типа DBObject, которые следует скопировать в коллекцию.
index: Индекс, с которого начинается копирование элементов массива. Индексация в массиве начинается с нуля.

Teigha.DatabaseServices.DBObjectCollection.GetEnumerator
Метод создает объект перечислителя для данной коллекции.
Returns: Возвращает объект перечислителя IEnumerator для данной коллекции.

Teigha.DatabaseServices.DBObjectCollection.IndexOf(Teigha.DatabaseServices.DBObject)
Метод определяет индекс элемента коллекции с заданным объектом типа DBObject.
value: Объект типа DBObject, для которого следует установить индекс в коллекции.
Returns: Возвращает индекс (int) элемента коллекции.  Индексация в коллекции начинается с нуля.

Teigha.DatabaseServices.DBObjectCollection.Insert(System.Int32,Teigha.DatabaseServices.DBObject)
Метод вставляет указанный объект DBObject в заданную позицию коллекции.
index: Индекс позиции для вставки объекта (тип int).
DBObject value: Вставляемый объект типа DBObject.

Teigha.DatabaseServices.DBObjectCollection.Remove(Teigha.DatabaseServices.DBObject)
Метод удаляет из коллекции заданный объект DBObject.
value: Элемент типа DBObject, подлежащий удалению из коллекции.

Teigha.DatabaseServices.DBObjectCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции объект, расположенный по указанному индексу.
index: Индекс (int) удаляемого элемента коллекции.

Teigha.DatabaseServices.DBObjectCollection.Count
В свойстве хранится количество элементов в коллекции.
Returns: Возвращает количество элементов в коллекции (int).

Teigha.DatabaseServices.DBObjectCollection.Item
Свойство предназначено для быстрого поиска элемента коллекции по его индексу.
Returns: Возвращает элемент коллекции типа DBObject.