Teigha.Geometry.CurveCurveIntersector3d
Класс <c>CurveCurveIntersector3d</c> представляет геометрию пересечений 3D-кривых общего вида.

Teigha.Geometry.CurveCurveIntersector3d.#ctor
Конструктор по умолчанию класса <c>CurveCurveIntersector3d</c>.

Teigha.Geometry.CurveCurveIntersector3d.#ctor(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d)
Конструктор класса <c>CurveCurveIntersector3d</c>.
Создает объект для вычисления пересечений указанных кривых с использованием точности по умолчанию.
curve1: Первая входная кривая. Тип <c>Curve3d</c>.
curve2: Вторая входная кривая. Тип <c>Curve3d</c>.
planeNormal: Опциональный вектор нормали плоскости. Тип <c>Vector3d</c>.

Teigha.Geometry.CurveCurveIntersector3d.#ctor(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d,Geometry.Tolerance)
Конструктор класса <c>CurveCurveIntersector3d</c>.
Создает объект для вычисления пересечений указанных кривых с заданной точностью.
curve1: Первая входная кривая. Тип <c>Curve3d</c>.
curve2: Вторая входная кривая. Тип <c>Curve3d</c>.
planeNormal: Опциональный вектор нормали плоскости. Тип <c>Vector3d</c>.
tolerance: Заданная точность геометрических вычислений. Тип <c>Geometry.Tolerance</c>.

Teigha.Geometry.CurveCurveIntersector3d.#ctor(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Teigha.Geometry.Vector3d)
Конструктор класса <c>CurveCurveIntersector3d</c>.
Создает объект для вычисления пересечений двух кривых на участках, которые определены заданными параметрическими интервалами.
Используется точность по умолчанию.
curve1: Первая входная кривая. Тип <c>Curve3d</c>.
curve2: Вторая входная кривая. Тип <c>Curve3d</c>.
range1: Параметрический интервал для первой кривой. Тип <c>Interval</c>.
range2: Параметрический интервал для второй кривой. Тип <c>Interval</c>.
planeNormal: Опциональный вектор нормали плоскости. Тип <c>Vector3d</c>.

Teigha.Geometry.CurveCurveIntersector3d.#ctor(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Teigha.Geometry.Vector3d,Geometry.Tolerance)
Конструктор класса <c>CurveCurveIntersector3d</c>.
Создает объект для вычисления с заданной точностью пересечений двух кривых на их участках, которые определены заданными параметрическими интервалами.
curve1: Первая входная кривая. Тип <c>Curve3d</c>.
curve2: Вторая входная кривая. Тип <c>Curve3d</c>.
range1: Параметрический интервал для первой кривой. Тип <c>Interval</c>.
range2: Параметрический интервал для второй кривой. Тип <c>Interval</c>.
planeNormal: Опциональный вектор нормали плоскости. Тип <c>Vector3d</c>.
tolerance: Заданная точность геометрических вычислений. Тип <c>Geometry.Tolerance</c>.

Teigha.Geometry.CurveCurveIntersector3d.ChangeCurveOrder
Метод изменяет на обратный порядок кривых в данном объекте, делая первую кривую второй и наоборот.

Teigha.Geometry.CurveCurveIntersector3d.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>CurveCurveIntersector3d</c>.

Teigha.Geometry.CurveCurveIntersector3d.GetIntersectionParameters(System.Int32)
Метод вычисляет значения параметров для каждой из кривых в точке пересечения с указанным индексом.
intersection: Индекс точки пересечения, в которой требуется вычислить параметры для пересекающихся кривых. Тип <c>int</c>.
Returns: Возвращает массив из двух элементов. Тип <c>double[]</c>.
Первое значение представляет параметр для первой кривой в точке пересечения, а второе значение — параметр для второй кривой в точке пересечения.

Teigha.Geometry.CurveCurveIntersector3d.GetIntersectionPoint(System.Int32)
Метод предоставляет 3D-точку пересечения с указанным индексом.
intersection: Порядковый индекс искомой точки пересечения. Тип <c>int</c>.
Returns: Возвращает 3D-точку пересечения с индексом <c>intersection</c>. Тип <c>Point3d</c>.

Teigha.Geometry.CurveCurveIntersector3d.GetIntersectionPointTolerance(System.Int32)
Метод предоставляет геометрическую точность, которая использовалась для вычисления точки пересечения с заданным индексом.
intersection: Индекс интересующей точки пересечения. Тип <c>int</c>.
Returns: Возвращает геометрическую точность вычисления указанной точки пересечения. Тип <c>double</c>.

Teigha.Geometry.CurveCurveIntersector3d.GetIntersectionRanges
Метод предоставляет параметрические интервалы, на которых вычисляются точки пересечения кривых.
Returns: Возвращает массив параметрических интервалов. Тип <c>Interval[]</c>.
Массив содержит ровно два элемента, которые представляют параметрические интервалы для первой и второй кривой, соответственно.

Teigha.Geometry.CurveCurveIntersector3d.GetOverlapRanges(System.Int32)
Метод позволяет вычислить для обеих кривых параметрические интервалы, которые соответствуют указанному по индексу участку перекрытия (совпадения) кривых.
overlap: Индекс участка перекрытия (совпадения) кривых. Тип <c>int</c>. Значение индекса должно быть неотрицательным и быть меньше количества перекрытий, возвращаемого свойством <c>OverlapCount</c>.
Returns: Возвращает массив из двух элементов, которые представляют параметрические интервалы для первой и второй кривой, соответственно.  Тип <c>Interval[]</c>.

Teigha.Geometry.CurveCurveIntersector3d.GetPointOnCurve1(System.Int32)
Метод позволяет получить точку пересечения с указанным индексом как точку <c>PointOnCurve3d</c> на первой кривой.
intersection: Входной индекс точки пересечения кривых. Тип <c>int</c>.
Returns: Возвращает объект <c>PointOnCurve3d</c> для точки пересечения на первой кривой.

Teigha.Geometry.CurveCurveIntersector3d.GetPointOnCurve2(System.Int32)
Метод позволяет получить точку пересечения с указанным индексом как точку <c>PointOnCurve3d</c> на второй кривой.
intersection: Входной индекс точки пересечения кривых. Тип <c>int</c>.
Returns: Возвращает объект <c>PointOnCurve3d</c> для точки пересечения на второй кривой.

Teigha.Geometry.CurveCurveIntersector3d.IsTangential(System.Int32)
Метод позволяет проверить, являются ли кривые касательными друг к другу в указанной точке пересечения.
intersection: Входной индекс точки пересечения кривых. Тип <c>int</c>.
Returns: Возвращает <c>true</c>, если в указанной точке пересечения кривые являются касательными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CurveCurveIntersector3d.IsTransversal(System.Int32)
Метод позволяет проверить, являются ли кривые трансверсальными (пересекающимися) в указанной точке пересечения.
intersection: Входной индекс точки пересечения кривых. Тип <c>int</c>.
Returns: Возвращает <c>true</c>, если пересечение кривых в указанной точке является трансверсальным.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CurveCurveIntersector3d.OrderWithRegardsTo1
Метод сортирует точки пересечения по возрастанию значений параметра первой кривой.

Teigha.Geometry.CurveCurveIntersector3d.OrderWithRegardsTo2
Метод сортирует точки пересечения по возрастанию значений параметра второй кривой.

Teigha.Geometry.CurveCurveIntersector3d.OverlapCount
Метод <c>OverlapCount</c> представляет количество интервалов перекрытия для двух кривых в данном объекте.
Returns: Возвращает количество интервалов перекрытия двух кривых. Тип <c>int</c>.

Teigha.Geometry.CurveCurveIntersector3d.OverlapDirection
Метод позволяет проверить взаимную ориентацию кривых на участке их перекрытия.
Returns: Возвращает <c>true</c>, если две кривые ориентированы в одном направлении на участке их перекрытия.
В случае противоположной ориентации перекрывающихся кривых возвращает значение <c>false</c>. Тип <c>bool</c>.

Teigha.Geometry.CurveCurveIntersector3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах точности по умолчанию.
curve1: Первая входная кривая. Тип <c>Curve3d</c>.
curve2: Вторая входная кривая. Тип <c>Curve3d</c>.
planeNormal: Опциональный вектор нормали плоскости. Тип <c>Vector3d</c>.

Teigha.Geometry.CurveCurveIntersector3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d,Geometry.Tolerance)
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах указанной точности.
curve1: Первая входная кривая. Тип <c>Curve3d</c>.
curve2: Вторая входная кривая. Тип <c>Curve3d</c>.
planeNormal: Опциональный вектор нормали плоскости. Тип <c>Vector3d</c>.
tolerance: Заданная точность геометрических вычислений. Тип <c>Geometry.Tolerance</c>.

Teigha.Geometry.CurveCurveIntersector3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Teigha.Geometry.Vector3d)
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения вычисляются в пределах точности по умолчанию.
curve1: Первая входная кривая. Тип <c>Curve3d</c>.
curve2: Вторая входная кривая. Тип <c>Curve3d</c>.
range1: Параметрический интервал для первой кривой. Тип <c>Interval</c>.
range2: Параметрический интервал для второй кривой. Тип <c>Interval</c>.
planeNormal: Опциональный вектор нормали плоскости. Тип <c>Vector3d</c>.

Teigha.Geometry.CurveCurveIntersector3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Teigha.Geometry.Vector3d,Geometry.Tolerance)
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения вычисляются в пределах указанной точности.
curve1: Первая входная кривая. Тип <c>Curve3d</c>.
curve2: Вторая входная кривая. Тип <c>Curve3d</c>.
range1: Параметрический интервал для первой кривой. Тип <c>Interval</c>.
range2: Параметрический интервал для второй кривой. Тип <c>Interval</c>.
planeNormal: Опциональный вектор нормали плоскости. Тип <c>Vector3d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Geometry.Tolerance</c>.

Teigha.Geometry.CurveCurveIntersector3d.Curve1
Свойство <c>Curve1</c> представляет указатель на первую кривую в данном объекте.
Returns: Возвращает первую кривую. Тип <c>Geometry.Curve3d</c>.

Teigha.Geometry.CurveCurveIntersector3d.Curve2
Свойство <c>Curve2</c> представляет указатель на вторую кривую в данном объекте.
Returns: Возвращает вторую кривую. Тип <c>Geometry.Curve3d</c>.

Teigha.Geometry.CurveCurveIntersector3d.NumberOfIntersectionPoints
Свойство <c>NumberOfIntersectionPoints</c> представляет количество найденных точек пересечения двух кривых.
Returns: Возвращает количество точек пересечения. Тип <c>int</c>.

Teigha.Geometry.CurveCurveIntersector3d.PlaneNormal
Свойство <c>PlaneNormal</c> представляет нормаль плоскости, которая используется для вычисления конфигураций в точке пересечения.
Returns: Возвращает нормаль плоскости. Тип <c>Vector3d</c>.

Teigha.Geometry.CurveCurveIntersector3d.Tolerance
Свойство <c>Tolerance</c> представляет текущее значение точности, которое будет использоваться при вычислении пересечений двух кривых.
Returns: Возвращает текущее значение геометрической точности. Тип <c>Geometry.Tolerance</c>.