Teigha.DatabaseServices.AssocNetwork
Класс AssocNetwork представляет сеть ассоциативных действий AssocAction.  Не реализован.

Teigha.DatabaseServices.AssocNetwork.#ctor
Конструктор по умолчанию. Не реализован.