Teigha.Geometry.Line2dCollection
Класс <c>Line2dCollection</c> представляет коллекцию двумерных линий.

Teigha.Geometry.Line2dCollection.#ctor
Конструктор по умолчанию класса <c>Line2dCollection</c>.
Создает пустую коллекцию 2D-линий.

Teigha.Geometry.Line2dCollection.Add(Teigha.Geometry.Line2d)
Метод добавляет в коллекцию указанную линию.
value: Линия, которую требуется добавить в коллекцию.
Returns: Возвращает индекс только что добавленного элемента коллекции. Тип <c>int</c>.
Индексация элементов коллекции начинается с нуля.

Teigha.Geometry.Line2dCollection.Clear
Метод удаляет из коллекции все элементы.

Teigha.Geometry.Line2dCollection.Contains(Teigha.Geometry.Line2d)
Метод позволяет проверить, содержится ли указанная линия в данной коллекции.
value: Проверяемая линия. Тип <c>Line2d</c>.
Returns: Возвращает <c>true</c>, если проверяемая линия присутствует в данной коллекции.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Line2dCollection.CopyTo(array&lt;Line2d&gt;,System.Int32)
Метод копирует элементы данной коллекции в указанный массив по указанному индексу.
array: Целевой массив, в который требуется скопировать элементы данной коллекции. Тип <c>Line2d[]</c>.
index: Индекс в массиве, начиная с которого в массиве сохраняются элементы коллекции. Тип <c>int</c>.

Teigha.Geometry.Line2dCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает перечислитель для этой коллекции.
Тип <c>IEnumerator</c>.

Teigha.Geometry.Line2dCollection.IndexOf(Teigha.Geometry.Line2d)
Метод вычисляет индекс элемента коллекции, который соответствует указанному объекту <c>Line2d</c>.
value: Проверяемая линия. Тип <c>Line2d</c>.
Returns: Возвращает индекс элемента коллекции, который соответствует проверяемой линии. Тип <c>int</c>.
Если элемент не найден, возвращает <c>-1</c>.

Teigha.Geometry.Line2dCollection.Insert(System.Int32,Teigha.Geometry.Line2d)
Метод вставляет в коллекцию новый элемент в позицию с указанным индексом.
index: Позиция нового элемента. Тип <c>int</c>.
value: Вставляемый в коллекцию элемент. Тип <c>Line2d</c>.

Teigha.Geometry.Line2dCollection.Remove(Teigha.Geometry.Line2d)
Метод удаляет из коллекции указанную 2D-линию.
value: Удаляемая линия. Тип <c>Line2d</c>.

Teigha.Geometry.Line2dCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции элемент с указанным индексом.
index: Индекс удаляемого элемента. Тип <c>int</c>.

Teigha.Geometry.Line2dCollection.Count
Свойство <c>Count</c> представляет текущее количество элементов в данной коллекции.
Returns: Возвращает количество элементов в коллекции.
Тип <c>int</c>.

Teigha.Geometry.Line2dCollection.Item
Свойство <c>Item</c> предоставляет доступ к элементу коллекции с указанным индексом.
index: Входной индекс элемента коллекции. Тип <c>int</c>.
Returns: Возвращает элемент коллекции с указанным индексом. Тип <c>Line2d</c>.