HostMgd.EditorInput.PromptStringOptions
Класс, обеспечивающий необязательные параметры приглашения
для ввода строки.

HostMgd.EditorInput.PromptStringOptions.AllowSpaces
Возвращает или устанавливает признак разрешения наличия
пробелов в вводимой строке.

HostMgd.EditorInput.PromptStringOptions.DefaultValue
Возвращает или устанавливает значение по умолчанию.

HostMgd.EditorInput.PromptStringOptions.#ctor(System.String)
Конструктор.
message: Приглашающее сообщение

HostMgd.EditorInput.PromptStringOptions.UseDefaultValue
Устанавливает или возвращает признак возможности
использования значения по умолчанию.