Teigha.Geometry.Matrix2d.#ctor(array&lt;double&gt;)
Конструктор структуры <c>Matrix2d</c>.
Создает матрицу, элементы которой сформированы на основе данных из переданного массива.
data: Входной массив. Тип <c>double[]</c>.

Teigha.Geometry.Matrix2d.AlignCoordinateSystem(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Метод предоставляет матрицу, которая преобразует одну систему координат в другую.
Каждая из систем координат указывается точкой начала и двумя осями.
fromOrigin: Точка начала исходной системы координат. Тип <c>Point2d</c>.
fromE0: Ось <c>X</c> исходной системы координат. Тип <c>Vector2d</c>.
fromE1: Ось <c>Y</c> исходной системы координат. Тип <c>Vector2d</c>.
toOrigin: Точка начала целевой  системы координат. Тип <c>Point2d</c>.
toE0: Ось <c>X</c> целевой  системы координат. Тип <c>Vector2d</c>.
toE1: Ось <c>Y</c> целевой  системы координат. Тип <c>Vector2d</c>.
Returns: Возвращает матрицу геометрического преобразования.
Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2d.Displacement(Teigha.Geometry.Vector2d)
Метод формирует трансляционную часть матрицы преобразования на основе указанного вектора.
vector: Входной вектор переноса. Тип <c>Vector2d</c>.
Returns: Возвращает матрицу преобразования, трансляционная часть которой определяется вектором <c>vector</c>.
Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2d.Equals(Object)
Метод предназначен для проверки на равенство данного объекта и указанного объекта.
obj: Входной объект, с которым сравнивается данная матрица. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если <c>obj</c> не является нулевым, и каждый столбец данной матрицы равен соответствующему столбцу матрицы <c>obj</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2d.GetDeterminant
Метод предоставляет детерминант данной матрицы.
Returns: Возвращает детерминант данной матрицы.
Тип <c>double</c>.

Teigha.Geometry.Matrix2d.GetHashCode
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает хеш-код объекта.
Тип <c>int</c>.

Teigha.Geometry.Matrix2d.GetScale
Метод вычисляет масштабный коэффициент этой матрицы.
Returns: Возвращает масштабный коэффициент матрицы.
Тип <c>double</c>.

Teigha.Geometry.Matrix2d.Inverse
Метод предоставляет матрицу, которая является обратной для данной матрицы.
Returns: Возвращает обратную матрицу.
Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2d.IsConformal(Teigha.Geometry.Matrix2dInfo)
Метод позволяет проверить, представляет ли данная матрица конформное линейное преобразование.
Векторы в столбцах конформной матрицы равны по длине и взаимно ортогональны.
info: Выходной объект типа <c>Matrix2dInfo</c>, который предоставляет информацию о масштабном коэффициенте, угле поворота, наличии зеркального отражения и направлении зеркального отражения.
Returns: Возвращает <c>true</c>, если геометрическое преобразование, описываемое матрицей, является конформным, т.е. векторы в столбцах матрицы равны по длине и ортогональны друг другу.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2d.IsEqualTo(Teigha.Geometry.Matrix2d)
Метод реализует проверку равенства двух матриц с использованием точности по умолчанию.
a: Входная матрица, которая сравнивается с данной. Тип <c>Matrix2d</c>.
Returns: Возвращает <c>true</c>, если в пределах используемой точности каждый элемент данной матрицы равен соответствующему элементу матрицы <c>a</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2d.IsEqualTo(Teigha.Geometry.Matrix2d,Teigha.Geometry.Tolerance)
Метод реализует проверку равенства двух матриц с использованием указанной точности.
a: Входная матрица, которая сравнивается с данной. Тип <c>Matrix2d</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах заданной точности каждый элемент данной матрицы равен соответствующему элементу матрицы <c>a</c>, соответственно, обе матрицы можно считать равными.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2d.IsScaledOrtho
Метод позволяет проверить, являются ли векторы в линейной части данной матрицы ортогональными друг другу в пределах точности по умолчанию.
Returns: Возвращает <c>true</c>, если с указанной точностью векторы в линейной части данной матрицы можно считать ортогональными друг другу.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2d.IsScaledOrtho(Teigha.Geometry.Tolerance)
Метод позволяет проверить, являются ли векторы в линейной части данной матрицы ортогональными друг другу в пределах указанной точности.
tolerance: Входная точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если с указанной точностью <c>tolerance</c> векторы в линейной части данной матрицы можно считать ортогональными друг другу. В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2d.IsSingular
Метод позволяет проверить, является ли данная матрица сингулярной.
Returns: Возвращает <c>true</c>, если в пределах используемой точности хотя бы один из направляющих векторов координатных осей, возвращаемых свойством <c>Matrix2d.CoordinateSystem2d</c>, является нулевым, или эти векторы параллельны друг другу.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2d.IsSingular(Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данная матрица сингулярной в пределах заданной точности.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах используемой точности хотя бы один из направляющих векторов координатных осей, возвращаемых свойством <c>Matrix2d.CoordinateSystem2d</c>, является нулевым, или эти векторы параллельны друг другу.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2d.IsUniscaledOrtho
Метод позволяет проверить, являются ли векторы в линейной части матрицы равными по длине и перпендикулярными друг другу.
Returns: Возвращает <c>true</c>, если в пределах используемой точности векторы в линейной части матрицы можно считать равными по длине и перпендикулярными друг другу. В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2d.IsUniscaledOrtho(Teigha.Geometry.Tolerance)
Метод позволяет проверить, являются ли векторы в линейной части матрицы равными по длине и перпендикулярными друг другу в пределах заданной точности.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах точности <c>tolerance</c> векторы в линейной части матрицы можно считать равными по длине и перпендикулярными друг другу. В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2d.Mirroring(Teigha.Geometry.Point2d)
Метод предоставляет матрицу, которая описывает зеркальное отражение относительно указанной точки.
point: Точка зеркального отражения. Тип <c>Point2d</c>.
Returns: Возвращает матрицу зеркального отражения относительно точки <c>point</c>.
Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2d.Mirroring(Teigha.Geometry.Line2d)
Метод предоставляет матрицу, которая описывает зеркальное отражение относительно указанной оси.
line: Ось зеркального отражения. Тип <c>Line2d</c>.
Returns: Возвращает матрицу зеркального отражения относительно оси <c>line</c>.
Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2d.Multiply(Teigha.Geometry.Matrix2d)
Метод реализует левое умножение данной матрицы на указанную матрицу, являющуюся левым множителем.
matrix: Входная матрица, которая является левым множителем в матричном произведении. Тип <c>Matrix2d</c>.
Returns: Возвращает результат левого произведения данной матрицы на матрицу <c>matrix</c>.
Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2d.PostMultiplyBy(Teigha.Geometry.Matrix2d)
Метод реализует правое умножение данной матрицы на указанную матрицу, являющуюся правым множителем.
rightSide: Входная матрица, которая в произведении является правым множителем. Тип <c>Matrix2d</c>.
Returns: Возвращает результат правого произведения данной матрицы на матрицу <c>rightSide</c>.
Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2d.PreMultiplyBy(Teigha.Geometry.Matrix2d)
Метод реализует левое умножение данной матрицы на указанную матрицу, являющуюся левым множителем.
leftSide: Входная матрица, которая в произведении является левым множителем. Тип <c>Matrix2d</c>.
Returns: Возвращает результат левого произведения данной матрицы на матрицу <c>leftSide</c>.
Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2d.Rotation(System.Double,Teigha.Geometry.Point2d)
Метод предоставляет матрицу, которая реализует вращение вокруг указанной точки на заданный угол.
angle: Входное значение угла вращения.     Тип <c>double</c>.
center: Входные координаты центра вращения. Тип <c>Point2d</c>.
Returns: Возвращает матрицу преобразования, которая описывает вращение вокруг точки <c>center</c> на угол <c>angle</c>.
Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2d.Scaling(System.Double,Teigha.Geometry.Point2d)
Метод предоставляет матрицу равномерного масштабирования относительно указанной точки с заданным коэффициентом масштабирования.
scaleAll: Масштабирующий множитель. Тип <c>double</c>.
center: Точка, относительно которой выполняется масштабирование. Тип <c>Point2d</c>.
Returns: Возвращает матрицу геометрического преобразования для равномерного масштабирования относительно точки <c>center</c> с коэффициентом масштабирования <c>scaleAll</c>.  Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2d.ToArray
Метод позволяет получить данную матрицу в виде массива из девяти элементов.
Запись элементов матрицы в массив выполняется построчно.
Returns: Возвращает массив из девяти элементов, в котором построчно сохранены элементы матрицы.
Тип <c>double[]</c>.

Teigha.Geometry.Matrix2d.ToString
Метод позволяет получить эквивалентное строковое представление данной матрицы.
Returns: Возвращает эквивалентное строковое представление данной матрицы.
Тип <c>String</c>.

Teigha.Geometry.Matrix2d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данной матрицы с учетом заданных языковых и региональных настроек.
provider: Входной провайдер языковых и региональных настроек. Тип <c>IFormatProvider</c>.
Returns: Возвращает эквивалентное строковое представление данной матрицы с учетом заданных языковых и региональных настроек.
Тип <c>String</c>.

Teigha.Geometry.Matrix2d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данной матрицы в заданном формате и с учетом указанных языковых и региональных настроек.
format: Предписанный формат строкового представления. Тип <c>String</c>.
provider: Входной провайдер языковых и региональных настроек. Тип <c>IFormatProvider</c>.
Returns: Возвращает эквивалентное строковое представление данной матрицы, которое учитывает заданный формат и предписанные языковые и региональные настройки. Тип <c>String</c>.

Teigha.Geometry.Matrix2d.Transpose
Метод выполняет транспонирование данной матрицы.
Returns: Возвращает транспонированную матрицу.
Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2d.CoordinateSystem2d
Свойство <c>CoordinateSystem2d</c> представляет начало и оси системы координат, в которую данная матрица отображает стандартную систему координат с началом (0,0) и осями (1,0) и (0,1).
Returns: Возвращает объект <c>Geometry.CoordinateSystem2d</c>, который представляет начало и оси системы координат.

Teigha.Geometry.Matrix2d.ElementAt
Свойство <c>ElementAt</c> представляет элементы матрицы по их индексам.
i: Номер строки  элемента. Тип <c>int</c>.
j: Номер столбца элемента. Тип <c>int</c>.
Returns: Возвращает элемент матрицы в строке <c>i</c> и столбце <c>j</c>.
Тип <c>double</c>.

Teigha.Geometry.Matrix2d.Translation
Свойство <c>Translation</c> представляет трансляционную часть данной матрицы преобразования.
Returns: Возвращает вектор переноса, который представлен трансляционной частью матрицы.
Тип <c>Vector2d</c>.