Teigha.BoundaryRepresentation.BrepEdgeCollection
Класс <c>BrepEdgeCollection</c> представляет набор ребер, соответствующих граничному представлению.

Teigha.BoundaryRepresentation.BrepEdgeCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции рёбер.
Returns: Возвращает перечислитель коллекции рёбер.
Тип <c>BrepEdgeEnumerator</c>.