Teigha.DatabaseServices.ResultBuffer
Этот класс реализует объект буфера результатов, который представляет собой структуру для хранения и передачи размеченных данных всех основных типов между разнообразными объектами с использованием различных технологий.

Teigha.DatabaseServices.ResultBuffer.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.ResultBuffer.#ctor(... array&lt;TypedValue&gt;)
Конструктор. Создает буфер с заданным массивом типизированных значений.
values: Массив типизированных значений TypedValue[].

Teigha.DatabaseServices.ResultBuffer.Add(Object)
Добавляет значение в конец списка этого буфера результатов.
value: Добавляемый объект, тип Object.

Teigha.DatabaseServices.ResultBuffer.Add(Teigha.DatabaseServices.TypedValue)
Добавляет значение в конец списка этого буфера результатов.
value: Добавляемый объект, тип TypedValue.

Teigha.DatabaseServices.ResultBuffer.AsArray
Этот метод возвращает массив типизированных значений, представляющих узлы в цепочке буфера результатов.
Returns: Возвращает массив тпизированных значений TypedValue[].

Teigha.DatabaseServices.ResultBuffer.Create(IntPtr,System.Boolean)
Этот метод создает управляемый объект ResultBuffer на основе объекта, переданного неуправляемым указателем buffer.
buffer: Указатель типа IntPtr.
autoDelete: Передать значение true, если указатель buffer должен быть удален после создания ResultBuffer и false в противном случае. Тип bool.
Returns: Возвращает экземпляр ResultBuffer.

Teigha.DatabaseServices.ResultBuffer.Equals(Object)
Метод предназначен для сравнения на идентичность с объектом obj, который передан в аргументе.
Возвращает значение true, если объекты идентичны.
obj: Объект, с которым выполняется сравнение.  Тип Object.
Returns: Возвращает true в случае, если оба объекта идентичны, и false в противном случае.

Teigha.DatabaseServices.ResultBuffer.GetEnumerator
Метод предназначен для получения объекта перечислителя буфера результатов ResultBuffer.
Returns: Возвращает объект перечислителя ResultBufferEnumerator.

Teigha.DatabaseServices.ResultBuffer.GetHashCode
Метод предназначен для получения хэш-кода этого объекта.
Returns: Возвращает хэш-код этого объекта, тип int.

Teigha.DatabaseServices.ResultBuffer.ToString
Метод предназначен для получения эквивалентного строкового представления этого объекта.
Returns: Возвращает эквивалентное строковое представление этого объекта, тип String.

Teigha.DatabaseServices.ResultBuffer.ToString(IFormatProvider)
Метод предназначен для получения эквивалентного строкового представления этого объекта с использованием языковых и региональных настроек, определяемых заданным провайдером.
provider: Провайдер языковых и региональных настроек, тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление этого объекта, тип String.

Teigha.DatabaseServices.ResultBuffer.ToString(String,IFormatProvider)
Метод предназначен для получения эквивалентного строкового представления этого объекта в указанном формате и с использованием языковых и региональных настроек, определяемых заданным провайдером.
format: Формат строкового представления этого объекта, тип String.
provider: Провайдер языковых и региональных настроек, тип IFormatProvider.
Returns: Возвращает эквивалентное строковое представление этого объекта, тип String.