Teigha.DatabaseServices.UnderlayLayer
Класс <c>UnderlayLayer</c> представляет слои подложки на чертеже.

Teigha.DatabaseServices.UnderlayLayer.#ctor
Конструктор по умолчанию класса <c>UnderlayLayer</c>.

Teigha.DatabaseServices.UnderlayLayer.Name
Свойство <c>Name</c> представляет имя данного слоя подложки.
Returns: Возвращает имя слоя. Тип <c>String</c>.

Teigha.DatabaseServices.UnderlayLayer.State
Свойство <c>State</c> представляет состояние блокировки данного слоя подложки.
Returns: Возвращает состояние слоя подложки. Перечисление <c>UnderlayLayerState</c>.