Teigha.DatabaseServices.ObjectId
ObjectId хранит единственный неизменный в пределах сеанса локатор для резидентного объекта базы данных.

Teigha.DatabaseServices.ObjectId.#ctor(IntPtr)
Конструктор создает экземпляр ObjectId на основе целочисленного указателя в старом формате.
oldId: Исходный указатель, тип IntPtr.
Returns: Возвращает новый экземпляр ObjectId.

Teigha.DatabaseServices.ObjectId.Compare(Teigha.DatabaseServices.ObjectId)
Метод сравнивает идентификатор данного объекта с указанным ObjectId и возвращает true, если они совпадают.
value1: ObjectId, с которым выполняется сравнение.
Returns: Возвращает true в случае совпадения идентификаторов, и false в противном случае.

Teigha.DatabaseServices.ObjectId.ConvertToRedirectedId
Метод преобразует ObjectId данного объекта, если он был перенаправлен из другой базы данных, в действительный идентификатор объекта в другой базе данных.
Returns: Возвращает ObjectId.

Teigha.DatabaseServices.ObjectId.Equals(Object)
Возвращает true, если данный объект равен объекту в аргументе.
obj: Объект для сравнения, тип Object.
Returns: Возвращает true, если данный объект равен объекту в аргументе, иначе - false.

Teigha.DatabaseServices.ObjectId.GetHashCode
Возвращает хэш-код для данного объекта.
Returns: Возвращает целочисленный хэш-код, тип int.

Teigha.DatabaseServices.ObjectId.GetObject(Teigha.DatabaseServices.OpenMode)
Возвращает объект, связанный с данным ObjectId.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
Returns: Возвращает экземпляр класса DBObject
Example
<p> В примере приведен фрагмент кода, демонстрирующий открытие объекта из базы данных.
По завершении работы с объектом, открытым таким образом, его необходимо принудительно удалить из памяти,
чтобы избежать ошибок в работе платформы и вашего приложения.</p>
<pre>С#</pre>
<code lang="c#">
using Teigha.DatabaseServices;
using HostMgd.ApplicationServices;
public partial class Commands
{
private void WorkWithoutTransactions()
{
// Открываем таблицу блоков без транзакции
BlockTable blockTable = Application.DocumentManager.MdiActiveDocument.Database.BlockTableId.GetObject(OpenMode.ForRead) as BlockTable;
// действия с таблицей блоков
// Принудительно удаляем объект из памяти по завершении работы с ним
blockTable.Dispose();
}
}
</code>

Teigha.DatabaseServices.ObjectId.GetObject(Teigha.DatabaseServices.OpenMode,System.Boolean)
Возвращает объект, связанный с данным ObjectId.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
openErased: Задать true, если следует получать ID удаленных объектов.
Returns: Возвращает экземпляр класса DBObject.

Teigha.DatabaseServices.ObjectId.GetObject(Teigha.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Возвращает объект, связанный с данным ObjectId.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
openErased: Задать true, если следует получать ID удаленных объектов. Тип bool.
forceOpenOnLockedLayer: Задать true, если следует открывать заблокированные слои. Тип bool.
Returns: Возвращает экземпляр класса DBObject

Teigha.DatabaseServices.ObjectId.Open(Teigha.DatabaseServices.OpenMode)
Метод открывает объект в указанном режиме доступа.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
Returns: Возвращает экземпляр класса DBObject

Teigha.DatabaseServices.ObjectId.Open(Teigha.DatabaseServices.OpenMode,System.Boolean)
Метод открывает объект, связанный с данным ObjectId, в указанном режиме доступа.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
openErased: Задать true, если следует открывать удаленный объект. Тип bool.
Returns: Возвращает экземпляр класса DBObject

Teigha.DatabaseServices.ObjectId.Open(Teigha.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Метод открывает объект, связанный с данным ObjectId, в указанном режиме доступа.
mode: Режим обращения к объекту из перечисления Teigha.DatabaseServices.OpenMode.
openErased: Задать true, если следует открывать удаленный объект. Тип bool.
forceOpenOnLockedLayer: Задать true, если следует открывать заблокированные слои. Тип bool.
Returns: Возвращает экземпляр класса DBObject

Teigha.DatabaseServices.ObjectId.ToString
Возвращает эквивалентное строковое представление объекта.
Returns: Возвращает тип String.

Teigha.DatabaseServices.ObjectId.ToString(IFormatProvider)
Возвращает эквивалентное строковое представление данного объекта в формате, который учитывает языковые и региональные настройки, определенные указанным поставщиком IFormatProvider.
provider: Поставщик IFormatProvider языковых и региональных настроек.
Returns: Возвращает тип String.

Teigha.DatabaseServices.ObjectId.Database
Свойство предоставляет доступ к базе данных, в которой ID объекта является резидентным.
Если идентификатор объекта равен NULL, то свойство возвращает NULL.
Returns: Возвращает объект типа Teigha.DatabaseServices.Database.

Teigha.DatabaseServices.ObjectId.Handle
Свойство предоставляет доступ к дескриптору объекта с данным ObjectId.
Returns: Возвращает тип Teigha.DatabaseServices.Handle.

Teigha.DatabaseServices.ObjectId.IsEffectivelyErased
Свойство определяет, удален или нет объект, связанный с этим ObjectId, а также не удален ли кто-либо из владельцев в иерархии владения этим объектом.
Returns: Возвращает значение true, если объект, связанный с этим ObjectId, удален, или если удален кто-либо из владельцев в иерархии владения этим объектом.

Teigha.DatabaseServices.ObjectId.IsErased
Свойство возвращает true, если объект, связанный с данным ObjectId, удален.
Returns: Возвращает true, если объект, связанный с данным ObjectId, удален. В противном случае возвращает false.

Teigha.DatabaseServices.ObjectId.IsNull
Свойство возвращает true, если ObjectId данного объекта является нулевым.
Returns: Возвращает true, если ObjectId данного объекта имеет значение Null, иначе - false.

Teigha.DatabaseServices.ObjectId.IsResident
Свойство возвращает значение true, если объект, связанный с этим ObjectId, находится в памяти.
Returns: Возвращает значение true, если объект, связанный с этим ObjectId, находится в памяти. В противном случае возвращает false.

Teigha.DatabaseServices.ObjectId.IsValid
Свойство определяет, связан ли ObjectId с базой данных, которая в данный момент загружена в память.
Если ObjectId связан с базой данных, которая больше недоступна (другими словами, была удалена), то возвращается значение false.
Returns: Возвращает значение true, если этот ObjectId связан с базой данных, которая в данный момент находится в памяти. Если ObjectId связан с базой данных, которая больше недоступна (другими словами, была удалена), то возвращается значение false.

Teigha.DatabaseServices.ObjectId.NonForwardedHandle
Если данный ObjectId находится в базе данных внешних ссылок, а связанный с ним объект, был перенаправлен в главную базу данных, то значением этого свойства является дескриптор (handle) в базе данных внешних ссылок.
Если объект, связанный с этим ObjectId, не из базы данных внешних ссылок или не перенаправлен, то это свойство аналогично свойству ObjectId.Handle.
Returns: Возвращает дескриптор Teigha.DatabaseServices.Handle.

Teigha.DatabaseServices.ObjectId.Null
Свойство обеспечивает доступ к нулевому ObjectId.  Данное свойство позволяет использовать более компактные выражения и помогает компилятору генерировать более эффективный код (если он знает, что ObjectId нулевой, то нет необходимости искать объект Null).
Returns: Возвращает тип ObjectId.

Teigha.DatabaseServices.ObjectId.ObjectClass
Свойство предоставляет доступ к RXClass объекта, который ассоциирован с ObjectId, таким образом гарантируя, что результат может быть безопасно разыменован и корректно сравнен с любым классом, производным от DBObject.
Returns: Возвращает тип RXClass.

Teigha.DatabaseServices.ObjectId.OldId
Свойство устарело, вместо него следует использовать свойство OldIdPtr.
Returns: Возвращает массив из двух элементов типа long.

Teigha.DatabaseServices.ObjectId.OldIdPtr
Свойство предоставляет доступ к значению ObjectId в старом формате - как к длинному целому (он представляет собой массив из двух long, первый элемент которого содержит то же значение, что и ObjectId).
Returns: Возвращает IntPtr.

Teigha.DatabaseServices.ObjectId.OriginalDatabase
Если этот ObjectId находится в базе данных внешних ссылок (xref database), и связанный с ним объект был перенаправлен в главную базу данных, то данное свойство возвращает указатель на базу данных внешних ссылок.
Если связанный с этим ObjectId объект не из базы данных внешних ссылок или не был перенаправлен, то значение этого свойства совпадает с ObjectId.Database.
Returns: Возвращает объект типа DatabaseServices.Database.