HostMgd.EditorInput.PromptNestedEntityResult
Класс, содержащий результаты ввода вложенного геометрического
объекта после приглашения.

HostMgd.EditorInput.PromptNestedEntityResult.ToString(IFormatProvider)
Возвращает строковое представление данного объекта в
соответствии с заданным форматом, зависящим от локализации.
provider: Формат, зависящей от локализации

HostMgd.EditorInput.PromptNestedEntityResult.Transform
Возвращает матрицу преобрзования, которая применяется к
выбранному объекту его контейнерами.