Teigha.DatabaseServices.Solid
Класс <c>Solid</c> представляет в базе данных двумерный (плоский) твердотельный объект.

Teigha.DatabaseServices.Solid.#ctor
Конструктор по умолчанию класса <c>Solid</c>.

Teigha.DatabaseServices.Solid.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса <c>Solid</c>. Создает 2D-тело по трем заданным точкам.
point1: Первая точка. Тип <c>Point3d</c>.
point2: Вторая точка. Тип <c>Point3d</c>.
point3: Третья точка. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Solid.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса <c>Solid</c>. Создает 2D-тело нулевой толщины по четырем заданным точкам.
point1: Первая точка.    Тип <c>Point3d</c>.
point2: Вторая точка.    Тип <c>Point3d</c>.
point3: Третья точка.    Тип <c>Point3d</c>.
point4: Четвертая точка. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Solid.GetPointAt(short)
Метод предоставляет точку данного тела с указанным индексом.
index: Индекс точки данного объекта. Тип <c>short</c>. Может принимать значения 0, 1, 2 или 3.
Returns: Возвращает координаты точки с индексом <c>index</c> (в мировой системе координат, WCS). Тип <c>Point3d</c>.

Teigha.DatabaseServices.Solid.SetPointAt(short,Teigha.Geometry.Point3d)
Метод позволяет задать новые координаты для точки с указанным индексом.
index: Индекс точки, у которой изменяется положение в пространстве. Тип <c>short</c>. Допустимые значения 0, 1, 2 или 3.
pointValue: Новые координаты точки (в мировой системе координат, WCS). Тип <c>Point3d</c>.

Teigha.DatabaseServices.Solid.Normal
Свойство <c>Normal</c> представляет вектор нормали плоскости данного плоского твердого объекта.
Returns: Возвращает вектор нормали плоскости данного плоского твердого объекта.
Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Solid.Thickness
Свойство <c>Thickness</c> представляет толщину данного 2D твердого тела (в единицах чертежа).
Returns: Возвращает толщину данного объекта в направлении вектора нормали. Тип <c>double</c>.