Teigha.DatabaseServices.TableHitTestInfo.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Returns: Возвращает строковое представление данного объекта. Тип <c>String</c>.

Teigha.DatabaseServices.TableHitTestInfo.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта, которое учитывает указанные языковые и региональные настройки.
provider: Провайдер языковых и региональных настроек.
Returns: Возвращает строковое представление данного объекта, учитывающее предписанные языковые и региональные настройки. Тип <c>String</c>. Строка содержит индексы строки и столбца таблицы.

Teigha.DatabaseServices.TableHitTestInfo.Column
Свойство <c>Column</c> представляет индекс столбца таблицы.
Returns: Возвращает индекс столбца таблицы. Тип <c>int</c>.

Teigha.DatabaseServices.TableHitTestInfo.Row
Свойство <c>Row</c> представляет индекс строки таблицы.
Returns: Возвращает индекс строки таблицы. Тип <c>int</c>.

Teigha.DatabaseServices.TableHitTestInfo.Type
Свойство <c>Type</c> представляет тип результата проверки попадания в таблицу.
Returns: Возвращает результат проверки попадания в таблицу. Значение из перечисления <c>TableHitTestType</c>.