Teigha.DatabaseServices.VertexRef
Класс <c>VertexRef</c> представляет ссылку на вершину объекта чертежа.

Teigha.DatabaseServices.VertexRef.#ctor
Конструктор по умолчанию класса <c>VertexRef</c>.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.DatabaseServices.FullSubentityPath)
Конструктор класса <c>VertexRef</c>. Создает ссылку на вершину объекта, для которого задан полный путь к подобъекту.
path: Полный путь к подобъекту. Тип <c>FullSubentityPath</c>.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.Geometry.Point3d)
Конструктор класса <c>VertexRef</c>.
Создает ссылку на вершину, расположенную в указанной точке.
point: Входная точка. Тип <c>Point3d</c>.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.DatabaseServices.CompoundObjectId)
Конструктор класса <c>VertexRef</c>.
Создает ссылку на вершину на основе указанного составного объекта.
compoundObjectId: Входной идентификатор составного объекта.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.SubentityId)
Конструктор класса <c>VertexRef</c>.
Создает ссылку на вершину на основе подобъекта указанного составного объекта.
compoundObjectId: Входной идентификатор составного объекта. Тип <c>CompoundObjectId</c>.
subentId: Входной идентификатор подобъекта. Тип <c>SubentityId</c>.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.SubentityId,Teigha.Geometry.Point3d)
Конструктор класса <c>VertexRef</c>.
Создает ссылку на вершину в заданной точке конкретного подобъекта заданного составного объекта.
compoundObjectId: Входной идентификатор составного объекта. Тип <c>CompoundObjectId</c>.
subentId: Входной идентификатор подобъекта. Тип <c>SubentityId</c>.
point: Входная точка. Тип <c>Point3d</c>.

Teigha.DatabaseServices.VertexRef.#ctor(Teigha.DatabaseServices.Entity)
Конструктор класса <c>VertexRef</c>.
Создает ссылку на вершину на основе указанного объекта чертежа.
entity: Входной объект чертежа, 3D-точка. Тип <c>Teigha.DatabaseServices.Entity</c>.

Teigha.DatabaseServices.VertexRef.Point
Свойство <c>Point</c> представляет координатную точку данной ссылки на вершину.
Returns: Возвращает координатную 3D-точку вершины. Тип <c>Point3d</c>.