Teigha.Geometry.CubicSplineCurve3d
Класс <c>CubicSplineCurve3d</c> представляет интерполяционный кубический сплайн в трехмерном пространстве.

Teigha.Geometry.CubicSplineCurve3d.#ctor
Конструктор по умолчанию класса <c>CubicSplineCurve3d</c>.
Инициализирует кубический сплайн с пустым списком точек.

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.Curve3d,System.Double)
Конструктор класса <c>CubicSplineCurve3d</c>.
Создает кубический сплайн, интерполирующий переданную кривую с заданной точностью интерполяции.
curve: Кривая, для которой следует создать интерполирующий ее кубический сплайн. Тип <c>Curve3d</c>.
epsilon: Заданная точность интерполяции.  Тип <c>double</c>.

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection,System.Boolean)
Конструктор класса <c>CubicSplineCurve3d</c>.
Создает экземпляр класса с указанными определяющими точками, узловым вектором и первыми производными в определяющих точках.
knots: Входной узловой вектор.  Тип <c>KnotCollection</c>.
fitPoints: Входная коллекция определяющих точек.  Тип <c>Point3dCollection</c>.
firstDerivatives: Входная коллекция векторов первых производных.  Тип <c>Vector3dCollection</c>.
periodic: Флаг, указывающий, что сплайн должен быть периодическим (замкнутым). Тип <c>bool</c>.

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.Point3dCollection)
Конструктор класса <c>CubicSplineCurve3d</c>.
Создает интерполяционный кубический сплайн, проходящий через указанные определяющие точки.
points: Входной массив определяющих точек сплайна.

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Tolerance)
Конструктор класса <c>CubicSplineCurve3d</c>.
Создает интерполяционный кубический сплайн, с заданной точностью проходящий через указанные определяющие точки.
points: Входной массив определяющих точек сплайна.  Тип <c>Point3dCollection</c>.
tolerance: Заданная точность интерполяции.  Тип <c>Tolerance</c>.

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса <c>CubicSplineCurve3d</c>.
Создает интерполяционный кубический сплайн, проходящий через заданные определяющие точки, и с указанными векторами первых производных в начале и в конце сплайна.
points: Входной массив определяющих точек сплайна. Тип <c>Point3dCollection</c>.
startDerivative: Первая производная в начальной точке. Тип <c>Vector3d</c>.
endDerivative: Первая производная в конечной точке. Тип <c>Vector3d</c>.

Teigha.Geometry.CubicSplineCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Конструктор класса <c>CubicSplineCurve3d</c>.
Создает интерполяционный кубический сплайн, проходящий предписанной точностью через заданные определяющие точки, и с указанными векторами первых производных в начале и в конце сплайна.
points: Входной массив определяющих точек сплайна. Тип <c>Point3dCollection</c>.
startDerivative: Первая производная в начальной точке. Тип <c>Vector3d</c>.
endDerivative: Первая производная в конечной точке. Тип <c>Vector3d</c>.
tolerance: Заданная точность интерполяции. Тип <c>Tolerance</c>.

Teigha.Geometry.CubicSplineCurve3d.Create(IntPtr,System.Boolean)
Метод создает объект <c>CubicSplineCurve3d</c> на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, из которого создается данный объект.  Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный трехмерный кубический сплайн.
Тип <c>CubicSplineCurve3d</c>.

Teigha.Geometry.CubicSplineCurve3d.FirstDerivativeAt(System.Int32)
Метод позволяет получить вектор первой производной в определяющей точке с заданным индексом.
i: Индекс определяющей точки, в которой требуется вычислить вектор первой производной.
Returns: Возвращает вектор первой производной в указанной определяющей точке сплайна.
Тип <c>Vector3d</c>.

Teigha.Geometry.CubicSplineCurve3d.FitPointAt(System.Int32)
Метод позволяет получить определяющую точку этого сплайна с заданным индексом.
i: Индекс искомой определяющей точки данного сплайна.
Returns: Возвращает определяющую точку сплайна с индексом <c>i</c>.
Тип <c>Point3d</c>.

Teigha.Geometry.CubicSplineCurve3d.SetFirstDerivativeAt(System.Int32,Teigha.Geometry.Vector3d)
Метод позволяет переопределить вектор первой производной в определяющей точке с указанным индексом.
i: Индекс определяющей точки.  Тип <c>int</c>.
derivative: Новый вектор первой производной в указанной определяющей точке. Тип <c>Vector3d</c>.

Teigha.Geometry.CubicSplineCurve3d.SetFitPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет переопределить в этом сплайне определяющую точку с указанным индексом.
i: Индекс определяющей точки.  Тип <c>int</c>.
point: Новые координаты определяющей точки с индексом <c>i</c>. Тип <c>Point3d</c>.

Teigha.Geometry.CubicSplineCurve3d.NumberOfFitPoints
Свойство <c>NumberOfFitPoints</c> представляет количество определяющих точек данного сплайна.
Returns: Возвращает количество определяющих точек сплайна. Тип <c>int</c>.