Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator
Этот класс реализует перечислитель в коллекции свойств динамического блока DynamicBlockReferencePropertyCollection.

Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.MoveNext
Этот метод перемещает указатель на следующий элемент или на маркер конца данной коллекции, если текущий элемент находится в конце коллекции.
Returns: Возвращает <c>true</c>, если указатель перемещен на следующий элемент коллекции.
Если указатель оказался на маркере конца коллекции, возвращает <c>false</c>.

Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.Reset
Этот метод сбрасывает позицию указателя перечислителя в начальное положение.

Teigha.DatabaseServices.DynamicBlockReferencePropertyCollectionEnumerator.Current
Свойство Current возвращает объект коллекции свойств динамического блока, на который указывает указатель.
Returns: Возвращает текущий объект коллекции. Тип <c>Object</c>.