Teigha.DatabaseServices.PlaceHolder
Данный класс предоставляет способ создания экземпляров заглушек для объектов DBObject.
Класс не имеет собственных данных и не реализует никаких новых методов.

Teigha.DatabaseServices.PlaceHolder.#ctor
Конструктор по умолчанию.