Teigha.BoundaryRepresentation.VertexEdgeEnumerator
Класс <c>VertexEdgeEnumerator</c> представляет перечислитель ребер, связанных с вершиной.

Teigha.BoundaryRepresentation.VertexEdgeEnumerator.Current
Свойство <c>Current</c> предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.  Тип <c>Edge</c>.