Teigha.DatabaseServices.DBDictionary
DBDictionary — это объектный словарь, хранящийся в базе данных и поддерживающий соответствие (мэппинг) текстовых строк и объектов базы данных.

Teigha.DatabaseServices.DBDictionary.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.DBDictionary.Contains(DatabaseServices.ObjectId)
Метод определяет, присутствует ли в словаре запись с указанным <c>ObjectId</c>.
objId: Искомый объект с указанным <c>ObjectId</c> .
Returns: Возвращает true, если объект с указанным <c>ObjectId</c> присутствует в словаре, и false в противном случае.

Teigha.DatabaseServices.DBDictionary.Contains(String)
Возвращает true, если объект с указанным ключом присутствует в словаре.
entryName: Имя ключа для искомого объекта.
Returns: Возвращает true, если объект с указанным <c>ObjectId</c> присутствует в словаре, и false в противном случае.

Teigha.DatabaseServices.DBDictionary.Copy
Метод создает копию словаря.
Returns: Возвращает копию данного словаря в виде экземпляра класса DBDictionary.

Teigha.DatabaseServices.DBDictionary.CopyTo(array&lt;DBDictionaryEntry&gt;,System.Int32)
Копирует в данный словарь объекты из массива, начиная с указанного индекса.
array: Массив объектов DBDictionaryEntry, из которого копируются объекты.
index: Индекс элемента массива, начиная с которого копируются объекты.

Teigha.DatabaseServices.DBDictionary.GetAt(String)
Метод предназначен для поиска в словаре записи с заданным ключом.
entryName: Строка с именем ключа искомой записи.
Returns: Возвращает ObjectId искомой записи.

Teigha.DatabaseServices.DBDictionary.GetEnumerator
Метод создает новый перечислитель.
Returns: Метод возвращает новый перечислитель типа DbDictionaryEnumerator.

Teigha.DatabaseServices.DBDictionary.NameAt(DatabaseServices.ObjectId)
Метод ищет в словаре запись с заданным ObjectId и в случае успеха возвращает имя ключа найденной записи.
objId: Идентификатор DObjectId искомого объекта.
Returns: В случае успеха возвращает имя ключа найденной записи.  В противном случае возвращает пустую строку.

Teigha.DatabaseServices.DBDictionary.Remove(DatabaseServices.ObjectId)
Метод удаляет из словаря запись c заданным идентификатором объекта.
objId: Идентификатор ObjectId удаляемого объекта.

Teigha.DatabaseServices.DBDictionary.Remove(String)
Метод удаляет из словаря запись c заданным ключом.
key: Строка, представляющая ключ (имя) записи в словаре.
Returns: Возвращает идентификатор ObjectId удаляемого объекта.

Teigha.DatabaseServices.DBDictionary.SetAt(String,Teigha.DatabaseServices.DBObject)
Метод создает в словаре новую запись, заданную аргументом newValue, если ключ searchKey в словаре отсутствует.
Если запись с ключом searchKey уже существует, то новая запись заменяет старую.
searchKey: Строка, представляющая имя ключа заменяемого объекта.
newValue: Новый объект типа DBObject для добавления в словарь.
Returns: Возвращается идентификатор objectId созданной записи.

Teigha.DatabaseServices.DBDictionary.SetName(String,String)
Метод выполняет переименование указанной записи.
oldName: Строка со старым ключом.
newName: Строка с новым ключом.

Teigha.DatabaseServices.DBDictionary.Count
Предоставляет доступ к  количеству записей в словаре.
Returns: Возвращает целое число, равное количеству записей в словаре.

Teigha.DatabaseServices.DBDictionary.IncludingErased
Предоставляет доступ ко всем записям словаря, включая стертые.
Returns: Возвращает словарь DBDictionary, содержащий все записи данного словаря, включая удаленные.

Teigha.DatabaseServices.DBDictionary.TreatElementsAsHard
Свойство определяет, защищает ли данный словарь свои элементы от удаления при очистке (purge).
Returns: Возвращает true, если словарь защищает свои элементы от удаления при очистке (purge).

Teigha.DatabaseServices.DBDictionary.Item
Это свойство находит запись в словаре по её ключу key и в случае успеха возвращает соответствующий ObjectId.
Returns: Возвращает ObjectId объекта чертежа.