Teigha.DatabaseServices.CompoundObjectId
Этот класс позволяет идентифицировать объект в базе данных, когда на объект ссылается вхождение блока BlockReference.

Teigha.DatabaseServices.CompoundObjectId.#ctor
Конструктор класса по умолчанию.

Teigha.DatabaseServices.CompoundObjectId.#ctor(Teigha.DatabaseServices.CompoundObjectId)
Конструктор класса CompoundObjectId, предназначенный для копирования объекта класса CompoundObjectId с использованием переданного идентификатора составного объекта.
A_0: Идентификатор копируемого составного объекта. Тип CompoundObjectId.

Teigha.DatabaseServices.CompoundObjectId.#ctor(Teigha.DatabaseServices.ObjectId)
Конструктор класса CompoundObjectId, предназначенный для создания идентификатора составного объекта с использованием переданного идентификатора объекта ObjectId.
id: Идентификатор исходного объекта, на который будет ссылаться новый объект CompoundObjectId. Тип ObjectId.

Teigha.DatabaseServices.CompoundObjectId.#ctor(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.Database)
Конструктор класса CompoundObjectId, предназначенный для создания идентификатора составного объекта на основе переданного идентификатора объекта в указанной базе данных.
id: Входной идентификатор объекта. Тип ObjectId.
hostDatabase: Входная база данных, которой принадлежит входной объект. Тип Database.

Teigha.DatabaseServices.CompoundObjectId.#ctor(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.Database)
Конструктор класса CompoundObjectId, предназначенный для создания идентификатора составного объекта на основе переданного идентификатора объекта ObjectId и пути вхождений блоков BlockReference в указанной базе данных.
id: Входной идентификатор объекта. Тип ObjectId.
path: Путь вхождений BlockReference, ведущий к указанному объекту. Тип ObjectIdCollection. Первый BlockReference в пути принадлежит базе данных хоста, второй BlockReference определяется из BlockTableRecord, на которую ссылается первый BlockReference, третий BlockReference — из BlockTableRecord, на которую ссылается второй BlockReference, и т.д.
hostDatabase: Входная база данных, которой принадлежит входной объект. Тип Database.

Teigha.DatabaseServices.CompoundObjectId.DwgInFields(Teigha.DatabaseServices.DwgFiler,System.Int32)
Метод предназначен для чтения данных этого объекта из файла .dwg.
filer: Входной DWG-файлер. Тип DwgFiler.
ownerVersion: Версия владельца. Тип int. Клиентский код должен передавать значение 0.

Teigha.DatabaseServices.CompoundObjectId.DwgOutFields(Teigha.DatabaseServices.DwgFiler,Teigha.DatabaseServices.Database)
Метод предназначен для записи данных этого объекта в файл .dwg.
filer: Входной DWG-файлер, в который производится запись данных. Тип DwgFiler.
hostDatabase: Главная база данных. Тип Database.

Teigha.DatabaseServices.CompoundObjectId.DxfInFields(Teigha.DatabaseServices.DxfFiler,Teigha.DatabaseServices.Database,System.Int32)
Метод предназначен для чтения данных этого объекта из файла .dxf.
filer: Входной объект DxfFiler, используемый для чтения данных.
hostDatabase: Главная база данных. Тип Database.
ownerVersion: Версия владельца. Тип int. Клиентский код должен передавать значение 0.

Teigha.DatabaseServices.CompoundObjectId.DxfOutFields(Teigha.DatabaseServices.DxfFiler,Teigha.DatabaseServices.Database)
Метод предназначен для записи данных этого объекта в файл .dxf.
filer: Входной DXF-файлер, в который производится запись данных. Тип DxfFiler.
hostDatabase: Главная база данных. Тип Database.

Teigha.DatabaseServices.CompoundObjectId.Equals(Object)
Метод предназначен для проверки совпадения объектов.
obj: Объект, который проверяется на совпадение. Тип Object.
Returns: Возвращает <c>true</c>, если объекты не являются нулевыми и совпадают. В противном случае возвращает <c>false</c>.
Notes

Teigha.DatabaseServices.CompoundObjectId.IsValid(System.Int32)
Метод предназначен для установления валидности идентификатора составного объекта при заданном уровне проверки.
validityCheckingLevel: Входной уровень проверки. Тип int.
Returns: Возвращает <c>true</c>, если объект при заданном уровне проверки считается валидным. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CompoundObjectId.NullId
Метод позволяет получить нулевой идентификатор составного объекта CompoundObjectId.
Returns: Возвращает нулевой идентификатор объекта CompoundObjectId.

Teigha.DatabaseServices.CompoundObjectId.Remap(Teigha.DatabaseServices.IdMapping)
Метод позволяет заново сопоставить все идентификаторы объектов, относящиеся к данному CompoundObjectId, используя указанный экземпляр класса IdMapping.
Returns: Возвращает <c>true</c>, если пересопоставление завершилось успешно.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CompoundObjectId.Set(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.Database)
Метод позволяет определить данный CompoundObjectId, используя входной идентификатор ObjectId из указанной базы данных.
id: Входной идентификатор объекта. Тип ObjectId.
hostDatabase: Главная база данных. Тип Database.

Teigha.DatabaseServices.CompoundObjectId.Set(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.Database)
Метод позволяет задать этот CompoundObjectId, используя входной идентификатор составного объекта из указанной базы данных.
compoundID: Идентификатор составного объекта. Тип CompoundObjectId.
hostDatabase: Главная база данных. Тип Database.

Teigha.DatabaseServices.CompoundObjectId.Set(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.Database)
Метод позволяет задать этот CompoundObjectId, используя входной идентификатор составного объекта CompoundObjectId и пути вхождений BlockReference в указанной базе данных.
id: Входной идентификатор объекта. Тип ObjectId.
path: Путь вхождений BlockRefrence, ведущий к входному объекту. Тип ObjectIdCollection.
hostDatabase: Входная база данных, которой принадлежит входной объект. Тип Database.

Teigha.DatabaseServices.CompoundObjectId.SetEmpty
Метод позволяет задать данный объект CompoundObjectId как пустой идентификатор составного объекта, не имеющий каких-либо данных.

Teigha.DatabaseServices.CompoundObjectId.SetFullPath(Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.Database)
Метод позволяет задать данный объект CompoundObjectId на базе объекта, который хранит путь вхождений блоков.
fullPath: Путь вхождений блоков с объектом конечного уровня в конце пути. Тип ObjectIdCollection.
hostDatabase: Главная база данных. Тип Database.

Teigha.DatabaseServices.CompoundObjectId.FullPath
Свойство предоставляет полный путь, т.е.  путь вхождений BlockReference, концом которого является идентификатор ObjectId.
Returns: Возвращает полный путь вхождений BlockReference. Тип ObjectIdCollection.

Teigha.DatabaseServices.CompoundObjectId.IsEmpty
Свойство позволяет выяснить, содержит ли данные этот объект CompoundObjectId.
Returns: Возвращает <c>true</c>, если этот объект является пустым, т.е. не содержит данных.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CompoundObjectId.IsExternal
Свойство позволяет проверить, является ли объект CompoundObjectId внешней ссылкой.
Returns: Возвращает <c>true</c>, если CompoundObjectId является внешней ссылкой.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CompoundObjectId.IsSimpleObjectId
Свойство позволяет проверить отсутствие пути, когда имеется только идентификатор конечного объекта (который может быть нулевым).
Returns: Возвращает <c>true</c>, если путь отсутствует.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CompoundObjectId.LeafId
Свойство обеспечивает доступ к идентификатору конечного ObjectId в BlockTableRecord, на который ссылается последнее вхождение BlockReference в пути, или просто ObjectId, если путь отсутствует.
Returns: Возвращает идентификатор конечного объекта. Тип ObjectId.

Teigha.DatabaseServices.CompoundObjectId.Path
Свойство предоставляет путь вхождений блоков BlockReference.
Returns: Возвращает путь вхождений блоков. Тип ObjectIdCollection.

Teigha.DatabaseServices.CompoundObjectId.TopId
Свойство предоставляет первый ObjectId в цепочке из вхождений блоков BlockReference или ObjectId конечного узла, если путь отсутствует.
Returns: Возвращает идентификатор первого элемента. Тип ObjectId.

Teigha.DatabaseServices.CompoundObjectId.Transform
Свойство предоставляет составное преобразование координат конечного объекта последовательности вхождений блоков в пространство модели, объединяя все преобразования BlockReference, от самого вложенного до самого верхнего.
Returns: Возвращает матрицу геометрического преобразования координат. Тип Matrix3d.