Teigha.DatabaseServices.SecurityParameters
Класс <c>SecurityParameters</c> представляет параметры безопасности, используемые базой данных.

Teigha.DatabaseServices.SecurityParameters.#ctor
Конструктор по умолчанию класса <c>SecurityParameters</c>.

Teigha.DatabaseServices.SecurityParameters.#ctor(String,String,String,String,String,String,String,Teigha.DatabaseServices.SecurityActions,Teigha.DatabaseServices.SecurityAlgorithm,unsigned int,unsigned int)
Конструктор класса <c>SecurityParameters</c>. Создает экземпляр класса с указанными параметрами.

Teigha.DatabaseServices.SecurityParameters.Equals(Object)
Метод предназначен для проверки объектов на равенство.
obj: Объект, проверяемый на равенство данному объекту. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если объекты совпадают, и оба не равны <c>null</c>.
В противном случае возвращает <c>false</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику -
если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство сравниваемых объектов.
Иногда используется метод <c>Equals()</c> из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать данный <c>GetHashCode()</c>, в то время как метод <c>Equals()</c> может быть переопределен в производном классе.

Teigha.DatabaseServices.SecurityParameters.GetHashCode
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает хеш-код данного объекта. Тип <c>int</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику -
если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство сравниваемых объектов.
Иногда используется метод <c>Equals()</c> из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать данный <c>GetHashCode()</c>, в то время как метод <c>Equals()</c> может быть переопределен в производном классе.

Teigha.DatabaseServices.SecurityParameters.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Returns: Возвращает эквивалентное представление данного объекта в виде текстовой строки, в которой хранятся поля и значения параметров безопасности. Тип <c>String</c>.

Teigha.DatabaseServices.SecurityParameters.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта, учитывающее заданные языковые и региональные настройки.
provider: Входной провайдер языковых и региональных настроек. Тип <c>IFormatProvider</c>.
Returns: Возвращает эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
Тип <c>String</c>.

Teigha.DatabaseServices.SecurityParameters.Action
Свойство <c>Action</c> представляет действия безопасности, которые необходимо выполнить.
Returns: Возвращает предписанные действия безопасности. Перечисление <c>SecurityActions</c>.

Teigha.DatabaseServices.SecurityParameters.Algorithm
Свойство <c>Algorithm</c> представляет используемый алгоритм шифрования.
Returns: Возвращает алгоритм шифрования. Перечисление <c>SecurityAlgorithm</c>.

Teigha.DatabaseServices.SecurityParameters.Comment
Свойство <c>Comment</c> представляет дополнительный комментарий, сопровождающий подпись.
Returns: Возвращает строку комментария. Тип <c>String</c>.

Teigha.DatabaseServices.SecurityParameters.Issuer
Свойство <c>Issuer</c> представляет имя эмитента сертификата (цифрового ID).
Returns: Возвращает имя эмитента сертификата. Тип <c>String</c>.

Teigha.DatabaseServices.SecurityParameters.KeyLength
Свойство <c>KeyLength</c> представляет длину ключа шифра.
Returns: Возвращает длину ключа шифра. Тип <c>int</c>.

Teigha.DatabaseServices.SecurityParameters.Password
Свойство <c>Password</c> представляет строку пароля.
Returns: Возвращает пароль. Тип <c>String</c>.

Teigha.DatabaseServices.SecurityParameters.ProviderName
Свойство <c>ProviderName</c> представляет имя провайдера криптографии.
Returns: Возвращает имя провайдера криптографии. Тип <c>String</c>.

Teigha.DatabaseServices.SecurityParameters.ProviderType
Свойство <c>ProviderType</c> представляет тип провайдера шифрования.
Returns: Возвращает тип провайдера шифрования. Тип <c>int</c>.

Teigha.DatabaseServices.SecurityParameters.SerialNumber
Свойство <c>SerialNumber</c> представляет серийный номер сертификата (цифрового ID).
Returns: Возвращает серийный номер сертификата. Тип <c>String</c>.

Teigha.DatabaseServices.SecurityParameters.Subject
Свойство <c>Subject</c> представляет имя субъекта сертификата (цифрового ID).
Returns: Возвращает имя субъекта сертификата. Тип <c>String</c>.

Teigha.DatabaseServices.SecurityParameters.TimeServer
Свойство <c>TimeServer</c> представляет имя сервера времени, используемого для установления временных меток.
Returns: Возвращает имя сервера времени. Тип <c>String</c>.