Teigha.DatabaseServices.MLeaderStyle
Данный класс представляет объекты <c>MLeaderStyle</c> в базе данных.

Teigha.DatabaseServices.MLeaderStyle.#ctor
Конструктор по умолчанию класса <c>MLeaderStyle</c>.

Teigha.DatabaseServices.MLeaderStyle.#ctor(Teigha.DatabaseServices.MLeaderStyle)
Конструктор класса <c>MLeaderStyle</c>, который создает новый экземпляр класса как копию уже существующего экземпляра.
mleaderStyle: Объект для копирования.  Тип <c>MLeaderStyle</c>.

Teigha.DatabaseServices.MLeaderStyle.GetTextAttachmentType(Teigha.DatabaseServices.LeaderDirectionType)
Метод возвращает текущий вариант расположения точки прикрепления выносной линии к многострочному тексту мультивыноски с учетом указанного расположения полки.
leaderDirection: Вариант ориентации полки из перечисления <c>LeaderDirectionType</c>.
Returns: Возвращает тип прикрепления выносной линии к многострочному тексту. Перечисление <c>TextAttachmentType</c>.
Тип <c>TextAttachmentType</c>.

Teigha.DatabaseServices.MLeaderStyle.OverwritePropChanged
Метод позволяет проверить, были ли изменены свойства данного объекта.
Returns: Возвращает <c>true</c>, если свойства были изменены.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeaderStyle.PostMLeaderStyleToDb(DatabaseServices.Database,String)
Метод позволяет добавить данный объект <c>MLeaderStyle</c> в указанную базу данных.
db: Целевая база данных. Тип <c>DatabaseServices.Database</c>.
styleName: Имя стиля мультивыноски. Тип <c>String</c>.
Returns: Возвращает идентификатор добавленного в базу данных стиля мультивыноски.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeaderStyle.SetTextAttachmentType(Teigha.DatabaseServices.TextAttachmentType,Teigha.DatabaseServices.LeaderDirectionType)
Метод позволяет задать вариант расположения точки прикрепления выносной линии к многострочному тексту данного объекта.
textAttachmentType: Тип прикрепления выносной линии к многострочному тексту из перечисления <c>TextAttachmentType</c>.
leaderDirection: Вариант ориентации полки из перечисления <c>LeaderDirectionType</c>.

Teigha.DatabaseServices.MLeaderStyle.Annotative
Свойство представляет предусмотренное стилем состояние аннотаций.
Returns: Возвращает состояние аннотаций. Перечисление <c>DatabaseServices.AnnotativeStates</c>.

Teigha.DatabaseServices.MLeaderStyle.ArrowSize
Свойство представляет размер стрелки, предусмотренный данным стилем.
Returns: Возвращает размер стрелки. Тип <c>double</c>.

Teigha.DatabaseServices.MLeaderStyle.ArrowSymbolId
Свойство представляет идентификатор объекта символа стрелки, предусмотренный данным стилем.
Returns: Возвращает идентификатор символа стрелки. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeaderStyle.BlockColor
Свойство представляет цвет, предусмотренный данным стилем для отрисовки содержимого блока мультивыноски.
Returns: Возвращает цвет блока. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.MLeaderStyle.BlockConnectionType
Свойство представляет предусмотренный данным стилем вариант соединения блока с линиями выноски.
Returns: Возвращает вариант соединения блока с линиями выноски. Перечисление <c>DatabaseServices.BlockConnectionType</c>.

Teigha.DatabaseServices.MLeaderStyle.BlockId
Свойство представляет идентификатор <c>ObjectId</c> блока, связанного с данным стилем.
Returns: Возвращает идентификатор блока. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeaderStyle.BlockRotation
Свойство представляет угол поворота блока, на который ссылается данный стиль.
Returns: Возвращает угол поворота блока (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.MLeaderStyle.blockScale
Свойство представляет масштаб отображения блока, на который ссылается данный стиль.
Returns: Возвращает масштаб отображения блока. Тип <c>Scale3d</c>.

Teigha.DatabaseServices.MLeaderStyle.BreakSize
Свойство представляет величину разрыва выносных линий, предусмотренную данным стилем.
Returns: Возвращает величину разрыва выносных линий. Тип <c>double</c>.

Teigha.DatabaseServices.MLeaderStyle.ContentType
Свойство представляет тип содержимого мультивыноски, предусмотренный данным стилем.
Returns: Возвращает тип содержимого мультивыноски. Значение из перечисления <c>DatabaseServices.ContentType</c>.

Teigha.DatabaseServices.MLeaderStyle.DefaultMText
Свойство представляет текст по умолчанию для связанного многострочного текста.
Returns: Возвращает текст по умолчанию. Тип <c>MText</c>.

Teigha.DatabaseServices.MLeaderStyle.DoglegLength
Свойство представляет длину полки мультивыноски, предусмотренную данным стилем.
Returns: Возвращает длину полки. Тип <c>double</c>.

Teigha.DatabaseServices.MLeaderStyle.DrawLeaderOrderType
Свойство представляет последовательность отрисовки сегментов выносных линий объектов <c>MLeader</c>, предусмотренный данным стилем.
Returns: Возвращает последовательность отрисовки сегментов выносных линий.
Тип <c>DatabaseServices.DrawLeaderOrderType</c>.

Teigha.DatabaseServices.MLeaderStyle.DrawMLeaderOrderType
Свойство представляет порядок отрисовки содержимого объектов <c>MLeader</c>, предумотренный данным стилем.
Returns: Возвращает порядок отрисовки содержимого мультивыноски.
Перечисление <c>DatabaseServices.DrawMLeaderOrderType</c>.

Teigha.DatabaseServices.MLeaderStyle.EnableBlockRotation
Свойство позволяет проверить, предусмотрено ли данным стилем вращение связанного блока.
Returns: Возвращает <c>true</c>, если вращение блока включено (допускается).
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeaderStyle.EnableBlockScale
Свойство позволяет включить или отключить масштабирование содержимого связанного блока.
Returns: Возвращает <c>true</c>, если масштабирование блока включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeaderStyle.EnableDogleg
Свойство позволяет контролировать отображение полки на выносной линии мультивыноски.
Returns: Возвращает <c>true</c>, если полка отображается.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeaderStyle.EnableFrameText
Свойство позволяет контролировать отображение рамки вокруг текста мультивыноски.
Returns: Возвращает <c>true</c>, если рамка вокруг текста отображается.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeaderStyle.EnableLanding
Свойство должно управлять отображением зазора между концом линии полки и содержимым мультивыноски.
В текущей реализации платформы всегда считается равным <c>true</c>.
Returns: Всегда возвращает <c>true</c>, т.е. отображение зазора между линией полки и контентом мультивыноски всегда включено.

Teigha.DatabaseServices.MLeaderStyle.ExtendLeaderToText
Свойство позволяет управлять режимом продления горизонтальных линий выносок автоматически до текста.
Returns: Возвращает <c>true</c>, если автоматическое продление линий выносок включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeaderStyle.FirstSegmentAngleConstraint
Свойство представляет угловое ограничение для первого сегмента линии выноски.
Returns: Возвращает угловое ограничение из перечисления <c>AngleConstraint</c>.

Teigha.DatabaseServices.MLeaderStyle.LandingGap
Свойство представляет величину зазора между концом линии полки и многострочным текстом мультивыноски.
Returns: Возвращает величину зазора. Тип <c>double</c>.

Teigha.DatabaseServices.MLeaderStyle.LeaderLineColor
Свойство представляет цвет линии выноски, предусмотренный данным стилем.
Returns: Возвращает цвет линии выноски. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.MLeaderStyle.LeaderLineType
Свойство представляет предусмотренный данным стилем тип линий выноски (прямая, сплайн, невидимая).
Returns: Возвращает тип линий выноски из перечисления <c>LeaderType</c>.

Teigha.DatabaseServices.MLeaderStyle.LeaderLineTypeId
Свойство представляет предусмотренный данным стилем идентификатор <c>ObjectId</c> типа линии, используемого для отрисовки выносных линий мультивыноски.
Returns: Возвращает идентификатор типа линии. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeaderStyle.LeaderLineWeight
Свойство представляет предусмотренную данным стилем толщину (вес) выносных линий мультивыноски.
Returns: Возвращает толщину (вес) линий из перечисления <c>DatabaseServices.LineWeight</c>.

Teigha.DatabaseServices.MLeaderStyle.MaxLeaderSegmentsPoints
Свойство представляет максимальное количество точек сегментов, используемых для построения линий выносок.
Returns: Возвращает количество точек сегментов. Тип <c>int</c>.

Teigha.DatabaseServices.MLeaderStyle.Name
Свойство представляет имя данного стиля мультивыноски.
Returns: Возвращает имя стиля. Тип <c>String</c>.

Teigha.DatabaseServices.MLeaderStyle.Scale
Свойство представляет масштабный множитель для данного стиля.
Returns: Возвращает масштабный множитель. Тип <c>double</c>.

Teigha.DatabaseServices.MLeaderStyle.SecondSegmentAngleConstraint
Свойство представляет угловое ограничение для второго сегмента линии выноски.
Returns: Возвращает угловое ограничение из перечисления <c>AngleConstraint</c>.

Teigha.DatabaseServices.MLeaderStyle.TextAlignAlwaysLeft
Свойство позволяет указать, что создаваемый многострочный текст должен всегда выравниваться по левому краю.
Returns: Возвращает <c>true</c>, если стиль предусматривает выравнивание текста по левому краю.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeaderStyle.TextAlignmentType
Свойство представляет тип выравнивания многострочного текста мультивыноски, предусмотренный данным стилем.
Returns: Возвращает тип выравнивания многострочного текста.
Значение из перечисления <c>DatabaseServices.TextAlignmentType</c>.

Teigha.DatabaseServices.MLeaderStyle.TextAngleType
Свойство представляет выбор угла для размещения многострочного текста относительно последнего сегмента линии выноски.
Returns: Возвращает выбор угла для размещения текста.
Значение из перечисления <c>DatabaseServices.TextAngleType</c>.

Teigha.DatabaseServices.MLeaderStyle.TextAttachmentDirection
Свойство представляет ориентацию полки выносных линий, предусмотренную данным стилем.
Returns: Возвращает ориентацию полки выносной линии. Значение из перечисления <c>DatabaseServices.TextAttachmentDirection</c>.

Teigha.DatabaseServices.MLeaderStyle.TextAttachmentType
Свойство представляет предусмотренный стилем вариант расположения точки прикрепления выносной линии к многострочному тексту.
Returns: Возвращает вариант расположения точки прикрепления. Перечисление <c>DatabaseServices.TextAttachmentType</c>.

Teigha.DatabaseServices.MLeaderStyle.TextColor
Свойство представляет цвет многострочного текста, предусмотренный данным стилем.
Returns: Возвращает цвет многострочного текста. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.MLeaderStyle.TextHeight
Свойство представляет высоту многострочного текста, которая предусмотрена данным стилем.
Returns: Возвращает высоту текста. Тип <c>double</c>.

Teigha.DatabaseServices.MLeaderStyle.TextStyleId
Свойство представляет идентификатор <c>ObjectId</c> текстового стиля, который должен применяться к многострочному тексту  мультивыноски.
Returns: Возвращает идентификатор текстового стиля. Тип <c>DatabaseServices.ObjectId</c>.