Teigha.Geometry.Point3d
Этот класс представляет точки (позиции) в трехмерном пространстве.

Teigha.Geometry.Point3d.#ctor(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Point2d)
Конструктор класса Point3d.  Создает 3D-точку в указанной 2D-точке в системе координат заданной плоскости.
plane: Входная плоскость. Тип PlanarEntity.
point: Входная 2D-точка. Тип Point2d.

Teigha.Geometry.Point3d.#ctor(array&lt;double&gt;)
Конструктор класса Point3d.  Создает трехмерную точку с координатами, полученными из первых трех элементов заданного массива.
xyz: Массив значений типа double, определяющих координаты этой точки. Из переданного массива используются только первые три значения.

Teigha.Geometry.Point3d.#ctor(System.Double,System.Double,System.Double)
Конструктор класса Point3d. Создает трехмерную точку в заданных координатах.
x: X-координата данной точки. Тип double.
y: Y-координата данной точки. Тип double.
z: Z-координата данной точки. Тип double.

Teigha.Geometry.Point3d.Add(Teigha.Geometry.Vector3d)
Метод создает новую точку как результат перемещения данной точки на заданный 3D-вектор.
value: Входной 3D-вектор. Тип Vector3d.
Returns: Возвращает результирующую точку Point3d.

Teigha.Geometry.Point3d.Convert2d(Teigha.Geometry.PlanarEntity)
Метод преобразует данную 3D-точку в 2D-точку в двумерной системе координат заданного плоского объекта.
plane: Плоскость, в которой располагается данная 3D-точка. Тип PlanarEntity.
Returns: Возвращает точку Point2d.

Teigha.Geometry.Point3d.DistanceTo(Teigha.Geometry.Point3d)
Метод определяет расстояние между этой и заданной точками.
point: Входная 3D-точка, до которой измеряется расстояние. Тип Point3d.
Returns: Возвращает расстояние между точками. Тип double.

Teigha.Geometry.Point3d.DivideBy(System.Double)
Метод создает новую точку, координаты которой получены делением координат данной точки на указанное значение.
value: Значение, используемое в качестве делителя.  Тип double.
Returns: Возвращает точку, полученную в результате операции деления.  Тип Point3d.

Teigha.Geometry.Point3d.Equals(Object)
Метод выполняет проверку на равенство данной точки и указанного объекта.
obj: Входной объект для сравнения.  Тип Object.
Returns: Возвращает true, если obj не равен нулю и имеет те же координаты, что и данная точка.

Teigha.Geometry.Point3d.GetAsVector
Метод преобразует данную 3D-точку в 3D-вектор с тем же набором координат и возвращает экземпляр Vector3d.
Returns: Возвращает вектор с теми же координатами, что и у данной точки. Тип Vector3d.

Teigha.Geometry.Point3d.GetHashCode
Метод позволяет получить хеш-код для данного объекта.
Returns: Возвращает хеш-код в виде целочисленного значения, которое уникально для каждого экземпляра этого класса. Тип int.

Teigha.Geometry.Point3d.GetVectorTo(Teigha.Geometry.Point3d)
Метод строит вектор от данной точки до указанной.
point: 3D-точка, до которой требуется построить вектор. Тип Point3d.
Returns: Возвращает вектор, соединяющий данную точку с входной точкой point.  Тип Vector3d.

Teigha.Geometry.Point3d.IsEqualTo(Teigha.Geometry.Point3d)
Метод проверяет совпадение 3D-точек.
point: Точка, с которой проверяется совпадение. Тип Point3d.
Returns: Возвращает true, если точки совпадают; в противном случае возвращает false.

Teigha.Geometry.Point3d.IsEqualTo(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод проверяет совпадение точек в пределах указанного допуска.
point: Точка, с которой проверяется совпадение. Тип Point3d.
tolerance: Допуск. Тип Tolerance.
Returns: Возвращает true, если расстояние между точками не превышает значение Tolerance.EqualPoint(). В противном случае возвращает false.

Teigha.Geometry.Point3d.Mirror(Teigha.Geometry.Plane)
Метод позволяет получить 3D-точку, которая является зеркальным отражением данной точки относительно заданной плоскости.
plane: Плоскость зеркального отражения. Тип Plane.
Returns: Возвращает 3D-точку, которая является результатом зеркального отражения данной точки относительно заданной плоскости. Тип Point3d.

Teigha.Geometry.Point3d.MultiplyBy(System.Double)
Метод возвращает 3D-точку, координаты которой получены умножением координат данной точки на переданное в метод значение.
value: Множитель для координат точки. Тип double.
Returns: Возвращает 3D-точку в новых координатах.  Тип Point3d.

Teigha.Geometry.Point3d.OrthoProject(Teigha.Geometry.Plane)
Метод создает точку, которая является ортогональной проекцией данной точки на указанную плоскость.
plane: Плоскость проецирования. Тип Plane.
Returns: Возвращает точку Point3d, которая является ортогональной проекцией данной точки на плоскость plane.

Teigha.Geometry.Point3d.Project(Teigha.Geometry.Plane,Teigha.Geometry.Vector3d)
Метод создает проекцию данной точки на указанную плоскость вдоль заданного направления.
plane: Плоскость проецирования. Тип Plane.
vector: Вектор, определяющий направление проецирования. Тип Vector3d.
Returns: Возвращает точку Point3d, которая является проекцией данной точки на плоскость plane вдоль заданного направления.

Teigha.Geometry.Point3d.RotateBy(System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Point3d)
Метод создает новую точку, которая получается поворотом этой точки вокруг заданной оси на заданный угол.
angle: Входной угол поворота в радианах. Тип double.
vector: Входной вектор, определяющий направление оси вращения. Тип Vector3d.
centerPoint: Входная точка, через которую проходит ось вращения. Тип Point3d.
Returns: Возвращает точку, являющуюся результатом поворота. Тип Point3d.

Teigha.Geometry.Point3d.ScaleBy(System.Double,Teigha.Geometry.Point3d)
Метод позволяет получить трехмерную точку, которая является результатом масштабирования этой точки с заданным коэффициентом относительно заданного центра.
scaleFactor: Входной масштабный множитель. Тип double.
centerPoint: Центр масштабирования. Тип Point3d.
Returns: Возвращает 3D-точку, являющуюся результатом операции масштабирования.  Тип Point3d.

Teigha.Geometry.Point3d.Subtract(Teigha.Geometry.Vector3d)
Метод позволяет получить точку, координаты которой определяются разностью координат этой точки и соответствующих компонент заданного вектора.
value: Вычитаемое значение. Тип Vector3d.
Returns: Возвращает точку Point3d, которая является результатом операции вычитания.

Teigha.Geometry.Point3d.ToArray
Метод создает массив, содержащий значения координат данной точки.
Returns: Возвращает массив из трех элементов, содержащий значения координат X, Y и Z данной точки. Тип double[].

Teigha.Geometry.Point3d.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.Geometry.Point3d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.Geometry.Point3d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
format: Формат строки. Тип String.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде форматированной строки. Тип String.

Teigha.Geometry.Point3d.TransformBy(Teigha.Geometry.Matrix3d)
Метод применяет к данной точке указанное геометрическое преобразование и возвращает точку в новых координатах.
leftSide: Матрица геометрического преобразования. Тип Matrix3d.
Returns: Возвращает 3D-точку как результат геометрического преобразования текущих координат данной точки. Тип Point3d.

Teigha.Geometry.Point3d.Coordinate
Свойство предоставляет доступ к координатам точки.
index: Индекс координаты; тип int.  0 – координата X, 1 – координата Y, 2 – координата Z.
Returns: Возвращает значение координаты. Тип double.

Teigha.Geometry.Point3d.Origin
Свойство возвращает начало координат 3D-пространства данной точки.
Returns: Возвращает точку начала координат. Тип Point3d.

Teigha.Geometry.Point3d.X
Свойство, представляющее координату X данной точки.
Returns: Возвращает координату X данной точки.Тип double.

Teigha.Geometry.Point3d.Y
Свойство, представляющее координату Y данной точки.
Returns: Возвращает координату Y данной точки.Тип double.

Teigha.Geometry.Point3d.Z
Свойство, представляющее координату Z данной точки.
Returns: Возвращает координату Z данной точки.Тип double.