Teigha.DatabaseServices.TypedValue
Класс TypedValue реализует тип значения для хранения объектов различных типов.
Конкретный тип хранимого значения определяется свойством TypeCode.

Teigha.DatabaseServices.TypedValue.#ctor(System.Int32)
Данный конструктор создает объект с заданным кодом типа значения.
typeCode: Код типа, int.

Teigha.DatabaseServices.TypedValue.#ctor(System.Int32,Object)
Данный конструктор создает объект с заданным кодом типа и конкретным значением.
typeCode: Код типа, int.
value: Значение. Тип Object.

Teigha.DatabaseServices.TypedValue.Equals(Object)
Метод определяет равенство данного объекта с указанным объектом.
obj: Объект, с которым выполняется проверка на равенство.  Тип Object
Returns: Возвращает значение true в случае равенства объектов, в противном случае - false.

Teigha.DatabaseServices.TypedValue.GetHashCode
Метод предназначен для доступа к хеш-коду объекта.
Returns: Возвращает хеш-код объекта. Тип int.

Teigha.DatabaseServices.TypedValue.ToString
Метод предназначен для получения строкового представления данного объекта.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.DatabaseServices.TypedValue.ToString(IFormatProvider)
Метод предназначен для получения строкового представления данного объекта с учетом заданных региональных и языковых настроек.
provider: Поставщик языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки, формат которой определяется указанным провайдером. Тип String.

Teigha.DatabaseServices.TypedValue.TypeCode
Свойство предназначено для хранения кода типа объекта.
Returns: Возвращает код типа объекта.  Тип short.

Teigha.DatabaseServices.TypedValue.Value
Свойство предназначено для хранения типизированного значения, котрое представляет данный объект TypedValue.
Returns: Возвращает типизированное значение как объект Object.