Teigha.DatabaseServices.SweepOptionsBuilder
Класс <c>SweepOptionsBuilder</c> предназначен для настройки параметров, используемых методами <c>SweptSurface.CreateSweptSurface()</c> и <c>Solid3d.CreateSweptSolid()</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.#ctor
Конструктор по умолчанию класса <c>SweepOptionsBuilder</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.#ctor(Teigha.DatabaseServices.SweepOptions)
Конструктор класса <c>SweepOptionsBuilder</c>. Создает экземпляр класса с указанными параметрами.
value: Параметры операции вытягивания по траектории. Тип <c>SweepOptions</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.SetPathEntityTransform(Teigha.DatabaseServices.Entity,System.Boolean)
Метод позволяет задать систему координат в начале/конце траектории вытягивания.
pathEnt: Объект траектории, который используется для вычисления геометрического преобразования траектории.
displayErrorMessages: Флаг, определяющий, следует ли выводить сообщения об ошибках. Тип <c>bool</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.SetSweepEntityTransform(array&lt;Entity&gt;,System.Boolean)
Метод позволяет задать систему координат для вытягиваемого объекта в начале/конце траектории.
sweepEntities: Массив объектов, которые используются операцией вытягивания по траектории. Тип <c>Entity[]</c>.
displayErrorMessages: Флаг, определяющий, следует ли выводить сообщения об ошибках. Тип <c>bool</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.ToSweepOptions
Метод позволяет извлечь параметры операции вытягивания по траектории, связанные с данным объектом.
Returns: Возвращает объект настроек операции. Тип <c>SweepOptions</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.Align
Свойство <c>Align</c> представляет настройку выравнивания вытягиваемого объекта относительно траектории.
Returns: Возвращает предписанный вариант выравнивания относительно траектории. Тип <c>SweepOptionsAlignOption</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.AlignAngle
Свойство <c>AlignAngle</c> представляет величину угла выравнивания в радианах.
Returns: Возвращает угол выравнивания в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.AlignStart
Свойство <c>AlignStart</c> представляет вариант выравнивания объекта относительно начала или конца траектории вытягивания.
Returns: Возвращает <c>true</c>, если применяется выравнивание относительно начала траектории.
В случае <c>false</c> используется выравнивание относительно конца траектории.

Teigha.DatabaseServices.SweepOptionsBuilder.Bank
Свойство <c>Bank</c> позволяет определить, расположена ли вытягиваемая грань или кривая вдоль траектории вытягивания.
Returns: Возвращает <c>true</c>, если вытягиваемая грань или кривая располагается вдоль траектории.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.BasePoint
Свойство <c>BasePoint</c> представляет базовую точку для выравнивания вытягиваемого объекта.
Returns: Возвращает базовую точку. Тип <c>Point3d</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.CheckIntersections
Свойство <c>CheckIntersections</c> позволяет определить состояние опции проверки на самопересечения для получаемого тела или поверхности.
Returns: Возвращает <c>true</c>, если проверка на самопересечения включена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.DraftAngle
Свойство <c>DraftAngle</c> представляет угол сужения (или расширения), под которым профиль будет сужаться по мере вытягивания вдоль траектории.
Returns: Возвращает угол сужения (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.EndDraftDist
Свойство <c>EndDraftDist</c> представляет расстояние вдоль траектории, на котором сужение/расширение вытягиваемого объекта прекращается.
Returns: Возвращает расстояние, на котором сужение/расширение прекращается. Тип <c>double</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.PathEntityTransform
Свойство <c>PathEntityTransform</c> представляет матрицу преобразования для траектории вытягивания.
Returns: Возвращает матрицу геометрического преобразования. Тип <c>Matrix3d</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.ScaleFactor
Свойство <c>ScaleFactor</c> представляет масштабный коэффициент операции вытягивания по траектории.
Returns: Возвращает масштабный коэффициент. Тип <c>double</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.StartDraftDist
Свойство <c>StartDraftDist</c> представляет расстояние, на котором начинается сужение/расширение вытягиваемого объекта.
Returns: Возвращает расстояние, на котором начинается сужение/расширение вытягиваемого объекта. Тип <c>double</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.SweepEntityTransform
Свойство <c>SweepEntityTransform</c> представляет матрицу преобразования системы координат вытягиваемого объекта.
Returns: Возвращает матрицу преобразования. Тип <c>Matrix3d</c>.

Teigha.DatabaseServices.SweepOptionsBuilder.TwistAngle
Свойство <c>TwistAngle</c> представляет угол кручения профиля по мере его вытягивания по траектории.
Returns: Возвращает угол кручения профиля. Тип <c>double</c>.