Teigha.DatabaseServices.UnderlayFile
Класс <c>UnderlayFile</c> реализуется хост-приложениями, которым требуется поддержка подложек.

Teigha.DatabaseServices.UnderlayFile.Items
Свойство <c>Items</c> представляет элементы, на которые должны быть ссылки.
Returns: Возвращает коллекцию элементов, на которые должны быть ссылки. Тип <c>UnderlayItemCollection</c>.