Teigha.DatabaseServices.BeginWblockBlockEventArgs
Класс представляет данные для события <c>BeginWblockBlock</c> базы данных.

Teigha.DatabaseServices.BeginWblockBlockEventArgs.BlockId
Свойство предоставляет идентификатор блока, для которого выполняется операция <c>Wblock</c>.
Returns: Возвращает идентификатор блока. Тип ObjectId.

Teigha.DatabaseServices.BeginWblockBlockEventArgs.From
Свойство возвращает базу данных, для которой выполняется операция <c>Wblock</c>.
Returns: Возвращает базу данных. Тип Database.