Teigha.DatabaseServices.LayoutEventArgs
Этот класс представляет данные для связанных с листом событий в менеджере листов.

Teigha.DatabaseServices.LayoutEventArgs.Id
Свойство представляет идентификатор объекта измененного листа.
Returns: Возвращает идентификатор объекта измененного листа. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.LayoutEventArgs.Name
Свойство представляет имя измененного листа.
Returns: Возвращает имя измененного листа. Тип <c>String</c>.