Teigha.DatabaseServices.AssocAction
Класс AssocAction представляет ассоциативные действия, позволяющие реализовать ассоциативное поведение объектов.

Teigha.DatabaseServices.AssocAction.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.AssocAction.AddDependency(Teigha.DatabaseServices.ObjectId,System.Boolean)
Метод добавляет к данному действию заданную ассоциативную зависимость AssocDependency.
dependencyId: Идентификатор добавляемой зависимости. Тип Teigha.DatabaseServices.ObjectId.
setThisActionAsOwningAction: Флаг "присвоения" зависимости действием. Тип bool.  В случае значения true данное действие становится владельцем добавляемой зависимости.  В противном случае действие будет просто ссылаться на зависимость.

Teigha.DatabaseServices.AssocAction.AddMoreObjectsToDeepClone(Teigha.DatabaseServices.IdMapping,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет добавить в процесс глубокого клонирования дополнительные объекты, которые ассоциативно связаны с уже клонированными объектами.
idMap: Объект IdMapping текущей сессии глубокого клонирования.
additionalObjectsToClone: Коллекция дополнительных объектов, которые требуется включить в процесс глубокого клонирования.

Teigha.DatabaseServices.AssocAction.AreDependenciesEqual(Teigha.DatabaseServices.AssocDependency,Teigha.DatabaseServices.AssocDependency)
Метод реализует проверку равенства ассоциативных зависимостей.
Решение принимается на уровне действия, являющегося владельцем зависимости.
dependency1: Первая ассоциативная зависимость. Тип AssocDependency.
dependency2: Вторая ассоциативная зависимость. Тип AssocDependency.
Returns: Возвращает true в случае равенства зависимостей. В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.AreDependenciesOnTheSameThing(Teigha.DatabaseServices.AssocDependency,Teigha.DatabaseServices.AssocDependency)
Метод позволяет проверить, зависят ли две заданные ассоциативные зависимости от одного и того же объекта.  Решение принимается на уровне действия-владельца зависимости.
dependency1: Первая ассоциативная зависимость. Тип AssocDependency.
dependency2: Вторая ассоциативная зависимость. Тип AssocDependency.
Returns: Возвращает true, если указанные две ассоциативные зависимости от одного и того же объекта.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.DependentObjectCloned(Teigha.DatabaseServices.AssocDependency,Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.DBObject)
Метод вызывается в момент обратного вызова постоянного реактора AssocDependency.Copied() принадлежащей действию зависимости.
dependency: Зависимость на клонированном объекте DBObject.  Тип AssocDependency.
dbObj: Исходный объект. Тип DBObject.
newObj: Только что созданный клон. Тип DBObject.

Teigha.DatabaseServices.AssocAction.DragStatus(Teigha.DatabaseServices.DragStatus)
Метод вызывается для уведомления действия о выполнении операции перетаскивания, в которой задействованы некоторые объекты, от которых прямо или косвенно зависит данное действие.
status: Статус операции перетаскивания. Член перечисления DragStatus.

Teigha.DatabaseServices.AssocAction.EvaluateDependencies
Метод реализует перевычисление всех зависимостей данного действия, для которых IsEvaluationRequest() == true.

Teigha.DatabaseServices.AssocAction.EvaluateDependency(Teigha.DatabaseServices.AssocDependency)
Метод реализует перевычисление ассоциативной зависимости на уровне действия-владельца.
dependency: Входная ассоциативная зависимость. Тип AssocDependency.

Teigha.DatabaseServices.AssocAction.EvaluationPriority
Метод оценивает приоритеты вычисления ассоциативных действий.
Returns: Возвращает оценку приоритета вычисления данного действия. Член перечисления AssocEvaluationPriority.
Notes
Приоритет больше 0 означает, что действие вычислимо, приоритет меньше 0 означает, что действие вычислить невозможно.
Приоритет 0 означает, что в данный момент приоритет определить невозможно.

Teigha.DatabaseServices.AssocAction.GetActionBody(Teigha.DatabaseServices.ObjectId)
Метод позволяет получить ObjectId тела ассоциативного действия.
actionId: Идентификатор ассоциативного действия. Тип Teigha.DatabaseServices.ObjectId.
Returns: Возвращает идентификатор тела действия. Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocAction.GetActionsDependentOnObject(Teigha.DatabaseServices.DBObject,System.Boolean,System.Boolean)
Метод позволяет получить все действия, которые зависят от заданного объекта DBObject (т.е. имеют зависимости AssocDependency для этого объекта).
dbObj: Входной объект, для которого ищутся ассоциативные действия. Тип DBObject. Объект должен быть открыт по крайней мере для чтения.
readDependenciesWanted: Если true, то следует искать действия, которые зависят от объекта dbObj. Тип bool.
writeDependenciesWanted: Если true, то следует искать действия, которые изменяют объект dbObj. Тип bool.
Returns: Возвращает коллекцию ObjectId найденных зависимостей. Тип ObjectIdCollection.

Teigha.DatabaseServices.AssocAction.GetActionsDependentOnObject(Teigha.DatabaseServices.DBObject,System.Boolean,System.Boolean,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет получить все действия, которые зависят от заданного объекта DBObject. Идентификаторы найденных зависимостей сохраняются в заданной коллекции.
dbObj: Входной объект, для которого ищутся ассоциативные действия. Тип DBObject. Объект должен быть открыт по крайней мере для чтения.
readDependenciesWanted: Если true, то следует искать действия, которые зависят от объекта dbObj. Тип bool.
writeDependenciesWanted: Если true, то следует искать действия, которые изменяют объект dbObj. Тип bool.
actionIds: Входная коллекция для найденных зависимостей. Тип ObjectIdCollection.

Teigha.DatabaseServices.AssocAction.GetDependencies(System.Boolean,System.Boolean)
Метод позволяет получить коллекцию зависимостей AssocDependency для данного ассоциативного действия.
readDependenciesWanted: Если true, то следует искать действия, которые зависят от данного действия. Тип bool.
writeDependenciesWanted: Если true, то следует искать действия, которые влияют на данное действие. Тип bool.
Returns: Возвращает коллекцию ObjectId с найденными зависимостями. Тип ObjectIdCollection.

Teigha.DatabaseServices.AssocAction.GetDependentObjects(System.Boolean,System.Boolean)
Метод позволяет получить коллекцию объектов, от которых зависит или которые изменяет данное действие.
readDependenciesWanted: Если true, то следует искать действия, которые зависят от данного действия. Тип bool.
writeDependenciesWanted: Если true, то следует искать действия, которые влияют на данное действие. Тип bool.
Returns: Возвращает коллекцию ObjectId с найденными зависимостями. Тип ObjectIdCollection.

Teigha.DatabaseServices.AssocAction.HasDependencyCachedValue(Teigha.DatabaseServices.AssocDependency)
Метод позволяет определить имеет ли указанная зависимость кэшированное значение.
dependency: Входная зависимость, у которой проверяется наличие кэшированного значения. Тип AssocDependency. Должна быть открыта как минимум для чтения.
Returns: Возвращает true, если у входной зависимости имеется кэшированное значение.  В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.IsEqualTo(Teigha.DatabaseServices.AssocAction)
Метод реализует сравнение данного действия на равенство указанному действию.
otherAction: Входное действие.  Тип AssocAction.  Должно быть доступно для чтения.
Returns: Возвращает true в случае равенства действий. В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.IsExternalDependency(Teigha.DatabaseServices.AssocDependency)
Метод позволяет проверить, является ли входная зависимость AssocDependency, принадлежащая данному действию, внешней по отношению к этому действию.
dependency: Входная зависимость. Тип AssocDependency.
Returns: Возвращает true, если входная зависимость оказывается внешней по отношению к данному действию.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.IsOwnedDependency(Teigha.DatabaseServices.AssocDependency)
Метод позволяет проверить, принадлежит ли указанная зависимость AssocDependency данному действию напрямую или, если данное действие является сетью, принадлежит ли зависимость действию, принадлежащему сети.
dependency: Входная зависимость, проверяемая на принадлежность данному действию. Тип AssocDependency. Должна быть доступна как минимум на чтение.
Returns: Возвращает true, если зависимость dependency принадлежит данному действию напрямую или принадлежит действию, принадлежащему сети (когда данное действие является сетью). В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.IsRelevantDependencyChange(Teigha.DatabaseServices.AssocDependency)
Метод позволяет проверить входную зависимость на актуальность изменения в объекте, от которого она зависит.
dependency: Входная зависимость, проверяемая на актуальность изменения в объекте, от которого она зависит. Тип AssocDependency. Должна быть доступна как минимум на чтение.
Returns: Возвращает true, если изменение зависимости актуально, и false в противном случае.
Реализация по умолчанию возвращает true.

Teigha.DatabaseServices.AssocAction.ObjectThatOwnsNetworkInstance
Метод позволяет найти объект, владеющий сетью AssocNetwork, которой принадлежит данное действие AssocAction.
Returns: Возвращает ObjectId объекта DBObject, владеющего сетью AssocNetwork, которой принадлежит данное действие AssocAction.
Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocAction.OwnedDependencyStatusChanged(Teigha.DatabaseServices.AssocDependency,Teigha.DatabaseServices.AssocStatus)
Метод позволяет уведомить действие-владельца зависимости о том, что статус этой зависимости был только что изменен.
ownedDependency: Входная зависимость, чей статус был только что изменен. Тип AssocDependency.
previousStatus: Предыдущий статус этой зависимости из перечисления AssocStatus.

Teigha.DatabaseServices.AssocAction.PostProcessAfterDeepClone(Teigha.DatabaseServices.IdMapping)
Метод позволяет реализовать уведомление исходных действий о завершении процедуры их глубокого клонирования.
idMap: Экземпляр класса IdMapping в текущей сессии глубокого клонирования.

Teigha.DatabaseServices.AssocAction.PostProcessAfterDeepCloneCancel(Teigha.DatabaseServices.IdMapping)
Метод позволяет реализовать уведомление исходных действий об отмене их глубокого клонирования.
idMap: Экземпляр класса IdMapping текущего сеанса глубокого клонирования. Тип IdMapping.

Teigha.DatabaseServices.AssocAction.RemoveActionsControllingObject(Teigha.DatabaseServices.ObjectId)
Метод отключает зависимости, контролирующие указанный объект.
objID: Объект базы данных, у которого необходимо удалить контролирующие его зависимости (write-dependencies).  Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocAction.RemoveActionsControllingObject(Teigha.DatabaseServices.ObjectId,System.Int32)
Метод отключает зависимости, контролирующие указанный объект, а также позволяет настроить обработку зависимостей со статусом "только для чтения".
objID: Объект базы данных, у которого необходимо удалить контролирующие его зависимости (write-dependencies).  Тип Teigha.DatabaseServices.ObjectId.
readOnlyDependencyHandling: Определяет, как обрабатывать зависимости только для чтения. Тип int.
Допустимые значения аргумента <c>readOnlyDependencyHandling</c>:

Teigha.DatabaseServices.AssocAction.RemoveActionsControllingObject(Teigha.DatabaseServices.ObjectId,System.Int32,Teigha.DatabaseServices.ObjectId)
Метод отключает зависимости, контролирующие указанный объект. Дополнительно метод позволяет настроить обработку зависимостей со статусом "только для чтения" и указать объект, на который будут перенаправления такие зависимости.
objID: Объект базы данных, у которого необходимо удалить контролирующие его зависимости (write-dependencies).  Тип Teigha.DatabaseServices.ObjectId.
readOnlyDependencyHandling: Определяет, как обрабатывать зависимости только для чтения. Тип int.
objectToRedirectReadOnlyDependenciesTo: Объект, на который перенаправляются зависимости только для чтения.  Тип Teigha.DatabaseServices.ObjectId.
Допустимые значения аргумента <c>readOnlyDependencyHandling</c>:

Teigha.DatabaseServices.AssocAction.RemoveAllDependencies(System.Boolean)
Метод позволяет удалить все зависимости AssocDependencies, хранящиеся в векторе зависимостей данного действия, и опционально стереть их.
alsoEraseThem: Флаг стирания зависимостей после их удаления из данного действия. Тип bool.

Teigha.DatabaseServices.AssocAction.RemoveDependency(Teigha.DatabaseServices.ObjectId,System.Boolean)
Метод удаляет указанную зависимость AssocDependency из данного действия и опционально стирает ее.
dependencyId: Входной идентификатор удаляемой зависимости. Тип Teigha.DatabaseServices.ObjectId.
alsoEraseIt: Флаг стирания зависимости после ее удаления из данного действия. Тип bool.

Teigha.DatabaseServices.AssocAction.SetOwningNetwork(Teigha.DatabaseServices.ObjectId,System.Boolean)
Метод позволяет задать сеть-владельца для данного действия.
networkId: Входная сеть ассоциативных зависимостей, которая логически должна владеть данным действием. Тип Teigha.DatabaseServices.ObjectId.
alsoSetAsDatabaseOwner: Флаг назначения владельца. Тип bool. Задать true, если требуется сделать сеть networkId "физическим" владельцем этого действия в базе данных. В противном случае передать false.

Teigha.DatabaseServices.AssocAction.SetStatus(Teigha.DatabaseServices.AssocStatus,System.Boolean,System.Boolean)
Метод устанавливает для данного действия требуемый статус из перечисления AssocStatus.
newStatus: Новый статус действия из перечисления AssocStatus.
notifyOwningNetwork: Если задано true, и переданный статус newStatus указывает, что действие необходимо вычислить, статус сети AssocNetwork, владельца этой зависимости, устанавливается в тот же статус (если только статус вычисления сети уже не является более высоким, чем новый).  Тип bool.
setInOwnedActions: Флаг настройки статусов в принадлежащих действиях. Тип bool. Если задано true, и этому действию принадлежат некоторые другие действия, статус устанавливается и во всех действиях, принадлежащих данному действию как напрямую, так и рекурсивно.

Teigha.DatabaseServices.AssocAction.TransformActionBy(Teigha.Geometry.Matrix3d)
Метод позволяет уведомить данное действие о том, что владелец действия был подвергнут геометрическому преобразованию.
transform: Входная матрица геометрического преобразования. Тип Teigha.Geometry.Matrix3d.

Teigha.DatabaseServices.AssocAction.ActionBody
Свойство позволяет получить или задать ObjectId тела данного действия.
Returns: Возвращает идентификатор тела ассоциативного действия. Тип Teigha.DatabaseServices.ObjectId

Teigha.DatabaseServices.AssocAction.IsActionBodyAProxy
Свойство позволяет проверить, не является ли тело действия прокси-объектом.
Returns: Возвращает true, если тело действия является прокси-объектом. В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.IsActionEvaluationInProgress
Свойство позволяет проверить, не находится ли система в данный момент в процессе вычисления данного действия или сети действий.
Returns: Возвращает true, если система в данный момент находится в процессе вычисления данного действия.
В противном случае возвращает false.

Teigha.DatabaseServices.AssocAction.OwningNetwork
Свойство позволяет получить ObjectId сети AssocNetwork, логически владеющей данным действием, или ObjectId.Null, если эта сеть AssocNetwork является вершиной иерархии сетей.
Returns: Возвращает ObjectId сети AssocNetwork, логически владеющей данным действием, или ObjectId.Null, если эта сеть AssocNetwork является вершиной иерархии сетей.  Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocAction.Status
Свойство позволяет получить или установить текущий статус AssocStatus данного действия.
Returns: Возвращает текущий статус данного действия.  Тип AssocStatus.