Teigha.Geometry.Matrix2dInfo.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если указанный объект равен данному объекту.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2dInfo.GetHashCode
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает хеш-код объекта.
Тип <c>int</c>.

Teigha.Geometry.Matrix2dInfo.IsEqualTo(Teigha.Geometry.Matrix2dInfo)
Метод проверяет равенство данного объекта указанному объекту типа <c>Matrix2dInfo</c>.
a: Входной проверяемый объект. Тип <c>Matrix2dInfo</c>.
Returns: Возвращает <c>true</c>, если с используемой точностью объекты можно считать равными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2dInfo.IsEqualTo(Teigha.Geometry.Matrix2dInfo,Teigha.Geometry.Tolerance)
Метод проверяет равенство данного объекта указанному объекту типа <c>Matrix2dInfo</c> c заданной точностью.
a: Входной объект для сравнения. Тип <c>Matrix2dInfo</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если с точностью <c>tolerance</c> объекты можно считать равными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2dInfo.ToString
Метод предоставляет эквивалентное строковое представление данного объекта.
Returns: Возвращает эквивалентное строковое представление данного объекта.
Тип <c>String</c>.

Teigha.Geometry.Matrix2dInfo.ToString(IFormatProvider)
Метод предоставляет эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
provider: Входной провайдер языковых и региональных настроек. Тип <c>IFormatProvider</c>.
Returns: Возвращает эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
Тип <c>String</c>.

Teigha.Geometry.Matrix2dInfo.Angle
Свойство <c>Angle</c> представляет значение угла поворота в матрице.
Returns: Возвращает значение угла поворота. Тип <c>double</c>.

Teigha.Geometry.Matrix2dInfo.IsMirror
Свойство <c>IsMirror</c> позволяет проверить наличие в матрице компоненты зеркального отражения.
Returns: Возвращает <c>true</c>, если в преобразовании присутствует компонента зеркального отражения.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Matrix2dInfo.Reflex
Свойство <c>Reflex</c> представляет направление оси зеркального отражения в матрице.
Returns: Возвращает направление оси зеркального отражения.
Тип <c>Vector2d</c>.

Teigha.Geometry.Matrix2dInfo.Scale
Свойство <c>Scale</c> представляет масштабный коэффициент матрицы.
Returns: Возвращает масштабный коэффициент матрицы.
Тип <c>double</c>.