Teigha.DatabaseServices.Dimension
Этот класс является базовым для всех классов, представляющих размеры на чертеже в экземпляре Database.

Teigha.DatabaseServices.Dimension.FieldFromMText(Teigha.DatabaseServices.MText)
Метод копирует текстовое поле из указанного объекта MText, если он содержит такое поле, и добавляет его копию к данному размеру.
dimMText: Исходный объект, из которого копируется поле. Тип MText.

Teigha.DatabaseServices.Dimension.FieldToMText(MText )
Метод копирует текстовое поле из данного размера, если он содержит такое поле, и добавляет его копию к указанному объекту MText.
dimMText: Входной объект, в который копируется поле. Тип <c>MText</c>.

Teigha.DatabaseServices.Dimension.FormatMeasurement(System.Double,String)
Метод возвращает строку MText, представляющую форматированное значение размера объекта Dimension.
measurement: Измеренное значение размера, которое должно быть отформатировано. Тип <c>double</c>.
dimensionText: Размерный текст для форматирования. Тип <c>String</c>.
Returns: Возвращает строку с отформатированным значением размера. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.GenerateLayout
Метод предназначен для обновления размера в соответствии с текущим размерным стилем.
На данный момент не реализован.

Teigha.DatabaseServices.Dimension.GetDimstyleData
Метод предназначен для копирования настроек размерного стиля данного объекта Dimension, включая переопределения, в указанную запись таблицы размерных стилей.
Returns: Возвращает объект DimStyleTableRecord с копией настроек размерного стиля.

Teigha.DatabaseServices.Dimension.SetDimstyleData(Teigha.DatabaseServices.DimStyleTableRecord)
Метод предназначен для копирования настроек размерного стиля, включая все переопределения, из указанной записи таблицы размерных стилей в данный объект Dimension.
style: Размерный стиль, который служит источником копируемых данных. Тип DimStyleTableRecord.

Teigha.DatabaseServices.Dimension.RecomputeDimensionBlock(System.Boolean)
Метод предназначен для перевычисления размерного блока, на который ссылается данный объект Dimension, чтобы отразить любые  изменения, внесенные в объект Dimension с момента последнего обновления записи таблицы блоков.
forceUpdate: Флаг принудительного обновления размера. В случае значения <c>true</c> запись BlockTableRecord обновляется, даже если размер не был изменён. Тип bool.

Teigha.DatabaseServices.Dimension.RemoveTextField
Метод предназначен для удаления текстового поля из этого объекта Dimension, если такое поле имеется.

Teigha.DatabaseServices.Dimension.CenterMarkSize
Свойство возвращает размер маркера центра для радиальных и диаметральных размеров.
Returns: Возвращает размер маркера центра. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.CenterMarkType
Свойство возвращает тип маркера центра для радиальных и диаметральных размеров.
Returns: Возвращает тип маркера центра. Значение из перечисления DimensionCenterMarkType.

Teigha.DatabaseServices.Dimension.AlternatePrefix
Свойство задает или возвращает альтернативный префикс размерного текста.
Returns: Возвращает альтернативный префикс. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.AlternateSuffix
Свойство задает или возвращает альтернативный суффикс размерного текста.
Returns: Возвращает альтернативный суффикс. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.AltSuppressLeadingZeros
Свойство управляет подавлением ведущих нулей в альтернативных значениях размеров.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.AltSuppressTrailingZeros
Свойство управляет подавлением замыкающих нулей в альтернативных значениях размеров.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.AltSuppressZeroFeet
Свойство позволяет управлять подавлением отображения нулевого значения целых футов в размере формата футы-дюймы для альтернативных единиц измерения.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.AltSuppressZeroInches
Свойство позволяет управлять подавлением отображения нулевого значения целых дюймов в размере формата футы-дюймы для альтернативных единиц измерения.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.AltToleranceSuppressLeadingZeros
Свойство позволяет управлять подавлением ведущих нулей в значениях отклонений размеров, выраженных в альтернативных размерных единицах.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.AltToleranceSuppressTrailingZeros
Свойство управляет подавлением замыкающих нулей в отклонениях размеров, выраженных в альтернативных единицах.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.AltToleranceSuppressZeroFeet
Свойство позволяет управлять подавлением отображения нулевого значения целых футов в отклонениях размеров, выраженных в альтернативных единицах формата футы-дюймы.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.AltToleranceSuppressZeroInches
Свойство позволяет управлять подавлением отображения нулевого значения целых дюймов в отклонениях размеров, выраженных в альтернативных единицах формата футы-дюймы.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Prefix
Свойство задает или возвращает префикс размерного текста.
Returns: Возвращает префикс размерного текста. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.Suffix
Returns: Возвращает суффикс размерного текста. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.SuppressAngularLeadingZeros
Свойство управляет подавлением ведущих нулей в значениях угловых размеров.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.SuppressAngularTrailingZeros
Свойство управляет подавлением замыкающих нулей в значениях угловых размеров.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.SuppressLeadingZeros
Свойство управляет подавлением ведущих нулей в значениях размеров.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.SuppressTrailingZeros
Свойство управляет подавлением замыкающих нулей в значениях размеров.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.SuppressZeroFeet
Свойство управляет подавлением отображения нулевого значения целых футов в размере формата футы-дюймы, если футы и дюймы являются основными единицами измерения.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.SuppressZeroInches
Свойство используется для управления подавлением нулевого значения целых дюймов в размере формата футы-дюймы, когда футы и дюймы являются основными единицами измерения.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.ToleranceSuppressLeadingZeros
Свойство позволяет управлять подавлением ведущих нулей в значениях отклонений размеров, выраженных в основных единицах.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.ToleranceSuppressTrailingZeros
Свойство управляет подавлением замыкающих нулей в отклонениях размеров, выраженных в основных единицах.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.ToleranceSuppressZeroFeet
Свойство позволяет управлять подавлением отображения нулевого значения целых футов в отклонениях размеров, выраженных в основных единицах формата футы-дюймы.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.ToleranceSuppressZeroInches
Свойство позволяет управлять подавлением отображения нулевого значения целых дюймов в отклонениях размеров, выраженных в основных единицах измерения.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.DimensionStyle
Свойство задает или возвращает ObjectId для объекта DimStyleTableRecord, который связан с данным объектом Dimension.
Returns: Возвращает идентификатор записи в таблице размерных стилей. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimadec
Свойство позволяет задать или получить количество десятичных знаков после запятой в значениях угловых размеров и угловых отклонений.
Returns: Возвращает количество десятичных знаков после запятой в значениях угловых размеров и угловых отклонений. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimalt
Свойство управляет режимом отображения размеров в альтернативных единицах измерения.
Returns: Возвращает <c>true</c>, если размеры отображаются в альтернативных единицах измерения.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Dimaltd
Свойство позволяет задать или получить количество десятичных знаков после запятой в значениях размеров, выраженных в альтернативных единицах измерения.
Returns: Возвращает количество десятичных знаков после запятой в значениях размеров. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimaltf
Свойство позволяет контролировать значение масштабного коэффициента для альтернативных линейных единиц измерения.
Returns: Возвращает масштабный коэффициент. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimaltrnd
Свойство позволяет задать или получить действительное число, используемое для округления линейных размеров в альтернативных единицах измерения (но не  допусков).
Returns: Возвращает единицу округления размеров. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.CurrentMeasurement
Свойство возвращает величину данного размера в указанных единицах измерения как значение с плавающей точкой двойной точности.
Returns: Возвращает текущее значение размера. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimalttd
Свойство определяет количество десятичных знаков после запятой, используемых при отображении отклонений размеров в альтернативных единицах измерения.
Returns: Возвращает количество десятичных знаков после запятой для отображения значений размеров. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimalttz
Свойство управляет подавлением нулей в значениях допусков при использовании альтернативных единиц изменения.
Returns: Возвращает код состояния отображения/подавления нулей. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimaltu
Свойство задает формат для размеров, представленных в альтернативных единицах измерения.
Returns: Возвращает код формата. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimaltz
Свойство управляет подавлением нулей в значениях размеров при использовании альтернативных единиц изменения.
Returns: Возвращает код состояния отображения/подавления нулей. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimapost
Свойство определяет префикс или суффикс размерного текста (или и то, и другое) при использовании альтернативных единиц измерения.
Returns: Возвращает префикс или суффикс размерного текста. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.Dimarcsym
Свойство определяет отображение обозначения дуги в размерном тексте длины дуги.
Returns: Возвращает вариант отображения обозначения дуги. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimasz
Свойство задает длину стрелок на размерных линиях и линиях выносок.
Returns: Возвращает длину стрелок. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimatfit
Свойство задает способ расположения размерного текста и стрелок, если между выносными линиями недостаточно места для текста и/или для стрелок.
Returns: Возвращает вариант расположения размерного текста и стрелок относительно выносных линий. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimaunit
Свойство задает вариант единиц измерения для угловых размеров.
Returns: Возвращает вариант единиц измерения для угловых размеров. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimazin
Свойство управляет подавлением нулей в угловых размерах и допусках.
Returns: Возвращает вариант подавления нулей. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimblks
Свойство задает или возвращает имя блока, используемого для отображения концов стрелок на размерных линиях.
Returns: Возвращает имя блока для концов стрелок. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.Dimblk
Свойство задает или возвращает идентификатор блока, который используется для отображения концов стрелок на размерных линиях.
Returns: Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimblk1
Свойство задает или возвращает идентификатор блока, который используется для отображения стрелки на первом конце размерной линии.
Returns: Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimblk2
Свойство задает или возвращает идентификатор блока, который используется для отображения стрелки на втором конце размерной линии.
Returns: Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimblk1s
Свойство задает или возвращает имя блока, используемого для отображения стрелки на первом конце размерной линии.
Returns: Возвращает имя блока. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.Dimblk2s
Свойство задает или возвращает имя блока, используемого для отображения стрелки на втором конце размерной линии.
Returns: Возвращает имя блока. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.DimBlockId
Свойство задает или возвращает идентификатор ObjectId записи BlockTableRecord, связанной с данным размером.
Returns: Возвращает идентификатор блока. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.DimBlockPosition
Свойство задает или возвращает относительное положение в мировой системе координат WCS блока, связанного с данным размером.
Returns: Возвращает точку вставки блока данного размера. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Dimension.Dimcen
Свойство управляет отображением и размерами маркеров центра и центровых линий дуг и окружностей.
Returns: Возвращает размер маркеров центра и центровых линий. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimclrd
Свойство задает или возвращает цвет выносок, стрелок, а также размерных линий и выносных линий.
Returns: Возвращает цвет указанных объектов чертежа. Тип Colors.Color.

Teigha.DatabaseServices.Dimension.Dimclre
Свойство определяет цвет выносных линий.
Returns: Возвращает цвет линий. Тип Colors.Color

Teigha.DatabaseServices.Dimension.Dimclrt
Свойство задает или возвращает цвет размерного текста.
Returns: Возвращает цвет размерного текста. Тип Colors.Color.

Teigha.DatabaseServices.Dimension.Dimdec
Свойство задает или возвращает количество десятичных знаков после запятой в основном значении размера и допуске.
Returns: Возвращает количество десятичных знаков после запятой. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimdle
Свойство задает или возвращает расстояние, на которое размерные линии выступают за пределы выносных линий.
Returns: Возвращает длину выступа размерных линий за пределы выносных. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimdli
Свойство задает или возвращает шаг размерных линий в размерах от общей базы.
Returns: Возвращает шаг в базовых размерах. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimdsep
Свойство задает или возвращает символ, который используется в качестве десятичного разделителя в значениях размеров.
Returns: Возвращает символ десятичного разделителя. Тип <c>System.Char</c>.

Teigha.DatabaseServices.Dimension.DimensionStyleName
Свойство задает или возвращает имя размерного стиля в данном объекте Dimension.
Returns: Возвращает имя размерного стиля. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.DimensionText
Свойство задает или возвращает текстовую строку, которая заменяет измеренное значение.
Returns: Возвращает текстовую строку, которая заменяет измеренное значение. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.Dimexe
Свойство задает или возвращает расстояние, на которое выносные линии выступают за пределы размерных линий.
Returns: Возвращает расстояние, на которое выносные линии выступают за пределы размерных линий. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimexo
Свойство задает или возвращает отступ выносных линий от исходных точек.
Returns: Возвращает отступ выносных линий от исходных точек. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimfrac
Свойство задает или возвращает дробный формат.
Returns: Возвращает значение типа <c>int</c>, которое кодирует вариант отображения дроби: 0 для горизонтальной, 1 для диагональной, 2 для дроби в одну строку.

Teigha.DatabaseServices.Dimension.Dimfxlen
Свойство задает или возвращает длину выносных линий с фиксированной длиной.
Returns: Возвращает длину выносных линий. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.DimfxlenOn
Свойство позволяет определить, имеют ли выносные линии фиксированную длину.
Returns: Возвращает <c>true</c>, если выносные линии имеют фиксированную длину.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Dimgap
Свойство задает или возвращает зазор между полем размерного текста и размерной линией, выносной линией или линией выноски с учетом с положения и ориентации текста.
Returns: Возвращает зазор вокруг поля размерного текста.  Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimjogang
Свойство задает или возвращает угол излома размерных линий в радиусных размерах с изломом.
Returns: Возвращает угол излома радиусной размерной линии. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimjust
Свойство задает или возвращает горизонтальное выравнивание поля размерного текста (относительно выносных линий).
Returns: Возвращает код горизонтального выравнивания поля размерного текста. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimldrblk
Свойство задает или возвращает блок стрелок на концах линий выноски.
Returns: Возвращает ссылку на блок стрелок. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimldrblks
Свойство задает или возвращает имя блока стрелок на концах линий выноски.
Returns: Возвращает имя блока стрелок. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.Dimlfac
Свойство задает или возвращает масштабный коэффициент для значений линейных размеров.
Returns: Возвращает масштабный коэффициент для линейных размеров. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimlim
Свойство позволяет определить, включен ли режим отображения размерного текста в виде предельных размеров.
Returns: Возвращает <c>true</c>, если режим включен.  В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Dimltex1
Свойство задает или возвращает тип первой выносной линии.
Returns: Возвращает идентификатор объекта типа линии.  Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimltex2
Свойство задает или возвращает тип второй выносной линии.
Returns: Возвращает идентификатор объекта типа линии.  Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimltype
Свойство задает или возвращает тип линии выноски, размерных линий и выносных линий
Returns: Возвращает идентификатор типа размерных линий. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.Dimlunit
Свойство задает или возвращает формат представления основных значений размеров и допусков.
Returns: Возвращает код формата числовых значений размеров и допусков. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimlwd
Свойство задает или возвращает толщину линии выноски, размерных и выносных линий.
Returns: Возвращает вес линий как объект типа DatabaseServices.LineWeight.

Teigha.DatabaseServices.Dimension.Dimlwe
Свойство задает или возвращает толщину (вес) обеих выносных линий.
Returns: Возвращает вес линий как объект типа DatabaseServices.LineWeight.

Teigha.DatabaseServices.Dimension.Dimpost
Свойство задает или возвращает префикс и/или суффикс размерного текста при использовании основных единиц измерения.
Returns: Возвращает префикс и/или суффикс размерного текста. Тип <c>String</c>.

Teigha.DatabaseServices.Dimension.Dimrnd
Свойство задает или возвращает действительное число, используемое для округления линейных размеров в основных единицах измерения (но не значений допусков/отклонений).
Returns: Возвращает действительное число, используемое для округления линейных размеров.  Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimsah
Свойство играет роль переключателя между режимами индивидуальной настройки типа стрелок слева и справа на размерной линии и режимом, при котором стрелки одинаковы.
Returns: Возвращает <c>true</c>, если для стрелок слева и справа используются блоки, заданные свойствами Dimblk1 и Dimblk2, соответственно.
Если блоки стрелок одинаковы, возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Dimscale
Свойство используется для управления общим масштабом размеров.
Returns: Возвращает общий коэффициент масштабирования размеров. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimsd1
Свойство управляет подавлением первой размерной линии и стрелки.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Dimsd2
Свойство управляет подавлением второй размерной линии и стрелки.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Dimse1
Свойство управляет подавлением первой выносной линии.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Dimse2
Свойство управляет подавлением второй выносной линии.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Dimsoxd
Свойство управляет подавлением стрелок, если между выносными линиями для них недостаточно места.
Returns: Возвращает <c>true</c>, если подавление включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Dimtad
Свойство позволяет выбирать вариант вертикального выравнивания размерного текста относительно размерной линии.
Returns: Возвращает вариант вертикального выравнивания размерного текста. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimtdec
Свойство задает или возвращает количество десятичных знаков после запятой в значениях допусков в основных единицах измерения.
Returns: Возвращает количество десятичных знаков после запятой в значениях допусков.  Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimtfac
Свойство задает или возвращает масштабный коэффициент для высоты текста допусков в размерах.
Returns: Возвращает масштабный коэффициент для высоты текста. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimtfill
Свойство управляет фоном размерного текста.
Returns: Возвращает код варианта отображения фона размерного текста.  Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimtfillclr
Свойство определяет цвет фона для заполнения поля размерного текста.
Returns: Возвращает цвет фоновой заливки размерного текста.  Тип Colors.Color.

Teigha.DatabaseServices.Dimension.Dimtih
Свойство Dimtih управляет ориентацией размерного текста между выносными линиями.
Returns: Возвращает <c>true</c> в случае выравнивания по горизонтали.
Возвращает <c>false</c> в случае выравнивания вдоль размерной линии или линии выноски.

Teigha.DatabaseServices.Dimension.Dimtix
Свойство Dimtix позволяет контролировать размещение размерного текста между выносными линиями.
Returns: Возвращает <c>true</c> в случае принудительного размещения между выносными линиями.
Возвращает <c>false</c> в случае размещения между выносными линиями только при наличии достаточного свободного места.

Teigha.DatabaseServices.Dimension.Dimtm
Свойство задает или возвращает нижнее предельное отклонение размера.
Returns: Возвращает нижнее предельное отклонение размера. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimtmove
Свойство определяет правила перемещения размерного текста относительно размерной линии.
Returns: Возвращает код правила перемещения размерного текста относительно размерной линии.  Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimtofl
Свойство позволяет управлять отображением линии между выносными линиями или внутри измеряемого объекта, когда размерные линии размещены за пределами выносных линий или измеряемого объекта.
Returns: Возвращает <c>true</c>, если стрелки соединены линией. Если линия подавлена, возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Dimtoh
Свойство управляет расположением размерного текста за пределами выносных линий или измеряемого объекта.
Returns: Возвращает <c>true</c> в случае выравнивания текста по горизонтали и
<c>false</c> в случае выравнивания вдоль размерной линии или линии выноски.

Teigha.DatabaseServices.Dimension.Dimtol
Свойство управляет отображением допусков в размерах.
Returns: Возвращает <c>true</c>, если отображение допусков включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Dimtolj
Свойство управляет вертикальным выравниванием текста допуска относительно текста номинального размера.
Returns: Возвращает код варианта вертикального выравнивания текста допуска.  Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimtp
Свойство позволяет включить режим отображения верхнего предельного отклонения размера.
Returns: Возвращает верхнее предельное отклонение. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimtsz
Свойство управляет размером засечек, отображаемых вместо стрелок на линейных, радиальных и диаметральных размерах.
Returns: Возвращает размер засечек. Тип <c>double</c>. Если Dimtsz = 0, отображаются стрелки.

Teigha.DatabaseServices.Dimension.Dimtvp
Свойство управляет вертикальным положением размерного текста относительно размерной линии.
Returns: Возвращает смещение текста по вертикали относительно размерной линии. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimtxt
Свойство управляет размером размерного текста.
Returns: Возвращает размер текста.  Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Dimtzin
Свойство управляет подавлением нулей при отображении допусков.
Returns: Возвращает вариант отображения нулей в значениях допусков. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.Dimupt
Свойство управляет режимом перемещения текста, позиционирование которого определено пользователем, при перемещении размерной линии.
Returns: Возвращает <c>true</c>, если перемещается размерная линия и текст, и <c>false</c>, если перемещается только размерная линия.

Teigha.DatabaseServices.Dimension.Dimzin
Свойство управляет подавлением нулей в значениях размеров, заданных в основных единицах измерения.
Returns: Возвращает вариант подавления нулей в значениях размеров. Тип <c>int</c>.

Teigha.DatabaseServices.Dimension.DynamicDimension
Свойство позволяет задать или определить, является ли данный размер динамическим.
Returns: Возвращает <c>true</c>, если размер является динамическим.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Dimension.Elevation
Свойство задает или возвращает высоту данного размера.
Returns: Возвращает высоту данного размера. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.HorizontalRotation
Свойство управляет углом поворота размера в горизонтальной плоскости (в радианах).
Returns: Возвращает угол поворота размера в горизонтальной плоскости (в радианах).  Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Measurement
Свойство возвращает значение размера как значение с плавающей точкой двойной точности.
Returns: Возвращает значение размера. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.Normal
Свойство задает или возвращает 3D-вектор нормали данного размера (в координатах WCS).
Returns: Возвращает вектор нормали размера. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Dimension.TextAttachment
Свойство задает или возвращает режим выравнивания размерного текста в пределах текстового поля.
Returns: Возвращает режим выравнивания размерного текста. Значение из перечисления AttachmentPoint.

Teigha.DatabaseServices.Dimension.TextLineSpacingFactor
Свойство задает или возвращает относительное расстояние между базовыми линиями соседних строк текста.
Returns: Возвращает коэффициент межстрочного интервала.  Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.TextLineSpacingStyle
Свойство задает или возвращает стиль межстрочного интервала для размерного текста.
Returns: Возвращает стиль межстрочного интервала.  Значение из перечисления LineSpacingStyle.

Teigha.DatabaseServices.Dimension.TextPosition
Свойство позволяет управлять 3D-точкой привязки текста.
Returns: Возвращает точку привязки текста. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Dimension.TextRotation
Свойство управляет углом поворота поля размерного текста в радианах.
Returns: Возвращает угол поворота размерного текста. Тип <c>double</c>.

Teigha.DatabaseServices.Dimension.TextStyleId
Свойство задает или возвращает текстовый стиль, используемый для размерного текста в данном объекте.
Returns: Возвращает идентификатор текстового стиля размерного текста. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.Dimension.UsingDefaultTextPosition
Свойство позволяет определить, должно ли для размерного текста использоваться положение по умолчанию или нет.
Returns: Возвращает <c>true</c>, если используется позиция по умолчанию.
В противном случае возвращает <c>false</c>.