Teigha.BoundaryRepresentation.BrepEdgeEnumerator
Класс <c>BrepEdgeEnumerator</c> представляет перечислитель рёбер, соответствующих граничному представлению.

Teigha.BoundaryRepresentation.BrepEdgeEnumerator.Current
Свойство <c>Current</c> представляет текущий элемент данного перечислителя.
Returns: Возвращает ребро, которое является текущим элементом данного перечислителя.
Тип <c>Edge</c>.