Teigha.DatabaseServices.DgnReference
Этот класс представляет в чертеже ссылки подложек DGN.

Teigha.DatabaseServices.DgnReference.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.DgnReference.#ctor(IntPtr,System.Boolean)
Конструктор класса DgnReference.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Флаг автоудаления исходного объекта. Тип bool.