Teigha.DatabaseServices.Surface
Класс <c>Surface</c> представляет в базе данных объект 3D-поверхности.

Teigha.DatabaseServices.Surface.#ctor
Конструктор по умолчанию класса <c>Surface</c>.

Teigha.DatabaseServices.Surface.BooleanIntersect(Teigha.DatabaseServices.Solid3d)
Метод предназначен для выполнения операции логического пересечения данной поверхности с указанным трехмерным твердым телом.
solid: Входное твердое тело, пересекающееся с данной поверхностью. Тип <c>Solid3d</c>.
Returns: Возвращает массив объектов, являющихся пересечением этой поверхности с указанным телом. Тип <c>Entity[]</c>.

Teigha.DatabaseServices.Surface.BooleanIntersect(Teigha.DatabaseServices.Surface)
Метод предназначен для выполнения операции логического пересечения данной поверхности с указанной трехмерной поверхностью.
surface2: Входная поверхность, пересекающаяся с данной поверхностью. Тип <c>Surface</c>.
Returns: Возвращает массив объектов, представляющих пересечение двух поверхностей.  Тип <c>Entity[]</c>.

Teigha.DatabaseServices.Surface.BooleanSubtract(Teigha.DatabaseServices.Solid3d)
Метод предназначен для выполнения операции логического вычитания указанного твердого тела из данной поверхности.
solid: Трехмерное твердое тело, которое вычитается из данного объекта.
Returns: Возвращает поверхность, являющуюся результатом логического вычитания. Тип <c>Surface</c>.

Teigha.DatabaseServices.Surface.BooleanSubtract(Teigha.DatabaseServices.Surface)
Метод предназначен для выполнения операции логического вычитания из данной поверхности указанной трехмерной поверхности.
surface2: Поверхность, которая вычитается из данной поверхности. Тип <c>Surface</c>.
Returns: Возвращает поверхность, являющуюся результатом логического вычитания. Тип <c>Surface</c>.

Teigha.DatabaseServices.Surface.BooleanUnion(Teigha.DatabaseServices.Surface)
Метод предназначен для выполнения операции логического объединения данной поверхности с другой поверхностью.
surface2: Поверхность, которая объединяется с данной поверхностью. Тип <c>Surface</c>.
Returns: Возвращает поверхность, являющуюся результатом логического объединения двух поверхностей. Тип <c>Surface</c>.

Teigha.DatabaseServices.Surface.ChamferEdges(array&lt;SubentityId&gt;,Teigha.DatabaseServices.SubentityId,System.Double,System.Double)
Метод предназначен для создания ассоциативных фасок на указанных ребрах данной поверхности.
subentityIds: Массив идентификаторов подобъектов ребер, к которым применяется данная операция. Тип <c>SubentityId[]</c>.
baseSubentityId: Идентификатор подобъекта базовой грани, на ребрах которой создаются фаски. Тип <c>SubentityId</c>.
baseDist: Расстояние от ребра для построения фаски на базовой грани. Тип <c>double</c>.
otherDist: Расстояние от ребра для построения фасок на других гранях. Тип <c>double</c>.

Teigha.DatabaseServices.Surface.ConvertToNurbSurface
Метод предназначен для преобразования данного объекта в NURB-поверхности.
Returns: Возвращает массив сгенерированных NURB-поверхностей. Тип <c>NurbSurface[]</c>.

Teigha.DatabaseServices.Surface.ConvertToRegion
Метод позволяет для каждой грани данной поверхности создать объект области <c>Region</c>.
Returns: Возвращает массив объектов <c>Region</c>, созданных на основе граней данной поверхности. Тип <c>Entity[]</c>.

Teigha.DatabaseServices.Surface.CreateFrom(Teigha.DatabaseServices.Entity)
Метод позволяет создать выдавленную поверхность из 2D-объекта с некоторой толщиной или плоскую поверхность из замкнутой кривой или области.
fromEntity: Объект чертежа, на основе которого создается поверхность. Тип <c>Entity</c>.
Returns: Возвращает созданную поверхность. Тип <c>Surface</c>.

Teigha.DatabaseServices.Surface.CreateInterferenceObjects(Teigha.DatabaseServices.Entity,System.Int32)
Метод позволяет создать новые объекты, которые представляют собой результат пересечения между данной поверхностью и указанным объектом чертежа.
ent: Объект чертежа, который анализируется на предмет пересечений с данной поверхностью. Тип <c>Entity</c>.
flags: Флаги пересечений. Тип <c>int</c>. Используется значение <c>0x00</c> - коллизии по умолчанию.

Teigha.DatabaseServices.Surface.CreateOffsetSurface(Teigha.DatabaseServices.Entity,System.Double)
Метод позволяет создать поверхность смещением указанного объекта на заданное расстояние.
entity: Входная поверхность для смещения. Тип <c>Entity</c>.
offsetDistance: Величина смещения (в единицах чертежа). Тип <c>double</c>.
Returns: Возвращает поверхность, полученную смещением.  Тип <c>Entity</c>.

Teigha.DatabaseServices.Surface.CreateOffsetSurface(Teigha.DatabaseServices.Entity,System.Double,System.Boolean)
Метод позволяет создать поверхность смещения и загрузить ее в текущую базу данных.
entity: Входная поверхность для смещения. Тип <c>Entity</c>.
offsetDistance: Величина смещения. Тип <c>double</c>.
associativeEnabled: Флаг, определяющий, требуется ли создавать ассоциативную поверхность смещения. Тип <c>bool</c>.
Returns: Возвращает идентификатор объекта полученной смещением поверхности. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Surface.CreateSectionObjects(Teigha.Geometry.Plane)
Метод позволяет получить массив объектов, которые образуются в результате рассечения данной поверхности указанной плоскостью.
sectionPlane: Плоскость сечения. Тип <c>Plane</c>.
Returns: Возвращает массив объектов, созданных в результате построения сечения. Тип <c>Entity[]</c>.

Teigha.DatabaseServices.Surface.FilletEdges(array&lt;SubentityId&gt;,Teigha.Geometry.DoubleCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.DoubleCollection)
Метод позволяет создать скругления на указанных ребрах данной поверхности.
subentityIds: Идентификаторы подобъектов ребер данной поверхности, на которых требуется создать скругления. Тип <c>SubentityId[]</c>.
radius: Массив радиусов скруглений на соответствующих ребрах. Тип <c>DoubleCollection</c>.
startSetback: Массив начальных отступов на соответствующих ребрах. Тип <c>DoubleCollection</c>.
endSetback: Массив конечных отступов на соответствующих ребрах. Тип <c>DoubleCollection</c>.

Teigha.DatabaseServices.Surface.GetArea
Метод предназначен для вычисления общей площади данной поверхности.
Returns: Возвращает площадь одной стороны данной поверхности. Тип <c>double</c>.

Teigha.DatabaseServices.Surface.GetSubentityColor(Teigha.DatabaseServices.SubentityId)
Метод позволяет получить цвет указанного подобъекта данной поверхности.
subEntityId: Идентификатор подобъекта, цвет которого требуется выяснить. Тип <c>SubentityId</c>.
Returns: Возвращает цвет указанного подобъекта. Тип <c>Colors.Color</c>.

Teigha.DatabaseServices.Surface.GetSubentityMaterial(Teigha.DatabaseServices.SubentityId)
Метод позволяет извлечь материал для указанного подобъекта данной поверхности.
subEntityId: Идентификатор подобъекта. Тип <c>SubentityId</c>.
Returns: Возвращает идентификатор объекта материала. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Surface.GetSubentityMaterialMapper(Teigha.DatabaseServices.SubentityId)
Метод позволяет получить для указанного подобъекта объект <c>Mapper</c>, который обеспечивает сопоставление материалов.
subEntityId: Идентификатор подобъекта. Тип <c>SubentityId</c>.
Returns: Возвращает объект <c>Mapper</c> для сопоставления материалов подобъекта.

Teigha.DatabaseServices.Surface.ImprintEntity(Teigha.DatabaseServices.Entity)
Метод позволяет построить пересечение указанного объекта с данной поверхностью и добавить в неё новую фасетную грань путем клеймения.
entityToImprint: Объект для клеймения на данном твердом теле. Тип <c>Entity</c>.

Teigha.DatabaseServices.Surface.ProjectOnToSurface(Teigha.DatabaseServices.Entity,Teigha.Geometry.Vector3d)
Метод позволяет создать новые объекты проецированием указанного объекта на данную поверхность в заданном направлении.
entityToProject: Проецируемый геометрический объект. Тип <c>Entity</c>.
projectionDirection: Направление проецирования. Тип <c>Vector3d</c>.
Returns: Возвращает массив геометрических объектов, образованных в результате проецирования. Тип <c>Entity[]</c>.

Teigha.DatabaseServices.Surface.RayTest(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,[Out]array&lt;SubentityId&gt;%,[Out]DoubleCollection%)
Метод предназначен для для создания луча, который начинается в указанной точке и имеет заданное направление.
rayBasePoint: Базовая точка, в которой начинается луч. Тип <c>Point3d</c>.
rayDir: Направление распространения луча. Тип <c>Vector3d</c>.
rayRadius: Радиус луча. Тип <c>double</c>. Он определяет допуск для проверок пересечений.
subEntIds: Возвращаемый массив идентификаторов подобъектов. Тип <c>SubentityId[]</c>. Может содержать идентификаторы граней, ребер и вершин.
parameters: Возвращаемый массив значений параметра. Тип <c>DoubleCollection</c>. Значения параметра отражают пересечение луча и подобъектов из массива <c>subEntIds</c>. Параметр возрастает по мере удаления от базовой точки луча.

Teigha.DatabaseServices.Surface.SetSubentityColor(Teigha.DatabaseServices.SubentityId,Colors.Color)
Метод позволяет задать цвет указанному подобъекту данной поверхности.
subEntityId: Идентификатор подобъекта. Тип <c>SubentityId</c>.
color: Новый цвет подобъекта.    Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.Surface.SetSubentityMaterial(Teigha.DatabaseServices.SubentityId,DatabaseServices.ObjectId)
Метод позволяет назначить новый материал указанному подобъекту данной поверхности.
subEntityId: Идентификатор подобъекта.  Тип <c>SubentityId</c>.
materialId: Идентификатор материала, который назначается подобъекту. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Surface.SetSubentityMaterialMapper(Teigha.DatabaseServices.SubentityId,Teigha.GraphicsInterface.Mapper)
Метод позволяет задать указанному подобъекту новый объект <c>Mapper</c> для сопоставления материалов.
subEntityId: Идентификатор подобъекта. Тип <c>SubentityId</c>.
mapper: Объект <c>Mapper</c> для сопоставления материалов.

Teigha.DatabaseServices.Surface.SliceByPlane(Teigha.Geometry.Plane)
Метод позволяет разрезать плоскостью данную поверхность и преобразовать ее в ту часть, которая осталась со стороны от режущей плоскости с положительным направлением нормали.
slicePlane: Секущая плоскость. Тип <c>Plane</c>.
Returns: Возвращает объект <c>SurfaceSliceResults</c>, который включает как "отрицательную", так и "положительную" части разрезанной поверхности.

Teigha.DatabaseServices.Surface.SliceBySurface(Teigha.DatabaseServices.Surface)
Метод позволяет рассечь данный объект другой поверхностью и преобразовать его в ту часть, которая остается со стороны от режущей поверхности с положительным направлением нормали.
slicingSurface: Режущая поверхность. Тип <c>Surface</c>.
Returns: Возвращает объект <c>SurfaceSliceResults</c>, который включает как "отрицательную", так и "положительную" части разрезанной поверхности.

Teigha.DatabaseServices.Surface.Thicken(System.Double,System.Boolean)
Метод предназначен для создания трехмерного твердого тела утолщением данной поверхности на указанную величину.
thickness: Величина утолщения. Тип <c>double</c>.
bothSides: Флаг, определяющий, должно ли утолщение выполняться в обе стороны от исходной поверхности. Тип <c>bool</c>.
Returns: Возвращает твердое тело, созданное в результате утолщения. Тип <c>Solid3d</c>. В случае ошибки метода возвращает <c>NULL</c>.

Teigha.DatabaseServices.Surface.TrimSurface(DatabaseServices.ObjectId,Teigha.DatabaseServices.ObjectIdCollection,Teigha.DatabaseServices.ObjectIdCollection,Teigha.Geometry.Vector3dCollection,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean)
Метод позволяет обрезать поверхность с указанными режущими поверхностями (или кривыми).
blankSurfaceId: Обрезаемая поверхность. Тип <c>DatabaseServices.ObjectId</c>.
toolSurfaceIds: Массив идентификаторов режущих объектов, тела которых будут использоваться для обрезки поверхности непосредственно, без каких-либо дополнительных операций типа проецирования. Тип <c>ObjectIdCollection</c>.
toolCurveIds: Массив идентификаторов режущих кривых, которые будут использоваться для обрезки поверхности после предварительного проецирования их на поверхность. Тип <c>ObjectIdCollection</c>.
projVectors: Массив направлений проецирования для каждой режущей кривой из массива <c>ToolCurveIds</c>. Соответственно, размеры коллекций <c>projVectors</c> и <c>ToolCurveIds</c> должны совпадать. Тип <c>Vector3dCollection</c>.
pickPoint: Точка выбора, которая определяет, какую именно область указанной поверхности необходимо обрезать. Тип <c>Point3d</c>.
viewVector: Вектор, представляющий направление обзора для создания луча из точки выбора. Используется для устранения возможной неоднозначности определения обрезаемой области поверхности при использовании точки выбора.  Искомой областью будет та, которую луч, построенный в этом направлении, встретит первой.  Тип <c>Vector3d</c>.
bAutoExtend: Если флаг принимает значение <c>true</c>, то, когда тело инструмента состоит из одной грани с аналитической геометрией, эта базовая геометрия достраивается до поверхности, чтобы обеспечить обрезку. Геометрия самого режущего объекта не изменяется. Тип <c>bool</c>.
associativeEnabled: Флаг ассоциативной обрезки. Определяет, должна ли данная операция обрезки быть ассоциативной. Тип <c>bool</c>.

Teigha.DatabaseServices.Surface.Perimeter
Свойство <c>Perimeter</c> представляет текущее значение периметра данной поверхности.
Returns: Возвращает значение периметра. Тип <c>double</c>.

Teigha.DatabaseServices.Surface.UIsoLineDensity
Свойство <c>UIsoLineDensity</c> представляет плотность изолиний в направлении <c>U</c>, отображаемых при визуализации поверхности в каркасном режиме.
Returns: Возвращает плотность изолиний в направлении <c>U</c>. Тип <c>short</c>.

Teigha.DatabaseServices.Surface.VIsoLineDensity
Свойство <c>VIsoLineDensity</c> представляет плотность изолиний в направлении <c>V</c>, отображаемых при визуализации поверхности в каркасном режиме.
Returns: Возвращает плотность изолиний в направлении <c>V</c>. Тип <c>short</c>.