Teigha.LayerManager.LayerFilterTree.#ctor(Teigha.LayerManager.LayerFilter,Teigha.LayerManager.LayerFilter)
Конструктор структуры <c>LayerFilterTree</c>.
Создает экземпляр структуры с указанными корневым и текущим узлами дерева фильтров слоев.
root: Корневой узел дерева. Тип <c>LayerFilter</c>.
current: Текущий узел дерева.  Тип <c>LayerFilter</c>.

Teigha.LayerManager.LayerFilterTree.Current
Свойство <c>Current</c> представляет текущий узел дерева фильтров слоев.
Returns: Возвращает текущий узел дерева фильтров слоев.
Тип <c>LayerFilter</c>.

Teigha.LayerManager.LayerFilterTree.Root
Свойство <c>Root</c> представляет корневой узел дерева фильтров слоев.
Returns: Возвращает корневой узел дерева фильтров слоев.
Тип <c>LayerFilter</c>.