Teigha.DatabaseServices.Background
Класс Background является базовым классом для всех объектов, представляющих фон видового экрана.

Teigha.DatabaseServices.Background.#ctor(IntPtr,System.Boolean)
Конструктор класса Background.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Флаг автоудаления исходного объекта. Тип bool. Для удаления объекта следует передать значение <c>true</c>. В противном случае следует передать значение <c>false</c>.

Teigha.DatabaseServices.Background.GetBackgroundDictionaryId(DatabaseServices.Database,System.Boolean)
Метод позволяет получить идентификатор словаря фонов в указанной базе данных.
database: База данных, в которой следует получить доступ к словарю фонов. Тип <c>DatabaseServices.Database</c>.
createIfNotPresent: Предать <c>true</c>, если словарь должен быть создан в случае его отсутствия.  В противном случае передать <c>false</c>. Тип <c>bool</c>.
Returns: Возвращает идентификатор словаря фонов. Тип DatabaseServices.ObjectId.