Teigha.DatabaseServices.ExtrudedSurface
Этот класс реализует трехмерную поверхность, полученную в процессе экструзии.

Teigha.DatabaseServices.ExtrudedSurface.#ctor
Конструктор класса ExtrudedSurface.

Teigha.DatabaseServices.ExtrudedSurface.CreateExtrudedSurface(Teigha.DatabaseServices.Entity,Teigha.Geometry.Vector3d,DatabaseServices.SweepOptions)
Метод CreateExtrudedSurface предназначен для создания экструдированной поверхности сдвигом плоской кривой, области или плоской поверхности на заданный вектор.
sweepEnt: Выдавливаемый геометрический объект - кривая, область или плоская поверхность. Тип Entity.
directionVec: Вектор, определяющий направление и длину выдавливания. Тип Vector3d.
sweepOptions: Опции выдавливания из перечисления DatabaseServices.SweepOptions.

Teigha.DatabaseServices.ExtrudedSurface.SetExtrude(Teigha.Geometry.Vector3d,DatabaseServices.SweepOptions)
Метод позволяет задать параметры, определяющие экструдированную поверхность.
sweepVec: Новый вектор выдавливания.  Тип Vector3d.
sweepOptions: Опции выдавливания из перечисления DatabaseServices.SweepOptions.

Teigha.DatabaseServices.ExtrudedSurface.Height
Свойство Height обеспечивает доступ к длине экструзии.
Returns: Возвращает длину экструзии. Тип <c>double</c>.

Teigha.DatabaseServices.ExtrudedSurface.SweepEntity
Свойство SweepEntity обеспечивает доступ к геометрическому объекту, который был использован для создания выдавленной поверхности.
Returns: Возвращает объект чертежа. Тип <c>Entity</c>.

Teigha.DatabaseServices.ExtrudedSurface.SweepOptions
Свойство предоставляет доступ к опциям выдавливания SweepOptions.
Returns: Возвращает опции операции выдавливания. Тип SweepOptions.

Teigha.DatabaseServices.ExtrudedSurface.SweepVec
Свойство SweepVec предоставляет доступ к вектору выдавливания.
Returns: Возвращает вектор выдавливания. Тип Vector3d.

Teigha.DatabaseServices.ExtrudedSurface.TaperAngle
Свойство предоставляет доступ к уклону операции выдавливания.
Returns: Возвращает угол уклона экструзии в радианах. Тип <c>double</c>.