Teigha.DatabaseServices.DataTable
Класс DataTable предоставляет универсальный инструмент для хранения в виде двумерной таблицы числовых и текстовых данных, 3D-точек и идентификаторов объектов.

Teigha.DatabaseServices.DataTable.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.DataTable.#ctor(IntPtr,System.Boolean)
Конструктор класса DataTable.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Флаг автоудаления исходного объекта. Тип bool.

Teigha.DatabaseServices.DataTable.AppendColumn(Teigha.DatabaseServices.CellType,String)
Метод добавляет в таблицу данных DataTable новый столбец.
type: Тип добавляемого столбца. Тип CellType.
columnName: Имя добавляемого столбца. Тип <c>String</c>.

Teigha.DatabaseServices.DataTable.AppendRow(Teigha.DatabaseServices.DataCellCollection,System.Boolean)
Метод добавляет строку в конец данной таблицы.
Дополнительно метод позволяет выполнить проверку соответствия столбцов в строке и таблице по количеству и типам данных.
row: Вставляемая строка. Тип DataCellCollection.
validate: Флаг проверок соответствия строки структуре таблицы. Тип bool.  В настоящее время не используется.

Teigha.DatabaseServices.DataTable.Assign(Teigha.DatabaseServices.DataTable)
Метод копирует в эту таблицу данные из указанной таблицы. Не реализован.
other: Входная таблица, которая служит источником данных. Тип DataTable.

Teigha.DatabaseServices.DataTable.GetCellAt(System.Int32,System.Int32)
Метод позволяет получить ячейку данных, расположенную в указанных строке и столбце.
row: Номер строки таблицы.  Тип int.
col: Номер столбца таблицы. Тип int.
Returns: Возвращает ячейку данных. Тип DataCell.
В случае недействительного индекса строки или столбца выбрасывается исключение Teigha.Runtime.ErrorStatus.eInvalidInput.

Teigha.DatabaseServices.DataTable.GetColumnAt(System.Int32)
Метод позволяет получить столбец DataColumn по его индексу в данной таблице DataTable.
index: Индекс столбца. Тип <c>int</c>.
Returns: Возвращает столбец в заданной позиции <c>index</c>. Тип DataColumn.
В случае недействительного индекса происходит завершение работы приложения, сопровождаемое сообщением 'Operation is not valid due to the current state of the object.' (Текущее состояние объекта не позволяет выполнить операцию).

Teigha.DatabaseServices.DataTable.GetColumnIndexAtName(String)
Метод позволяет определить индекс столбца с указанным именем.
name: Имя искомого столбца. Тип String.
Returns: Возвращает индекс найденного столбца. Тип <c>int</c>.
Если столбец с указанным именем в таблице отсутствует, возвращает 0.

Teigha.DatabaseServices.DataTable.GetColumnNameAt(System.Int32)
Метод позволяет получить имя столбца с указанным индексом.
index: Индекс искомого столбца. Тип <c>int</c>.
Returns: Возвращает имя столбца. Тип <c>String</c>.
Если индекс оказался недействительным, метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.

Teigha.DatabaseServices.DataTable.GetColumnTypeAt
Метод позволяет получить тип столбца с указанным индексом.
index: Индекс искомого столбца. Тип int.
Returns: Возвращает тип  столбца. Тип CellType.
Если индекс оказался недействительным, метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.

Teigha.DatabaseServices.DataTable.GetRowAt
Метод позволяет получить строку с заданным индексом.
index: Индекс искомой строки. Тип <c>int</c>
Returns: Возвращает строку. Тип DataCellCollection.
Если индекс оказался недействительным, метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.

Teigha.DatabaseServices.DataTable.InsertColumnAt(System.Int32,Teigha.DatabaseServices.CellType,String)
Метод вставляет столбец в таблицу по указанному индексу столбца.
index: Индекс столбца. Тип <c>int</c>. Если индекс оказался недействительным, метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
type: Тип столбца. Тип CellType.
columnName: Имя столбца. Тип <c>String</c>.

Teigha.DatabaseServices.DataTable.InsertRowAt(System.Int32,Teigha.DatabaseServices.DataCellCollection,bool )
Метод вставляет в таблицу заданную строку перед строкой с указанным индексом.
Дополнительно метод позволяет проверить ячейки строки на соответствие структуре таблицы.
index: Индекс строки, перед которой вставляется новая строка. Тип <c>int</c>. В случае недействительного индекса выбрасывается исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
row: Вставляемая строка. Тип DataCellCollection.
validate: Флаг проверки. Тип <c>bool</c>. В текущей версии не используется.  Если в ходе проверки обнаружены ошибки, выбрасывается исключение Teigha.Runtime.ErrorStatus.eInvalidInput.

Teigha.DatabaseServices.DataTable.RemoveColumnAt(System.Int32)
Метод предназначен для удаления столбца с указанным индексом.
index: Индекс удаляемого столбца. Тип <c>int</c>. В случае недействительного индекса метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.

Teigha.DatabaseServices.DataTable.RemoveRowAt(System.Int32)
Метод предназначен для удаления строки с указанным индексом.
index: Индекс удаляемой строки. Тип <c>int</c>.

Teigha.DatabaseServices.DataTable.SetCellAt(System.Int32,System.Int32,Teigha.DatabaseServices.DataCell)
Метод позволяет задать данные в ячейке с указанными индексами строки и столбца.
row: Индекс строки. Тип <c>int</c>. В случае недействительного индекса строки метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
col: Индекс столбца. Тип <c>int</c>. В случае недействительного индекса столбца метод выбрасывает исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
cell: Данные для ячейки. Тип DataCell.

Teigha.DatabaseServices.DataTable.SetRowAt(System.Int32,Teigha.DatabaseServices.DataCellCollection,System.Boolean)
Метод позволяет задать (или заменить) данные строки с указанным индексом.
Дополнительно метод позволяет выполнить проверки предоставленных данных на соответствие структуре таблицы.
index: Индекс строки. Тип <c>int</c>. В случае недействительного индекса выбрасывается исключение Teigha.Runtime.ErrorStatus.eInvalidInput.
row: Коллекция ячеек для строки. Тип DataCellCollection.
validate: Флаг проверок. Тип <c>bool</c>. Если данные в не проходят проверку, выбрасывается исключение Teigha.Runtime.ErrorStatus.eInvalidInput.

Teigha.DatabaseServices.DataTable.NumColsGrowSize
Свойство возвращает или позволяет задать инкремент физического количества столбцов в таблице.
Returns: Возвращает инкремент физического количества столбцов в таблице. Тип int.

Teigha.DatabaseServices.DataTable.NumColsPhysicalSize
Свойство предоставляет доступ к количеству столбцов, выделенных для таблицы.
Returns: Возвращает физический размер таблицы в столбцах. Тип int.

Teigha.DatabaseServices.DataTable.NumColumns
Свойство предоставляет доступ к текущему количеству столбцов в таблице.
Returns: Возвращает текущее количество столбцов в таблице. Тип int.

Teigha.DatabaseServices.DataTable.NumRows
Свойство предоставляет доступ к текущему количеству строк в таблице.
Returns: Возвращает текущее количество строк в таблице. Тип int.

Teigha.DatabaseServices.DataTable.NumRowsGrowSize
Свойство возвращает или позволяет задать инкремент физического количества строк в таблице.
Returns: Возвращает инкремент физического количества строк в таблице. Тип int.

Teigha.DatabaseServices.DataTable.NumRowsPhysicalSize
Свойство предоставляет доступ к физическому размеру таблицы в строках.
Returns: Возвращает физический размер таблицы в строках. Тип int.

Teigha.DatabaseServices.DataTable.TableName
Свойство предоставляет доступ к имени таблицы.
Returns: Возвращает имя таблицы. Тип String.