Teigha.DatabaseServices.LoftOptionsCheckCurvesOut
Этот класс представляет группу флагов, которые отражают состояние кривых поперечных сечений при их использовании в операциях вытягивания поверхностей по сечениям (лофт).

Teigha.DatabaseServices.LoftOptionsCheckCurvesOut.#ctor
Конструктор ро умолчанию класса <c>LoftOptionsCheckCurvesOut</c>.

Teigha.DatabaseServices.LoftOptionsCheckCurvesOut.AllClosed
Свойство позволяет проверить, все ли поперечные сечения являются замкнутыми.
Returns: Возвращает <c>true</c>, если все поперечные сечения являются замкнутыми.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptionsCheckCurvesOut.AllOpen
Свойство позволяет проверить, все ли поперечные сечения являются незамкнутыми.
Returns: Возвращает <c>true</c>, если все поперечные сечения являются незамкнутыми.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptionsCheckCurvesOut.AllPlanar
Свойство позволяет проверить, все ли поперечные сечения являются плоскими.
Returns: Возвращает <c>true</c>, если все поперечные сечения являются плоскими.
В противном случае возвращает <c>false</c>.