Teigha.DatabaseServices.Solid3dMassProperties.#ctor(System.Int32)
Конструктор класса <c>Solid3dMassProperties</c>.
dummy: Не используется. Тип <c>int</c>.

Teigha.DatabaseServices.Solid3dMassProperties.Centroid
Свойство <c>Centroid</c> представляет центр тяжести твердого тела.
Returns: Возвращает координатную точку центра тяжести твердого тела.
Тип <c>Point3d</c>.

Teigha.DatabaseServices.Solid3dMassProperties.Extents
Свойство <c>Extents</c> представляет габаритную рамку твердого тела.
Returns: Возвращает габаритную рамку твердого тела. Тип <c>Extents3d</c>.

Teigha.DatabaseServices.Solid3dMassProperties.PrincipalAxes
Свойство <c>PrincipalAxes</c> представляет главную ось твердого тела по ее индексу.
Returns: Возвращает главную ось тела по ее индексу. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Solid3dMassProperties.MomentsOfIntertia
Свойство <c>MomentsOfIntertia</c> представляет моменты инерции твердого тела относительно осей <c>X</c>, <c>Y</c> и <c>Z</c>.
Returns: Возвращает моменты инерции твердого тела. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Solid3dMassProperties.PrincipalMoments
Свойство <c>PrincipalMoments</c> представляет главные моменты инерции твердого тела относительно осей <c>X</c>, <c>Y</c> и <c>Z</c>.
Returns: Возвращает главные моменты инерции. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Solid3dMassProperties.ProductsOfIntertia
Свойство <c>ProductsOfIntertia</c> представляет центробежные моменты инерции твердого тела относительно осей <c>X</c>, <c>Y</c> и <c>Z</c>.
Returns: Возвращает центробежные моменты инерции. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Solid3dMassProperties.RadiiOfGyration
Свойство <c>RadiiOfGyration</c> представляет радиусы инерции твердого тела относительно осей <c>X</c>, <c>Y</c> и <c>Z</c>.
Returns: Возвращает радиусы инерции. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Solid3dMassProperties.Volume
Свойство <c>Volume</c> представляет текущий объем твердого тела.
Returns: Возвращает объем твердого тела. Тип <c>double</c>.