Teigha.BoundaryRepresentation.LoopVertexCollection
Класс <c>LoopVertexCollection</c> представляет коллекцию вершин цикла грани.

Teigha.BoundaryRepresentation.LoopVertexCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции.
Returns: Возвращает перечислитель данной коллекции.
Тип <c>LoopVertexEnumerator</c>.