Teigha.Geometry.BoundedPlane
Класс <c>BoundedPlane</c> представляет ограниченную плоскую параметрическую поверхность.

Teigha.Geometry.BoundedPlane.#ctor
Конструктор по умолчанию класса <c>BoundedPlane</c>.
Создает действительную бесконечную плоскую поверхность в плоскости <c>XY</c>.

Teigha.Geometry.BoundedPlane.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса <c>BoundedPlane</c>.
Создает ограниченную плоскую поверхность, определяемую ее началом и двумя точками в этой плоскости.
p1: Первая точка. Тип <c>Point3d</c>.
origin: Точка начала. Тип <c>Point3d</c>.
p2: Вторая точка. Тип <c>Point3d</c>.

Teigha.Geometry.BoundedPlane.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса <c>BoundedPlane</c>.
Создает ограниченную плоскую поверхность, определяемую точкой начала и двумя векторами в этой плоскости.
origin: Точка начала.    Тип <c>Point3d</c>.
u: Вектор <c>U</c>. Тип <c>Vector3d</c>.
v: Вектор <c>V</c>. Тип <c>Vector3d</c>.

Teigha.Geometry.BoundedPlane.Create(IntPtr,System.Boolean)
Метод создает объект <c>BoundedPlane</c> на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, на основе которого создается данный объект.  Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора.  Тип <c>bool</c>.
Returns: Возвращает вновь созданный экземпляр класса <c>BoundedPlane</c>.

Teigha.Geometry.BoundedPlane.IntersectWith(Teigha.Geometry.BoundedPlane)
Метод позволяет создать линию пересечения данного объекта с переданной ограниченной плоскостью.
plane: Ограниченная плоскость, с которой строится линия пересечения.
Returns: Возвращает линейный сегмент, являющийся результатом пересечения данного объекта с входным объектом <c>plane</c>.
Тип <c>LineSegment3d</c>.

Teigha.Geometry.BoundedPlane.IntersectWith(Teigha.Geometry.BoundedPlane,Teigha.Geometry.Tolerance)
Метод позволяет создать линию пересечения данного объекта с переданной ограниченной плоскостью с указанной точностью.
plane: Ограниченная плоскость, с которой строится линия пересечения.  Тип <c>BoundedPlane</c>.
tolerance: Точность геометрических вычислений.  Тип <c>Tolerance</c>.
Returns: Возвращает линейный сегмент, являющийся результатом пересечения данного объекта с входным объектом <c>plane</c>.
Тип <c>LineSegment3d</c>.

Teigha.Geometry.BoundedPlane.IntersectWith(Teigha.Geometry.Plane)
Метод позволяет создать линию пересечения данного объекта с указанной плоскостью.
plane: Плоскость, с которой строится линия пересечения.  Тип <c>Plane</c>.
Returns: Возвращает линейный сегмент, являющийся результатом пересечения данного объекта с входным объектом <c>plane</c>.
Тип <c>LineSegment3d</c>.

Teigha.Geometry.BoundedPlane.IntersectWith(Teigha.Geometry.Plane,Teigha.Geometry.Tolerance)
Метод позволяет с указанной точностью создать линию пересечения данного объекта с переданной плоскостью.
plane: Плоскость, с которой строится линия пересечения. Тип <c>Plane</c>.
tolerance: Точность геометрических вычислений.  Тип <c>Tolerance</c>.
Returns: Возвращает линейный сегмент, являющийся результатом пересечения данного объекта с входным объектом <c>plane</c>.
Тип <c>LineSegment3d</c>.

Teigha.Geometry.BoundedPlane.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет переопределить данный объект, используя новые координаты начала и две точки в этой плоскости.
p1: Новое положение первой точки. Тип <c>Point3d</c>.
origin: Новое положение точки начала. Тип <c>Point3d</c>.
p2: Новое положение второй точки. Тип <c>Point3d</c>.

Teigha.Geometry.BoundedPlane.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить данный объект, используя указанные координаты начала и два вектора в этой плоскости.
origin: Новое положение точки начала.  Тип <c>Point3d</c>.
u: Входной вектор <c>u</c>.       Тип <c>Vector3d</c>.
v: Входной вектор <c>v</c>.       Тип <c>Vector3d</c>.