Teigha.DatabaseServices.AlignedDimension
Класс AlignedDimension представляет тип размера, определяющего расстояние между двумя произвольными точками в пространстве.

Teigha.DatabaseServices.AlignedDimension.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.AlignedDimension.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,String,DatabaseServices.ObjectId)
Данный конструктор создает новый объект AlignedDimension с использованием переданных в конструктор параметров (опорные точки, размерный текст, размерный стиль и т.д.).
line1Point: Первая опорная точка размера, от которой измеряется длина. В ней начинается первая выносная линия. Тип Point3d.
line2Point: Вторая опорная точка размера, до которой измеряется длина. В ней начинается вторая выносная линия. Тип Point3d.
dimensionLinePoint: Точка, лежащая на размерной линии. Тип Point3d.
dimensionText: Текст на размере, заменяет текстовое представление измеренного значения. Тип String.
dimensionStyle: Идентификатор ObjectId размерного стиля, который используется для отображения объекта AlignedDimension.

Teigha.DatabaseServices.AlignedDimension.Oblique
Свойство предоставляет доступ на изменение к углу наклона этого размера (в радианах).
Returns: Возвращает угол наклона данного размера в радианах.

Teigha.DatabaseServices.AlignedDimension.dimLinePoint
Свойство предоставляет доступ на изменение к точке определения размерной линии (в координатах WCS).
Returns: Возвращает точку Point3d в мировой системе координат (WCS).

Teigha.DatabaseServices.AlignedDimension.xLine1Point
Свойство предоставляет доступ на изменение к начальной точке первой выносной линии размера (в координатах WCS).
Returns: Возвращает начальную точку первой выносной линии размера (в координатах WCS).  Тип Point3d.

Teigha.DatabaseServices.AlignedDimension.xLine2Point
Свойство предоставляет доступ на изменение к начальной точке второй выносной линии размера (в координатах WCS).
Returns: Возвращает начальную точку второй выносной линии размера (в координатах WCS). Тип Point3d.