Teigha.Geometry.ExternalCurve3d
Класс <c>ExternalCurve3d</c> представляет 3D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.

Teigha.Geometry.ExternalCurve3d.#ctor
Конструктор по умолчанию класса <c>ExternalCurve3d</c>.

Teigha.Geometry.ExternalCurve3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект.
Тип <c>ExternalCurve3d</c>.

Teigha.Geometry.ExternalCurve3d.Set(IntPtr,Teigha.Geometry.ExternalEntityKind)
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
curveDef: Указатель на определение внешней кривой. Тип <c>IntPtr</c>.
curveKind: Информация о системе, в которой было создано определение внешнего объекта. Тип <c>ExternalEntityKind</c>.

Teigha.Geometry.ExternalCurve3d.SetToOwnCurve
Метод делает этот объект владельцем данных своего определения.

Teigha.Geometry.ExternalCurve3d.ExternalCurve
Свойство <c>ExternalCurve</c> представляет внешнюю кривую в ее исходном виде.
Returns: Возвращает указатель на внешнюю кривую.
Тип <c>IntPtr</c>.

Teigha.Geometry.ExternalCurve3d.ExternalCurveKind
Свойство <c>ExternalCurveKind</c> представляет информацию о нативной системе, в которой было создано определение внешней кривой.
Returns: Возвращает информацию о системе, в которой было создано определение внешнего объекта.
Тип <c>Geometry.ExternalEntityKind</c>.

Teigha.Geometry.ExternalCurve3d.IsCircularArc
Свойство <c>IsCircularArc</c> позволяет проверить, представляет ли данный объект круглую дугу.
Returns: Возвращает <c>true</c>, если внешняя кривая представлена нативным определением в геометрической библиотеке платформы nanoCAD. В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve3d.IsDefined
Свойство <c>IsDefined</c> позволяет проверить, является ли данный объект определенным, т.е. сформировано ли определение данной кривой.
Returns: Возвращает <c>true</c>, если данный объект имеет определение кривой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve3d.IsEllipticalArc
Свойство <c>IsEllipticalArc</c> позволяет проверить, представляет ли данный объект эллиптическую дугу.
Returns: Возвращает <c>true</c>, если данный объект представляет эллиптическую дугу.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve3d.IsLine
Свойство <c>IsLine</c> позволяет проверить, представляет ли данный объект прямую линию.
Returns: Возвращает <c>true</c>, если данный объект представляет прямую линию.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve3d.IsLineSegment
Свойство <c>IsLineSegment</c> позволяет проверить, представляет ли данный объект прямолинейный сегмент.
Returns: Возвращает <c>true</c>, если данный объект представляет прямолинейный сегмент.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve3d.IsNativeCurve
Свойство <c>IsNativeCurve</c> позволяет проверить, поддерживает ли геометрическая библиотека платформы нативное представление данной внешней кривой.
Returns: Возвращает <c>true</c>, если геометрической библиотекой платформы поддерживается нативное представление данной внешней кривой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve3d.IsNurbCurve
Свойство <c>IsNurbCurve</c> позволяет проверить, может ли экземпляр внешней кривой быть представлен определением, которое является нативным для графической системы платформы.
Returns: Возвращает <c>true</c>, если внешняя кривая имеет точное нативное представление в графической системе платформы.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve3d.IsOwnerOfCurve
Свойство <c>IsOwnerOfCurve</c> позволяет убедиться, что данный объект является владельцем данных своего определения.
Returns: Возвращает <c>true</c>, если данный объект является владельцем данных своего определения.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve3d.IsRay
Свойство <c>IsRay</c> позволяет проверить, представляет ли данный объект луч.
Returns: Возвращает <c>true</c>, если данный объект представляет луч.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve3d.NativeCurve
Свойство <c>NativeCurve</c> обеспечивает доступ к нативному представлению данной внешней кривой в геометрической библиотеке платформы.
Returns: Возвращает нативное представление данной внешней кривой в геометрической библиотеке платформы.
Тип <c>Curve3d</c>.