Teigha.DatabaseServices.FullDwgVersion
Этот класс представляет основные и второстепенные версии DWG.

Teigha.DatabaseServices.FullDwgVersion.#ctor(Teigha.DatabaseServices.DwgVersion,Teigha.DatabaseServices.MaintenanceReleaseVersion)
Конструктор класса FullDwgVersion. Создает объект с заданными настройками версии (major/minor).
majorVersion: Основная версия DWG.   Значение из перечисления <c>DwgVersion</c>.
minorVersion: Второстепенная версия. Значение из перечисления <c>MaintenanceReleaseVersion</c>.

Teigha.DatabaseServices.FullDwgVersion.Equals(Object)
Метод предназначен для проверки данного объекта на совпадение с указанным объектом.
other: Объект, с которым выполняется сравнение. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если данный объект идентичен объекту <c>other</c>.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.FullDwgVersion.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Returns: Возвращает хеш-код объекта. Тип <c>int</c>.

Teigha.DatabaseServices.FullDwgVersion.ToString
Метод предназначен для формирования эквивалентного строкового представления данного объекта.
Returns: Возвращает эквивалентное представление данного объекта в виде строки. Тип <c>String</c>.

Teigha.DatabaseServices.FullDwgVersion.MajorVersion
Свойство возвращает основную (major) версию DWG.
Returns: Возвращает основную версию DWG. Значение из перечисления  <c>DwgVersion</c>.

Teigha.DatabaseServices.FullDwgVersion.MinorVersion
Свойство возвращает второстепенную (minor) версию DWG.
Returns: Возвращает версию технического релиза DWG. Значение из перечисления <c>MaintenanceReleaseVersion</c>.