Teigha.BoundaryRepresentation.VertexLoopCollection
Класс <c>VertexLoopCollection</c> представляет набор циклов, связанных с вершиной.

Teigha.BoundaryRepresentation.VertexLoopCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции циклов.
Returns: Возвращает перечислитель коллекции циклов.
Тип <c>VertexLoopEnumerator</c>.