Teigha.DatabaseServices.LoftedSurface
Этот класс реализует трехмерный объект, поверхность которого получена при помощи лофта - вытягивания поверхности по сечениям.

Teigha.DatabaseServices.LoftedSurface.#ctor
Конструктор по умолчанию класса <c>LoftedSurface</c>.

Teigha.DatabaseServices.LoftedSurface.CreateLoftedSurface(array&lt;Entity&gt;,array&lt;Entity&gt;,Teigha.DatabaseServices.Entity,DatabaseServices.LoftOptions)
Метод позволяет создать лофтом поверхность на основе заданных кривых в соответствии с переданными параметрами операции лофта.
crossSections: Массив поперечных сечений. Тип <c>Entity[]</c>.
guideCurves: Массив направляющих. Тип <c>Entity[]</c>.
pathCurve: Траектория вытягивания поверхности. Тип <c>Entity</c>.
loftOptions: Опции операции лофта. Тип <c>DatabaseServices.LoftOptions</c>. Эти опции оказывают влияние на геометрию получаемой поверхности.

Teigha.DatabaseServices.LoftedSurface.Closed
Свойство предоставляет возможность проверить замкнутость полученной вытянутой поверхности.
Returns: Возвращает <c>true</c>, если поверхность является замкнутой.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftedSurface.CrossSections
Свойство возвращает массив объектов, используемых в качестве профилей поперечных сечений.
Returns: Возвращает массив кривых поперечных сечений. Тип <c>Entity[]</c>.

Teigha.DatabaseServices.LoftedSurface.GuideCurves
Свойство возвращает массив объектов (кривых), используемых в качестве направляющих для вытягивания поверхности по сечениям.
Returns: Возвращает массив направляющих. Тип <c>Entity[]</c>.

Teigha.DatabaseServices.LoftedSurface.LoftOptions
Свойство представляет параметры лофта, используемые для управления геометрией результирующей поверхности.
Returns: Возвращает параметры лофта. Тип <c>DatabaseServices.LoftOptions</c>.

Teigha.DatabaseServices.LoftedSurface.NumberOfCrossSections
Свойство возвращает количество используемых поперечных сечений.
Returns: Возвращает количество поперечных сечений. Тип <c>int</c>.

Teigha.DatabaseServices.LoftedSurface.PathEntity
Свойство возвращает объект траектории, вдоль которой выполняется лофт.
Returns: Возвращает траекторию лофта.  Тип <c>Entity</c>.