Teigha.Geometry.NurbCurve3d
Класс <c>NurbCurve3d</c> представляет неоднородные рациональные B-сплайны (NURBS) в трехмерном пространстве.

Teigha.Geometry.NurbCurve3d.#ctor
Конструктор по умолчанию класса <c>NurbCurve3d</c>.
Создаваемые им объекты не содержат никаких данных.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.EllipticalArc3d)
Конструктор класса <c>NurbCurve3d</c>.
Создает трехмерную NURBS кривую, которая интерполирует указанную трехмерную эллиптическую дугу.
ellipse: Входная эллиптическая дуга. Тип <c>EllipticalArc3d</c>.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.LineSegment3d)
Конструктор класса <c>NurbCurve3d</c>.
Создает трехмерную NURBS кривую, которая интерполирует указанный линейный сегмент.
lineSegment: Входной линейный сегмент. Тип <c>LineSegment3d</c>.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection)
Конструктор класса <c>NurbCurve3d</c>.
Создает трехмерную NURBS кривую, которая в пределах точности по умолчанию интерполирует указанный массив трехмерных точек.
fitPoints: Входная коллекция определяющих точек. Тип <c>Point3dCollection</c>.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Tolerance)
Конструктор класса <c>NurbCurve3d</c>.
Создает трехмерную NURBS кривую, которая с заданной точностью интерполирует указанный массив трехмерных точек.
fitPoints: Входная коллекция определяющих точек. Тип <c>Point3dCollection</c>.
fitTolerance: Входная точность интерполяции. Тип <c>Tolerance</c>. Ограничивает максимальное отклонение интерполирующей кривой от определяющих точек.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean)
Конструктор класса <c>NurbCurve3d</c>.
Создает трехмерную кривую, которая с точностью по умолчанию интерполирует заданный массив трехмерных точек и опционально учитывает указанные направления касательных в начальной и конечной точках.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип <c>Point3dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector3d</c>.
endTangent: Вектор касательной в конечной точке.  Тип <c>Vector3d</c>.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>startTangent</c>. Тип <c>bool</c>.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>endTangent</c>.   Тип <c>bool</c>.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean,Teigha.Geometry.Tolerance)
Конструктор класса <c>NurbCurve3d</c>.
Создает трехмерную кривую, которая с предписанной точностью интерполирует заданный массив трехмерных точек и опционально учитывает указанные направления касательных в начальной и конечной точках.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип <c>Point3dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector3d</c>.
endTangent: Вектор касательной в конечной точке.  Тип <c>Vector3d</c>.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>startTangent</c>. Тип <c>bool</c>.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>endTangent</c>.   Тип <c>bool</c>.
fitTolerance: Заданная точность интерполяции. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean,Teigha.Geometry.KnotParameterizationEnum)
Конструктор класса <c>NurbCurve3d</c>.
Создает трехмерную кривую, которая с точностью по умолчанию интерполирует заданный массив трехмерных точек, используя предписанный метод узловой параметризации и указанные направления касательных в начальной и конечной точках.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип <c>Point3dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector3d</c>.
endTangent: Вектор касательной в конечной точке.  Тип <c>Vector3d</c>.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>startTangent</c>. Тип <c>bool</c>.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>endTangent</c>.   Тип <c>bool</c>.
knotParam: Метод узловой параметризации сплайна. Перечисление <c>KnotParameterizationEnum</c>.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean,Teigha.Geometry.KnotParameterizationEnum,Teigha.Geometry.Tolerance)
Конструктор класса <c>NurbCurve3d</c>.
Создает трехмерную кривую, которая с заданной точностью интерполирует заданный массив трехмерных точек, используя предписанный метод узловой параметризации и указанные направления касательных в начальной и конечной точках.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип <c>Point3dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector3d</c>.
endTangent: Вектор касательной в конечной точке.  Тип <c>Vector3d</c>.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>startTangent</c>. Тип <c>bool</c>.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>endTangent</c>.   Тип <c>bool</c>.
knotParam: Метод узловой параметризации сплайна. Перечисление <c>KnotParameterizationEnum</c>.
fitTolerance: Заданная точность интерполяции. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve3d.#ctor(System.Int32,Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,System.Boolean)
Конструктор класса <c>NurbCurve3d</c>.
Создает NURBS кривую заданной степени с указанными узловым вектором и массивом управляющих вершин.
degree: Степень NURBS кривой. Тип <c>int</c>.
knots: Узловой вектор. Тип <c>KnotCollection</c>.
controlPoints: Коллекция управляющих вершин. Тип <c>Point3dCollection</c>.
periodic: Флаг, который определяет, следует ли создавать периодическую (и замкнутую) кривую. Тип <c>bool</c>.

Teigha.Geometry.NurbCurve3d.#ctor(System.Int32,Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,System.Boolean)
Конструктор класса <c>NurbCurve3d</c>.
Создает опционально замкнутую NURBS кривую заданной степени с указанными узловым вектором и массивами управляющих вершин и значений весов.
degree: Степень NURBS кривой. Тип <c>int</c>.
knots: Узловой вектор. Тип <c>KnotCollection</c>.
controlPoints: Коллекция управляющих вершин. Тип <c>Point3dCollection</c>.
weights: Коллекция весов. Тип <c>DoubleCollection</c>.
periodic: Флаг, который определяет, следует ли создавать периодическую (и замкнутую) кривую. Тип <c>bool</c>.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection,System.Boolean)
Конструктор класса <c>NurbCurve3d</c>.
fitPoints: Массив определяющих точек для интерполирующей кривой.  Тип <c>Point3dCollection</c>.
fitTangents: Векторы, интерполирующие производные кривой в определяющих точках.  Тип <c>Vector3dCollection</c>.
periodic: Флаг, определяющий, должна ли создаваемая кривая быть периодической (замкнутой). Тип <c>bool</c>.

Teigha.Geometry.NurbCurve3d.#ctor(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection,Teigha.Geometry.Tolerance,System.Boolean)
Конструктор класса <c>NurbCurve3d</c>. Создает экземпляр класса с указанными параметрами.
fitPoints: Массив определяющих точек для интерполирующей кривой.  Тип <c>Point3dCollection</c>.
fitTangents: Векторы, интерполирующие производные кривой в определяющих точках.  Тип <c>Vector3dCollection</c>.
fitTolerance: Заданная точность интерполяции. Тип <c>Tolerance</c>. Ограничивает максимальное отклонение интерполирующей кривой от определяющих точек.
periodic: Флаг, определяющий, должна ли создаваемая кривая быть периодической (замкнутой). Тип <c>bool</c>.

Teigha.Geometry.NurbCurve3d.#ctor(System.Int32,Teigha.Geometry.PolylineCurve3d,System.Boolean)
Конструктор класса <c>NurbCurve3d</c>.
Создает NURBS кривую заданной степени, которая интерполирует вершины указанной полилинии и опционально может быть замкнутой.
degree: Входная степень NURBS кривой. Тип <c>int</c>.
fitPolyline: 3D-полилиния, вершины которой служат определяющими точками для NURBS кривой. Тип <c>PolylineCurve3d</c>.
periodic: Флаг, указывающий, что требуется получить периодическую (и замкнутую) NURBS кривую. Тип <c>bool</c>.

Teigha.Geometry.NurbCurve3d.AddControlPointAt(System.Double,Teigha.Geometry.Point3d,System.Double)
Метод добавляет управляющую вершину в указанном узле.
newKnot: Параметр узла, в котором добавляется новая управляющая вершина. Тип <c>double</c>.
point: Координаты добавляемой управляющей вершины. Тип <c>Point3d</c>.
weight: Значение веса, которое присваивается управляющей вершине. Тип <c>double</c>.

Teigha.Geometry.NurbCurve3d.AddFitPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет вставить определяющую точку с заданным индексом.
index: Индекс определяющей точки. Тип <c>int</c>.
point: Координаты определяющей точки. Тип <c>Point3d</c>.
Returns: Возвращает <c>true</c>, если сплайн был создан методом определяющих точек, и добавление новой определяющей точки с заданным индексом завершилась успешно.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve3d.AddKnot(System.Double)
Метод добавляет новый узел в узловой вектор сплайна.
newKnot: Новый узел. Тип <c>double</c>.

Teigha.Geometry.NurbCurve3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>NurbCurve3d</c>.

Teigha.Geometry.NurbCurve3d.DeleteControlPointAt(System.Int32)
Метод удаляет управляющую вершину с указанным индексом.
index: Индекс удаляемой управляющей вершины.  Тип <c>int</c>.

Teigha.Geometry.NurbCurve3d.DeleteFitPointAt(System.Int32)
Метод удаляет определяющую точку с указанным индексом.
index: Индекс удаляемой определяющей точки. Тип <c>int</c>.
Returns: Возвращает <c>true</c> в случае успешного удаления определяющей точки.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve3d.ElevateDegree(System.Int32)
Метод увеличивает степень сплайна на указанную величину.
plusDegree: Величина, на которую увеличивается степень сплайна.  Тип <c>int</c>.

Teigha.Geometry.NurbCurve3d.GetFitPointAt(System.Int32)
Метод предоставляет определяющую точку с указанным индексом.
index: Индекс определяющей точки. Тип <c>int</c>.
Returns: Возвращает определяющую точку с индексом <c>index</c>. Тип <c>Point3d</c>.

Teigha.Geometry.NurbCurve3d.GetFitTangents
Метод предоставляет векторы касательных в начальной и конечной точках, если данный сплайн был построен методом определяющих точек.
Returns: Возвращает векторы производных в начальной и конечной точках в виде массива из двух элементов.
Тип <c>Vector3d[]</c>.

Teigha.Geometry.NurbCurve3d.GetParametersOfC1Discontinuity
Метод предоставляет значения параметра всех точек сплайна с нарушенной C1 непрерывностью (неравные касательные векторы слева и справа от точки).
Returns: Возвращает массив значений параметра в точках с нарушенной C1 непрерывностью.
Тип <c>DoubleCollection</c>.

Teigha.Geometry.NurbCurve3d.GetParametersOfC1Discontinuity(Teigha.Geometry.Tolerance)
Метод предоставляет значения параметра всех точек сплайна, где в пределах указанной точности нарушена C1 непрерывность (неравные касательные векторы слева и справа от точки).
tolerance: Входная точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив значений параметра в точках с нарушенной C1 непрерывностью.
Тип <c>DoubleCollection</c>.

Teigha.Geometry.NurbCurve3d.GetParametersOfG1Discontinuity
Метод предоставляет значения параметра всех точек сплайна с нарушенной G1 непрерывностью (неколлинеарность касательных векторов слева и справа от точки).
Returns: Возвращает массив значений параметра в точках с нарушенной G1 непрерывностью.
Тип <c>DoubleCollection</c>.

Teigha.Geometry.NurbCurve3d.GetParametersOfG1Discontinuity(Teigha.Geometry.Tolerance)
Метод предоставляет значения параметра всех точек сплайна с нарушенной в пределах заданной точности G1 непрерывностью (неколлинеарность  касательных векторов слева и справа от точки).
tolerance: Входная точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив значений параметра в точках с нарушенной G1 непрерывностью.
Тип <c>DoubleCollection</c>.

Teigha.Geometry.NurbCurve3d.GetWeightAt(System.Int32)
Метод предоставляет вес управляющей вершины с указанным индексом.
index: Индекс управляющей вершины. Тип <c>int</c>.  Должен быть неотрицательным и меньше количества управляющих вершин.
Returns: Возвращает значение веса по указанному индексу.
Тип <c>double</c>.

Teigha.Geometry.NurbCurve3d.HardTrimByParams(System.Double,System.Double)
Метод позволяет обрезать данную NURBS кривую, задав ей новые значения начального и конечного параметров.
newStartParameter: Новое начальное значение параметра. Тип <c>double</c>.
newEndParameter: Новое конечное  значение параметра. Тип <c>double</c>.

Teigha.Geometry.NurbCurve3d.InsertKnot(System.Double)
Метод вставляет новый узел в узловой вектор данной кривой.
newKnot: Новый узел.

Teigha.Geometry.NurbCurve3d.JoinWith(Teigha.Geometry.NurbCurve3d)
Метод дополняет данную кривую указанным сплайном и перевычисляет результирующую кривую.
curve: Сплайн, который требуется присоединить к данной кривой.

Teigha.Geometry.NurbCurve3d.MakeClosed
Метод позволяет сделать данную кривую замкнутой, если она еще не замкнута.

Teigha.Geometry.NurbCurve3d.MakeNonPeriodic
Метод делает данную кривую непериодической (если она таковой еще не является).

Teigha.Geometry.NurbCurve3d.MakeOpen
Метод делает замкнутый сплайн незамкнутым.

Teigha.Geometry.NurbCurve3d.MakePeriodic
Метод позволяет сделать данную кривую периодическим сплайном.

Teigha.Geometry.NurbCurve3d.MakeRational(System.Double)
Метод позволяет преобразовать данную кривую в рациональный сплайн.
Каждой управляющей вершине назначается указанный вес.
weight: Вес, который назначается каждой управляющей вершине. Тип <c>double</c>.

Teigha.Geometry.NurbCurve3d.PurgeFitData
Метод предназначен для удаления всех определяющих данных, использованных для построения данной кривой.
Returns: Возвращает <c>true</c>, если этот сплайн был построен методом определяющих точек.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve3d.SetEvaluateMode(System.Boolean)
Метод задает режим вычислений, включающий или отключающий внутреннюю оптимизацию.
evaluateMode: Режим вычислений NURBS кривой. Тип <c>bool</c>.

Teigha.Geometry.NurbCurve3d.SetFitData(System.Int32,Teigha.Geometry.Point3dCollection)
Метод перевычисляет сплайн, используя указанные определяющие точки и степень сплайна, а также точность по умолчанию.
degree: Степень сплайна. Тип <c>int</c>.
fitPoints: Массив определяющих точек сплайна. Тип <c>Point3dCollection</c>.

Teigha.Geometry.NurbCurve3d.SetFitData(System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.Tolerance)
Метод перевычисляет сплайн, используя указанные определяющие точки, степень сплайна и точность интерполяции.
degree: Степень сплайна. Тип <c>int</c>.
fitPoints: Массив определяющих точек сплайна. Тип <c>Point3dCollection</c>.
fitTolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve3d.SetFitData(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Boolean)
Метод пересчитывает сплайн, используя указанные определяющие точки, векторы касательных в начальной и конечной точках и точность по умолчанию.
fitKnots: Узловой вектор нового сплайна. Тип <c>KnotCollection</c>.
fitPoints: Массив определяющих точек. Тип <c>Point3dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector3d</c>.
endTangent: Вектор касательной в конечной точке. Тип <c>Vector3d</c>.
periodic: Флаг, определяющий, требуется ли построить периодический сплайн (замкнутую кривую). Тип <c>bool</c>.

Teigha.Geometry.NurbCurve3d.SetFitData(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance,System.Boolean)
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
Опционально сплайн может быть построен периодическим.
fitKnots: Узловой вектор нового сплайна. Тип <c>KnotCollection</c>.
fitPoints: Массив определяющих точек. Тип <c>Point3dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector3d</c>.
endTangent: Вектор касательной в конечной точке. Тип <c>Vector3d</c>.
fitTolerance: Геометрическая точность. Тип <c>Tolerance</c>.
periodic: Флаг, определяющий, требуется ли построить периодический сплайн (замкнутую кривую). Тип <c>bool</c>.

Teigha.Geometry.NurbCurve3d.SetFitData(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках.
fitPoints: Определяющие точки. Тип <c>Point3dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector3d</c>.
endTangent: Вектор касательной в конечной  точке. Тип <c>Vector3d</c>.

Teigha.Geometry.NurbCurve3d.SetFitData(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
fitPoints: Определяющие точки. Тип <c>Point3dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector3d</c>.
endTangent: Вектор касательной в конечной точке.  Тип <c>Vector3d</c>.
fitTolerance: Геометрическая точность. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve3d.SetFitData(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.KnotParameterizationEnum,Teigha.Geometry.Tolerance)
Метод задает новые определяющие данные в этом объекте и перевычисляет сплайн.
fitPoints: Определяющие точки. Тип <c>Point3dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector3d</c>.
endTangent: Вектор касательной в конечной точке.  Тип <c>Vector3d</c>.
knotParam: Метод узловой параметризации сплайна. Тип <c>KnotParameterizationEnum</c>.
fitTolerance: Геометрическая точность интерполяции. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve3d.SetFitPointAt(System.Int32,Teigha.Geometry.Point3d)
Метод изменяет определяющую точку с указанным индексом.
index: Индекс определяющей точки. Тип <c>int</c>.
point: Новые координаты определяющей точки. Тип <c>Point3d</c>.
Returns: Возвращает <c>true</c>, если перевычисление сплайна после изменения определяющей точки завершилось успешно.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve3d.SetFitTangents(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить направления касательных на концах сплайна.
startTangent: Направление касательной в начальной точке сплайна. Тип <c>Vector3d</c>.
endTangent: Направление касательной в конечной  точке сплайна. Тип <c>Vector3d</c>.
Returns: Возвращает <c>true</c>, если перевычисление сплайна с новыми касательными завершилось успешно.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve3d.SetWeightAt(System.Int32,System.Double)
Метод позволяет задать вес управляющей вершины сплайна с указанным индексом.
index: Индекс управляющей вершины. Тип <c>int</c>. Индекс должен быть больше или равен 0 и меньше количества управляющих вершин.
value: Новое значение веса. Тип <c>double</c>.

Teigha.Geometry.NurbCurve3d.DefinitionData
Свойство <c>DefinitionData</c> возвращает все данные, определяющие сплайн.
Returns: Возвращает данные, определяющие этот сплайн.
Тип <c>NurbCurve3dData</c>.

Teigha.Geometry.NurbCurve3d.EvalMode
Свойство <c>EvalMode</c> позволяет узнать текущий режим вычисления сплайна.
Returns: Возвращает <c>true</c>, если внутренняя оптимизация включена.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve3d.FitData
Свойство <c>FitData</c> представляет все определяющие данные, использованные для построения сплайна.
Returns: Возвращает определяющие данные, использованные для построения сплайна.
Тип <c>NurbCurve3dFitData</c>.

Teigha.Geometry.NurbCurve3d.FitKnotParameterization
Свойство <c>FitKnotParameterization</c> представляет метод узловой параметризации данного сплайна.
Returns: Возвращает текущий метод узловой параметризации сплайна.
Тип <c>KnotParameterizationEnum</c>.

Teigha.Geometry.NurbCurve3d.FitTolerance
Свойство <c>FitTolerance</c> представляет точность интерполяции для данного сплайна.
Returns: Возвращает текущее значение геометрической точности интерполяции для данного сплайна.
Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve3d.NumFitPoints
Свойство <c>NumFitPoints</c> представляет количество определяющих точек, использованных для построения сплайна.
Returns: Возвращает количество определяющих точек сплайна.
Тип <c>int</c>.

Teigha.Geometry.NurbCurve3d.NumWeights
Свойство <c>NumWeights</c> представляет количество значений веса, определенных у этого сплайна.
Returns: Если сплайн является рациональным, возвращаемое значение равно количеству управляющих вершин. В противном случае свойство возвращает 0.
Тип <c>int</c>.