Teigha.DatabaseServices.LayerTableRecord.GetViewportOverrides(DatabaseServices.ObjectId)
Метод предназначен для получения информации о
переопределениях параметров слоя в видовом экране
пространства листа.
viewportId: ObjectId видового экрана
Returns: Возвращает тип данных LayerViewportProperties.

Teigha.DatabaseServices.LayerTableRecord.HasViewportOverrides(DatabaseServices.ObjectId)
Метод показывает, есть ли у слоя переопределения в видовом
экране пространства листа.
viewportId: ObjectId видового экрана
Returns: Возвращает тип данных <c>bool</c>.

Teigha.DatabaseServices.LayerTableRecord.RemoveAllOverrides
Метод предназначен для удаления всех переопределений слоя во
всех видовых экранах документа.

Teigha.DatabaseServices.LayerTableRecord.EntityColor
В свойстве хранится информации о настройках цвета слоя.
Returns: Возвращает тип данных <xref target="Teigha::Colors::EntityColor" text="EntityColor" />.

Teigha.DatabaseServices.LayerTableRecord.LinetypeObjectId
В свойстве хранится <c>ObjectId</c> типа линии, который
установлен в слое.
Returns: Возвращает тип данных <c>ObjectId</c>.

Teigha.DatabaseServices.LayerTableRecord.LineWeight
В свойстве хранится информация о весе линии, установленной в
слое.
Returns: Возвращает тип данных <xref target="Teigha::DatabaseServices::LineWeight" text="LineWeight" />.

Teigha.DatabaseServices.LayerTableRecord.PlotStyleNameId
В свойстве хранится ObjectId стиля печати, который установлен
в слое.
Returns: Возвращает тип данных <c>ObjectId</c>.

Teigha.DatabaseServices.LayerTableRecord.Transparency
В свойстве хранится значение прозрачности слоя.
Returns: Возвращает тип данных <xref target="Teigha::Colors::Transparency" text="Transparency" />.

Teigha.DatabaseServices.LayerTableRecord.MaterialId
В свойстве хранится ObjectId материала, назначенного слою.
Returns: Возвращает тип данных <c>ObjectId</c>.

Teigha.DatabaseServices.LayerTableRecord.Color
В свойстве хранится цвет слоя.
Returns: \ \
Возвращает тип данных <xref target="Teigha::Colors::Color" text="Color" />.