Teigha.DatabaseServices.LayoutCopiedEventArgs
Этот класс представляет данные для события <c>LayoutCopied</c> в диспетчере листов.

Teigha.DatabaseServices.LayoutCopiedEventArgs.Id
Свойство представляет идентификатор объекта исходного листа.
Returns: Возвращает идентификатор объекта исходного листа. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.LayoutCopiedEventArgs.Name
Свойство представляет имя исходного листа.
Returns: Возвращает имя листа. Тип <c>String</c>.

Teigha.DatabaseServices.LayoutCopiedEventArgs.NewId
Свойство представляет идентификатор объекта нового (скопированного) листа.
Returns: Возвращает идентификатор объекта нового листа-копии. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.LayoutCopiedEventArgs.NewName
Свойство представляет имя нового листа (копии).
Returns: Возвращает имя нового листа-копии. Тип <c>String</c>.