HostMgd.EditorInput.PromptKeywordOptions
Класс, представляющий необязательные параметры для
приглашения ввода ключевого слова.

HostMgd.EditorInput.PromptKeywordOptions.AllowArbitraryInput
Разрешить произвольный ввод.

HostMgd.EditorInput.PromptKeywordOptions.AllowNone
Возвращает или устанавливает признак того, может ли ввод
состоять только из нажатия на клавишу Enter. Если это
свойство устанволено в true, то такой ввод разрешен.

HostMgd.EditorInput.PromptKeywordOptions.#ctor(String)
Конструктор класса.
message: Приглашающее сообщение

HostMgd.EditorInput.PromptKeywordOptions.#ctor(String,String)
Конструктор класса
messageAndKeywords: Представляет собой строку с сообщением
Формат строки\: "message
globalKeywords: Перечень глобальных значений ключей