Teigha.DatabaseServices.RenderSettings
Класс <c>RenderSettings</c> служит контейнером для свойств, общих для всех инструментов высококачественного рендеринга.

Teigha.DatabaseServices.RenderSettings.#ctor
Конструктор по умолчанию класса <c>RenderSettings</c>.

Teigha.DatabaseServices.RenderSettings.BackFacesEnabled
Свойство <c>BackFacesEnabled</c> позволяет определить, включен ли рендеринг задних граней.
Returns: Возвращает <c>true</c>, если рендеринг задних граней выполняется.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RenderSettings.Description
Свойство <c>Description</c> представляет текстовое описание данного объекта.
Returns: Возвращает текстовое описание объекта. Тип <c>String</c>.

Teigha.DatabaseServices.RenderSettings.DiagnosticBackgroundEnabled
Свойство <c>DiagnosticBackgroundEnabled</c> позволяет определить, используется ли для рендеринга  диагностический (проверочный) фон.
Returns: Возвращает <c>true</c>, если диагностический фон используется.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RenderSettings.DisplayIndex
Свойство <c>DisplayIndex</c> представляет порядок отображения в пользовательском интерфейсе записей словаря <c>ACAD_RENDER_SETTINGS</c>.
Returns: Возвращает порядок отображения записей. Тип <c>int</c>.

Teigha.DatabaseServices.RenderSettings.MaterialsEnabled
Свойство <c>MaterialsEnabled</c> позволяет определить, включена ли визуализация объектов с использованием индивидуально настроенных материалов.
Returns: Возвращает <c>true</c>, если включен режим использования индивидуально настроенных материалов.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RenderSettings.Name
Свойство <c>Name</c> представляет имя данного объекта.
Returns: Возвращает имя данного объекта. Тип <c>String</c>.

Teigha.DatabaseServices.RenderSettings.PreviewImageFileName
Свойство <c>PreviewImageFileName</c> представляет полное имя файла изображения предварительного просмотра для данного  объекта <c>RenderSettings</c>.
Returns: Возвращает полное имя файла изображения. Тип <c>String</c>.

Teigha.DatabaseServices.RenderSettings.ShadowsEnabled
Свойство <c>ShadowsEnabled</c> позволяет определить, включено ли отбрасывание теней.
Returns: Возвращает <c>true</c>, если рендеринг теней включен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RenderSettings.TextureSampling
Свойство <c>TextureSampling</c> позволяет определить, включена ли выборка (фильтрация) текстур для изображения.
Returns: Возвращает <c>true</c>, если фильтрация текстур включена.
В противном случае возвращает <c>false</c>.