Teigha.DatabaseServices.ObjectTypeAttribute
Этот класс сообщает тип объекта.

Teigha.DatabaseServices.ObjectTypeAttribute.#ctor(Type)
Конструктор класса <c>ObjectTypeAttribute</c>.
type: Входной тип объекта.  Тип <c>Type</c>.

Teigha.DatabaseServices.ObjectTypeAttribute.ObjectType
Свойство представляет тип объекта.
Returns: Возвращает тип объекта.  Тип <c>Type</c>.