Teigha.DatabaseServices.LineWeightConverter
Класс предназначен для преобразования весов (толщин) линий.

Teigha.DatabaseServices.LineWeightConverter.CanConvertFrom(ITypeDescriptorContext,Type)
Метод позволяет проверить, возможно ли преобразовать предоставленный тип в данный тип.
context: Контекст для преобразования <c>sourceType</c>.  Тип <c>ITypeDescriptorContext</c>.
sourceType: Входной тип для преобразования. Тип <c>Type</c>.
Returns: Возвращает <c>true</c>, если <c>sourceType</c> возможно преобразовать в данный тип.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LineWeightConverter.ConvertFrom(ITypeDescriptorContext,CultureInfo,Object)
Метод преобразует предоставленный объект и возвращает результат преобразования.
context: Контекст для преобразования объекта <c>value</c>. Тип <c>ITypeDescriptorContext</c>.
culture: Провайдер языковых и региональных настроек. Тип <c>CultureInfo</c>.
value: Исходный объект для преобразования. Тип <c>Object</c>.
Returns: Возвращает результат преобразования. Тип <c>Object</c>.

Teigha.DatabaseServices.LineWeightConverter.ConvertTo(ITypeDescriptorContext,CultureInfo,Object,Type)
Метод предназначен для преобразования указанного объекта в заданный тип.
context: Контекст для преобразования входного объекта. Тип <c>ITypeDescriptorContext</c>.
culture: Провайдер языковых и региональных настроек. Тип <c>CultureInfo</c>.
value: Исходный объект. Тип <c>Object</c>.
destinationType: Требуемый тип, к которому следует привести объект <c>value</c>. Тип <c>Type</c>.
Returns: Возвращает результат преобразования. Тип <c>Object</c>.