Teigha.DatabaseServices.DataCell
Класс DataCell реализует единообразный подход к представлению следующих типов данных: Boolean, integer, double, char*, Point3d, ObjectId, HardOwnershipId, SoftOwnershipId, HardPointerId и SoftPointerId.

Teigha.DatabaseServices.DataCell.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.DataCell.Init
Метод реинициализирует ячейку, устанавливая для нее тип данных CellType.Unknown.

Teigha.DatabaseServices.DataCell.SetBool(System.Boolean)
Метод устанавливает для этой ячейки логическое значение.
value: Входное значение для ячейки. Тип bool.

Teigha.DatabaseServices.DataCell.SetDouble
Метод устанавливает для этой ячейки значение типа double.
value: Входное значение для ячейки. Тип double.

Teigha.DatabaseServices.DataCell.SetHardOwnershipId(DatabaseServices.ObjectId)
Метод делает эту ячейку владельцем указанного объекта по жесткой ссылке на идентификатор зависимого объекта.
value: Идентификатор зависимого объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DataCell.SetHardPointerId(DatabaseServices.ObjectId)
Метод устанавливает для этой ячейки идентификатор жесткой ссылки на указатель.
value: Входное значение для ячейки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DataCell.SetInteger(System.Int32)
Метод устанавливает для этой ячейки значение типа int.
value: Входное значение для ячейки. Тип int.

Teigha.DatabaseServices.DataCell.SetObjectId(DatabaseServices.ObjectId)
Метод устанавливает для этой ячейки значение типа ObjectId.
value: Входное значение для ячейки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DataCell.SetPoint(Teigha.Geometry.Point3d)
Метод устанавливает для этой ячейки значение типа Point3d.
value: Входное значение для ячейки. Тип Point3d.

Teigha.DatabaseServices.DataCell.SetSoftOwnershipId(DatabaseServices.ObjectId)
Метод делает ячейку владельцем указанного объекта по мягкой ссылке на идентификатор зависимого объекта.
value: Входное значение для ячейки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DataCell.SetSoftPointerId(DatabaseServices.ObjectId)
Метод устанавливает для этой ячейки идентификатор мягкой ссылки на указатель на зависимый объект.
value: Входное значение для ячейки. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DataCell.SetString(String)
Метод устанавливает для этой ячейки значение типа String.
value: Входное значение для ячейки. Тип String.

Teigha.DatabaseServices.DataCell.SetVector(Teigha.Geometry.Vector3d)
Метод устанавливает для этой ячейки значение типа Vector3d.
value: Входное значение для ячейки. Тип Vector3d.

Teigha.DatabaseServices.DataCell.CellType
Свойство возвращает тип данных, установленный для этой ячейки.
Returns: Возвращает значение из перечисления DatabaseServices.CellType.

Teigha.DatabaseServices.DataCell.Value
Свойство возвращает значение, установленное для этой ячейки.
Returns: Возвращает значение в ячейке. Тип Object.