Teigha.DatabaseServices.DrawOrderTable
Класс DrawOrderTable предназначен для управления порядком отрисовки объектов, принадлежащих записи таблицы блоков.

Teigha.DatabaseServices.DrawOrderTable.#ctor(IntPtr,System.Boolean)
Конструктор класса DrawOrderTable.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Флаг автоудаления исходного объекта. Тип bool.

Teigha.DatabaseServices.DrawOrderTable.FirstEntityIsDrawnBeforeSecond(DatabaseServices.ObjectId,DatabaseServices.ObjectId)
Метод предназначен для проверки, отображается ли первый объект раньше второго согласно последовательности, предусмотренной  данным объектом DrawOrderTable.
first: Идентификатор первого объекта. Тип DatabaseServices.ObjectId.
second: Идентификатор второго объекта. Тип DatabaseServices.ObjectId.
Returns: Возвращает <c>true</c>, если данный экземпляр DrawOrderTable предполагает отрисовку сначала первого объекта, а потом второго.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DrawOrderTable.GetFullDrawOrder(unsigned char)
Метод предназначен для получения коллекции идентификаторов объектов в связанной записи таблицы блоков в DrawOrder, порядок в которой определяется данным объектом DrawOrderTable.
honorSortEntitiesMask: Маска порядка сортировки.  Тип unsigned char.
Returns: Возвращает упорядоченную коллекцию идентификаторов объектов. Тип ObjectIdCollection.

Teigha.DatabaseServices.DrawOrderTable.GetRelativeDrawOrder(unsigned char)
Метод предназначен для получения коллекции идентификаторов объектов, относительный порядок которых определяется данным объектом DrawOrderTable.  Ничего не делает в текущей реализации.
honorSortEntitiesMask: Маска порядка сортировки.  Тип unsigned char.
Returns: Возвращает упорядоченную коллекцию идентификаторов объектов. Тип ObjectIdCollection.

Teigha.DatabaseServices.DrawOrderTable.GetSortHandle(DatabaseServices.ObjectId)
Метод предназначен для получения дескриптора, определяющего порядок отрисовки объекта с указанным идентификатором.
id: Идентификатор объекта, для которого требуется получить дескриптор. Тип DatabaseServices.ObjectId.
Returns: Возвращает дескриптор указанного объекта. Тип DatabaseServices.Handle.

Teigha.DatabaseServices.DrawOrderTable.MoveAbove(Teigha.DatabaseServices.ObjectIdCollection,DatabaseServices.ObjectId)
Метод предназначен для перемещения объектов с указанными идентификаторами выше целевого объекта в последовательности отрисовки данного объекте DrawOrderTable.
collection: Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.
target: Идентификатор целевого объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DrawOrderTable.MoveBelow(Teigha.DatabaseServices.ObjectIdCollection,DatabaseServices.ObjectId)
Метод предназначен для перемещения указанной группы объектов ниже целевого объекта в последовательности отрисовки данного объекта DrawOrderTable.
collection: Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.
target: Идентификатор целевого объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DrawOrderTable.MoveToBottom(Teigha.DatabaseServices.ObjectIdCollection)
Метод помещает все указанные объекты в начало последовательности отрисовки данной таблицы DrawOrderTable.
collection: Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.

Teigha.DatabaseServices.DrawOrderTable.MoveToTop(Teigha.DatabaseServices.ObjectIdCollection)
Метод помещает все указанные объекты в конец последовательности отрисовки данной таблицы DrawOrderTable.
collection: Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.

Teigha.DatabaseServices.DrawOrderTable.SetRelativeDrawOrder(Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет задать иной относительный порядок отрисовки указанных объектов в этой таблице DrawOrderTable.
Порядок отрисовки других объектов не изменяется.
collection: Идентификаторы объектов, для которых изменяется порядок отрисовки. Тип ObjectIdCollection.

Teigha.DatabaseServices.DrawOrderTable.SwapOrder(DatabaseServices.ObjectId,DatabaseServices.ObjectId)
Метод позволяет поменять на обратный порядок отрисовки двух указанных объектов в данной таблице DrawOrderTable.
id1: Идентификатор первого объекта. Тип DatabaseServices.ObjectId.
id2: Идентификатор второго объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DrawOrderTable.BlockId
Свойство обеспечивает доступ к идентификатору записи BlockTableRecord, которой принадлежит данный экземпляр DrawOrderTable.
Returns: Возвращает идентификатор объекта BlockTableRecord. Тип DatabaseServices.ObjectId.