Teigha.DatabaseServices.PlotSettings
Этот класс представляет настройки печати в экземпляре базы данных.

Teigha.DatabaseServices.PlotSettings.#ctor(System.Boolean)
Конструктор класса <c>PlotSettings</c>.
Создает экземпляр настроек печати на выбор для пространства модели, либо для пространства листа.
modelType: Входное логическое значение, определяющее тип настроек печати. Тип <c>bool</c>.

Teigha.DatabaseServices.PlotSettings.AddToPlotSettingsDictionary(DatabaseServices.Database)
Метод добавляет данный объект <c>PlotSettings</c> в словарь настроек печати в указанной базе данных.
toWhichDatabase: База данных, в которую необходимо добавить объект настроек печати.

Teigha.DatabaseServices.PlotSettings.SetShadePlot(Teigha.DatabaseServices.PlotSettingsShadePlotType,DatabaseServices.ObjectId)
Метод задает параметры для печати тонированных объектов.
type: Режим тонированной печати. Тип <c>PlotSettingsShadePlotType</c>.
shadePlotId: Идентификатор объекта визуального стиля (VisualStyle) или объекта настроек рендеринга (RenderSettings), который будет использоваться в качестве объекта тонированной печати.

Teigha.DatabaseServices.PlotSettings.CanonicalMediaName
Свойство <c>CanonicalMediaName</c> представляет независимое от локализации (каноническое) имя текущего настроенного бумажного носителя.
Returns: Возвращает имя бумажного носителя.
Тип <c>String</c>.

Teigha.DatabaseServices.PlotSettings.CurrentStyleSheet
Свойство <c>CurrentStyleSheet</c> представляет текущую таблицу стилей печати.
Returns: Возвращает имя текущей таблицы стилей печати. Тип <c>String</c>.

Teigha.DatabaseServices.PlotSettings.CustomPrintScale
Свойство <c>CustomPrintScale</c> представляет пользовательский масштаб печати для данного объекта <c>PlotSettings</c>.
Returns: Возвращает объект пользовательского масштаба. Тип <c>CustomScale</c>.

Teigha.DatabaseServices.PlotSettings.DrawViewportsFirst
Свойство <c>DrawViewportsFirst</c> определяет, должны ли видовые экраны печататься раньше других объектов в пространстве листа для этого объекта <c>PlotSettings</c>.
Returns: Возвращает <c>true</c>, если первыми должны выводиться плавающие видовые экраны.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.ModelType
Свойство <c>ModelType</c> определяет, к какому типу относится данный объект <c>PlotSettings</c> - к настройкам печати для пространства модели или для пространства листа.
Returns: Возвращает <c>true</c>, если данный объект представляет настройки для пространства модели.
В случае настроек для пространства листа возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.PlotAsRaster
Свойство <c>PlotAsRaster</c> позволяет выяснить, предусмотрен ли текущими настройками печати растровый вывод видового экрана с тонированными объектами.
Returns: Возвращает <c>true</c>, если настройками задан растровый вывод тонированных объектов.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.PlotCentered
Свойство <c>PlotCentered</c> позволяет проверить, предусмотрено ли настройками данного <c>PlotSettings</c> центрирование  на листе при печати.
Returns: Возвращает <c>true</c>, если используется центрирование при печати.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.PlotConfigurationName
Свойство <c>PlotConfigurationName</c> представляет имя системного принтера или файла конфигурации печати для этого объекта <c>PlotSettings</c>.
Returns: Возвращает имя системного принтера или файла конфигурации печати.
Тип <c>String</c>.

Teigha.DatabaseServices.PlotSettings.PlotHidden
Свойство <c>PlotHidden</c> позволяет определить, предусмотрено ли удаление при печати скрытых линий у объектов.
Returns: Возвращает <c>true</c>, если алгоритм удаления скрытых линий не используется.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.PlotOrigin
Свойство <c>PlotOrigin</c> представляет смещение начала координат области печати на печатаемом листе.
Returns: Возвращает смещение начала координат. Тип <c>Point2d</c>.

Teigha.DatabaseServices.PlotSettings.PlotPaperMargins
Свойство <c>PlotPaperMargins</c> представляет поля бумаги, настроенные для этого объекта <c>PlotSettings</c>.
Returns: Возвращает размеры полей бумаги. Тип <c>Extents2d</c>.

Teigha.DatabaseServices.PlotSettings.PlotPaperSize
Свойство <c>PlotPaperSize</c> представляет ширину и высоту листов бумаги, которые заданы в этом объекте <c>PlotSettings</c>.
Returns: Возвращает ширину и высоту листов бумаги. Тип <c>Point2d</c>.

Teigha.DatabaseServices.PlotSettings.PlotPaperUnits
Свойство <c>PlotPaperUnits</c> представляет единицы измерения на бумаге, используемые для полей, смещений, размера бумаги и единиц чертежа для данного объекта <c>PlotSettings</c>.
Returns: Возвращает настроенные единицы измерения на бумаге из перечисления <c>DatabaseServices.PlotPaperUnit</c>.

Teigha.DatabaseServices.PlotSettings.PlotPlotStyles
Свойство <c>PlotPlotStyles</c> позволяет определить, применяются ли стили печати для данного объекта <c>PlotSettings</c>.
Returns: Возвращает <c>true</c>, если стили печати выводятся на печать.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.PlotRotation
Свойство <c>PlotRotation</c> представляет поворот при печати в настройках этого объекта <c>PlotSettings</c>.
Returns: Возвращает поворот при печати. Значение из перечисления <c>Teigha.DatabaseServices.PlotRotation</c>.

Teigha.DatabaseServices.PlotSettings.PlotSettingsName
Свойство <c>PlotSettingsName</c> представляет имя данного объекта <c>PlotSettings</c>.
Returns: Возвращает имя данного объекта. Тип <c>String</c>.

Teigha.DatabaseServices.PlotSettings.PlotTransparency
Свойство <c>PlotTransparency</c> позволяет определить, включён ли учет прозрачности при печати.
Returns: Возвращает <c>true</c>, если прозрачность учитывается при печати.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.PlotType
Свойство <c>PlotType</c> представляет тип печати чертежа, определенный для данного объекта <c>PlotSettings</c>.
Returns: Возвращает тип печати чертежа. Значение из перечисления <c>DatabaseServices.PlotType</c>.

Teigha.DatabaseServices.PlotSettings.PlotViewName
Свойство <c>PlotViewName</c> представляет доступ к именованному виду, который, в свою очередь, определяет, какая часть листа должна быть выведена на печать.
Returns: Возвращает имя вида. Тип <c>String</c>.

Teigha.DatabaseServices.PlotSettings.PlotViewportBorders
Свойство <c>PlotViewportBorders</c> позволяет определить, должны ли отображаться границы видового экрана согласно настройкам этого объекта <c>PlotSettings</c>.
Returns: Возвращает <c>true</c>, если границы отображаться должны.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.PlotWindowArea
Свойство <c>PlotWindowArea</c> представляет углы прямоугольной рамки окна печати для этого объекта <c>PlotSettings</c>.
Returns: Возвращает углы прямоугольной рамки окна печати. Тип <c>Extents2d</c>.

Teigha.DatabaseServices.PlotSettings.PlotWireframe
Свойство <c>PlotWireframe</c> позволяет определить, будет ли каркасной печать видового экрана, исходя из текущих настроек печати тонированного видового экрана.
Returns: Возвращает <c>true</c>, если печать будет каркасной.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.PrintLineweights
Свойство <c>PrintLineweights</c> позволяет определить, печатаются ли веса линий для этого объекта <c>PlotSettings</c>.
Returns: Возвращает <c>true</c>, если веса линий печатаются.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.ScaleLineweights
Свойство <c>ScaleLineweights</c> позволяет определить, масштабируются ли толщины (веса) линий у этого объекта <c>PlotSettings</c>.
Returns: Возвращает <c>true</c>, если толщины (веса) линий масштабируются.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.ShadePlot
Свойство <c>ShadePlot</c> представляет тип тонированной печати, предусмотренный данным объектом <c>PlotSettings</c>.
Returns: Возвращает тип печати тонированных объектов. Перечисление <c>PlotSettingsShadePlotType</c>.

Teigha.DatabaseServices.PlotSettings.ShadePlotCustomDpi
Свойство <c>ShadePlotCustomDpi</c> представляет пользовательское разрешение, с которым будут выводиться на печать тонированные и векторизованные видовые экраны, если свойству <c>ShadePlotResLevel</c> задано значение <c>ShadePlotResLevel.Custom</c>.
Returns: Возвращает пользовательское разрешение при печати в единицах dpi (точки на дюйм).
Тип <c>short</c>.

Teigha.DatabaseServices.PlotSettings.ShadePlotId
Свойство <c>ShadePlotId</c> предоставляет доступ к <c>ObjectId</c> объекта <c>VisualStyle</c> или <c>RenderSettings</c>, на который ссылается данный объект <c>PlotSettings</c>.
Returns: Возвращает идентификатор объекта.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.PlotSettings.ShadePlotResLevel
Свойство <c>ShadePlotResLevel</c> представляет уровень разрешения при тонированной печати, предусмотренный данным объектом <c>PlotSettings</c>.
Returns: Возвращает уровень разрешения при печати.
Значение из перечисления <c>Teigha.DatabaseServices.ShadePlotResLevel</c>.

Teigha.DatabaseServices.PlotSettings.ShowPlotStyles
Свойство <c>ShowPlotStyles</c> определяет, отображаются ли стили печати для этого объекта <c>PlotSettings</c> в режиме листа.
Returns: Возвращает <c>true</c>, если стили печати отображаются.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.PlotSettings.StdScale
Свойство <c>StdScale</c> представляет стандартный масштаб для этого объекта <c>PlotSettings</c> в виде значения с плавающей точкой.
Returns: Возвращает значение стандартного масштаба. Тип <c>double</c>.

Teigha.DatabaseServices.PlotSettings.StdScaleType
Свойство <c>StdScaleType</c> представляет стандартный тип масштаба для этого объекта <c>PlotSettings</c>.
Returns: Возвращает стандартный тип масштаба.
Значение из перечисления <c>DatabaseServices.StdScaleType</c>.

Teigha.DatabaseServices.PlotSettings.UseStandardScale
Свойство <c>UseStandardScale</c> определяет, используется ли листом свойство <c>StdScaleType</c> для расчета текущего масштаба печати.
Returns: Возвращает <c>true</c>, если свойство <c>StdScaleType</c> используется для определения текущего масштаба печати.
В противном случае возвращает <c>false</c>.