Teigha.GraphicsSystem.Device
Класс <c>Device</c> реализует устройство как абстрактное представление окна графического интерфейса, в котором отображается чертеж.

Teigha.GraphicsSystem.Device.#ctor
Конструктор по умолчанию класса <c>Device</c>.

Teigha.GraphicsSystem.Device.Add(Teigha.GraphicsSystem.View)
Метод позволяет добавить графический вид для отображения чертежа на устройстве.
pView: Добавляемый вид, который связывается с данным устройством.

Teigha.GraphicsSystem.Device.CreateModel
Метод позволяет создать новый объект модели и связать его с данным устройством.
Returns: Возвращает дескриптор созданной модели.
Тип <c>Model</c>.

Teigha.GraphicsSystem.Device.CreateView
Метод позволяет создать новый вид и связать его с данным устройством.
Returns: Возвращает дескриптор созданного вида.
Тип <c>View</c>.

Teigha.GraphicsSystem.Device.CreateView(Teigha.GraphicsSystem.ClientViewInfo)
Метод позволяет создать новый вид на основе информации о клиентском виде и связать его с данным устройством.
pViewInfo: Информация о клиентском виде, на основе которого создается вид.
Returns: Возвращает дескриптор созданного вида.
Тип <c>View</c>.

Teigha.GraphicsSystem.Device.CreateView(Teigha.GraphicsSystem.ClientViewInfo,System.Boolean)
Метод позволяет создать новый вид на основе информации о клиентском виде и связать его с данным устройством.
Дополнительно метод позволяет включить поддержку видимости слоев индивидуально в каждом видовом экране.
pViewInfo: Информация о клиентском виде, на основе которого создается вид. Тип <c>ClientViewInfo</c>.
enableLayerVisibilityPerView: Флаг включения поддержки видимости слоев индивидуально для каждого видового экрана. Тип <c>bool</c>.
Returns: Возвращает дескриптор созданного вида.
Тип <c>View</c>.

Teigha.GraphicsSystem.Device.Erase(System.Int32)
Метод предназначен для удаления вида с указанным индексом.
viewIndex: Индекс удаляемого вида.
Returns: Возвращает <c>true</c>, если удаление вида завершилось успешно.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.Device.Erase(Teigha.GraphicsSystem.View)
Метод предназначен для удаления указанного вида.
pView: Удаляемый вид. Тип <c>View</c>.
Returns: Возвращает <c>true</c>, если удаление вида завершилось успешно.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.Device.EraseAll
Метод предназначен для удаления всех видов, связанных с данным устройством.

Teigha.GraphicsSystem.Device.GetSize
Метод позволяет получить размер данного устройства.
Returns: Возвращает текущий размер устройства.
Тип <c>System.Drawing.Size</c>.

Teigha.GraphicsSystem.Device.GetSizeExt
Метод позволяет получить двумерную габаритную рамку, представляющую размеры данного устройства.
Returns: Возвращает двумерную габаритную рамку устройства.
Тип <c>DatabaseServices.Extents2d</c>.

Teigha.GraphicsSystem.Device.GetSizeRect
Метод позволяет получить объект <c>System.Drawing.Rectangle</c>, представляющий размеры данного устройства.
Returns: Возвращает прямоугольник, представляющий размеры устройства.
Тип <c>System.Drawing.Rectangle</c>.

Teigha.GraphicsSystem.Device.GetSnapshot(System.Drawing.Rectangle)
Метод позволяет получить снимок текущего состояния графики данного устройства.
rectangle: Область снимка на устройстве. Тип <c>System.Drawing.Rectangle</c>.
Returns: Возвращает снимок состояния графики в формате <c>System.Drawing.Bitmap</c>.

Teigha.GraphicsSystem.Device.InsertView(System.Int32,Teigha.GraphicsSystem.View)
Метод позволяет вставить указанный вид в заданную индексом позицию на этом устройстве.
viewIndex: Индекс вида на устройстве.    Тип <c>int</c>.
pView: Вставляемый в устройство вид. Тип <c>View</c>.

Teigha.GraphicsSystem.Device.Invalidate
Метод предназначен для уведомления о том, что вся отображаемая область стала недействительной и нуждается в обновлении.

Teigha.GraphicsSystem.Device.Invalidate(System.Drawing.Rectangle)
Метод предназначен для уведомления о том, что указанная область экрана стала недействительной и требует обновления.
screenRect: Границы области. Тип <c>System.Drawing.Rectangle</c>.

Teigha.GraphicsSystem.Device.OnDisplayChange(System.Int32,System.Int32,System.Int32)
Метод заставляет данное устройство принимать новое разрешение экрана и глубину цвета всякий раз, когда операционная система меняет эти параметры.
bitsPerPixel: Новая глубина цвета в битах на пиксель. Тип <c>int</c>.
xPixels: Разрешение по оси <c>X</c>. Тип <c>int</c>.
yPixels: Разрешение по оси <c>Y</c>. Тип <c>int</c>.

Teigha.GraphicsSystem.Device.OnRealizeBackgroundPalette
Метод сообщает данному устройству, что его палитру следует переключить в фоновый режим.
Этот метод обычно вызывается, когда окно графического интерфейса теряет фокус.

Teigha.GraphicsSystem.Device.OnRealizeForegroundPalette
Метод сообщает данному устройству, что его палитру следует переключить в режим переднего плана.
Обычно вызывается, когда окно графического интерфейса получает фокус.

Teigha.GraphicsSystem.Device.OnSize(DatabaseServices.Extents2d)
Метод позволяет сообщить устройству новые размеры, используя объект <c>DatabaseServices.Extents2d</c>.
Этот метод следует вызывать при каждом изменении размеров устройства.
outputRect: Новые размеры устройства. Тип <c>DatabaseServices.Extents2d</c>.

Teigha.GraphicsSystem.Device.OnSize(System.Drawing.Rectangle)
Метод позволяет сообщить устройству новые размеры, используя объект <c>System.Drawing.Rectangle</c>.
Этот метод следует вызывать при каждом изменении размеров устройства.
outputRect: Прямоугольник, который задает новые размеры устройства.

Teigha.GraphicsSystem.Device.OnSize(System.Drawing.Size)
Метод позволяет сообщить устройству новые размеры, используя объект <c>System.Drawing.Size</c>.
Этот метод следует вызывать при каждом изменении размеров устройства.
size: Новые размеры устройства. Тип <c>System.Drawing.Size</c>.

Teigha.GraphicsSystem.Device.SetLogicalPalette(array&lt;Drawing.Color&gt;)
Метод предоставляет возможность задать на данном устройстве логическую цветовую палитру.
В дальнейшем эта палитра позволит использовать индексированные цвета.
logicalPalette: Логическая цветовая палитра. Тип <c>array<System.Drawing.Color></c>.

Teigha.GraphicsSystem.Device.Update
Метод позволяет направить всем принадлежащим видам сообщение о необходимости обновиться, что принудительно актуализирует текущее изображение.

Teigha.GraphicsSystem.Device.Update(System.Drawing.Rectangle)
Метод позволяет направить всем принадлежащим видам требование обновить указанную область с целью актуализировать текущее изображение.
pUpdatedRect: Область экрана для обновления. Тип <c>System.Drawing.Rectangle</c>.

Teigha.GraphicsSystem.Device.ViewAt(System.Int32)
Метод позволяет получить вид по его индексу.
viewIndex: Входной индекс вида. Тип <c>int</c>.
Returns: Возвращает Дескриптор искомого вида. Тип <c>View</c>.

Teigha.GraphicsSystem.Device.BackgroundColor
Свойство <c>BackgroundColor</c> представляет цвет фона в окне графического интерфейса данного устройства.
Returns: Возвращает цвет фона в окне GUI.  Тип <c>System.Drawing.Color</c>.

Teigha.GraphicsSystem.Device.DarkPalette
Свойство <c>DarkPalette</c> представляет палитру темных фоновых цветов, которая используется данным устройством.
Returns: Возвращает массив цветов палитры.
Тип <c>System.Drawing.Color[]</c>.

Teigha.GraphicsSystem.Device.IsValid
Свойство <c>IsValid</c> позволяет определить, корректное ли изображение отображается в окне графического интерфейса данного устройства.
Returns: Возвращает <c>true</c>, если изображение является корректным.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.Device.LightPalette
Свойство <c>LightPalette</c> представляет палитру светлых фоновых цветов, которая используется данным устройством.
Returns: Возвращает массив цветов палитры. Тип <c>System.Drawing.Color[]</c>.

Teigha.GraphicsSystem.Device.LogicalPalette
Свойство <c>LogicalPalette</c> представляет логическую палитру, которая будет использоваться данным устройством.
Returns: Возвращает Массив цветов палитры. Тип <c>System.Drawing.Color[]</c>.

Teigha.GraphicsSystem.Device.NumViews
Свойство <c>NumViews</c> представляет количество видов, связанных с данным устройством.
Returns: Возвращает количество видов на устройстве. Тип <c>int</c>.

Teigha.GraphicsSystem.Device.Properties
Свойство <c>Properties</c> представляет набор свойств данного устройства, хранимых в виде словаря.
Returns: Возвращает словарь со свойствами устройства. Тип <c>Teigha.Runtime.Dictionary</c>.

Teigha.GraphicsSystem.Device.UserGiContext
Свойство <c>UserGiContext</c> представляет пользовательский контекст для графического интерфейса.
Returns: Возвращает пользовательский контекст для графического интерфейса.
Тип <c>GraphicsInterface.Context</c>.