Teigha.DatabaseServices.SolidBackground
Класс <c>SolidBackground</c> представляет сплошной фон.

Teigha.DatabaseServices.SolidBackground.#ctor
Конструктор по умолчанию класса <c>SolidBackground</c>.

Teigha.DatabaseServices.SolidBackground.Color
Свойство <c>Color</c> представляет цвет данного фона.
Returns: Возвращает цвет фона. Тип <c>Teigha.Colors.EntityColor</c>.