Teigha.DatabaseServices.XrefComandeeredEventArgs
Класс <c>XrefComandeeredEventArgs</c> представляет данные для события <c>XrefComandeered</c> в базе данных.

Teigha.DatabaseServices.XrefComandeeredEventArgs.From
Свойство <c>From</c> представляет базу данных, на которую осуществляется внешняя ссылка.
Returns: Возвращает базу данных. Тип <c>Database</c>.

Teigha.DatabaseServices.XrefComandeeredEventArgs.Id
Свойство <c>Id</c> представляет идентификатор объекта, который в данный момент находится под управлением по внешней ссылке.
Returns: Возвращает идентификатор объекта, на который указывает внешняя ссылка.
Тип <c>ObjectId</c>.