HostMgd.EditorInput.PointFilterEventArgs
Класс, обеспечивающий данными событие PointFilter класса
Editor.

HostMgd.EditorInput.PointFilterEventArgs.CallNext
Возвращает признак того, будет ли следующий фильтр вызван для
дальнейшей фильтрации.
True, если будет вызван следующи фильтр, в противном случае
false.

HostMgd.EditorInput.PointFilterEventArgs.Context
Возвращает объект, который обеспечивает событие входными
данными.

HostMgd.EditorInput.PointFilterEventArgs.Result
Возвращает объект, чьи свойства и методы могут быть
использованы для установки результата события.