Teigha.Geometry.LinearEntity2d
Класс <c>LinearEntity2d</c> является абстрактным базовым классом для всех классов двумерных линейных объектов.

Teigha.Geometry.LinearEntity2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>LinearEntity2d</c>.

Teigha.Geometry.LinearEntity2d.GetLine
Метод предоставляет бесконечную линию, коллинеарную данному линейному объекту.
Returns: Возвращает бесконечную линию, коллинеарную данному линейному объекту.
Тип <c>Line2d</c>.

Teigha.Geometry.LinearEntity2d.GetPerpendicularLine(Teigha.Geometry.Point2d)
Метод позволяет получить линию, которая перпендикулярна данному объекту и проходит через указанную точку.
point: Точка, через которую должен проходить перпендикуляр к данному объекту.
Returns: Возвращает перпендикуляр к данному объекту, который проходит через точку <c>point</c>.
Тип <c>Line2d</c>.

Teigha.Geometry.LinearEntity2d.IntersectWith(Teigha.Geometry.LinearEntity2d)
Метод вычисляет точку пересечения данного объекта с другим линейным объектом.
line: Линейный объект, точку пересечения с которым требуется вычислить.
Returns: Возвращает точку пересечения в виде массива из одного элемента.
Тип <c>Point2d[]</c>.

Teigha.Geometry.LinearEntity2d.IntersectWith(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод вычисляет точку пересечения данного объекта с другим линейным объектом с некоторой заданной точностью.
line: Линейный объект, точку пересечения с которым требуется вычислить. Тип <c>LinearEntity2d</c>.
tolerance: Входное значение геометрической точности. Тип <c>Tolerance</c>.
Returns: Возвращает точку пересечения в виде массива из одного элемента.
Тип <c>Point2d[]</c>.

Teigha.Geometry.LinearEntity2d.IsColinearTo(Teigha.Geometry.LinearEntity2d)
Метод позволяет проверить, является ли указанный линейный объект коллинеарным данному линейному объекту.
line: Проверяемый линейный объект.  Тип <c>LinearEntity2d</c>.
Returns: Возвращает <c>true</c>, если объект <c>line</c> коллинеарен данному линейному объекту.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity2d.IsColinearTo(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли указанный линейный объект коллинеарным данному линейному объекту с некоторой заданной точностью.
line: Проверяемый линейный объект.  Тип <c>LinearEntity2d</c>.
tolerance: Входное значение геометрической точности. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах точности <c>tolerance</c> можно считать, что данный объект коллинеарен объекту <c>line</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity2d.IsParallelTo(Teigha.Geometry.LinearEntity2d)
Метод позволяет проверить, является ли указанный линейный объект параллельным данному линейному объекту.
line: Проверяемый линейный объект. Тип <c>LinearEntity2d</c>.
Returns: Возвращает <c>true</c>, если в пределах точности по умолчанию можно считать, что данный объект параллелен объекту <c>line</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity2d.IsParallelTo(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли указанный линейный объект параллельным данному линейному объекту с некоторой заданной точностью.
line: Проверяемый линейный объект. Тип <c>LinearEntity2d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах заданной точности можно считать, что данный объект параллелен объекту <c>line</c>.
В противном случае возвращает <c>false</c>

Teigha.Geometry.LinearEntity2d.IsPerpendicularTo(Teigha.Geometry.LinearEntity2d)
Метод позволяет проверить, является ли указанный линейный объект перпендикулярным данному линейному объекту.
line: Проверяемый линейный объект. Тип <c>LinearEntity2d</c>.
Returns: Возвращает <c>true</c>, если в пределах точности по умолчанию можно считать, что данный объект перпендикулярен объекту <c>line</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity2d.IsPerpendicularTo(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли указанный линейный объект перпендикулярным данному  объекту с некоторой заданной точностью.
line: Проверяемый линейный объект. Тип <c>LinearEntity2d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах заданной точности можно считать, что данный объект перпендикулярен объекту <c>line</c>.
В противном случае возвращает <c>false</c>

Teigha.Geometry.LinearEntity2d.Overlap(Teigha.Geometry.LinearEntity2d)
Метод позволяет определить область перекрытия данного объекта и указанного линейного объекта.
line: Проверяемый линейный объект. Тип <c>LinearEntity2d</c>.
Returns: Возвращает объект, который представляет область перекрытия. Тип <c>LinearEntity2d</c>.

Teigha.Geometry.LinearEntity2d.Overlap(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод позволяет определить область перекрытия данного объекта и указанного линейного объекта, вычисленную с некоторой заданной точностью.
line: Проверяемый линейный объект. Тип <c>LinearEntity2d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает объект, который представляет область перекрытия. Тип <c>LinearEntity2d</c>.

Teigha.Geometry.LinearEntity2d.Direction
Свойство <c>Direction</c> представляет единичный направляющий вектор данного линейного объекта.
Returns: Возвращает единичный направляющий вектор. Тип <c>Vector2d</c>.

Teigha.Geometry.LinearEntity2d.PointOnLine
Свойство <c>PointOnLine</c> представляет произвольную точку, гарантированно расположенную на данном линейном объекте.
Returns: Возвращает точку на данном линейном объекте. Тип <c>Point2d</c>.