Teigha.DatabaseServices.SymbolTableEnumerator
Класс <c>SymbolTableEnumerator</c> представляет перечислитель для таблицы символов.

Teigha.DatabaseServices.SymbolTableEnumerator.MoveNext
Метод реализует переход указателя перечислителя к следующей записи в таблице символов.
Returns: Возвращает <c>true</c>, если текущий элемент перечислителя находится в таблице (его индекс не превышает размер таблицы), и <c>false</c>, если индекс вышел за пределы таблицы.

Teigha.DatabaseServices.SymbolTableEnumerator.Reset
Метод выполняет реинициализацию перечислителя, сбрасывая его текущий индекс на <c>-1</c>.

Teigha.DatabaseServices.SymbolTableEnumerator.Current
Свойство <c>Current</c> представляет текущую запись перечислителя в таблице символов.
Returns: Возвращает идентификатор текущей записи в таблице символов. Тип <c>ObjectId</c>.