Teigha.DatabaseServices.SectionManager
Класс <c>SectionManager</c> используется для управления секущими плоскостями в базе данных.

Teigha.DatabaseServices.SectionManager.#ctor
Конструктор по умолчанию класса <c>SectionManager</c>.

Teigha.DatabaseServices.SectionManager.GetEnumerator
Метод предоставляет перечислитель для коллекции секущих плоскостей.
Returns: Возвращает объект перечислителя. Тип <c>Collections.IEnumerator</c>.

Teigha.DatabaseServices.SectionManager.GetSection(String)
Метод позволяет получить секущую плоскость по указанному имени в базе данных.
pszName: Входное имя секущей плоскости. Тип <c>String</c>.
Returns: Возвращает идентификатор объекта секущей плоскости.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.SectionManager.GetUniqueSectionName(String)
Метод позволяет получить уникальное имя секущей плоскости.
pszBaseName: Базовое имя секущей плоскости. Тип <c>String</c>.
Returns: Возвращает уникальное имя секущей плоскости. Тип <c>String</c>.

Teigha.DatabaseServices.SectionManager.LiveSection
Свойство <c>LiveSection</c> представляет в базе данных идентификатор объекта активной в данный момент секущей плоскости.
Returns: Возвращает идентификатор объекта секущей плоскости.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.SectionManager.NumSections
Свойство <c>NumSections</c> представляет количество секущих плоскостей в базе данных.
Returns: Возвращает количество секущих плоскостей. Тип <c>int</c>.