Teigha.DatabaseServices.SweepOptions
Класс <c>SweepOptions</c>  предназначен для управления параметрами, которые используются при создании поверхностей и твердых тел вытягиванием по траектории такими методами как <c>SweptSurface.CreateSweptSurface()</c> или <c>Solid3d.CreateSweptSolid()</c>.

Teigha.DatabaseServices.SweepOptions.#ctor
Конструктор по умолчанию класса <c>SweepOptions</c>.

Teigha.DatabaseServices.SweepOptions.#ctor(Teigha.DatabaseServices.SweepOptions)
Конструктор класса <c>SweepOptions</c>. Создает экземпляр класса как копию указанного объекта.
opts: Экземпляр класса, копию которого требуется создать. Тип <c>SweepOptions</c>.

Teigha.DatabaseServices.SweepOptions.CheckPathCurve(Teigha.DatabaseServices.Entity,System.Boolean)
Метод предоставляет возможность проверить, является ли указанный геометрический объект допустимым в качестве траектории вытягивания.
pathEnt: Кривая траектории. Тип <c>Entity</c>.
displayErrorMessages: Флаг, определяющий, следует ли отображать сообщения о выявленных ошибках. Тип <c>bool</c>.

Teigha.DatabaseServices.SweepOptions.CheckSweepCurve(Teigha.DatabaseServices.Entity,System.Boolean)
Метод позволяет проверить допустимость указанного объекта для операции вытягивания по траектории.
sweepEnt: Кривая, область или плоская поверхность для вытягивания по траектории. Тип <c>Entity</c>.
displayErrorMessages: Флаг, определяющий, следует ли отображать сообщения о выявленных ошибках. Тип <c>bool</c>.
Returns: Возвращает экземпляр класса <c>SweepOptionsCheckSweepCurveOut</c> с результатами метода.

Teigha.DatabaseServices.SweepOptions.Clone
Метод предназначен для клонирования данного объекта.
Returns: Возвращает полный клон данного объекта. Тип <c>Object</c>.

Teigha.DatabaseServices.SweepOptions.Align
Свойство <c>Align</c> представляет выравнивание вытягиваемого объекта относительно траектории.
Returns: Возвращает вариант выравнивания относительно траектории. Тип <c>SweepOptionsAlignOption</c>.

Teigha.DatabaseServices.SweepOptions.AlignAngle
Свойство <c>AlignAngle</c> представляет величину угла выравнивания в радианах.
Returns: Возвращает угол выравнивания в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.SweepOptions.AlignStart
Свойство <c>AlignStart</c> представляет вариант выравнивания объекта относительно начала или конца траектории вытягивания.
Returns: Возвращает <c>true</c>, если применяется выравнивание относительно начала траектории.
В случае <c>false</c> используется выравнивание относительно конца траектории.

Teigha.DatabaseServices.SweepOptions.Bank
Свойство <c>Bank</c> позволяет определить, расположена ли вытягиваемая грань или кривая вдоль траектории вытягивания.
Returns: Возвращает <c>true</c>, если вытягиваемая грань или кривая располагается вдоль траектории.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SweepOptions.BasePoint
Свойство <c>BasePoint</c> представляет базовую точку для выравнивания вытягиваемого объекта.
Returns: Возвращает базовую точку. Тип <c>Point3d</c>.

Teigha.DatabaseServices.SweepOptions.CheckIntersections
Свойство <c>CheckIntersections</c> позволяет определить состояние опции проверки самопересечения.
Returns: Возвращает <c>true</c>, если проверка самопересечений включена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SweepOptions.DraftAngle
Свойство <c>DraftAngle</c> представляет угол сужения (расширения), на который профиль будет сужаться по мере вытягивания вдоль траектории.
Returns: Возвращает угол сужения (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.SweepOptions.EndDraftDist
Свойство <c>EndDraftDist</c> представляет расстояние, на котором сужение/расширение вытягиваемого объекта прекращается.
Returns: Возвращает расстояние, на котором сужение/расширение прекращается. Тип <c>double</c>.

Teigha.DatabaseServices.SweepOptions.PathEntityTransform
Свойство <c>PathEntityTransform</c> представляет матрицу преобразования для системы координат в начале/конце траектории вытягивания.
Returns: Возвращает матрицу преобразования. Тип <c>Matrix3d</c>.

Teigha.DatabaseServices.SweepOptions.ScaleFactor
Свойство <c>ScaleFactor</c> представляет масштабный коэффициент.
Returns: Возвращает масштабный коэффициент. Тип <c>double</c>.

Teigha.DatabaseServices.SweepOptions.StartDraftDist
Свойство <c>StartDraftDist</c> представляет расстояние, на котором начинается сужение/расширение вытягиваемого объекта.
Returns: Возвращает расстояние, на котором начинается сужение/расширение вытягиваемого объекта. Тип <c>double</c>.

Teigha.DatabaseServices.SweepOptions.SweepEntityTransform
Свойство <c>SweepEntityTransform</c> представляет матрицу преобразования системы координат вытягиваемого объекта.
Returns: Возвращает матрицу преобразования. Тип <c>Matrix3d</c>.

Teigha.DatabaseServices.SweepOptions.TwistAngle
Свойство <c>TwistAngle</c> представляет угол кручения профиля по мере его вытягивания по траектории.
Returns: Возвращает угол кручения профиля. Тип <c>double</c>.