Teigha.BoundaryRepresentation.BrepEntity
Класс <c>BrepEntity</c> является базовым интерфейсным классом для топологических объектов и определяет их общий функционал.

Teigha.BoundaryRepresentation.BrepEntity.CheckEntity
Метод позволяет проверить на наличие ошибок топологию, геометрию и структуру данных объекта.
Returns: Возвращает <c>true</c>, если проверка не выявила в объекте топологических ошибок.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.BrepEntity.Equals(Object)
Метод предназначен для проверки равенства двух объектов.
obj: Объект, который сравнивается с данным объектом.
Returns: Возвращает <c>true</c>, если оба объекта можно считать равными.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetLineContainment(Geometry.LinearEntity3d,System.Int32)
Метод позволяет проверить, проходит ли указанная линия в пределах или вне пределов топологической границы данного объекта.
В текущей версии не реализован.
line: Линия, проверяемая на пересечения с топологической границей данного объекта.  Тип <c>Geometry.LinearEntity3d</c>.
iNumHitsWanted: Максимальное значение пересечений границы при проверке.  Тип <c>int</c>.
Returns: Возвращает массив попаданий линии в границу объекта.  Тип <c>Hit[]</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetMassProperties
Метод позволяет получить массо-центровочные характеристики данного объекта топологии. Предполагается равномерная единичная плотность, а точность определяется глобальными настройками.
Returns: Возвращает массо-центровочные характеристики данного объекта.
Тип <c>MassProperties</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetMassProperties(System.Double)
Метод позволяет получить массо-центровочные характеристики данного объекта топологии с учетом заданной плотности материала. Точность вычислений определяется глобальными настройками.
density: Входная расчетная плотность для данного объекта.  Тип <c>double</c>.
Returns: Возвращает массо-центровочные характеристики данного объекта.
Тип <c>MassProperties</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetMassProperties(System.Double,System.Double)
Метод позволяет получить массо-центровочные характеристики данного объекта топологии с учетом заданной плотности материала и требуемой точности вычислений.
density: Входная расчетная плотность для данного объекта.  Тип <c>double</c>.
tolRequired: Входная требуемая точность вычислений.            Тип <c>double</c>.
Returns: Возвращает массо-центровочные характеристики данного объекта.
Тип <c>MassProperties</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetMassProperties(System.Double,System.Double,[Out] double%)
Метод позволяет получить массо-центровочные характеристики данного объекта топологии с учетом указанных параметров. Метод возвращает также фактически достигнутую точность вычислений массовых свойств.
density: Входная расчетная плотность для данного объекта.      Тип <c>double</c>.
tolRequired: Входная требуемая точность вычислений.                Тип <c>double</c>.
tolAchieved: Выходная фактически достигнутая точность вычислений.  Тип <c>double</c>.
Returns: Возвращает массо-центровочные характеристики данного объекта.
Тип <c>MassProperties</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetPerimeterLength
Метод предназначен для вычисления периметра данного топологического объекта. Точность вычислений определяется глобальными настройками.
Returns: Возвращает периметр данного объекта.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetPerimeterLength(System.Double)
Метод предназначен для вычисления периметра данного топологического объекта с указанной точностью.
tolRequired: Входная требуемая точность вычислений.
Returns: Возвращает периметр данного объекта.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetPerimeterLength(System.Double,[Out] double%)
Метод предназначен для вычисления периметра данного топологического объекта с указанной точностью.
tolRequired: Входная требуемая точность вычислений.  Тип <c>double</c>.
tolAchieved: Фактически достигнутая точность вычисления периметра.  Тип <c>double</c>.
Returns: Возвращает периметр данного объекта.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetPointContainment(Teigha.Geometry.Point3d,[Out]PointContainment%)
Метод позволяет определить, располагается ли указанная точка внутри или снаружи топологической границы данного объекта.
В текущей версии не реализован.
point: Проверяемая 3D-точка.  Тип <c>Point3d</c>.
containment: Результат определения принадлежности точки.  Значение из перечисления <c>PointContainment</c>.
Returns: Возвращает топологический объект, которому принадлежит входная точка <c>point</c>.
Тип <c>BrepEntity</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetSurfaceArea
Метод позволяет получить площадь поверхности данного топологического объекта.
Используемая точность определяется глобальными настройками.
Returns: Возвращает площадь поверхности данного объекта.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetSurfaceArea(System.Double)
Метод позволяет получить площадь поверхности данного топологического объекта с указанной точностью.
tolRequired: Требуемая точность вычислений.
Returns: Возвращает площадь поверхности данного объекта.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetSurfaceArea(System.Double,[Out] double%)
Метод позволяет получить площадь поверхности данного топологического объекта с указанной точностью.  Дополнительно метод возвращает фактически достигнутую точность вычисления площади.
tolRequired: Требуемая точность вычислений.            Тип <c>double</c>.
tolAchieved: Достигнутая точность вычисления площади.  Тип <c>double</c>.
Returns: Возвращает площадь поверхности данного объекта.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetVolume
Метод позволяет получить объем данного топологического объекта.
Используемая точность вычислений определяется глобальными настройками.
Returns: Возвращает объем данного объекта.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetVolume(System.Double)
Метод позволяет получить объем данного топологического объекта с требуемой точностью.
tolRequired: Требуемая точность вычислений.  Тип <c>double</c>.
Returns: Возвращает объем данного объекта.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.BrepEntity.GetVolume(System.Double,[Out] double%)
Метод позволяет получить объем данного топологического объекта с требуемой точностью.  Дополнительно метод возвращает фактически достигнутую точность вычисления объема.
tolRequired: Требуемая точность вычислений объема.   Тип <c>double</c>.
tolAchieved: Достигнутая точность вычисления объема. Тип <c>double</c>.
Returns: Возвращает объем данного объекта.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.BrepEntity.BoundBlock
Свойство <c>BoundBlock</c> представляет граничный бокс в пространстве модели для данного топологического объекта.
Returns: Возвращает граничный бокс данного объекта.
Тип <c>BoundBlock3d</c>.

Teigha.BoundaryRepresentation.BrepEntity.Brep
Свойство <c>Brep</c> предоставляет доступ к объекту <c>BoundaryRepresentation.Brep</c> на вершине текущей топологической иерархии.
Returns: Возвращает объект на вершине текущей топологической иерархии.
Тип <c>BoundaryRepresentation.Brep</c>.

Teigha.BoundaryRepresentation.BrepEntity.IsNull
Свойство <c>IsNull</c> позволяет проверить, инициализирован ли данный объект, т.е. связана ли с ним модель ACIS.
Returns: Возвращает <c>true</c>, только если с данным объектом не связана никакая модель ACIS.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.BrepEntity.SubentityPath
Свойство <c>SubentityPath</c> представляет полный путь подобъекта nanoCAD для данного топологического объекта.
Returns: Возвращает полный путь подобъекта.
Тип <c>FullSubentityPath</c>.

Teigha.BoundaryRepresentation.BrepEntity.ValidationLevel
Свойство <c>ValidationLevel</c> предоставляет доступ к уровню проверки, который в данный момент используется данным топологическим объектом.
Returns: Возвращает уровень проверки данного объекта. Перечисление <c>BoundaryRepresentation.ValidationLevel</c>.