Teigha.DatabaseServices.BlockTableRecord.AppendEntity(Teigha.DatabaseServices.Entity)
Метод предназначен для добавления примитива в блок и в базу
данных чертежа.
entity: Добавляемый примитив (не должен быть NULL)
Returns: Возвращает <c>ObjectId</c> добавленного примитива.

Teigha.DatabaseServices.BlockTableRecord.GetEnumerator
Метод предназначен для перебора в цикле содержимого
определения блока.
Returns: Возвращает тип данных <c>BlockTableRecordEnumerator</c>.

Teigha.DatabaseServices.BlockTableRecord.AssumeOwnershipOf(Teigha.DatabaseServices.ObjectIdCollection)
Метод предназначен для передачи блоку права собственности на
объекты и обеспечения безопасного перемещения этих объектов
между блоками.
entitiesToMove: Коллекция <c>ObjectId</c> примитивов,

Teigha.DatabaseServices.BlockTableRecord.GetAnonymousBlockIds
Метод предназначен для получения коллекции <c>ObjectId</c>
анонимных блоков чертежа.
Returns: Метод возвращает коллекцию <c>ObjectId</c> в
формате <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.BlockTableRecord.GetBlockReferenceIds(System.Boolean,System.Boolean)
Метод предназначен для получения коллекции <c>ObjectId</c>
всех вставок блоков чертежа, которые ссылаются на это
определение блока.
directOnly: Признак добавления в коллекцию косвенных
forceValidity: Этот параметр применим только, если параметр <c>directOnly
Returns: Метод возвращает коллекцию <c>ObjectId</c> в формате <c>ObjectIdCollection</c>.
Note
При вызове данного метода нужно решить, какое значение
forceValidity будет наиболее эффективным. Например, если
нужно установить Id в порядке очереди BlockReference на
регенерацию, чтобы избежать вызова REGENALL, возможно, более
дешевым будет установить forceValidity в false и выполнить
REGENALL.
Полная регенерация будет быстрее и лучше использовать память,
чем принудительная загрузка всего файла в память. Тем не
менее, если метод вызывается для определения циклических
ссылок в блоках, то forceValidity должен быть установлен в
true для того, чтобы гарантировать, что все ссылки блоков
(потенциально циклические) будут найдены.

Teigha.DatabaseServices.BlockTableRecord.GetErasedBlockReferenceIds
Метод предназначен для получения коллекции <c>ObjectId</c>
всех вставок данного определения блока, которые были удалены
из чертежа.
Returns: Метод возвращает коллекцию <c>ObjectId</c> в формате <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.BlockTableRecord.GetXrefDatabase(System.Boolean)
Метод предназначен для внешних блоков и позволяет получить
базу данных, в которой есть определение внешнего блока.
incrementUnresolved: Признак того, что нужно открыть базу
Returns: Метод возвращает тип данных <c>Database</c>.

Teigha.DatabaseServices.BlockTableRecord.UpdateAnonymousBlocks
Метод обновляет анонимные блоки, созданные на основе данного
динамического блока, чтобы отобразить изменения в определении
блока.

Teigha.DatabaseServices.BlockTableRecord.BlockBeginId
Свойство предназначено для хранения ObjectID начала блока.
Returns: Возвращает <c>ObjectId</c> объекта
<c>BlockBegin</c> текущей записи таблицы блоков
(<c>BlockTableRecord</c>).

Teigha.DatabaseServices.BlockTableRecord.BlockEndId
Свойство предназначено для хранения BlockEndId.
Returns: Возвращает <c>ObjectId</c> объекта <c>BlockEnd</c> текущей
записи таблицы блоков (<c>BlockTableRecord</c>).

Teigha.DatabaseServices.BlockTableRecord.BlockScaling
В свойстве хранятся характеристики масштабирования вставок
данного определения блока.
Returns: Возвращает/принимает одно из значений перечисления
<xref target="Teigha::DatabaseServices::BlockScaling" text="BlockScaling"/>.
Return Value List
<c>Any</c> : разный масштаб у всех вставок;
<c>Uniform</c> : одинаковый масштаб у всех вставок.

Teigha.DatabaseServices.BlockTableRecord.Comments
Свойство предназначено для хранения текстовых данных,
относящихся к этому определению блока.
Returns: Возвращает <c>string</c>.

Teigha.DatabaseServices.BlockTableRecord.DrawOrderTableId
В свойстве хранится ObjectId записи таблицы DrawOrderTable,
связанной с этим блоком.
Returns: Возвращает ObjectId объекта DrawOrderTable.

Teigha.DatabaseServices.BlockTableRecord.Explodable
Свойство указывает на возможность разбивать вставки этого
блока на отдельные примитивы.
Returns: Возвращает тип данных bool:
* <c>true</c> #45; вставки этого определения блока можно
разбить на отдельные примитивы;
* <c>false</c> #45; вставки этого определения блока нельзя
разбить на отдельные примитивы.

Teigha.DatabaseServices.BlockTableRecord.HasAttributeDefinitions
Свойство показывает, есть ли в блоке атрибуты.
Returns: Возвращает тип данных bool:
* <c>true</c> - в блоке определены атрибуты;
* <c>false</c> - в блоке нет атрибутов.

Teigha.DatabaseServices.BlockTableRecord.HasPreviewIcon
Признак наличия иконки предпросмотра у блока.
Returns: Возвращает тип данных bool:
* <c>true</c> - у блока есть иконка предпросмотра;
* <c>false</c> - у блока нет иконки предпросмотра.

Teigha.DatabaseServices.BlockTableRecord.IncludingErased
Свойство предназначено для получения копии определения блока,
включающей удаленные из него примитивы.
Returns: Возвращает определение блока BlockTableRecord, значение
свойства IncludingErased.

Teigha.DatabaseServices.BlockTableRecord.IsAnonymous
Свойство предназначено для определения, является ли данное
определение блока анонимным.
Returns: Возвращает тип данных bool:
* true - блок является анонимным.
* false - не анонимный.

Teigha.DatabaseServices.BlockTableRecord.IsDynamicBlock
Свойство показывает, является ли данный блок динамическим.
Returns: Возвращает тип данных bool:
* true - блок является динамическим.
* false - блок статический.

Teigha.DatabaseServices.BlockTableRecord.IsFromExternalReference
Свойство предназначено для определения того, загружен блок из
другого чертежа или создан непосредственно в этом чертеже.
Returns: Возвращает тип данных bool:
* true #45; блок является внешним для документа, то есть
вставлен из другого документа.
* false #45; блок был создан в текущем документе.
Note
Значение свойства используется для 3-его бита группового кода
70 DXF.

Teigha.DatabaseServices.BlockTableRecord.IsFromOverlayReference
Свойство предназначено для изменения типа ссылки на внешний
блок.
Returns: Возвращает тип данных bool:
* true #45; блок является внешним для
документа, то есть вставлен из другого документа, и тип
ссылки на вставку этого блока – наложенная;
* false #45; блок является внешним для документа и тип
ссылки на вставку этого блока #45; вложенная.
Note
Значение свойства используется для 3-его бита
группового кода 70 DXF.

Teigha.DatabaseServices.BlockTableRecord.IsLayout
Признак того, что данное определение блока описывает лист.
Returns: Возвращает тип данных bool:
* true #45; блок представляет собой лист или пространство
модели;
* false #45; остальные блоки.

Teigha.DatabaseServices.BlockTableRecord.IsUnloaded
Признак того, что определение блока выгружено.
Returns: Возвращает тип данных bool:
* true #45; данная запись описывает блок, который является
внешним, т.е. взят из другого документа, и этот блок был
выгружен из настоящего документа.
* false #45; внешний блок не выгружен из настоящего
документа.
Если эти условия не соблюдаются, свойство возвращает <c>false</c>.

Teigha.DatabaseServices.BlockTableRecord.LayoutId
Свойство предназначено для хранения ObjectId листа документа,
к которому на текущий момент относится блок.
Returns: Возвращает ObjectId

Teigha.DatabaseServices.BlockTableRecord.Origin
Свойство предназначено для хранения данных о базовой точке
блока.
Returns: Возвращает точку <xref target="Teigha::Geometry::Point3d" text="Point3d" />
с тремя координатами расположения базовой точки блока.
Note
Точка всегда имеет координаты (0, 0, 0). Не рекомендуется
менять её значение.

Teigha.DatabaseServices.BlockTableRecord.PathName
Свойство предназначено для хранения ссылки на внешний блок.
Returns: Тип данных <c>string</c>.
Note
Значение свойства соответствует групповому коду 1 DXF.

Teigha.DatabaseServices.BlockTableRecord.PreviewIcon
Свойство предназначено для хранения иконки предпросмотра
блока.
Returns: Тип данных <c>System.Drawing.Bitmap</c>

Teigha.DatabaseServices.BlockTableRecord.Units
Свойство предназначено для хранения единицы измерения.
Returns: Тип данных <c>UnitsValue</c>.

Teigha.DatabaseServices.BlockTableRecord.XrefStatus
Свойство предназначено для внешних блоков и хранит информацию
о состоянии ссылки.
Returns: Тип данных <xref target="Teigha::DatabaseServices::XrefStatus" text="XrefStatus"/>.

Teigha.DatabaseServices.BlockTableRecord.Copy
Метод предназначен для быстрого создания копии определения
блока.
Returns: Тип данных <c>BlockTableRecord</c>.