Teigha.Geometry.NurbCurve3dFitData.Equals(Object)
Метод позволяет проверить, идентичен ли данный объект входному объекту.
obj: Входной объект, проверяемый на равенство.  Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если входной объект не является нулевым и идентичен данному объекту.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve3dFitData.GetHashCode
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает хеш-код объекта. Тип <c>int</c>.

Teigha.Geometry.NurbCurve3dFitData.IsEqualTo(Teigha.Geometry.NurbCurve3dFitData)
Метод позволяет проверить, идентичны ли данные аппроксимации NURB кривой в данном объекте соответствующим данным аппроксимации NURB кривой во входном объекте.
a: Данные 3D-аппроксимации NURB кривой. Тип <c>NurbCurve3dFitData</c>.
Returns: Возвращает <c>true</c>, если сравниваемые объекты идентичны.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve3dFitData.Degree
Свойство <c>Degree</c> представляет степень NURB кривой.
Returns: Возвращает степень NURB кривой.  Тип <c>int</c>.

Teigha.Geometry.NurbCurve3dFitData.EndTangent
Свойство <c>EndTangent</c> представляет конечный вектор касательной.
Returns: Возвращает конечный вектор касательной. Тип <c>Vector3d</c>.

Teigha.Geometry.NurbCurve3dFitData.FitPoints
Свойство <c>FitPoints</c> представляет массив определяющих точек NURB кривой.
Returns: Возвращает массив определяющих точек NURB кривой.
Тип <c>Point3dCollection</c>.

Teigha.Geometry.NurbCurve3dFitData.FitTolerance
Свойство <c>FitTolerance</c> представляет точность аппроксимации в определяющих точках.
Returns: Возвращает точность аппроксимации в определяющих точках.  Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve3dFitData.KnotParam
Свойство <c>KnotParam</c> представляет использованный метод узловой параметризации сплайна.
Returns: Возвращает метод узловой параметризации сплайна.
Перечисление <c>KnotParameterizationEnum</c>.

Teigha.Geometry.NurbCurve3dFitData.StartTangent
Свойство <c>StartTangent</c> представляет начальный вектор касательной.
Returns: Возвращает начальный вектор касательной.
Тип <c>Vector3d</c>.

Teigha.Geometry.NurbCurve3dFitData.TangentsExist
Свойство <c>TangentsExist</c> позволяет проверить существование данных о касательных.
Returns: Возвращает <c>true</c>, если данные о касательных присутствуют.
В противном случае возвращает <c>false</c>.