Teigha.DatabaseServices.Assoc2dConstraintGroup
Класс Assoc2dConstraintGroup представляет совокупность геометрических и размерных зависимостей между подобъектами геометрических объектов.  Все связанные элементы геометрии должны лежать в одной плоскости.

Teigha.DatabaseServices.Assoc2dConstraintGroup.#ctor(Teigha.Geometry.Plane)
Конструктор по умолчанию.
plane: Плоскость вновь созданной группы ограничений. По умолчанию используется плоскость XY.

Teigha.DatabaseServices.Assoc2dConstraintGroup.DeleteConstrainedGeometry(Teigha.DatabaseServices.ObjectId)
Метод удаляет используемый группой ограничений объект ConstrainedGeometry, а также связанный с ним объект AssocGeomDependency.
geomDependencyId: Идентификатор удаляемого объекта. Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.Assoc2dConstraintGroup.RegenDimensionSystem
Метод восстанавливает внутреннюю систему размеров. Предназначен только для внутреннего использования.

Teigha.DatabaseServices.Assoc2dConstraintGroup.SolutionStatus(System.Boolean)
Метод позволяет получить статус решения, полученного для данной группы ограничений.
alsoCheckForConstraints: Входной флаг, указывающий, следует ли выполнить проверку ограничений. Значение по умолчанию — true.
Returns: Возвращает элемент перечисления SolutionStatusType.

Teigha.DatabaseServices.Assoc2dConstraintGroup.TransformActionBy(Teigha.Geometry.Matrix3d)
Метод применяет заданное геометрическое преобразование к рабочей плоскости данной группы ограничений.
transform: Входная матрица геометрического преобразования. Тип Geometry.Matrix3d.

Teigha.DatabaseServices.Assoc2dConstraintGroup.GetDOF
Свойство позволяет получить число степеней свободы (DOF) данной группы ограничений.
Returns: Возвращает количество степеней свободы. Тип int.

Teigha.DatabaseServices.Assoc2dConstraintGroup.WorkPlane
Свойство предоставляет доступ к рабочей плоскости данной группы ограничений.
Returns: Возвращает рабочую плоскость данной группы ограничений. Тип Teigha.Geometry.Plane.