Teigha.DatabaseServices.Ray
Класс <c>Ray</c> представляет объекты лучей в базе данных.

Teigha.DatabaseServices.Ray.#ctor
Конструктор по умолчанию класса <c>Ray</c>.

Teigha.DatabaseServices.Ray.BasePoint
Свойство <c>BasePoint</c> представляет базовую точку, от которой исходит луч (начало луча).
Returns: Возвращает трехмерную точку. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Ray.SecondPoint
Свойство <c>SecondPoint</c> представляет вторую точку, которая в совокупности с базовой точкой определяет направление данного луча.
Returns: Возвращает трехмерную точку. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Ray.UnitDir
Свойство <c>UnitDir</c> представляет 3D-вектор, определяющий направление данного луча.
Returns: Возвращает 3D-вектор для направления луча. Тип <c>Vector3d</c>.