HostMgd.EditorInput.InputPointContext
Этот класс обеспечивает входными параметрами события
PointFilter и PointMonitor.
Он соответствует параметрам функций HostEdInputPointFilter.processInputPoint() и
HostEdInputPointMonitor.monitorInputPoint() nanoCAD API.

HostMgd.EditorInput.InputPointContext.CartesianSnappedPoint
Возвращает старый стиль привязки в случае, если в истории
установлен признак CartSnapped.

HostMgd.EditorInput.InputPointContext.ComputedPoint
Возвращает конечную точку, если значение pointComputed равно
true. Оно всегда установлено, независимо от того, выполнены
ли построение фильтров или нет. После этого может быть
вычислена автопривязка из osnappedPoint.

HostMgd.EditorInput.InputPointContext.Document
Возвращает объект документ, из которого было выдано событие.
Это делает возможным использование одного обработчика для
всех менеджеров входных точек и определяет, какой именно
обработчик должен обработать событие.

HostMgd.EditorInput.InputPointContext.DrawContext
Возвращает отображение представления, размеры точек и другую
контекстную инфорацию, независимо от того, какую видимую
графику вы хотите отобразить.

HostMgd.EditorInput.InputPointContext.GrippedPoint
Возвращает указатель на ручку, если в истории установлен бит
Gripped.

HostMgd.EditorInput.InputPointContext.History
Возвращает целое число с битовыми полями, как определено в
перечислении PointHistory.

HostMgd.EditorInput.InputPointContext.LastPoint
Возвращает последнюю точку, если в истории установлен бит
LastPoint.

HostMgd.EditorInput.InputPointContext.ObjectSnapMask
Возвращает текущий режим объектной привязки, если
pointComputed установлен в true и в истории установлен бит
Osnapped.

HostMgd.EditorInput.InputPointContext.ObjectSnapOverrides
Возвращает текущую активную объектную привязку (даже если она
не участвуют в вычислении computedPoint).

HostMgd.EditorInput.InputPointContext.ObjectSnappedPoint
Возвращает текущую объектной привязки точки, если
pointComputed установлен в true и установлен бит Osnapped в
истории.

HostMgd.EditorInput.InputPointContext.PointComputed
Возвращает true, если все требуемые точки являются
корректными и false в противном случае.

HostMgd.EditorInput.InputPointContext.RawPoint
Возвращает точку, отслеженную по позиции курсора до
последующей фильтрации, или введенную через альтернативные
значения. Корректно работает только, если значение
pointComputed С true.

HostMgd.EditorInput.InputPointContext.ToolTipText
Возвращает строку подсказки для последнего инструмента, как
это определено в nanoCAD; может быть заменено на возвращение
новой строки.