Teigha.BoundaryRepresentation.FaceLoopEnumerator
Класс <c>FaceLoopEnumerator</c> представляет перечислитель циклов грани BREP.

Teigha.BoundaryRepresentation.FaceLoopEnumerator.Current
Свойство <c>Current</c> предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает цикл грани, являющийся текущим элементом данного перечислителя.
Тип <c>BoundaryLoop</c>.