Teigha.GraphicsInterface.Drawable
Класс представляет графические объекты, как временные, так и постоянные, которые реализуют интерфейс графического отображения.

Teigha.GraphicsInterface.Drawable.#ctor
Конструктор по умолчанию.

Teigha.GraphicsInterface.Drawable.#ctor
Конструктор класса Teigha.GraphicsInterface.Drawable.
unmanagedPointer: Неуправляемый указатель. Тип IntPtr.
autoDelete: Флаг автоудаления исходного объекта. Тип bool.

Teigha.GraphicsInterface.Drawable.SetAttributes(GraphicsInterface.DrawableTraits)
Метод устанавливает значения графических атрибутов для подобъектов текущего объекта, используя входной объект DrawableTraits.
traits: Входной объект GraphicsInterface.DrawableTraits, который необходимо задать. Атрибуты заполняются значениями атрибутов подобъектов вызывающих объектов.
Returns: Возвращает комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributesFlags. Тип int.

Teigha.GraphicsInterface.Drawable.SubSetAttributes(GraphicsInterface.DrawableTraits)
Метод устанавливает значения графических атрибутов подобъектов этого объекта и возвращает их вместе с графическими атрибутами подобъектов вызывающего объекта.
traits: Входной объект GraphicsInterface.DrawableTraits, который необходимо задать. Атрибуты заполняются значениями атрибутов подобъектов вызывающих объектов.
Returns: Возвращает комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributesFlags. Тип int.

Teigha.GraphicsInterface.Drawable.SubViewportDraw(GraphicsInterface.ViewportDraw)
Метод вычисляет объект и обеспечивает корректное отображение его геометрии в заданном видовом экране.
vd: Входной интерфейс ViewportDraw.  Тип GraphicsInterface.ViewportDraw.

Teigha.GraphicsInterface.Drawable.SubViewportDrawLogicalFlags(GraphicsInterface.ViewportDraw)
Метод предоставляет комбинацию атрибутных флагов, используемых для регенерации логического набора элементов отображаемой геометрии объекта, которая зависит от видовых представлений.
vd: Входной интерфейс ViewportDraw. Тип GraphicsInterface.ViewportDraw.
Returns: Возвращает логическую комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributesFlags. Тип int.

Teigha.GraphicsInterface.Drawable.ViewportDraw(GraphicsInterface.ViewportDraw)
Метод реализует отрисовку объекта в видовом экране с использованием входного интерфейса GraphicsInterface.ViewportDraw.
vd: Входной интерфейс ViewportDraw.  Тип GraphicsInterface.ViewportDraw.

Teigha.GraphicsInterface.Drawable.ViewportDrawLogicalFlags(GraphicsInterface.ViewportDraw)
Метод предназначен для доступа к флагам атрибутов отрисовки текущего видового экрана.
vd: Входной интерфейс ViewportDraw.  Тип GraphicsInterface.ViewportDraw.
Returns: Возвращает комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributesFlags. Тип int.

Teigha.GraphicsInterface.Drawable.WorldDraw(GraphicsInterface.WorldDraw)
Метод реализует отрисовку объекта в пространстве модели с использованием входного интерфейса GraphicsInterface.WorldDraw.
wd: Входной интерфейс WorldDraw.  Тип GraphicsInterface.WorldDraw.
Returns: Возвращает true, только если геометрическое представление объекта не зависит от видового экрана.
Возвращаемое значение false указывает, что какая-то часть графики объекта зависит от видового представления, поэтому 3D GS должна дополнительно вызвать ViewportDraw(), чтобы для такого объекта получить законченную геометрию и полный набор атрибутов.

Teigha.GraphicsInterface.Drawable.SubWorldDraw(GraphicsInterface.WorldDraw)
Метод создает независимое от видовых представлений геометрическое представление этого объекта.
wd: Входной интерфейс WorldDraw.  Тип GraphicsInterface.WorldDraw.
Returns: Возвращает true, только если геометрическое представление объекта не зависит от видового экрана. Возвращаемое значение false указывает, что какая-то часть графики объекта зависит от видового представления, поэтому 3D GS должна вызвать ViewportDraw(), чтобы для такого объекта получить законченную геометрию и полный набор атрибутов.

Teigha.GraphicsInterface.Drawable.Bounds
Свойство предоставляет доступ к границам отображаемого объекта, если они доступны.
Returns: Возвращает границы отображаемого объекта или null, если границы недоступны или не существуют.
Тип System.Nullable<DatabaseServices.Extents3d>.

Teigha.GraphicsInterface.Drawable.DrawableType
Свойство предоставляет доступ к типу текущего отображаемого объекта.
Returns: Возвращает тип текущего отображаемого объекта из перечисления GraphicsInterface.DrawableType.

Teigha.GraphicsInterface.Drawable.Id
Свойство возвращает идентификатор в базе данных, соответствующий этому отображаемому объекту (если этот объект является постоянным).
Returns: Возвращает идентификатор отображаемого объекта в базе данных. Тип DatabaseServices.ObjectId.

Teigha.GraphicsInterface.Drawable.IsPersistent
Свойство позволяет установить, является ли объект Drawable резидентным в базе данных.
Returns: Возвращает true, если объект Drawable является резидентным в базе данных. В противном случае возвращает false.