Teigha.DatabaseServices.ObjectErasedEventArgs
Данный класс представляет данные для события <c>ObjectErased</c> в базе данных.

Teigha.DatabaseServices.ObjectErasedEventArgs.DBObject
Свойство <c>DBObject</c> представляет изменённый объект.
Returns: Возвращает изменённый объект. Тип <c>DatabaseServices.DBObject</c>.

Teigha.DatabaseServices.ObjectErasedEventArgs.Erased
Свойство позволяет проверить, является ли указанный объект удалённым.
Returns: Возвращает <c>true</c>, если объект считается удалённым.
В противном случае возвращает <c>false</c>.