Teigha.DatabaseServices.ItemLocator
Класс <c>ItemLocator</c> представляет индекс <c>{i, j, k}</c> элемента в прямоугольном массиве.

Teigha.DatabaseServices.ItemLocator.#ctor(System.Int32,System.Int32,System.Int32)
Конструктор класса ItemLocator. Инициализирует индексы этой структуры указанными значениями.
itemIndex: Индекс элемента. Тип <c>int</c>.
rowIndex: Индекс строки.   Тип <c>int</c>.
levelIndex: Индекс уровня.   Тип <c>int</c>.

Teigha.DatabaseServices.ItemLocator.ItemIndex
Свойство обеспечивает доступ к индексу, который определяет позицию элемента в массиве относительно первого элемента массива.
Returns: Возвращает индекс данного элемента. Тип <c>int</c>.

Teigha.DatabaseServices.ItemLocator.LevelIndex
Свойство представляет индекс, определяющий текущий уровень элемента в массиве относительно первого уровня.
Returns: Возвращает уровень данного элемента. Тип <c>int</c>.

Teigha.DatabaseServices.ItemLocator.RowIndex
Свойство представляет индекс, определяющий строку элемента в массиве относительно первой строки.
Returns: Возвращает текущую строку данного элемента. Тип <c>int</c>.