Teigha.DbConstraints.Exception
Класс <c>Exception</c> представляет контейнер для значений ошибок <c>ErrorStatus</c>.

Teigha.DbConstraints.Exception.#ctor
Конструктор по умолчанию класса <c>Exception</c>.

Teigha.DbConstraints.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus)
Конструктор класса <c>Exception</c>. Создает экземпляр класса для указанного статуса ошибки.
es: Входной статус ошибки.

Teigha.DbConstraints.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus,String)
Конструктор класса <c>Exception</c>. Создает экземпляр класса для указанного статуса ошибки и с указанным сообщением.
es: Входной статус ошибки.       Тип <c>ErrorStatus</c>.
message: Входное сообщение об ошибке. Тип <c>String</c>.

Teigha.DbConstraints.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus,String,Teigha.BoundaryRepresentation.Exception)
Конструктор класса <c>Exception</c>.
Создает экземпляр класса с указанными статусом ошибки, сообщением об ошибке и с внутренним исключением.
es: Входной статус ошибки.         Тип <c>ErrorStatus</c>.
message: Входное сообщение об ошибке.   Тип <c>String</c>.
innerException: Входное внутреннее исключение. Тип <c>Exception</c>.

Teigha.DbConstraints.Exception.#ctor(SerializationInfo,StreamingContext)
Конструктор класса <c>Exception</c>.
Создает исключение, используя указанную информацию о сериализации и потоковом контексте.
info: Входная информация о сериализации, которая используется для инициализации статуса ошибки.  Тип <c>SerializationInfo</c>.
context: Входной контекст сериализованного потока, содержит контекстную информацию об источнике или получателе. Тип <c>StreamingContext</c>.

Teigha.DbConstraints.Exception.GetObjectData(SerializationInfo,StreamingContext)
Метод предназначен для извлечения данных об исключениях.
info: Выходная информация о сериализации, которая используется для инициализации статуса ошибки.  Тип <c>SerializationInfo</c>.
context: Выходной контекст сериализованного потока, содержит контекстную информацию об источнике или получателе. Тип <c>StreamingContext</c>.

Teigha.DbConstraints.Exception.ErrorStatus
Свойство <c>ErrorStatus</c> предоставляет доступ к текущему статусу ошибки.
Returns: Возвращает статус ошибки.  Тип <c>ErrorStatus</c>.