Teigha.DatabaseServices.GeomRef
Класс <c>GeomRef</c> является базовым для конкретных производных классов, таких как EdgeRef, FaceRef и VertexRef.
Эти простые классы, которые хранят ссылку на подобъект объекта чертежа и используются главным образом не для хранения, а для передачи информации о геометрии подобъекта.

Teigha.DatabaseServices.GeomRef.Reset
Метод обнуляет ссылку на геометрию в данном объекте.

Teigha.DatabaseServices.GeomRef.IsEmpty
Свойство позволяет проверить, не является ли данный объект пустым, когда он не ссылается ни на какую геометрию.
Returns: Возвращает <c>true</c>, если данный объект является пустым.  В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GeomRef.IsValid
Свойство позволяет проверить, является ли данный объект действительным.
Returns: Возвращает <c>true</c>, если данный объект является действительным.
В противном случае возвращает <c>false</c>.