HostMgd.ApplicationServices.Document.LockDocument(DocumentLockMode,String,String,System.Boolean)
Метод предназначен для блокировки dwg-документа в заданном режиме, для выполнения указанной команды.
Метод блокирует dwg-документ в режиме, заданном в параметре lockMode. Также, можно указать глобальное и локализованное название команды, которая будет выполняться во время блокировки.
lockMode: Задает режим блокировки с помощью одного из значений, указанных в перечислении DocumentLockMode
globalCommandName: Глобальное имя команды, которая будет выполняться во время блокировки документа. Тип String. Может иметь значение null
localCommandName: Локальное название команды, которая будет выполняться во время блокировки документа. Тип String. Может иметь значение null
promptIfFails: Если документ не может быть заблокирован из-за того, что уже выпоняется команда над этим документом и значение параметра promptIfFails - true,
Returns: Возвращает заблокированный документ в случае его успешной блокировки. Тип DocumentLock