Teigha.BoundaryRepresentation.Shell
Класс <c>Shell</c> является интерфейсным классом для оболочек BREP.

Teigha.BoundaryRepresentation.Shell.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса <c>Shell</c>. Создает экземпляр класса, используя указанный путь подобъекта.
fullSubentPath: Путь подобъекта.  Тип <c>DatabaseServices.FullSubentityPath</c>.

Teigha.BoundaryRepresentation.Shell.GetFacesStartingFrom(Teigha.BoundaryRepresentation.Face)
Метод позволяет получить коллекцию граней оболочки, начиная с указанной стартовой грани.
startFrom: Входная стартовая грань, с которой начинается формируемая коллекция граней.
Returns: Возвращает коллекцию граней данной оболочки.
Тип <c>ShellFaceCollection</c>.

Teigha.BoundaryRepresentation.Shell.Complex
Свойство <c>Complex</c> представляет объект <c>Complex</c>, связанный с данной оболочкой <c>Shell</c>.
Returns: Возвращает комплекс, связанный с данной оболочкой.
Тип <c>BoundaryRepresentation.Complex</c>.

Teigha.BoundaryRepresentation.Shell.Faces
Свойство <c>Faces</c> предоставляет доступ ко всем граням данной оболочки.
Returns: Возвращает коллекцию граней оболочки.
Тип <c>ShellFaceCollection</c>.