HostMgd.ApplicationServices.DocumentCollection.ExecuteInApplicationContext(ExecuteInApplicationContextCallback,System.Object)
Метод предназначен для вызова функции, которая ничего не возвращает из контекста приложения.
Метод позволяет вызывать функцию, которая ничего не возвращает из контекста приложения.
callback: Делегат для вызова callback void функции из контекста приложения. Тип ExecuteInApplicationContextCallback
data: Любые данные, которые нужно использовать при вызове функции. Тип object