Teigha.Geometry.Matrix3d
Класс Matrix3d представляет аффинное преобразование трехмерного пространства, включая вращения и трансляцию.

Teigha.Geometry.Matrix3d.#ctor(array&lt;double&gt;)
Конструктор создает 3D-матрицу на основе значений в переданном массиве.
data: Массив элементов матрицы. Тип double[].

Teigha.Geometry.Matrix3d.AlignCoordinateSystem(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод формирует матрицу для преобразования из одной системы координат в другую.
fromOrigin: Точка начала исходной системы координат. Тип Point3d.
fromXAxis: Вектор, задающий направление оси X исходной СК. Тип Vector3d.
fromYAxis: Вектор, задающий направление оси Y исходной СК. Тип Vector3d.
fromZAxis: Вектор, задающий направление оси Z исходной СК. Тип Vector3d.
toOrigin: Точка начала целевой системы координат. Тип Point3d.
toXAxis: Вектор, задающий направление оси X целевой СК. Тип Vector3d.
toYAxis: Вектор, задающий направление оси Y целевой СК. Тип Vector3d.
toZAxis: Вектор, задающий направление оси Z целевой СК. Тип Vector3d.
Returns: Возвращает матрицу преобразования из исходной СК в целевую СК. Тип Matrix3d.

Teigha.Geometry.Matrix3d.Displacement(Teigha.Geometry.Vector3d)
Метод формирует матрицу трансляции  на заданный вектор.
vector: Вектор трансляции. Тип Vector3d.
Returns: Возвращает матрицу перемещения на заданный вектор.

Teigha.Geometry.Matrix3d.Equals(Object)
Метод реализует проверку объектов на равенство.
obj: Объект, с которым сравнивается данная матрица.  Тип Object.
Returns: Возвращает true, если obj не равен нулю и представляет эквивалентную матрицу.
Notes

Teigha.Geometry.Matrix3d.GetDeterminant
Метод позволяет получить определитель данной матрицы.
Returns: Возвращает значение детерминанта матрицы. Тип double.

Teigha.Geometry.Matrix3d.GetHashCode
Метод предоставляет хеш-код для данной матрицы.
Returns: Возвращает хеш-код объекта. Тип int.

Teigha.Geometry.Matrix3d.GetScale
Метод предоставляет масштабный коэффициент этой матрицы.
Returns: Возвращает масштабный коэффициент матрицы. Тип double.

Teigha.Geometry.Matrix3d.Inverse
Метод позволяет получить матрицу, обратную по отношению к данной матрице.
Returns: Возвращает обратную матрицу. Тип Matrix3d.

Teigha.Geometry.Matrix3d.IsEqualTo(Teigha.Geometry.Matrix3d,Teigha.Geometry.Tolerance)
Метод позволяет выяснить, совпадает ли данная матрица с указанной матрицей в пределах заданного допуска.
mat: Входная матрица для сравнения. Тип Matrix3d.
tolerance: Допуск, используемый для сравнеия. Тип Tolerance.
Returns: Возвращает true в случае совпадения матриц и false в противном случае.

Teigha.Geometry.Matrix3d.IsEqualTo(Teigha.Geometry.Matrix3d)
Метод позволяет выяснить, совпадает ли данная матрица с указанной матрицей.
mat: Входная матрица для сравнения. Тип Matrix3d.
Returns: Возвращает true в случае совпадения матриц и false в противном случае.

Teigha.Geometry.Matrix3d.IsInverse(Teigha.Geometry.Matrix3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли указанная матрица обратной по отношению к данной матрице в пределах заданного допуска.
inv: Матрица, с которой выполняется сравнение. Тип Matrix3d.
tolerance: Допуск, используемый для сравнеия. Тип Tolerance.
Returns: Возвращает true, если матрица inv является обратной по отношению к данной, иначе - false.

Teigha.Geometry.Matrix3d.IsInverse(Teigha.Geometry.Matrix3d)
Метод позволяет проверить, является ли указанная матрица обратной по отношению к данной матрице.
inv: Матрица, с которой выполняется сравнение. Тип Matrix3d.
Returns: Возвращает true, если матрица <c>inv</c> является обратной по отношению к данной, иначе - false.

Teigha.Geometry.Matrix3d.IsScaledOrtho(Teigha.Geometry.Tolerance)
Метод позволяет проверить, перпендикулярны ли друг другу векторы-столбцы линейной части данной матрицы в пределах заданного допуска.
tolerance: Допуск, определяющий точность сравнения. Тип Tolerance.
Returns: Возвращает true, если трехмерные векторы, которые представлены столбцами линейной части этой матрицы, перпендикулярны друг другу в пределах заданного допуска. В противном случае возвращает false.

Teigha.Geometry.Matrix3d.IsScaledOrtho
Метод позволяет проверить, перпендикулярны ли друг другу векторы-столбцы линейной части данной матрицы.
Returns: Возвращает true, если трехмерные векторы, которые представлены столбцами линейной части этой матрицы, перпендикулярны друг другу. В противном случае возвращает false.

Teigha.Geometry.Matrix3d.IsSingular(Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данная матрица сингулярной в пределах заданной точности.
tolerance: Используемый допуск. Тип Tolerance.
Returns: Возвращает true, если данная матрица является сингулярной, иначе - false.
Notes
* Матрица сингулярна тогда и только тогда, когда ее определитель равен нулю. Такое возможно, например, если какие-либо векторы-столбцы линейной части данной матрицы имеют нулевую длину или оказываются параллельными.
* Сингулярная матрица не может быть инвертирована.

Teigha.Geometry.Matrix3d.IsSingular
Метод позволяет проверить, является ли данная матрица сингулярной.
Returns: Возвращает true, если данная матрица является сингулярной, иначе - false.
Notes
* Матрица сингулярна тогда и только тогда, когда ее определитель равен нулю. Такое возможно, например, если какие-либо векторы-столбцы линейной части данной матрицы имеют нулевую длину или оказываются параллельными.
* Сингулярная матрица не может быть инвертирована.

Teigha.Geometry.Matrix3d.IsUniscaledOrtho(Teigha.Geometry.Tolerance)
Метод позволяет проверить, являются ли векторы-столбцы линейной части данной матрицы одинаковыми по длине и перпендикулярными друг другу (в пределах заданной точности).
tolerance: Входная точность. Тип Tolerance.
Returns: Возвращает true, если векторы-столбцы линейной части данной матрицы перпендикулярны друг другу и одинаковы по длине. В противном случае возвращает false.

Teigha.Geometry.Matrix3d.IsUniscaledOrtho
Метод позволяет проверить, являются ли векторы-столбцы линейной части данной матрицы одинаковыми по длине и перпендикулярными друг другу.
Returns: Возвращает true, если векторы-столбцы линейной части данной матрицы перпендикулярны друг другу и одинаковы по длине. В противном случае возвращает false.

Teigha.Geometry.Matrix3d.Mirroring(Teigha.Geometry.Line3d)
Метод формирует матрицу преобразования, соответствующего зеркальному отражению относительно заданной оси.
line: Ось симметрии. Тип Line3d.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.Geometry.Matrix3d.Mirroring(Teigha.Geometry.Plane)
Метод формирует матрицу преобразования, соответствующего зеркальному отражению относительно заданной плоскости.
plane: Плоскость симметрии. Тип Plane.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.Geometry.Matrix3d.Mirroring(Teigha.Geometry.Point3d)
Возвращает матрицу преобразования, которое описывает отражение относительно заданной точки в пространстве.
pointValue: Точка, относительно которой строится отражение. Тип Point3d.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.Geometry.Matrix3d.PlaneToWorld(Teigha.Geometry.Plane)
Метод формирует матрицу преобразования из системы координат на заданной плоскости в мировую систему координат (WCS).
plane: Входная плоскость. Тип Plane.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.Geometry.Matrix3d.PlaneToWorld(Teigha.Geometry.Vector3d)
Метод формирует матрицу преобразования из системы координат на заданной плоскости в мировую систему координат (WCS). Плоскость задается вектором нормали.
normal: Вектор нормали к плоскости. Тип Vector3d.
Returns: Возвращает матрицу преобразования. Тип Matrix3d.

Teigha.Geometry.Matrix3d.PostMultiplyBy(Teigha.Geometry.Matrix3d)
Метод выполняет матричное умножение данной матрицы на заданную матрицу.
rightSide: Матрица, которая выступает в матричном произведении правым сомножителем. Тип Matrix3d.
Returns: Возвращает результирующую матрицу. Тип Matrix3d.

Teigha.Geometry.Matrix3d.PreMultiplyBy(Teigha.Geometry.Matrix3d)
Метод выполняет матричное умножение заданной матрицы на данную матрицу.
leftSide: Матрица, которая выступает в матричном произведении левым сомножителем. Тип Matrix3d.
Returns: Возвращает результирующую матрицу. Тип Matrix3d.

Teigha.Geometry.Matrix3d.Projection(Teigha.Geometry.Plane,Teigha.Geometry.Vector3d)
Метод формирует матрицу, которая представляет параллельное проецирование на плоскость в указанном направлении.
projectionPlane: Плоскость, на которую выполняется проецирование. Тип Plane.
projectDir: Направление проецирования. Тип Vector3d.
Returns: Возвращает матрицу Matrix3d, которая обеспечивает заданное проецирование.

Teigha.Geometry.Matrix3d.Rotation(System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Point3d)
Возвращает матрицу поворота на заданный угол вокруг заданной оси.
angle: Угол поворота (рад). Тип double.
axis: Ось вращения. Тип Vector3d.
center: Центр вращения. Тип Point3d.
Returns: Возвращает матрицу Matrix3d, которая обеспечивает заданное вращение.

Teigha.Geometry.Matrix3d.Scaling(System.Double,Teigha.Geometry.Point3d)
Метод формирует матрицу равномерного масштабирования относительно заданной точки с заданным коэффициентом.
scaleAll: Коэффициент масштабирования. Тип double.
center: Центр масштабирования. Тип Point3d.
Returns: Возвращает матрицу Matrix3d, которая обеспечивает заданное масштабирование.

Teigha.Geometry.Matrix3d.ToArray
Метод формирует одномерный массив, содержащий все элементы данной матрицы.
Returns: Возвращает представление данной матрицы в виде одномерного массива. Тип double[].

Teigha.Geometry.Matrix3d.ToString
Метод реализует эквивалентное представление данной матрицы в виде текстовой строки.
Returns: Возвращает строку. Тип String.

Teigha.Geometry.Matrix3d.ToString(IFormatProvider)
Метод реализует эквивалентное представление данной матрицы в виде текстовой строки с учетом региональных и языковых настроек.
provider: Провайдер региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает строковое представление данной матрицы. Тип String.

Teigha.Geometry.Matrix3d.ToString(String,IFormatProvider)
Метод реализует эквивалентное представление данной матрицы в виде текстовой строки в заданном формате и с учетом региональных и языковых настроек.
format: Входной формат строки. Тип String.
provider: Провайдер региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает строковое представление данной матрицы. Тип String.

Teigha.Geometry.Matrix3d.Transpose
Метод формирует матрицу, являющуюся результатом транспонирования данной матрицы.
Returns: Возвращает транспонированную матрицу. Тип Matrix3d.

Teigha.Geometry.Matrix3d.WorldToPlane(Teigha.Geometry.Plane)
Метод формирует матрицу преобразования кординат из мировой системы координат (WCS) в координаты на заданной плоскости.
plane: Целевая плоскость. Тип Plane.
Returns: Возвращает матрицу Matrix3d, которая обеспечивает заданное преобразование координат.

Teigha.Geometry.Matrix3d.WorldToPlane(Teigha.Geometry.Vector3d)
Метод формирует матрицу преобразования кординат из мировой системы координат (WCS) в координаты на плоскости, заданной вектором нормали.
normal: Входной вектор нормали целевой плоскости. Тип Vector3d.
Returns: Возвращает матрицу Matrix3d, которая обеспечивает заданное преобразование координат.

Teigha.Geometry.Matrix3d.CoordinateSystem3d
Свойство выполняет приведение данной матрицы к типу Geometry.CoordinateSystem3d, который представляет систему координат.
Returns: Возвращает систему координат как объект Geometry.CoordinateSystem3d.

Teigha.Geometry.Matrix3d.ElementAt
Свойство предоставляет доступ к элементу матрицы с указанными индексами строки и столбца.
i: Номер строки матрицы, тип int.
j: Номер столбца матрицы, тип int.
Returns: Возвращает значение элемента матрицы с указанными индексами строки и столбца. Тип double.

Teigha.Geometry.Matrix3d.Identity
Свойство возвращает единичную матрицу.
Returns: Возвращает возвращает единичную матрицу. Тип Matrix3d.

Teigha.Geometry.Matrix3d.Normal
Свойство возвращает абсолютное значение наибольшего элемента в линейной части данной матрицы
Returns: Возвращает абсолютное значение наибольшего элемента. Тип double.

Teigha.Geometry.Matrix3d.Translation
Свойство возвращает трансляционную часть данной матрицы в виде вектора.
Returns: Возвращает объект Vector3d.