Teigha.DatabaseServices.IdMappingEventArgs
Этот класс представляет данные для событий, связанных с сопоставлением (мэппингом) идентификаторов (<c>BeginDeepClone</c>, <c>BeginDeepCloneTranslation</c>, <c>InsertMappingAvailable</c> и <c>WblockMappingAvailable</c>) в базе данных.

Teigha.DatabaseServices.IdMappingEventArgs.IdMapping
Свойство возвращает объект <c>IdMapping</c>, ассоциированный с данным событием.
Returns: Возвращает карту сопоставления идентификаторов <c>IdMapping</c>, связанную с данным событием.