Teigha.BoundaryRepresentation.Element2dNodeCollection
Класс <c>Element2dNodeCollection</c> представляет коллекцию узлов объекта <c>Element2d</c>.

Teigha.BoundaryRepresentation.Element2dNodeCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции.
Returns: Возвращает перечислитель данной коллекции.
Тип <c>Element2dNodeEnumerator</c>.