HostMgd.EditorInput.Editor.PromptForSelectionEnding
Событие, возникающее после завершения операции выбора
объектов
Порядок возникновения событий:
№  Событие
0  SelectionRemoved - PickfirstSet ssCount:13 removed:1
1  PromptingForSelection.
2  SelectionAdded - PickfirstSet ssCount:0 added:12
3  PromptForSelectionEnding - ssCount:12.
4  PromptedForSelection.