Teigha.BoundaryRepresentation.ShellFaceCollection
Класс <c>ShellFaceCollection</c> представляет набор граней, соответствующих оболочке <c>Shell</c>.

Teigha.BoundaryRepresentation.ShellFaceCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции.
Returns: Возвращает перечислитель коллекции граней оболочки BREP.
Тип <c>ShellFaceEnumerator</c>.