Teigha.DatabaseServices.Material
Класс <c>Material</c> представляет свойства материала, используемые при визуализации затененных объектов.

Teigha.DatabaseServices.Material.#ctor
Конструктор по умолчанию класса <c>Material</c>.

Teigha.DatabaseServices.Material.Ambient
Свойство представляет теневой компонент рассеянного цвета данного материала.
Returns: Возвращает компонент рассеянного цвета.
Тип <c>MaterialColor</c>.

Teigha.DatabaseServices.Material.Anonymous
Свойство позволяет проверить, является ли этот материал «анонимным».
Только для внутреннего использования.
Returns: Возвращает <c>true</c>, если материал является «анонимным».
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Material.Bump
Свойство представляет компонент рельефности данного материала.
Returns: Возвращает карту рельефности (выдавливания).
Тип <c>MaterialMap</c>.

Teigha.DatabaseServices.Material.ChannelFlags
Свойство представляет флаги канала для данного материала и позволяет настраивать требуемые комбинации каналов.
Returns: Возвращает комбинацию флагов из перечисления <c>GraphicsInterface.ChannelFlags</c>.

Teigha.DatabaseServices.Material.ColorBleedScale
Свойство, которое представляет коэффициент цветового заполнения для данного материала.
Returns: Возвращает коэффициент цветового заполнения. Тип <c>double</c>.

Teigha.DatabaseServices.Material.Description
Свойство представляет описание данного материала.
Returns: Возвращает описание материала.  Тип <c>String</c>.

Teigha.DatabaseServices.Material.Diffuse
Свойство представляет основной диффузный компонент этого материала.
Returns: Возвращает диффузный компонент материала.
Тип <c>MaterialDiffuseComponent</c>.

Teigha.DatabaseServices.Material.FinalGather
Свойство представляет режим финальной сборки для данного материала.
Returns: Возвращает текущий режим финальной сборки.
Перечисление <c>GraphicsInterface.FinalGatherMode</c>.

Teigha.DatabaseServices.Material.GlobalIllumination
Свойство представляет текущий режим общего освещения для этого материала.
Returns: Возвращает режим общего освещения.
Перечисление <c>GraphicsInterface.GlobalIlluminationMode</c>.

Teigha.DatabaseServices.Material.IlluminationModel
Свойство представляет модель освещения, которая используется для этого материала в расширенном процессе рендеринга.
Returns: Возвращает модель освещения материала.
Перечисление <c>GraphicsInterface.IlluminationModel</c>.

Teigha.DatabaseServices.Material.IndirectBumpScale
Свойство представляет коэффициент непрямой рельефности данного материала.
Returns: Возвращает коэффициент непрямой рельефности материала. Тип <c>double</c>.

Teigha.DatabaseServices.Material.Luminance
Свойство представляет значение яркости материала.
Returns: Возвращает яркость материала.  Тип <c>double</c>.

Teigha.DatabaseServices.Material.LuminanceMode
Свойство представляет режим яркости данного материала.
Returns: Возвращает режим яркости материала.
Перечисление <c>GraphicsInterface.LuminanceMode</c>.

Teigha.DatabaseServices.Material.Mode
Свойство представляет режим представления данного материала.
Returns: Возвращает режим представления материала.
Перечисление <c>GraphicsInterface.Mode</c>.

Teigha.DatabaseServices.Material.Name
Свойство представляет наименование данного материала.
Returns: Возвращает наименование материала.  Тип <c>String</c>.

Teigha.DatabaseServices.Material.NormalMap
Свойство представляет компонент <c>NormalMap</c> этого материала.
Returns: Возвращает компонент <c>NormalMap</c> материала.
Тип <c>MaterialNormalMapComponent</c>.

Teigha.DatabaseServices.Material.Opacity
Свойство представляет компонент непрозрачности этого материала.
Returns: Возвращает компонент непрозрачности материала.
Тип <c>MaterialOpacityComponent</c>.

Teigha.DatabaseServices.Material.ReflectanceScale
Свойство представляет коэффициент отражения данного материала.
Returns: Возвращает коэффициент отражения материала. Тип <c>double</c>.

Teigha.DatabaseServices.Material.Reflection
Свойство представляет компонент отражения данного материала.
Returns: Возвращает компонент отражения материала. Тип <c>MaterialMap</c>.

Teigha.DatabaseServices.Material.Reflectivity
Свойство представляет степень отражающей способности этого материала.
Returns: Возвращает отражающую способность материала. Тип <c>double</c>.

Teigha.DatabaseServices.Material.Refraction
Свойство представляет компонент преломления данного материала.
Returns: Возвращает компонент преломления материала.
Тип <c>MaterialRefractionComponent</c>.

Teigha.DatabaseServices.Material.SelfIllumination
Свойство представляет значение самосвечения данного материала.
Returns: Возвращает значение самосвечения материала. Тип <c>double</c>.

Teigha.DatabaseServices.Material.Specular
Свойство представляет компонент зеркального отражения этого материала.
Returns: Возвращает компонент зеркального отражения материала.
Тип <c>MaterialSpecularComponent</c>.

Teigha.DatabaseServices.Material.Translucence
Свойство представляет полупрозрачность этого материала.
Returns: Возвращает полупрозрачность материала. Тип <c>double</c>.

Teigha.DatabaseServices.Material.TransmittanceScale
Свойство представляет коэффициент пропускания данного материала.
Returns: Возвращает коэффициент пропускания материала. Тип <c>double</c>.

Teigha.DatabaseServices.Material.TwoSided
Свойство позволяет указать или проверить, что материал является двусторонним.
Returns: Возвращает <c>true</c>, если материал является двусторонним.
В противном случае возвращает <c>false</c>.