Teigha.DatabaseServices.Solid3d
Класс <c>Solid3d</c> представляет  в базе данных объекты трехмерных твердых тел.

Teigha.DatabaseServices.Solid3d.#ctor
Конструктор по умолчанию класса <c>Solid3d</c>.

Teigha.DatabaseServices.Solid3d.BooleanOperation(Teigha.DatabaseServices.BooleanOperationType,Teigha.DatabaseServices.Solid3d)
Метод предназначен для выполнения логических операций между данным объектом и другим твердым телом (объединение, пересечение, вычитание).
operation: Тип логической операции. Перечисление <c>BooleanOperationType</c>.
solid: Другое твердое тело, участвующее в данной логической операции. Тип <c>Solid3d</c>.

Teigha.DatabaseServices.Solid3d.ChamferEdges(array&lt;SubentityId&gt;,Teigha.DatabaseServices.SubentityId,System.Double,System.Double)
Метод предназначен для создания фасок на ребрах данного твердого тела.
subentityIds: Массив идентификаторов объектов ребер данного твердого тела. Тип <c>SubentityId[]</c>.
baseSubentityId: Идентификатор объекта основной грани, на ребрах которой создаются фаски. Тип <c>SubentityId</c>.
baseDist: Расстояние от ребра для построения фаски на основной грани.  Тип <c>double</c>.
otherDist: Расстояние от ребра для построения фасок на других гранях.   Тип <c>double</c>.

Teigha.DatabaseServices.Solid3d.CheckInterference(Teigha.DatabaseServices.Solid3d)
Метод позволяет проверить, пересекается ли данный объект с другим твердым телом.
otherSolid: Другое твердое тело, участвующее в проверке на возможные коллизии. Тип <c>Solid3d</c>.
Returns: Возвращает <c>true</c>, если твердое тело <c>otherSolid</c> пересекается с данным объектом.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Solid3d.CleanBody
Метод позволяет удалить все избыточные ребра и грани, которые не являются необходимыми для обеспечения топологии данного твердого тела.

Teigha.DatabaseServices.Solid3d.ConvertToBrepAtSubentPaths(array&lt;FullSubentityPath&gt;)
Метод позволяет преобразовать отдельные элементы истории построения параметризованного типа в простое граничное представление без параметрической информации или данных о типе. В текущей версии метод не реализован.
paths: Массив элементов истории. Тип <c>FullSubentityPath[]</c>.

Teigha.DatabaseServices.Solid3d.CopyEdge(Teigha.DatabaseServices.SubentityId)
Метод позволяет сделать копию указанного ребра данного объекта в виде отдельного объекта (экземпляра класса <c>Line</c>, <c>Circle</c>, <c>Arc</c>, <c>Ellipse</c>, <c>Spline</c>).
subEntityId: Идентификатор подобъекта ребра в данном твердом теле. Тип <c>SubentityId</c>.
Returns: Возвращает копию ребра в виде самостоятельного экземпляра одного из геометрических примитивов. Тип <c>Entity</c>.

Teigha.DatabaseServices.Solid3d.CopyFace(Teigha.DatabaseServices.SubentityId)
Метод позволяет сделать копию указанной грани в виде отдельного объекта класса <c>Region</c> или <c>Body</c>.
subEntityId: Идентификатор подобъекта грани в данном твердом теле. Тип <c>SubentityId</c>.
Returns: Возвращает копию указанной грани в виде отдельного геометрического объекта. Тип <c>Entity</c>.

Teigha.DatabaseServices.Solid3d.CreateBox(System.Double,System.Double,System.Double)
Метод позволяет создать 3D-тело в виде прямоугольного параллелепипеда заданного размера, ребра которого выровнены по осям мировой системы координат (WCS), с центром в начале системы координат WCS.
lengthAlongX: Длина тела вдоль оси <c>X</c> WCS. Тип <c>double</c>.
lengthAlongY: Длина тела вдоль оси <c>Y</c> WCS. Тип <c>double</c>.
lengthAlongZ: Длина тела вдоль оси <c>Z</c> WCS. Тип <c>double</c>.
На значения входных аргументов накладываются следующие ограничения:

Teigha.DatabaseServices.Solid3d.CreateExtrudedSolid(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SubentityId,System.Double,Teigha.DatabaseServices.SweepOptions)
Метод предназначен для создания твердого тела методом выдавливания указанной грани на заданную длину.
sweepEntity: Выдавливаемый объект. Тип <c>Entity</c>.
faceSubEntityId: Идентификатор подобъекта грани, которую требуется выдавить. Тип <c>SubentityId</c>.
height: Длина выдавливания. Тип <c>double</c>. Используется как множитель для вектора направления выдавливания.
sweepOptions: Опции операции выдавливания. Тип <c>SweepOptions</c>.

Teigha.DatabaseServices.Solid3d.CreateExtrudedSolid(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SubentityId,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.SweepOptions)
Метод предназначен для создания твердого тела методом выдавливания указанной грани, направление и длина которого задана входным вектором.
sweepEntity: Выдавливаемый объект. Тип <c>Entity</c>.
faceSubEntityId: Идентификатор подобъекта грани, которую требуется выдавить. Тип <c>SubentityId</c>.
directionVector: Вектор, определяющий направление и величину выдавливания. Тип <c>Vector3d</c>.
sweepOptions: Опции операции выдавливания. Тип <c>SweepOptions</c>.

Teigha.DatabaseServices.Solid3d.CreateExtrudedSolid(Teigha.DatabaseServices.Entity,Teigha.Geometry.Vector3d,Teigha.DatabaseServices.SweepOptions)
Метод предназначен для создания твердого тела выдавливанием плоской кривой, области или плоской поверхности, направление и длина которого задана входным вектором.
sweepEntity: Выдавливаемый объект. Тип <c>Entity</c>.
directionVector: Вектор, определяющий направление и величину выдавливания. Тип <c>Vector3d</c>.
sweepOptions: Опции операции выдавливания. Тип <c>SweepOptions</c>.

Teigha.DatabaseServices.Solid3d.CreateFrom(Teigha.DatabaseServices.Entity)
Метод предназначен для создания трехмерного твердого тела из указанного геометрического объекта.
fromEntity: Входной объект, из которого создается твердое тело. Тип <c>Entity</c>.

Teigha.DatabaseServices.Solid3d.CreateFrustum(System.Double,System.Double,System.Double,System.Double)
Метод создаёт усеченный конус, ориентированный по осям мировой системы координат (WCS), с центром основания в начале координат.
В зависимости от входных параметров метода геометрия получаемого твердого тела может иметь вид круглого или эллиптического цилиндра, круглого или эллиптического конуса, круглого или эллиптического усеченного конуса.
height: Высота получаемого тела. Тип <c>double</c>. Значение не должно быть меньше 1e-6.
radiusAlongX: Радиус основания в направлении оси <c>X</c> МСК (WCS). Тип <c>double</c>. Значение не должно быть меньше 1e-6.
radiusAlongY: Радиус основания в направлении оси <c>Y</c> МСК (WCS). Тип <c>double</c>. Значение не должно быть меньше 1e-6.
topRadius: Радиус верхнего основания. Тип <c>double</c>. Значение не должно быть меньше 1e-6.

Teigha.DatabaseServices.Solid3d.CreateLoftedSolid(array&lt;Entity&gt;,array&lt;Entity&gt;,Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.LoftOptions)
Метод предназначен для создания трехмерного твердого тела методом лофта - вытягиванием по сечениям.
crossSectionCurves: Массив кривых, которые будут использоваться операцией лофта в качестве поперечных сечений. Тип <c>Entity[]</c>.
guideCurves: Массив направляющих.  Тип <c>Entity[]</c>.
pathCurve: Кривая пути.          Тип <c>Entity</c>.
loftOptions: Опции операции лофта. Тип <c>LoftOptions</c>.

Teigha.DatabaseServices.Solid3d.CreatePyramid(System.Double,System.Int32,System.Double,System.Double)
Метод предназначен для создания твердого тела в виде пирамиды с указанными параметрами.
height: Высота пирамиды. Тип <c>double</c>. Высота по модулю не может быть меньше 1e-6.
sides: Количество боковых граней пирамиды. Тип <c>int</c>. Диапазон допустимых значений - от 3 до 64, включительно.
radius: Радиус окружности, вписанной в нижнее основание пирамиды. Тип <c>double</c>. Значение по модулю не может быть меньше 1e-6.
topRadius: Радиус окружности, вписанной в верхнее основание пирамиды. Тип <c>double</c>. Значение по модулю не может быть меньше 1e-6.

Teigha.DatabaseServices.Solid3d.CreateRevolvedSolid(Teigha.DatabaseServices.Entity,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double,Teigha.DatabaseServices.RevolveOptions)
Метод создает трехмерное твердое тело вращением указанной кривой, области или плоской поверхности вокруг заданной оси вращения.
profileEntity: Профиль в виде кривой, области или плоской поверхности, используемый для получения 3D-тела операцией вращения. Тип <c>Entity</c>.
axisPoint: Точка на оси вращения. Тип <c>Point3d</c>.
axisDir: Направляющий вектор оси вращения. Тип <c>Vector3d</c>.
angleOfRevolution: Угол поворота профиля в операции вращения (в радианах). Тип <c>double</c>.
startAngle: Начальный угол поворота (в радианах). Тип <c>double</c>. Если равен нулю, вращение начинается с текущей позиции объекта <c>profileEntity</c>.
revolveOptions: Опции операции вращения. Тип <c>RevolveOptions</c>.

Teigha.DatabaseServices.Solid3d.CreateRevolvedSolid(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SubentityId,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double,Teigha.DatabaseServices.RevolveOptions)
Метод создает трехмерное твердое тело вращением указанной грани вокруг заданной оси вращения.
profileEntity: Объект чертежа, которому принадлежит вращаемая грань.  Тип <c>Entity</c>.
faceSubEntityId: Идентификатор подобъекта вращаемой грани. Тип <c>SubentityId</c>.
axisPoint: Точка на оси вращения. Тип <c>Point3d</c>.
axisDir: Направляющий вектор оси вращения. Тип <c>Vector3d</c>.
angleOfRevolution: Угол поворота профиля в операции вращения (в радианах). Тип <c>double</c>.
startAngle: Начальный угол поворота (в радианах). Тип <c>double</c>. Если равен нулю, вращение начинается с текущей позиции объекта <c>profileEntity</c>.
revolveOptions: Опции операции вращения. Тип <c>RevolveOptions</c>.

Teigha.DatabaseServices.Solid3d.CreateSphere(System.Double)
Метод создает сферу заданного радиуса с центром в начале мировой системы координат.
radius: Радиус создаваемой сферы. Тип <c>double</c>. Значение не может быть меньше 1e-6.

Teigha.DatabaseServices.Solid3d.CreateSweptSolid(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SubentityId,Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SweepOptions)
Метод создает трехмерное твердое тело вытягиванием конкретной грани указанного объекта чертежа по заданной траектории.
sweepEntity: Объект чертежа, которому принадлежит вытягиваемая грань. Тип <c>Entity</c>.
faceSubEntityId: Идентификатор подобъекта грани. Тип <c>SubentityId</c>.
pathEntity: Объект кривой, которая представляет траекторию вытягивания грани. Тип <c>Entity</c>.
sweepOptions: Настройки операции вытягивания по траектории. Тип <c>SweepOptions</c>.

Teigha.DatabaseServices.Solid3d.CreateSweptSolid(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.SweepOptions)
Метод создает трехмерное твердое тело вытягиванием указанной кривой, области или плоской поверхности по заданной траектории.
sweepEntity: Объект чертежа, который служит профилем для операции вытягивания по траектории. Тип <c>Entity</c>.
pathEntity: Объект кривой, которая представляет траекторию вытягивания профиля. Тип <c>Entity</c>.
sweepOptions: Настройки операции вытягивания по траектории. Тип <c>SweepOptions</c>.

Teigha.DatabaseServices.Solid3d.CreateTorus(System.Double,System.Double)
Метод предназначен для создания твердого тела в виде тора в мировой системе координат (WCS) c осью <c>z</c> в качестве оси вращения и с центром в начале координат.
majorRadius: Радиус тора. Тип <c>double</c>.
minorRadius: Радиус образующей окружности тора. Тип <c>double</c>.

Teigha.DatabaseServices.Solid3d.CreateWedge(System.Double,System.Double,System.Double)
Метод создает трехмерный твердотельный клин, выровненный по осям мировой системы координат (WCS).
lengthAlongX: Размер тела в направлении оси <c>x</c> (WCS). Тип <c>double</c>.
lengthAlongY: Размер тела в направлении оси <c>y</c> (WCS). Тип <c>double</c>.
lengthAlongZ: Размер тела в направлении оси <c>z</c> (WCS). Тип <c>double</c>.

Teigha.DatabaseServices.Solid3d.Extrude(Teigha.DatabaseServices.Region,System.Double,System.Double)
Метод создает трехмерное твердое тело выдавливанием указанной области на заданную высоту и с заданным углом наклона.
region: Область, используемая операцией выдавливания в качестве профиля выдавливания. Тип <c>Region</c>.
height: Высота выдавливания. Тип <c>double</c>.
taperAngle: Угол наклона при выдавливании (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.Solid3d.ExtrudeAlongPath(Teigha.DatabaseServices.Region,Teigha.DatabaseServices.Curve,System.Double)
Метод создает трехмерное твердое тело путем выдавливания указанной области вдоль заданной траектории.
region: Область, используемая операцией выдавливания в качестве профиля выдавливания. Тип <c>Region</c>.
path: Объект кривой, который служит траекторией выдавливания. Тип <c>Curve</c>.
taperAngle: Угол наклона при выдавливании (в радианах). Тип <c>double</c>.  Диапазон допустимых значений <c>[-PI/2..PI/2]</c>.

Teigha.DatabaseServices.Solid3d.ExtrudeFaces(array&lt;SubentityId&gt;,System.Double,System.Double)
Метод позволяет выдавить массив граней твердого тела на указанную длину с заданным углом наклона.
subentityIds: Массив идентификаторов подобъекта для выдавливаемых граней. Тип <c>SubentityId[]</c>.
height: Высота выдавливания. Тип <c>double</c>.
taper: Угол наклона при выдавливании (в радианах). Тип <c>double</c>.  Диапазон допустимых значений <c>[-PI/2..PI/2]</c>.

Teigha.DatabaseServices.Solid3d.ExtrudeFacesAlongPath(array&lt;SubentityId&gt;,Teigha.DatabaseServices.Curve)
Метод позволяет выдавить группу указанных граней твердого тела вдоль заданной траектории.
subentityIds: Массив идентификаторов подобъектов для выдавливаемых граней. Тип <c>SubentityId[]</c>.
path: Объект, определяющий траекторию выдавливания. Тип <c>Curve</c>.

Teigha.DatabaseServices.Solid3d.FilletEdges(array&lt;SubentityId&gt;,Teigha.Geometry.DoubleCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.DoubleCollection)
Метод предназначен для создания скруглений на ребрах данного твердого тела.
subentityIds: Массив идентификаторов объектов ребер. К указанным ребрам применяется операция скругления. Тип <c>SubentityId[]</c>.
radius: Массив значений радиусов скругления для соответствующих ребер. Тип <c>DoubleCollection</c>.
startSetback: Массив начальных отступов на соответствующих ребрах. Тип <c>DoubleCollection</c>.
endSetback: Массив конечных отступов на соответствующих ребрах. Тип <c>DoubleCollection</c>.

Teigha.DatabaseServices.Solid3d.GetSection(Teigha.Geometry.Plane)
Метод предназначен для построения области <c>Region</c>, являющейся результатом сечения твердого тела указанной плоскостью.
plane: Секущая плоскость. Тип <c>Plane</c>.
Returns: Возвращает созданную область. Тип <c>Region</c>.

Teigha.DatabaseServices.Solid3d.GetSubentityColor(Teigha.DatabaseServices.SubentityId)
Метод позволяет получить цвет указанного подобъекта данного твердого тела.
subEntityId: Идентификатор подобъекта (ребра или грани). Тип <c>SubentityId</c>.
Returns: Возвращает цвет интересующего подобъекта. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.Solid3d.GetSubentityMaterial(Teigha.DatabaseServices.SubentityId)
Метод позволяет получить материал для указанного подобъекта.
subEntityId: Идентификатор подобъекта. Тип <c>SubentityId</c>.
Returns: Возвращает идентификатор материала указанного подобъекта. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Solid3d.GetSubentityMaterialMapper(Teigha.DatabaseServices.SubentityId)
Метод позволяет для указанного подобъекта получить объект <c>Mapper</c>, который обеспечивает сопоставление материалов.
subEntityId: Входной идентификатор подобъекта. Тип <c>SubentityId</c>.
Returns: Возвращает объект для сопоставления материалов подобъекта. Тип <c>Mapper</c>.

Teigha.DatabaseServices.Solid3d.ImprintEntity(Teigha.DatabaseServices.Entity)
Метод реализует операцию клеймения данного твердого тела указанным объектом.
entity: Объект для клеймения на данном твердом теле. Тип <c>Entity</c>.

Teigha.DatabaseServices.Solid3d.OffsetBody(System.Double)
Метод реализует смещение всех граней данного твердого тела на указанное расстояние.
offsetDistance: Величина смещения. Тип <c>double</c>.

Teigha.DatabaseServices.Solid3d.OffsetFaces(array&lt;SubentityId&gt;,System.Double)
Метод позволяет смещать указанные грани твердого тела на заданное расстояние.
subentityIds: Массив идентификаторов подобъектов граней. Тип <c>SubentityId[]</c>.
offsetDistance: Величина смещения. Тип <c>double</c>.

Teigha.DatabaseServices.Solid3d.ProjectOnToSolid(Teigha.DatabaseServices.Entity,Teigha.Geometry.Vector3d)
Метод предназначен для создания объектов проецированием указанного объекта в указанном направлении на данное 3D-тело.
Созданные объекты не являются резидентными в базе данных.
entityToProject: Проецируемый геометрический объект. Тип <c>Entity</c>.
projectionDirection: Направление проецирования. Тип <c>Vector3d</c>.
Returns: Возвращает массив геометрических объектов. Тип <c>Entity[]</c>.

Teigha.DatabaseServices.Solid3d.RemoveFaces(array&lt;SubentityId&gt;)
Метод предназначен для удаления указанных граней из данного твердого тела.
subentityIds: Массив идентификаторов подобъектов удаляемых граней данного 3D-тела. Тип <c>SubentityId[]</c>.

Teigha.DatabaseServices.Solid3d.Revolve(Teigha.DatabaseServices.Region,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double)
Метод позволяет создать трехмерное твердое тело вращением указанной области на заданный угол вокруг заданной оси.
region: Вращаемая область. Тип <c>Region</c>.
axisPoint: Точка на линии, проекция которой дает ось вращения. Тип <c>Point3d</c>.
axisDir: Направляющий вектор линии, проекция которой дает ось вращения. Тип <c>Vector3d</c>.
angleOfRevolution: Угол вращения в радианах по модулю 2*Pi. Тип <c>double</c>.

Teigha.DatabaseServices.Solid3d.SeparateBody
Метод позволяет разделить данное 3D-тело на массив твердых тел, представляющих дополнительные непересекающиеся объемы.
Returns: Возвращает массив твердых тел с непересекающимися объемами. Тип <c>Solid3d[]</c>.

Teigha.DatabaseServices.Solid3d.SetSubentityColor(Teigha.DatabaseServices.SubentityId,Colors.Color)
Метод позволяет задать цвет указанной подобъекту грани или ребра.
subEntityId: Идентификатор подобъекта (грани или ребра), которому назначается новый цвет. Тип <c>SubentityId</c>.
color: Новый цвет подобъекта. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.Solid3d.SetSubentityMaterial(Teigha.DatabaseServices.SubentityId,DatabaseServices.ObjectId)
Метод позволяет назначить указанному подобъекту данного 3D-тела новый материал.
subEntityId: Идентификатор подобъекта. Тип <c>SubentityId</c>.
materialId: Идентификатор объекта материала. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Solid3d.SetSubentityMaterialMapper(Teigha.DatabaseServices.SubentityId,Teigha.GraphicsInterface.Mapper)
Метод позволяет задать указанному подобъекту новый объект <c>Mapper</c> для сопоставления материалов.
subEntityId: Идентификатор подобъекта. Тип <c>SubentityId</c>.
mapper: Объект для сопоставления материалов. Тип <c>Mapper</c>.

Teigha.DatabaseServices.Solid3d.ShellBody(array&lt;SubentityId&gt;,System.Double)
Метод позволяет преобразовать твердое тело в тонкостенную твердотельную оболочку путем смещения граней исходного тела.
subentityIds: Идентификаторы подобъектов граней твердого тела. Тип <c>SubentityId[]</c>.
offsetDistance: Величина смещения граней. Тип <c>double</c>.

Teigha.DatabaseServices.Solid3d.Slice(DatabaseServices.Surface)
Метод разрезает твердое тело указанной поверхностью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей поверхности с положительным направлением нормали.
surface: Режущая поверхность. Тип <c>DatabaseServices.Surface</c>.

Teigha.DatabaseServices.Solid3d.Slice(DatabaseServices.Surface,System.Boolean)
Метод разрезает твердое тело указанной поверхностью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей поверхности с положительным направлением нормали.  Дополнительно метод позволяет получить в виде твердого тела и "отрицательную" половину исходного 3D-тела.
surface: Режущая поверхность. Тип <c>DatabaseServices.Surface</c>.
negativeHalfToo: Флаг, определяющий, должна ли другая ("отрицательная") часть исходного тела создаваться как отдельное тело. Тип <c>bool</c>.
Returns: Возвращает созданное твердое тело, представляющее "отрицательную" половину исходного 3D-тела.
Тип <c>Solid3d</c>.

Teigha.DatabaseServices.Solid3d.Slice(Teigha.Geometry.Plane)
Метод позволяет разрезать плоскостью данное твердое тело и преобразовать его в ту часть, которая осталась с "положительной" стороны от режущей плоскости.
plane: Режущая плоскость. Тип <c>Plane</c>.

Teigha.DatabaseServices.Solid3d.Slice(Teigha.Geometry.Plane,System.Boolean)
Метод разрезает твердое тело указанной плоскостью и преобразует исходное твердое тело в часть, оставшуюся со стороны от режущей плоскости с положительным направлением нормали.  Дополнительно метод позволяет получить в виде твердого тела и "отрицательную" половину исходного 3D-тела.
plane: Режущая плоскость. Тип <c>Plane</c>.
negativeHalfToo: Флаг, определяющий, должна ли другая ("отрицательная") часть исходного тела создаваться как отдельное твердое тело. Тип <c>bool</c>.
Returns: Возвращает созданное твердое тело, представляющее "отрицательную" половину исходного 3D-тела.
Тип <c>Solid3d</c>.

Teigha.DatabaseServices.Solid3d.StlOut(String,System.Boolean)
Метод предназначен для записи представления данного твердого тела в формате стереолитографии (STL) в файл с указанным именем.
fileName: Имя файла. Тип <c>String</c>.
asciiFormat: Флаг, определяющий, будет ли записан файл в текстовом формате ASCII (значение <c>true</c>), или же будет записан файл в двоичном формате (значение <c>false</c>). Тип <c>bool</c>.

Teigha.DatabaseServices.Solid3d.TaperFaces(array&lt;SubentityId&gt;,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double)
Метод реализует сужение указанных граней твердого тела на заданный угол относительно базовой плоскости, определяемой заданными базовой точкой и вектором.
subentityIds: Идентификаторы подобъектов граней данного твердого тела. Тип <c>SubentityId[]</c>.
basePoint: Базовая точка плоскости сужения. Тип <c>Point3d</c>.
draftVector: Вектор направления сужения. Тип <c>Vector3d</c>.
draftAngle: Угол сужения в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.Solid3d.TransformFaces(array&lt;SubentityId&gt;,Teigha.Geometry.Matrix3d)
Метод предназначен для геометрического преобразования указанных граней данного твердого тела, заданного матрицей преобразования.
subentityIds: Идентификаторы подобъектов граней данного твердого тела. Тип <c>SubentityId[]</c>.
matrix: Матрица геометрического преобразования. Тип <c>Matrix3d</c>.

Teigha.DatabaseServices.Solid3d.Area
Свойство <c>Area</c> представляет площадь данного твердого тела.
Returns: Возвращает площадь поверхности твердого тела. Тип <c>double</c>.

Teigha.DatabaseServices.Solid3d.IsNull
Свойство <c>IsNull</c> позволяет проверить, существует ли модель ACIS, связанная с этим объектом.
Returns: Возвращает <c>true</c>, если модель ACIS для данного объекта не существует.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Solid3d.MassProperties
Свойство <c>MassProperties</c> представляет массо-центровочные характеристики данного твердого тела.
Returns: Возвращает массо-центровочные характеристики данного объекта. Тип <c>Solid3dMassProperties</c>.

Teigha.DatabaseServices.Solid3d.NumChanges
Свойство <c>NumChanges</c> представляет количество изменений, произошедших с момента создания данного твердого тела.
Returns: Возвращает количество изменений данного объекта. Тип <c>int</c>.

Teigha.DatabaseServices.Solid3d.RecordHistory
Свойство <c>RecordHistory</c> позволяет определить, записывает ли данное твердое тело историю своих операций.
Returns: Возвращает <c>true</c>, если история операций сохраняется.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Solid3d.ShowHistory
Свойство <c>ShowHistory</c> позволяет определить, отображаются ли элементы из истории операций тела.
Returns: Возвращает <c>true</c>, если элементы из истории операций отображаются.
В противном случае возвращает <c>false</c>.