Teigha.GraphicsSystem.InvalidationHint
Данное перечисление определяет типы данных, которые, будучи в кэше, могут потерять актуальность и требовать перестроения. Используется графической системой для управления методом <c>GraphicsSystem.Model.Invalidate()</c>.