Teigha.BoundaryRepresentation.LoopEdgeEnumerator
Класс <c>LoopEdgeEnumerator</c> представляет перечислитель коллекции рёбер цикла грани.

Teigha.BoundaryRepresentation.LoopEdgeEnumerator.Current
Свойство <c>Current</c> представляет текущий элемент перечислителя.
Returns: Возвращает текущий элемент перечислителя.
Тип <c>Edge</c>.

Teigha.BoundaryRepresentation.LoopEdgeEnumerator.IsEdgeOrientToLoop
Свойство <c>IsEdgeOrientToLoop</c> позволяет проверить, совпадают ли ориентации текущего ребра и цикла грани.
Returns: Возвращает <c>true</c>, если ориентация текущего ребра и цикла совпадают.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.LoopEdgeEnumerator.OrientedCurve
Свойство <c>OrientedCurve</c> предоставляет доступ к ориентированной кривой для текущего ребра данного перечислителя.
Returns: Возвращает кривую для текущего ребра.  Тип <c>Curve3d</c>.

Teigha.BoundaryRepresentation.LoopEdgeEnumerator.ParamCurve
Свойство <c>ParamCurve</c> представляет параметрическую 2D-кривую для текущего ребра данного перечислителя.
Returns: Возвращает параметрическую 2D-кривую.
Тип <c>Curve2d</c>.

Teigha.BoundaryRepresentation.LoopEdgeEnumerator.ParamCurveAsNurb
Свойство <c>ParamCurveAsNurb</c> представляет NURB 2D-кривую для текущего ребра перечислителя.
Returns: Возвращает NURB 2D-кривую для текущего ребра.
Тип <c>NurbCurve2d</c>.