Teigha.DatabaseServices.TableContent
Класс <c>TableContent</c> представляет в базе данных содержимое таблицы.

Teigha.DatabaseServices.TableContent.#ctor
Конструктор по умолчанию класса <c>TableContent</c>.

Teigha.DatabaseServices.TableContent.GetCellStyle(System.Int32,System.Int32)
Метод предоставляет стиль указанной ячейки.
row: Индекс строки таблицы. Тип <c>int</c>.
column: Индекс столбца таблицы. Тип <c>int</c>.
Returns: Возвращает имя стиля ячейки. Тип <c>String</c>.

Teigha.DatabaseServices.TableContent.GetColumnWidth(System.Int32)
Метод позволяет получить ширину столбца с указанным индексом.
column: Индекс столбца таблицы. Тип <c>int</c>.
Returns: Возвращает ширину столбца. Тип <c>double</c>.

Teigha.DatabaseServices.TableContent.GetRowHeight(System.Int32)
Метод позволяет получить высоту строки с указанным индексом.
row: Индекс строки таблицы. Тип <c>int</c>.
Returns: Возвращает высоту строки. Тип <c>double</c>.

Teigha.DatabaseServices.TableContent.SetCellStyle(System.Int32,System.Int32,String)
Метод позволяет задать стиль указанной ячейки.
row: Индекс строки таблицы.  Тип <c>int</c>.
column: Индекс столбца таблицы. Тип <c>int</c>.
cellStyle: Имя стиля ячейки.       Тип <c>String</c>.

Teigha.DatabaseServices.TableContent.SetColumnWidth(System.Int32,System.Double)
Метод позволяет задать ширину столбца с указанным индексом.
column: Индекс столбца. Тип <c>int</c>.
width: Новая ширина указанного столбца. Тип <c>double</c>.

Teigha.DatabaseServices.TableContent.SetRowHeight(System.Int32,System.Double)
Метод позволяет задать высоту строки с указанным индексом.
row: Индекс строки. Тип <c>int</c>.
height: Новое значение высоты строки. Тип <c>double</c>.

Teigha.DatabaseServices.TableContent.TableStyleId
Свойство <c>TableStyleId</c> представляет идентификатор табличного стиля.
Returns: Возвращает идентификатор табличного стиля.
Тип <c>DatabaseServices.ObjectId</c>.