Teigha.DatabaseServices.ObjectContext
Абстрактный базовый класс ObjectContext предназначен для представления контекста, который может влиять на свойства и поведение пользовательских объектов.

Teigha.DatabaseServices.ObjectContext.CollectionName
Свойство представляет имя коллекции контекстов, которой принадлежит данный контекст.
Returns: Возвращает имя коллекции контекстов. Тип <c>String</c>.

Teigha.DatabaseServices.ObjectContext.Name
Свойство представляет имя данного контекста.
Returns: Возвращает имя контекста. Тип <c>String</c>.

Teigha.DatabaseServices.ObjectContext.UniqueIdentifier
Свойство представляет уникальный и неизменный идентификатор контекста.
Returns: Возвращает идентификатор контекста. Тип <c>IntPtr</c>.