Teigha.DatabaseServices.Viewport
Класс <c>Viewport</c> представляет в базе данных объекты видового экрана пространства листа <c>PaperSpace</c>.

Teigha.DatabaseServices.Viewport.#ctor
Конструктор по умолчанию класса <c>Viewport</c>.

Teigha.DatabaseServices.Viewport.FreezeLayersInViewport(System.Collections.IEnumerator)
Метод позволяет заморозить указанные слои в данном видовом экране.
layerIds: Список идентификаторов слоёв, которые должны быть заморожены.

Teigha.DatabaseServices.Viewport.GetFrozenLayers
Метод предоставляет коллекцию всех слоёв, замороженных в данном видовом экране.
Returns: Возвращает коллекцию идентификаторов замороженных слоёв.
Тип <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.Viewport.GetPreviousBackground(GraphicsInterface.DrawableType)
Метод позволяет получить ранее заданный фон вида. Не реализован.
type: Тип объекта предыдущего фона. Перечисление <c>GraphicsInterface.DrawableType</c>.
Returns: Возвращает идентификатор объекта предыдущего фона.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Viewport.GetUcs(Point3d%,Vector3d%,Vector3d%)
Метод позволяет получить начало, ось X и ось Y пользовательской системы координат (UCS) данного видового экрана.
origin: Принимает точку начала ПСК (UCS).      Тип <c>Point3d</c>.
x: Принимает направление оси X ПСК (UCS). Тип <c>Vector3d</c>.
y: Принимает направление оси Y ПСК (UCS). Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Viewport.IsLayerFrozenInViewport(DatabaseServices.ObjectId)
Метод позволяет определить, заморожен ли указанный слой в данном видовом экране.
layerId: Идентификатор проверяемого слоя. Тип <c>DatabaseServices.ObjectId</c>.
Returns: Возвращает <c>true</c>, если слой заморожен в данном видовом экране.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.SetPreviousBackground(DatabaseServices.ObjectId,GraphicsInterface.DrawableType)
Метод позволяет задать предыдущий фон в данном видовом экране. Не реализован.
value: Идентификатор объекта фона. Тип <c>DatabaseServices.ObjectId</c>.
type: Тип предыдущего объекта фона. Перечисление <c>GraphicsInterface.DrawableType</c>.

Teigha.DatabaseServices.Viewport.SetShadePlot(Teigha.DatabaseServices.ShadePlotType,DatabaseServices.ObjectId)
Метод позволяет задать тип отображения теней при выводе на печать данного видового экрана.
type: Тип отображения теней. Перечисление <c>ShadePlotType</c>.
shadePlotId: Идентификатор объекта <c>VisualStyle</c> или <c>RenderSettings</c>, которые будут использоваться для управления отображением теней. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Viewport.SetSun(Teigha.DatabaseServices.DBObject)
Метод позволяет задать солнечное освещение (бесконечно удаленный источник света) для данного видового экрана.
sun: Объект Солнца. Тип <c>DBObject</c>.
Returns: Возвращает идентификатор установленного источника солнечного освещения в базе данных.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Viewport.SetUcs(DatabaseServices.ObjectId)
Метод позволяет задать пользовательскую систему координат, связанную с этим видовым экраном.
userCoordinateSystemId: Идентификатор объекта UCS.

Teigha.DatabaseServices.Viewport.SetUcs(Teigha.DatabaseServices.OrthographicView)
Метод позволяет задать в видовом экране пользовательскую систему координат, используя указанный тип ортогонального вида.
view: Тип ортогонального вида. Перечисление <c>OrthographicView</c>.

Teigha.DatabaseServices.Viewport.SetUcs(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет задать в видовом экране пользовательскую систему координат непосредственно, используя координаты точки начала и направления осей <c>X</c> и <c>Y</c>.
origin: Положение начала новой пользовательской системы координат. Тип <c>Point3d</c>.
x: Направляющий вектор оси <c>X</c>. Тип <c>Vector3d</c>.
y: Направляющий вектор оси <c>Y</c>. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Viewport.SetUcsToWorld
Метод позволяет совместить ПСК данного видового экрана с мировой системой координат.

Teigha.DatabaseServices.Viewport.SetViewDirection(Teigha.DatabaseServices.OrthographicView)
Метод позволяет задать в данном видовом экране предопределенную ориентацию вида из набора ортогональных видов.
Не реализован.
view: Тип ортогонального вида. Перечисление <c>OrthographicView</c>.

Teigha.DatabaseServices.Viewport.ThawAllLayersInViewport
Метод позволяет разморозить все слои в данном видовом экране.

Teigha.DatabaseServices.Viewport.ThawLayersInViewport(System.Collections.IEnumerator)
Метод позволяет разморозить в данном видовом экране указанный список слоёв.
layerIds: Коллекция идентификаторов слоёв, которые следует разморозить.

Teigha.DatabaseServices.Viewport.UpdateDisplay
Метод обновляет представление на экране, чтобы отразить изменения в данном видовом экране.

Teigha.DatabaseServices.Viewport.AmbientLightColor
Свойство <c>AmbientLightColor</c> представляет цвет рассеянного света в данном видовом экране.
Returns: Возвращает цвет рассеянного света.
Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.Viewport.AnnotationScale
Свойство <c>AnnotationScale</c> представляет объект масштаба аннотаций в данном видовом экране.
Returns: Возвращает объект масштаба аннотаций.
Тип <c>DatabaseServices.AnnotationScale</c>.

Teigha.DatabaseServices.Viewport.BackClipDistance
Свойство <c>BackClipDistance</c> представляет расстояние до задней плоскости отсечения для данного видового экрана.
Returns: Возвращает расстояние до задней плоскости отсечения.
Тип <c>double</c>.

Teigha.DatabaseServices.Viewport.BackClipOn
Свойство <c>BackClipOn</c> позволяет определить,  включен ли в данном видовом экране режим заднего отсечения.
Returns: Возвращает <c>true</c>, если режим заднего отсечения включен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.Background
Свойство <c>Background</c> представляет идентификатор объекта фона в данном видовом экране.
Returns: Возвращает идентификатор объекта фона вида.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Viewport.Brightness
Свойство <c>Brightness</c> представляет значение яркости, которое влияет на относительную интенсивность освещения в данном видовом экране.
Returns: Возвращает значение яркости.
Тип <c>double</c>.

Teigha.DatabaseServices.Viewport.centerPoint
Свойство <c>CenterPoint</c> представляет центральную точку данного видового экрана в координатах МСК (WCS).
Returns: Возвращает центральную точку видового экрана.
Тип <c>Point3d</c>.

Teigha.DatabaseServices.Viewport.CircleSides
Свойство <c>CircleSides</c> представляет процент масштабирования окружностей в данном видовом экране в диапазоне [1..20000].
Это значение используется при тесселяции кривых. Чем оно выше, тем больше линейных сегментов используется при тесселяции кривой.
Returns: Возвращает процент масштабирования окружностей в диапазоне [1..20000].
Тип <c>int</c>.

Teigha.DatabaseServices.Viewport.Contrast
Свойство <c>Contrast</c> представляет значение контрастности, влияющее на интенсивность рассеянного освещения от других источников света в данном видовом экране.
Returns: Возвращает значение контраста.
Тип <c>double</c>.

Teigha.DatabaseServices.Viewport.CustomScale
Свойство <c>CustomScale</c> представляет пользовательский масштаб в данном видовом экране.
Returns: Возвращает величину пользовательского масштаба.
Тип <c>double</c>.

Teigha.DatabaseServices.Viewport.DefaultLightingOn
Свойство <c>DefaultLightingOn</c> позволяет определить, включено ли в данном видовом экране освещение по умолчанию.
Returns: Возвращает <c>true</c>, если освещение по умолчанию включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.DefaultLightingType
Свойство <c>DefaultLightingType</c> представляет тип освещения по умолчанию в данном видовом экране.
Returns: Возвращает тип освещения по умолчанию в данном видовом экране.
Перечисление <c>DatabaseServices.DefaultLightingType</c>.

Teigha.DatabaseServices.Viewport.EffectivePlotStyleSheet
Свойство <c>EffectivePlotStyleSheet</c> представляет имя таблицы стилей печати, связанной с данным видовым экраном.
Returns: Возвращает имя таблицы стилей печати.
Тип <c>String</c>.

Teigha.DatabaseServices.Viewport.Elevation
Свойство <c>Elevation</c> представляет возвышение плоскости ПСК (UCS) данного видового экрана.
Returns: Возвращает возвышение плоскости ПСК.
Тип <c>double</c>.

Teigha.DatabaseServices.Viewport.FastZoomOn
Свойство <c>FastZoomOn</c> позволяет определить, включен ли в данном видовом экране режим быстрого масштабирования.
Returns: Возвращает <c>true</c>, если режим быстрого масштабирования включен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.FrontClipAtEyeOn
Свойство <c>FrontClipAtEyeOn</c> позволяет определить, проходит ли передняя плоскость отсечения через камеру.
Returns: Возвращает <c>true</c>, если передняя плоскость отсечения проходит через камеру.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.FrontClipDistance
Свойство <c>FrontClipDistance</c> представляет расстояние до передней плоскости отсечения в данном видовом экране.
Returns: Возвращает расстояние до передней плоскости отсечения.
Тип <c>double</c>.

Teigha.DatabaseServices.Viewport.FrontClipOn
Свойство <c>FrontClipOn</c> позволяет определить, включен ли в данном видовом экране режим переднего отсечения.
Returns: Возвращает <c>true</c>, если режим переднего отсечения включен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.GridAdaptive
Свойство <c>GridAdaptive</c> позволяет определить, является ли сетка в данном видовом экране адаптивной.
Returns: Возвращает <c>true</c>, если сетка в данном видовом экране является адаптивной.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.GridBoundToLimits
Свойство <c>GridBoundToLimits</c> определяет, отображается ли сетка в этом видовом экране только в границах лимитов МСК (WCS) и ПСК (UCS).
Returns: Возвращает <c>true</c>, если сетка отображается только в границах МСК (WCS) и ПСК (UCS).
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.GridFollow
Свойство <c>GridFollow</c> определяет, реагирует ли сетка на динамические изменения ПСК (UCS) в этом видовом экране.
Returns: Возвращает <c>true</c>, если сетка динамически перестраивается в соответствии с изменениями ориентации пользовательской системы координат.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.GridIncrement
Свойство <c>GridIncrement</c> представляет шаг сетки вдоль осей <c>X</c> и <c>Y</c> ПСК в данном видовом экране.
Returns: Возвращает объект типа <c>Vector2d</c>, компоненты которого представляют шаг сетки вдоль соответствующей оси системы координат.

Teigha.DatabaseServices.Viewport.GridMajor
Свойство <c>GridMajor</c> представляет количество вспомогательных линий сетки между каждой парой соседних основных линий сетки.
Returns: Возвращает количество вспомогательных линий сетки между основными.
Тип <c>short</c>.

Teigha.DatabaseServices.Viewport.GridOn
Свойство <c>GridOn</c> позволяет определить, включен ли режим отображения сетки в данном видовом экране.
Returns: Возвращает <c>true</c>, если режим отображения сетки включен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.GridSubdivisionRestricted
Свойство <c>GridSubdivisionRestricted</c> позволяет определить, запрещено ли дробление сетки мельче шага вспомогательных линий сетки в данном видовом экране.
Returns: Возвращает <c>true</c>, если дробление сетки мельче шага вспомогательных линий не допускается.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.Height
Свойство <c>Height</c> представляет высоту этого видового экрана в единицах чертежа.
Returns: Возвращает высоту видового экрана в единицах чертежа.
Тип <c>double</c>.

Teigha.DatabaseServices.Viewport.HiddenLinesRemoved
Свойство <c>HiddenLinesRemoved</c> позволяет определить, будут ли удалены скрытые линии в данном видовом экране при выводе на печать.
Returns: Возвращает <c>true</c>, если скрытые линии будут удалены.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.LensLength
Свойство <c>LensLength</c> представляет фокусное расстояние в режиме вида в перспективе (в мм) в данном видовом экране.
Returns: Возвращает фокусное расстояние (в мм).
Тип <c>double</c>.

Teigha.DatabaseServices.Viewport.LinkedToSheetView
Свойство <c>LinkedToSheetView</c> позволяет определить, связан ли данный видовой экран с видом в пространстве листа.
Returns: Возвращает <c>true</c>, если данный видовой экран связан с видом в пространстве листа.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.Locked
Свойство <c>Locked</c> позволяет определить, заблокирован ли масштабный коэффициент в данном видовом экране.
Returns: Возвращает <c>true</c>, если масштабный коэффициент заблокирован.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.NonRectClipEntityId
Свойство <c>NonRectClipEntityId</c> представляет идентификатор объекта чертежа, который послужил инструментом обрезки в данном видовом экране.
Returns: Возвращает идентификатор объекта чертежа.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Viewport.NonRectClipOn
Свойство <c>NonRectClipOn</c> позволяет определить, включен ли в данном видовом экране режим обрезки непрямоугольным объектом.
Returns: Возвращает <c>true</c>, если режим обрезки непрямоугольным объектом включен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.Number
Свойство <c>Number</c> представляет идентификационный номер данного видового экрана.
Returns: Возвращает идентификационный номер данного видового экрана.
Тип <c>int</c>.

Teigha.DatabaseServices.Viewport.On
Свойство <c>On</c> позволяет определить состояние данного видового экрана (включен или выключен).
Returns: Возвращает <c>true</c>, если видового экрана включен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.PerspectiveOn
Свойство <c>PerspectiveOn</c> позволяет определить, включено ли перспективное проецирование в данном видовом экране.
Returns: Возвращает <c>true</c>, если перспективное проецирование включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.PlotAsRaster
Свойство <c>PlotAsRaster</c> позволяет определить, выводится ли данный видовой экран на печать в растровом режиме с использованием своих текущих настроек тонирования.
Returns: Возвращает <c>true</c>, если видовой экран выводится на печать в растровом режиме с использованием своих настроек тонирования.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.PlotStyleSheet
Свойство <c>PlotStyleSheet</c> представляет имя таблицы стилей печати, применяемых к объектам в данном видовом экране.
Returns: Возвращает имя таблицы стилей печати.
Тип <c>String</c>.

Teigha.DatabaseServices.Viewport.PlotWireframe
Свойство <c>PlotWireframe</c> позволяет определить, отображается ли векторная графика в данном видовом экране с использованием текущих настроек отображения теней при выводе на печать.
Returns: Возвращает <c>true</c>, если используются текущие настройки тонирования.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.RenderMode
Свойство <c>RenderMode</c> представляет текущий режим рендеринга в данном видовом экране.
Returns: Возвращает текущий режим рендеринга.
Тип <c>DatabaseServices.RenderMode</c>.

Teigha.DatabaseServices.Viewport.ShadePlot
Свойство <c>ShadePlot</c> представляет текущий режим отображения теней в данном видовом экране.
Returns: Возвращает текущий режим отображения теней.
Тип <c>ShadePlotType</c>.

Teigha.DatabaseServices.Viewport.ShadePlotId
Свойство <c>ShadePlotId</c> представляет объект тени (визуальный стиль или предопределенные настройки рендеринга), который определяет, как будет выводиться на печать текущий видовой экран.
Returns: Возвращает идентификатор объекта тени.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Viewport.SnapAngle
Свойство <c>SnapAngle</c> представляет угол поворота шаговой привязки в данном видовом экране относительно текущей ПСК (UCS).
Returns: Возвращает угол поворота шаговой привязки (в радианах).
Тип <c>double</c>.

Teigha.DatabaseServices.Viewport.SnapBasePoint
Свойство <c>SnapBasePoint</c> представляет базовую точку шаговой привязки в данном видовом экране относительно текущей ПСК (UCS).
Returns: Возвращает базовую точку шаговой привязки.
Тип <c>Point2d</c>.

Teigha.DatabaseServices.Viewport.SnapIncrement
Свойство <c>SnapIncrement</c> представляет интервал шаговой привязки в данном видовом экране.
Returns: Возвращает интервал шаговой привязки.
Тип <c>Vector2d</c>.

Teigha.DatabaseServices.Viewport.SnapIsometric
Свойство <c>SnapIsometric</c> позволяет определить, является ли изометрическая привязка текущим типом шаговой привязки.
Returns: Возвращает <c>true</c>, если текущим типом шаговой привязки является изометрическая привязка.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.SnapIsoPair
Свойство <c>SnapIsoPair</c> представляет плоскость изометрии для данного видового экрана.
Returns: Возвращает код плоскости изометрии.
Тип <c>int</c>.

Teigha.DatabaseServices.Viewport.SnapOn
Свойство <c>SnapOn</c> позволяет определить, включен ли режим шаговой привязки в данном видовом экране.
Returns: Возвращает <c>true</c>, если режим шаговой привязки включен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.StandardScale
Свойство <c>StandardScale</c> представляет масштаб в данном видовом экране, используя стандартные значения масштабов из перечисления <c>Teigha.DatabaseServices.StandardScaleType</c>.
Returns: Возвращает текущий масштаб в видовом экране как значение из перечисления <c>Teigha.DatabaseServices.StandardScaleType</c>.

Teigha.DatabaseServices.Viewport.SunId
Свойство <c>SunId</c> представляет идентификатор связанного с этим видовым экраном объекта солнца (бесконечно удаленного источника освещения).
Returns: Возвращает идентификатор объекта солнца (бесконечно удаленного источника освещения).
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Viewport.Thumbnail
Свойство <c>Thumbnail</c> представляет изображение предварительного просмотра этого видового экрана.
Returns: Возвращает изображение предварительного просмотра видового экрана.
Тип <c>System.Drawing.Bitmap</c>.

Teigha.DatabaseServices.Viewport.Transparent
Свойство <c>Transparent</c> позволяет определить, выставлен ли флаг прозрачности для данного видового экрана.
Returns: Возвращает <c>true</c>, если видовой экран прозрачный.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.TwistAngle
Свойство <c>TwistAngle</c> представляет угол поворота данного видового экрана в системе координат дисплея (DCS).
Returns: Возвращает угол поворота видового экрана (в радианах) в плоскости дисплея.
Тип <c>double</c>.

Teigha.DatabaseServices.Viewport.UcsFollowModeOn
Свойство <c>UcsFollowModeOn</c> позволяет определить, включен ли для данного видового экрана переход к отображению в плане при переключении с одной пользовательской системы координат (ПСК, UCS) на другую.
Returns: Возвращает <c>true</c>, если переход к отображению в плане при каждой смене ПСК включен.
В противном случае возвращает <c>false</c>, и тогда смена ПСК не влияет на текущий вид.

Teigha.DatabaseServices.Viewport.UcsIconAtOrigin
Свойство <c>UcsIconAtOrigin</c> позволяет определить, располагается ли в данном видовом экране значок ПСК (UCS) в начале пользовательской системы координат.
Returns: Возвращает <c>true</c>, если значок ПСК располагается в начале пользовательской системы координат.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.UcsIconVisible
Свойство <c>UcsIconVisible</c> позволяет определить, включено ли отображение значка ПСК (UCS) в данном видовом экране.
Returns: Возвращает <c>true</c>, если значок ПСК (UCS) отображается в видовом экране.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.UcsName
Свойство <c>UcsName</c> представляет идентификатор объекта пользовательской системы координат, связанной с данным видовым экраном.
Returns: Возвращает идентификатор объекта пользовательской системы координат.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Viewport.UcsOrthographic
Свойство <c>UcsOrthographic</c> представляет ортогональный вид в пользовательской системе координат.
Returns: Возвращает ортогональный вид из перечисления <c>OrthographicView</c>.

Teigha.DatabaseServices.Viewport.UcsPerViewport
Свойство <c>UcsPerViewport</c> позволяет определить, следует ли сохранять связь ПСК с данным видовым экраном.
Returns: Возвращает <c>true</c>, если связь ПСК с данным видовым экраном сохраняется.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Viewport.ViewCenter
Свойство <c>ViewCenter</c> представляет точку центра вида в данном видовом экране в системе координат дисплея.
Returns: Возвращает точку центра вида в данном видовом экране.
Тип <c>Point2d</c>.

Teigha.DatabaseServices.Viewport.ViewDirection
Свойство <c>ViewDirection</c> представляет направление вида в данном видовом экране (в мировой системе координат).
Returns: Возвращает направление вида (в мировой системе координат, WCS ).
Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Viewport.ViewHeight
Свойство <c>ViewHeight</c> представляет высоту вида данного видового экрана в системе координат дисплея (DCS).
Returns: Возвращает высоту вида данного видового экрана в DCS.
Тип <c>double</c>.

Teigha.DatabaseServices.Viewport.ViewOrthographic
Свойство <c>ViewOrthographic</c> представляет текущий ортогональный вид в данном видовом экране.
Returns: Возвращает текущий ортогональный вид. Перечисление <c>OrthographicView</c>.

Teigha.DatabaseServices.Viewport.viewTarget
Свойство <c>ViewTarget</c> представляет целевую точку данного видового экрана в мировой системе координат.
Returns: Возвращает целевую точку видового экрана в WCS.
Тип <c>Point3d</c>.

Teigha.DatabaseServices.Viewport.VisualStyleId
Свойство <c>VisualStyleId</c> представляет идентификатор объекта визуального стиля, который используется в данном видовом экране.
Returns: Возвращает идентификатор объекта визуального стиля.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Viewport.Width
Свойство <c>Width</c> представляет ширину данного видового экрана.
Returns: Возвращает ширину видового экрана.
Тип <c>double</c>.