Teigha.Geometry.Point2d
Данный класс представляет геометрические точки в 2D-пространстве.

Teigha.Geometry.Point2d.#ctor(System.Double,System.Double)
Конструктор.  Создает новый объект Point2d с указанными координатами x и y.
x: X-координата новой точки. Тип double.
y: Y-координата новой точки. Тип double.

Teigha.Geometry.Point2d.#ctor(array&lt;double&gt;)
Конструктор. Создает новый объект Point2d с координатами из двух первых элементов входного массива.
xy: Массив координат. Тип double[].

Teigha.Geometry.Point2d.Add(Teigha.Geometry.Vector2d)
Метод формирует новую точку, которая получена трансляцией данной точки на заданный 2D-вектор.
value: Входной вектор. Тип Vector2d.
Returns: Возвращает точку Point2d.

Teigha.Geometry.Point2d.DivideBy(System.Double)
Метод создает новую точку, координаты которой получены делением координат данной точки на указанное значение.
value: Значение, используемое для вычисления новых координат. Тип double.
Returns: Возвращает точку Point2d в новых координатах.

Teigha.Geometry.Point2d.Equals(Object)
Метод выполняет проверку на равенство данной точки и указанного объекта.
obj: Входной объект для сравнения.  Тип Object.
Returns: Возвращает true, если obj не равен нулю и имеет те же координаты, что и данная точка.

Teigha.Geometry.Point2d.GetAsVector
Метод преобразует данную точку в 2D-вектор с тем же набором координат и возвращает экземпляр Vector2d.
Returns: Возвращает вектор с теми же координатами, что и у данной 2D-точки. Тип Vector2d.

Teigha.Geometry.Point2d.GetDistanceTo(Teigha.Geometry.Point2d)
Метод вычисляет расстояние между этой и указанной точками.
point: Входная 2D-точка, до которой измеряется расстояние. Тип Point2d.
Returns: Возвращает расстояние между точками. Тип double.

Teigha.Geometry.Point2d.GetHashCode
Метод позволяет получить хеш-код для данного объекта.
Returns: Возвращает хеш-код в виде целочисленного значения, которое уникально для каждого экземпляра этого класса. Тип int.

Teigha.Geometry.Point2d.GetVectorTo(Teigha.Geometry.Point2d)
Метод строит вектор от данной точки до указанной.
point: 2D-точка, до которой требуется построить вектор. Тип Point2d.
Returns: Возвращает двумерный вектор, соединяющий данную точку с точкой point.  Тип Vector2d.

Teigha.Geometry.Point2d.IsEqualTo(Teigha.Geometry.Point2d)
Метод проверяет совпадение 2D-точек.
a: Точка, с которой проверяется совпадение. Тип Point2d.
Returns: Возвращает true, если точки совпадают; в противном случае возвращает false.

Teigha.Geometry.Point2d.Mirror(Teigha.Geometry.Line2d)
Метод создает новую 2D-точку как зеркальное отражение данной точки относительно указанной оси, располагающейся в той же плоскости.
line: Входная ось симметрии. Тип Line2d.
Returns: Возвращает 2D-точку, которая является результатом зеркального отражения этой точки относительно линии line. Тип Point2d.

Teigha.Geometry.Point2d.MultiplyBy(System.Double)
Метод умножает координаты данной точки на заданное значение.
value: Входной множитель. Тип double.
Returns: Возвращает 2D-точку, координаты которой получены умножением координат этой точки на значение value.  Тип Point2d.

Teigha.Geometry.Point2d.RotateBy(System.Double,Teigha.Geometry.Point2d)
Метод выполняет вращение этой точки вокруг заданного центра на заданный угол.
angle: Угол поворота в радианах. Тип double.
origin: Входная точка, которая служит центром вращения. Тип Point2d.
Returns: Возвращает 2D-точку, являющуюся результатом указанного вращения. Тип Point2d.

Teigha.Geometry.Point2d.ScaleBy(System.Double,Teigha.Geometry.Point2d)
Метод позволяет получить двумерную точку, которая является результатом масштабирования данной точки относительно заданного центра с заданным масштабным коэффициентом.
scaleFactor: Входной масштабный множитель. Тип double.
origin: Центр масштабирования. Тип Point2d.
Returns: Возвращает 2D-точку, являющуюся результатом операции масштабирования.  Тип Point2d.

Teigha.Geometry.Point2d.Subtract(Teigha.Geometry.Vector2d)
Метод позволяет получить точку, координаты которой определяются разностью координат данной точки и соответствующих компонент заданного вектора.
value: Вычитаемое значение.  Тип Vector2d.
Returns: Возвращает точку Point2d, которая является результатом вычитания.

Teigha.Geometry.Point2d.ToArray
Метод создает массив, содержащий значения координат данной точки.
Returns: Возвращает массив из двух элементов, содержащий значения координат X и Y данной точки. Тип double[].

Teigha.Geometry.Point2d.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.Geometry.Point2d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.Geometry.Point2d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
format: Формат строки. Тип String.
provider: Провайдер языковых и региональных настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде форматированной строки. Тип String.

Teigha.Geometry.Point2d.TransformBy(Teigha.Geometry.Matrix2d)
Метод применяет к данной точке указанное геометрическое преобразование и возвращает точку в новых координатах.
leftSide: Матрица геометрического преобразования. Тип Matrix2d.
Returns: Возвращает 2D-точку как результат геометрического преобразования leftSide текущих координат данной точки. Тип Point2d.

Teigha.Geometry.Point2d.Coordinate
Свойство предоставляет доступ к координатам точки.
index: Индекс координаты; тип int. 0 – координата X, 1 – координата Y.
Returns: Возвращает значение координаты. Тип double

Teigha.Geometry.Point2d.Origin
Свойство возвращает начало координат 2D-пространства данной точки.
Returns: Возвращает точку начала координат. Тип Point2d.

Teigha.Geometry.Point2d.X
Свойство, представляющее координату X данной точки.
Returns: Возвращает координату X данной точки.Тип double.

Teigha.Geometry.Point2d.Y
Свойство, представляющее координату Y данной точки.
Returns: Возвращает координату Y данной точки.Тип double.