HostMgd.EditorInput.PromptNestedEntityResultEventArgs
Класс, обеспечивающий данными событие PromptedForNestedEntity
класса Editor.

HostMgd.EditorInput.PromptNestedEntityResultEventArgs.Result
Возвращает результат выбора.