Teigha.DatabaseServices.ProxyResurrectionCompletedEventArgs
Класс <c>ProxyResurrectionCompletedEventArgs</c> предоставляет данные для события <c>ProxyResurrectionCompleted</c> базы данных.

Teigha.DatabaseServices.ProxyResurrectionCompletedEventArgs.ApplicationName
Свойство <c>ApplicationName</c> представляет имя приложения.
Returns: Возвращает имя приложения. Тип <c>String</c>.

Teigha.DatabaseServices.ProxyResurrectionCompletedEventArgs.Ids
Свойство <c>Ids</c> представляет идентификаторы восстанавливаемых объектов.
Returns: Возвращает коллекцию идентификаторов объектов.
Тип <c>ObjectIdCollection</c>.