HostMgd.EditorInput.SelectionRemovedEventArgs
Класс, обеспечивающий данными событие SelectionRemoved
Editor.

HostMgd.EditorInput.SelectionRemovedEventArgs.Flags
Возвращает битовые признаки, которые обеспечивают детальную
информацию о выборе, который производится в данный момент.

HostMgd.EditorInput.SelectionRemovedEventArgs.Remove(System.Int32)
Удаление объекта из набора по его индексу.
index: Индекс удаляемого объекта

HostMgd.EditorInput.SelectionRemovedEventArgs.RemoveSubentity(System.Int32,System.Int32)
Удаление подъобъекта из набора выбора.
index: Индекс объекта
subentityIndex: Индекс геометрического подобъекта

HostMgd.EditorInput.SelectionRemovedEventArgs.RemovedObjects
Набор объектов, удаленных из выбранного набора.

HostMgd.EditorInput.SelectionRemovedEventArgs.Selection
Возвращает набор объектов, выбранных в данный момент.