Teigha.Runtime.LispFunctionAttribute
Класс <c>LispFunctionAttribute</c> представляет атрибуты для вызываемых функций Lisp.

Teigha.Runtime.LispFunctionAttribute.#ctor(String)
Конструктор класса <c>LispFunctionAttribute</c>.
Создает объект с указанным именем функции Lisp.
globalName: Входное глобальное имя функции Lisp. Тип <c>String</c>.

Teigha.Runtime.LispFunctionAttribute.#ctor(String,String)
Конструктор класса <c>LispFunctionAttribute</c>.
Создает объект с указанным именем и локализованным идентификатором функции Lisp.
globalName: Входное глобальное имя функции Lisp. Тип <c>String</c>.
localizedNameId: Входной локализованный идентификатор функции Lisp.  Тип <c>String</c>.

Teigha.Runtime.LispFunctionAttribute.#ctor(String,String,String)
Конструктор класса <c>LispFunctionAttribute</c>.
Создает объект с указанным именем, локализованным идентификатором и темой справки для функции Lisp.
globalName: Входное глобальное имя функции Lisp.                  Тип <c>String</c>.
localizedNameId: Входной локализованный идентификатор функции Lisp.    Тип <c>String</c>.
helpFileName: Входная статья справки для данной функции Lisp.       Тип <c>String</c>.

Teigha.Runtime.LispFunctionAttribute.#ctor(String,String,String,String)
Конструктор класса <c>LispFunctionAttribute</c>.
Создает объект с указанным именем, локализованным идентификатором, а также файлом и темой справки для функции Lisp.
globalName: Входное глобальное имя функции Lisp.                  Тип <c>String</c>.
localizedNameId: Входной локализованный идентификатор функции Lisp.    Тип <c>String</c>.
helpFileName: Полный путь и имя файла справки.                      Тип <c>String</c>.
helpFileName: Входная статья справки для данной функции Lisp.       Тип <c>String</c>.

Teigha.Runtime.LispFunctionAttribute.ContextMenuExtensionType
Свойство <c>ContextMenuExtensionType</c> представляет тип расширения контекстного меню для функции Lisp.
Returns: Возвращает тип расширения контекстного меню.
Тип <c>Type</c>.

Teigha.Runtime.LispFunctionAttribute.Flags
Свойство <c>Flags</c> представляет командные флаги для данной функции Lisp.
Returns: Возвращает командные флаги для данной функции Lisp из перечисления <c>CommandFlags</c>.

Teigha.Runtime.LispFunctionAttribute.GlobalName
Свойство <c>GlobalName</c> представляет глобальное имя данного объекта.
Returns: Возвращает глобальное имя данного объекта.
Тип <c>String</c>.

Teigha.Runtime.LispFunctionAttribute.GroupName
Свойство <c>GroupName</c> представляет имя группы данного объекта.
Returns: Возвращает имя группы данного объекта.
Тип <c>String</c>.

Teigha.Runtime.LispFunctionAttribute.HelpFileName
Свойство <c>HelpFileName</c> представляет полное имя файла справки данного объекта.
Returns: Возвращает полное имя файла справки данного объекта.
Тип <c>String</c>.

Teigha.Runtime.LispFunctionAttribute.HelpTopic
Свойство <c>HelpTopic</c> представляет статью справки для данного объекта.
Returns: Возвращает статью справки для данного объекта.
Тип <c>String</c>.

Teigha.Runtime.LispFunctionAttribute.LocalizedNameId
Свойство <c>LocalizedNameId</c> представляет локализованный идентификатор функции Lisp.
Returns: Возвращает локализованный идентификатор функции Lisp.
Тип <c>String</c>.