Teigha.DatabaseServices.DictionaryWithDefaultDictionary
Данный класс представляет словарь, обладающий записью по умолчанию.

Teigha.DatabaseServices.DictionaryWithDefaultDictionary.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.DictionaryWithDefaultDictionary.DefaultId
Свойство предоставляет доступ на изменение к идентификатору объекта, который является записью по умолчанию для данного словаря.
Returns: Возвращает жесткий идентификатор записи по умолчанию данного словаря. Тип DatabaseServices.ObjectId.