Teigha.DatabaseServices.Body
Класс представляет объекты трехмерных тел в экземпляре базы данных.

Teigha.DatabaseServices.Body.#ctor
Конструктор по умолчанию класса Body.

Teigha.DatabaseServices.Body.#ctor(IntPtr,System.Boolean)
Конструктор класса Body.
unmanagedObjPtr: Входной объект. Тип IntPtr.
autoDelete: Флаг автоудаления входного объекта. Тип bool.

Teigha.DatabaseServices.Body.AcisIn(String)
Метод позволяет считать из указанного файла данные ACIS для данного объекта и возвращает коллекцию полученных тел ACIS.
fileName: Имя файла с геометрией. Тип String.
Returns: Возвращает коллекцию полученных из файла твердых тел ACIS. Тип DBObjectCollection.
Notes
Вновь созданные объекты не добавляются в базу данных, поэтому вызывающее приложение обязано либо добавить их в базу данных, либо удалить из памяти, когда потребность в них отпадёт.

Teigha.DatabaseServices.Body.AcisOut(String,Teigha.DatabaseServices.DBObjectCollection)
Метод записывает указанную коллекцию тел ACIS в заданный файл.
fileName: Имя файла для сохранения тел ACIS. Тип String.
entitiesOutToFile: Коллекция тел ACIS, которые предполагается сохранить в файле. Тип DBObjectCollection.

Teigha.DatabaseServices.Body.BodyPtr
Свойство предоставляет указатель на геометрию, непосредственно связанную с данным объектом.
Returns: Возвращает указатель на геометрию данного объекта. Тип IntPtr.

Teigha.DatabaseServices.Body.IsNull
Свойство позволяет установить, имеется ли в данном теле объект ShapeManager.
Returns: Возвращает <c>true</c>, если в данном теле нет объекта <c>ShapeManager</c>.

Teigha.DatabaseServices.Body.NumChanges
Свойство возвращает количество изменений, произошедших с этим телом с момента его создания.
Returns: Возвращает количество изменений в данном теле. Тип int.