Teigha.DatabaseServices.SweptSurface
Класс <c>SweptSurface</c> представляет в базе данных поверхности, полученные вытягиванием по траектории.

Teigha.DatabaseServices.SweptSurface.#ctor
Конструктор по умолчанию класса <c>SweptSurface</c>.

Teigha.DatabaseServices.SweptSurface.CreateSweptSurface(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Entity,DatabaseServices.SweepOptions)
Метод предназначен для создания поверхности вытягиванием указанного объекта по заданной траектории с учетом переданных опций
sweepEnt: Объект, вытягиваемый по траектории. Тип <c>Entity</c>.
pathEnt: Объект траектории. Тип <c>Entity</c>.
sweepOptions: Настройки операции вытягивания по траектории. Тип <c>DatabaseServices.SweepOptions</c>.

Teigha.DatabaseServices.SweptSurface.Bank
Свойство <c>Bank</c> позволяет определить, расположена ли вытягиваемая поверхность или кривая вдоль траектории вытягивания.
Returns: Возвращает <c>true</c>, если вытягиваемая поверхность или кривая располагается вдоль траектории.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SweptSurface.PathEntity
Свойство <c>PathEntity</c> представляет траекторию вытягивания для данной поверхности.
Returns: Возвращает траекторию операции. Тип <c>Entity</c>.

Teigha.DatabaseServices.SweptSurface.PathLength
Свойство <c>PathLength</c> представляет длину траектории, вытягиванием по которой получен данный объект.
Returns: Возвращает длину траектории. Тип <c>double</c>.

Teigha.DatabaseServices.SweptSurface.ProfileRotation
Свойство <c>ProfileRotation</c> представляет угол поворота профиля.
Returns: Возвращает угол поворота. Тип <c>double</c>.

Teigha.DatabaseServices.SweptSurface.ScaleAlongPath
Свойство <c>ScaleAlongPath</c> представляет масштабный коэффициент, использованный при получении данного объекта при вытягивании по траектории.
Returns: Возвращает масштабный коэффициент. Тип <c>double</c>.

Teigha.DatabaseServices.SweptSurface.SweepEntity
Свойство <c>SweepEntity</c> представляет геометрический объект, использованный для получения данной поверхности вытягиванием по траектории.
Returns: Возвращает геометрический объект для вытягивания по траектории.
Тип <c>Entity</c>.

Teigha.DatabaseServices.SweptSurface.SweepOptions
Свойство <c>SweepOptions</c> представляет комплекс настроек операции вытягивания по траектории.
Returns: Возвращает настройки операции вытягивания по траектории. Тип <c>DatabaseServices.SweepOptions</c>.

Teigha.DatabaseServices.SweptSurface.TwistAlongPath
Свойство <c>TwistAlongPath</c> представляет угол кручения профиля по мере его вытягивания по траектории.
Returns: Возвращает угол кручения. Тип <c>double</c>.