Teigha.Geometry.CircularArc3d
Класс <c>CircularArc3d</c> представляет окружности и круглые дуги в трёхмерном пространстве.

Teigha.Geometry.CircularArc3d.#ctor
Конструктор по умолчанию класса <c>CircularArc3d</c>.
Создает трехмерную единичную окружность в плоскости XY с центром в точке (0,0,0).

Teigha.Geometry.CircularArc3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса <c>CircularArc3d</c>.
Создает круглую дугу по трем точкам.
startPoint: Начальная точка дуги. Тип <c>Point3d</c>.
point: Точка на дуге. Тип <c>Point3d</c>.
endPoint: Конечная точка дуги. Тип <c>Point3d</c>.

Teigha.Geometry.CircularArc3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double)
Конструктор класса <c>CircularArc3d</c>.
Создает окружность с заданными центром, радиусом и вектором нормали плоскости дуги.
center: Центр 3D-окружности.  Тип <c>Point3d</c>.
normal: Вектор нормали плоскости, в которой создается 3D-окружность.  Тип <c>Vector3d</c>.
radius: Радиус 3D-окружности.  Тип <c>double</c>. Радиус не может равняться 0.

Teigha.Geometry.CircularArc3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double)
Конструктор класса <c>CircularArc3d</c>.
Создает в заданной плоскости круглую 3D-дугу с указанными центром, радиусом, начальным и конечным углами.
center: Центр дуги. Тип <c>Point3d</c>.
normal: Вектор нормали плоскости, в которой создается 3D-дуга. Тип <c>Vector3d</c>.
referenceVector: Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла). Тип <c>Vector3d</c>.
radius: Радиус дуги. Тип <c>double</c>. Не может равняться 0.
startAngle: Угол начальной точки дуги. Тип <c>double</c>.
endAngle: Угол конечной точки дуги. Тип <c>double</c>.

Teigha.Geometry.CircularArc3d.ClosestPointToPlane(Teigha.Geometry.PlanarEntity)
Метод позволяет найти на данной дуге точку, ближайшую к указанной плоскости.
plane: Входная плоскость, для которой требуется найти ближайшую точку на дуге. Тип <c>PlanarEntity</c>.
Returns: Возвращает массив из двух ближайших точек, соответственно, на дуге и на плоскости.
Тип <c>Point3d[]</c>.

Teigha.Geometry.CircularArc3d.ClosestPointToPlane(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет найти на данной дуге точку, ближайшую к указанной плоскости в пределах заданной точности.
plane: Входная плоскость, для которой требуется найти ближайшую точку на дуге. Тип <c>PlanarEntity</c>.
tolerance: Точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает массив из двух ближайших точек, соответственно, на дуге и на плоскости.
Тип <c>Point3d[]</c>.

Teigha.Geometry.CircularArc3d.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта <c>CircularArc3d</c> на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, на основе которого создается дуга <c>CircularArc3d</c>. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, указывающий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданную дугу. Тип <c>CircularArc3d</c>.

Teigha.Geometry.CircularArc3d.GetPlane
Метод позволяет найти плоскость, в которой лежит данная дуга.
Returns: Возвращает плоскость, в которой лежит эта дуга. Тип <c>Plane</c>.

Teigha.Geometry.CircularArc3d.GetTangent(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью найти трехмерную линию касательной в указанной точке этой дуги.
pointValue: Входная точка на дуге.  Тип <c>Point3d</c>.
tolerance: Заданная точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает 3D-линию касательной к дуге в заданной точке дуги.
Тип <c>Line3d</c>.

Teigha.Geometry.CircularArc3d.GetTangent(Teigha.Geometry.Point3d)
Метод позволяет найти линию касательной в заданной точке дуги.
pointValue: Входная точка на дуге, в которой требуется вычислить линию касательной.  Тип <c>Point3d</c>.
Returns: Возвращает 3D-линию касательной к дуге в заданной точке дуги.
Тип <c>Line3d</c>.

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.CircularArc3d)
Метод позволяет найти точки пересечения данной дуги с другой 3D-дугой.
arc: Входная трехмерная дуга. Тип <c>CircularArc3d</c>.
Returns: Возвращает массив точек пересечения двух дуг.
Тип <c>Point3d[]</c>.

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.CircularArc3d,Teigha.Geometry.Tolerance)
Метод позволяет найти с заданной точностью точки пересечения данной дуги с другой 3D-дугой.
arc: Входная дуга, точки пересечения с которой требуется найти. Тип <c>CircularArc3d</c>.
tolerance: Заданная точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает массив точек пересечения двух дуг.
Тип <c>Point3d[]</c>.

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод позволяет найти точки пересечения данной дуги с указанной 3D-линией.
line: Входная 3D-линия, точки пересечения с которой требуется найти. Тип <c>LinearEntity3d</c>.
Returns: Возвращает массив точек пересечения дуги и линии.
Тип <c>Point3d[]</c>.

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью найти точки пересечения данной дуги с указанной 3D-линией.
line: Входная 3D-линия, точки пересечения с которой требуется найти. Тип <c>LinearEntity3d</c>.
tolerance: Заданная точность вычислений.  Тип <c>Tolerance</c>.
Returns: Возвращает массив точек пересечения дуги и линии.
Тип <c>Point3d[]</c>.

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.PlanarEntity)
Метод позволяет найти точки пересечения этой дуги с указанной плоскостью.
plane: Плоскость, с которой требуется найти точки пересечения данной дуги. Тип <c>PlanarEntity</c>.
Returns: Возвращает массив точек пересечения дуги и плоскости.
Тип <c>Point3d[]</c>.

Teigha.Geometry.CircularArc3d.IntersectWith(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью найти точки пересечения этой дуги с указанной плоскостью.
plane: Входная плоскость, точки пересечения с которой требуется найти. Тип <c>PlanarEntity</c>.
tolerance: Заданная точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает массив точек пересечения дуги с плоскостью.
Тип <c>Point3d[]</c>.

Teigha.Geometry.CircularArc3d.IsInside(Teigha.Geometry.Point3d)
Метод позволяет определить, лежит ли указанная точка внутри данной дуги.
pointValue: Входная точка. Тип <c>Point3d</c>.
Returns: Возвращает <c>true</c>, если точка <c>pointValue</c> лежит внутри полной окружности данной дуги.
Возвращает значение <c>false</c>, если точка <c>pointValue</c> лежит на окружности или вне её или не лежит в плоскости дуги.

Teigha.Geometry.CircularArc3d.IsInside(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью определить, лежит ли указанная точка внутри данной дуги.
pointValue: Входная точка. Тип <c>Point3d</c>.
tolerance: Заданная точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если точка <c>pointValue</c> лежит внутри полной окружности данной дуги.
Возвращает значение <c>false</c>, если точка <c>pointValue</c> лежит на окружности или за ее пределами или не лежит в плоскости дуги.

Teigha.Geometry.CircularArc3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d)
Метод позволяет найти точки пересечения проекций данной дуги и указанной линии на заданную плоскость.
line: Входная 3D-линия. Тип <c>LinearEntity3d</c>.
projectionDirection: Направление проецирования (нормаль плоскости проекции). Тип <c>Vector3d</c>.
Returns: Возвращает массив точек пересечения проекций дуги и линии на заданную плоскость.
Тип <c>Point3d[]</c>.

Teigha.Geometry.CircularArc3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью найти точки пересечения проекций данной дуги и указанной линии на заданную плоскость.
line: Входная 3D-линия. Тип <c>LinearEntity3d</c>.
projectionDirection: Направление проецирования (нормаль плоскости проецирования). Тип <c>Vector3d</c>.
tolerance: Заданная точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает массив точек пересечения проекций дуги и линии на заданную плоскость.
Тип <c>Point3d[]</c>.

Teigha.Geometry.CircularArc3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет переопределить данную дугу по трем заданным точкам.
startPoint: Начальная точка дуги. Тип <c>Point3d</c>.
pointOnArc: Точка на дуге. Тип <c>Point3d</c>.
endPoint: Конечная точка дуги. Тип <c>Point3d</c>.

Teigha.Geometry.CircularArc3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double)
Метод позволяет переопределить дугу в полную окружность в указанной плоскости с заданными центром и радиусом.
center: Цент окружности. Тип <c>Point3d</c>.
normal: Вектор нормали плоскости, в которой располагается окружность. Тип <c>Vector3d</c>.
radius: Радиус окружности. Тип <c>double</c>. Не может равняться 0.

Teigha.Geometry.CircularArc3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double)
Метод позволяет переопределить все параметры данной дуги - центр, радиус, начальный и конечный углы, плоскость, а также направление отсчета углов.
center: Центр дуги. Тип <c>Point3d</c>.
normal: Вектор нормали плоскости, в которой располагается 3D-дуга. Тип <c>Vector3d</c>.
referenceVector: Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла). Тип <c>Vector3d</c>.
radius: Радиус дуги. Тип <c>double</c>.
startAngle: Угол начальной точки дуги. Тип <c>double</c>.
endAngle: Угол конечной точки дуги. Тип <c>double</c>.

Teigha.Geometry.CircularArc3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,System.Double,System.Double,System.Double)
Метод переопределяет дугу так, чтобы она имела заданный радиус и касалась двух указанных кривых.
curve1: Первая 3D-кривая, задающая условие касательности дуги. Тип <c>Curve3d</c>.
curve2: Вторая 3D-кривая, задающая условие касательности дуги. Тип <c>Curve3d</c>.
radius: Радиус дуги. Тип <c>double</c>.
param1: Возвращает параметр, соответствующий точке касания на кривой <c>curve1</c>.  Тип <c>double</c>.
param2: Возвращает параметр, соответствующий точке касания на кривой <c>curve2</c>.  Тип <c>double</c>.

Teigha.Geometry.CircularArc3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,System.Double,System.Double,System.Double)
Метод позволяет переопределить данную дугу так, чтобы она была касательной к трем указанным 3D-кривым.
curve1: Первая 3D-кривая, задающая условие касательности дуги.  Тип <c>Curve3d</c>.
curve2: Вторая 3D-кривая, задающая условие касательности дуги.  Тип <c>Curve3d</c>.
curve3: Третья 3D-кривая, задающая условие касательности дуги.  Тип <c>Curve3d</c>.
param1: Возвращает параметр, соответствующий точке касания на кривой <c>curve1</c>. Тип <c>double</c>.
param2: Возвращает параметр, соответствующий точке касания на кривой <c>curve2</c>. Тип <c>double</c>.
param3: Возвращает параметр, соответствующий точке касания на кривой <c>curve3</c>. Тип <c>double</c>.

Teigha.Geometry.CircularArc3d.SetAngles(System.Double,System.Double)
Метод позволяет переопределить углы начальной и конечной точек данной дуги.
startAngle: Новое значение начального угла. Тип <c>double</c>.
endAngle: Новое значение конечного угла.  Тип <c>double</c>.

Teigha.Geometry.CircularArc3d.SetAxes(Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить вектор нормали и опорный вектор дуги.
normal: Вектор нормали плоскости, в которой располагается дуга. Тип <c>Vector3d</c>.
referenceVector: Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла). Тип <c>Vector3d</c>.

Teigha.Geometry.CircularArc3d.Center
Свойство <c>Center</c> предоставляет доступ к точке центра дуги.
Returns: Возвращает точку центра дуги. Тип <c>Point3d</c>.

Teigha.Geometry.CircularArc3d.EndAngle
Свойство <c>EndAngle</c> представляет угол конечной точки дуги.
Returns: Возвращает угол конечной точки дуги. Тип <c>double</c>.

Teigha.Geometry.CircularArc3d.EndPoint
Свойство <c>EndPoint</c> представляет конечную точку дуги.
Returns: Возвращает конечную точку дуги.
Тип <c>Point3d</c>.

Teigha.Geometry.CircularArc3d.Normal
Свойство <c>Normal</c> представляет вектор нормали плоскости дуги.
Returns: Возвращает вектор нормали плоскости дуги.
Тип <c>Vector3d</c>.

Teigha.Geometry.CircularArc3d.Radius
Свойство <c>Radius</c> предоставляет доступ к значению радиуса дуги.
Returns: Возвращает радиус дуги.
Тип <c>double</c>.

Teigha.Geometry.CircularArc3d.ReferenceVector
Свойство <c>ReferenceVector</c> представляет опорный вектор отсчета углов дуги.
Returns: Возвращает опорный вектор дуги. Тип <c>Vector3d</c>.

Teigha.Geometry.CircularArc3d.StartAngle
Свойство <c>StartAngle</c> представляет угол начальной точки дуги.
Returns: Возвращает угол начальной точки дуги.
Тип <c>double</c>.

Teigha.Geometry.CircularArc3d.StartPoint
Свойство <c>StartPoint</c> представляет начальную точку дуги.
Returns: Возвращает начальную точку дуги.
Тип <c>Point3d</c>.