Teigha.DatabaseServices.Shape
Класс <c>Shape</c> представляет объекты <c>Shape</c> в базе данных nanoCAD.

Teigha.DatabaseServices.Shape.#ctor
Конструктор по умолчанию класса <c>Shape</c>.

Teigha.DatabaseServices.Shape.#ctor(Teigha.Geometry.Point3d,System.Double,System.Double,System.Double)
Конструктор класса <c>Shape</c>. Создает экземпляр класса с указанными параметрами.
position: Координатная точка привязки данного объекта <c>Shape</c>. Тип <c>Point3d</c>.
size: Высота объекта <c>Shape</c>. Тип <c>double</c>.
rotation: Угол поворота объекта <c>Shape</c> (в радианах). Тип <c>double</c>.
widthFactor: Относительный коэффициент ширины объекта <c>Shape</c>. Тип <c>double</c>.

Teigha.DatabaseServices.Shape.Name
Свойство <c>Name</c> представляет имя данного объекта.
Returns: Возвращает имя объекта. Тип <c>String</c>.

Teigha.DatabaseServices.Shape.Normal
Свойство <c>Normal</c> представляет нормаль плоскости, в которой располагается данный объект.
Returns: Возвращает вектор нормали плоскости в мировой системе координат (WCS). Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Shape.Oblique
Свойство <c>Oblique</c> представляет угол наклона данного объекта в интервале [-85 .. +85] градусов.
Returns: Возвращает угол наклона объекта в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.Shape.Position
Свойство <c>Position</c> представляет координатную точку привязки данного объекта.
Returns: Возвращает точку привязки объекта. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Shape.Rotation
Свойство <c>Rotation</c> представляет угол поворота данного объекта в своей плоскости.
Returns: Возвращает угол поворота объекта в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.Shape.ShapeIndex
Свойство <c>ShapeIndex</c> представляет идентификатор объекта записи в таблице символов шрифта, содержащей шрифт SHX данного объекта.
Returns: Возвращает идентификатор объекта записи в таблице символов шрифта. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Shape.ShapeNumber
Свойство <c>ShapeNumber</c> представляет номер данного объекта в файле SHX.
Returns: Возвращает код данного символа в файле SHX.  Тип <c>short</c>.

Teigha.DatabaseServices.Shape.Size
Свойство <c>Size</c> представляет высоту данного объекта.
Returns: Возвращает высоту данного объекта. Тип <c>double</c>.

Teigha.DatabaseServices.Shape.StyleId
Свойство <c>StyleId</c> представляет идентификатор объекта записи в таблице символов шрифта, содержащей шрифт SHX данного объекта.
Returns: Возвращает идентификатор объекта записи в таблице символов шрифта.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Shape.Thickness
Свойство <c>Thickness</c> представляет толщину данного объекта как глубину выдавливания по нормали к плоскости объекта.
Returns: Возвращает толщину данного объекта. Тип <c>double</c>.

Teigha.DatabaseServices.Shape.WidthFactor
Свойство <c>WidthFactor</c> представляет коэффициент ширины данного объекта, т.е. относительный масштабный коэффициент по ширине <c>X</c>.
Returns: Возвращает коэффициент ширины. Тип <c>double</c>.