Teigha.BoundaryRepresentation.EdgeLoopEnumerator
Класс <c>EdgeLoopEnumerator</c> представляет перечислитель циклов, связанных с ребром BREP.

Teigha.BoundaryRepresentation.EdgeLoopEnumerator.Current
Свойство <c>Current</c> представляет текущий элемент данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип <c>BoundaryLoop</c>.