HostMgd.EditorInput.PromptPointOptions
Класс, представляющий необязательные параметры приглашения
для ввода точки.

HostMgd.EditorInput.PromptPointOptions.#ctor(String)
Конструктор.
message: Входное сообщение

HostMgd.EditorInput.PromptPointOptions.#ctor(String,String)
Конструктор.
messageAndKeywords: Приглашение и отображаемые ключевые
globalKeywords: Ключевые слова (глобальные имена)

HostMgd.EditorInput.PromptPointOptions.UseBasePoint
Возвращает и выставляет признак того, будет ли использоваться
базовая точка.