Teigha.BoundaryRepresentation.Brep
Класс <c>Brep</c> представляет собой интерфейсный класс для BREP-описания геометрии объекта в базе данных nanoCAD.

Teigha.BoundaryRepresentation.Brep.#ctor(Teigha.DatabaseServices.FullSubentityPath)
Конструктор класса <c>Brep</c>. Создает экземпляр класса, используя указанный путь к подобъекту.
fullPath: Полный путь, используемый для создания описания B-Rep.  Тип <c>FullSubentityPath</c>.

Teigha.BoundaryRepresentation.Brep.#ctor(Teigha.BoundaryRepresentation.Brep)
Конструктор класса <c>Brep</c>. Создает экземпляр класса как копию указанного объекта <c>Brep</c>.
br: Входной объект типа <c>Brep</c>, копию которого требуется создать.

Teigha.BoundaryRepresentation.Brep.#ctor(Teigha.DatabaseServices.Entity)
Конструктор класса <c>Brep</c>. Создает экземпляр класса, используя указанный объект чертежа.
ent: Входной объект для создания нового экземпляра класса.  Тип <c>Entity</c>.

Teigha.BoundaryRepresentation.Brep.GetComplexsStartingFrom(Teigha.BoundaryRepresentation.Complex)
Метод предназначен для извлечения коллекции комплексов B-Rep.
startFrom: Входной комплекс, начиная с которого формируется выходная коллекция комплексов B-Rep.
Returns: Возвращает коллекцию комплексов B-Rep.
Тип <c>BrepComplexCollection</c>.

Teigha.BoundaryRepresentation.Brep.GetEdgesStartingFrom(Teigha.BoundaryRepresentation.Edge)
Метод предназначен для извлечения коллекции рёбер.
startFrom: Входное ребро, начиная с которого формируется коллекция рёбер.
Returns: Возвращает коллекцию рёбер.  Тип <c>BrepEdgeCollection</c>.

Teigha.BoundaryRepresentation.Brep.GetFacesStartingFrom(Teigha.BoundaryRepresentation.Face)
Метод предназначен для извлечения коллекции граней.
startFrom: Входная грань, начиная с которой формируется коллекция граней.  Тип <c>Face</c>.
Returns: Возвращает коллекцию граней.  Тип <c>BrepFaceCollection</c>.

Teigha.BoundaryRepresentation.Brep.GetShellsStartingFrom(Teigha.BoundaryRepresentation.Shell)
Метод предназначен для извлечения коллекции оболочек.
startFrom: Оболочка, начиная с которой формируется коллекция оболочек.  Тип <c>Shell</c>.
Returns: Возвращает коллекцию оболочек.  Тип <c>BrepShellCollection</c>.

Teigha.BoundaryRepresentation.Brep.GetVerticesStartingFrom(Teigha.BoundaryRepresentation.Vertex)
Метод предназначен для извлечения коллекции вершин.
startFrom: Вершина, начиная с которой формируется коллекция вершин.  Тип <c>Vertex</c>.
Returns: Возвращает коллекцию вершин.  Тип <c>BrepVertexCollection</c>.

Teigha.BoundaryRepresentation.Brep.HasTransformation([Out]Matrix3d%)
Метод позволяет проверить, имеет ли данный объект <c>Brep</c> не единичную матрицу преобразования.
matrix: Матрица геометрического преобразования.  Тип <c>Matrix3d</c>.
Returns: Возвращает <c>true</c>, если матрица есть, и она не единичная.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.Brep.Complexes
Свойство <c>Complexes</c> представляет коллекцию всех комплексов, связанных с данным объектом.
Returns: Возвращает коллекцию комплексов.  Тип <c>BrepComplexCollection</c>.

Teigha.BoundaryRepresentation.Brep.Edges
Свойство <c>Edges</c> представляет коллекцию всех рёбер, связанных с данным объектом.
Returns: Возвращает коллекцию рёбер.  Тип <c>BrepEdgeCollection</c>.

Teigha.BoundaryRepresentation.Brep.Faces
Свойство <c>Faces</c> представляет коллекцию всех граней, связанных с данным объектом.
Returns: Возвращает коллекцию граней.  Тип <c>BrepFaceCollection</c>.

Teigha.BoundaryRepresentation.Brep.Shells
Свойство <c>Shells</c> представляет коллекцию всех оболочек, связанных с данным объектом.
Returns: Возвращает коллекцию всех оболочек.  Тип <c>BrepShellCollection</c>.

Teigha.BoundaryRepresentation.Brep.Solid
Свойство <c>Solid</c> представляет твердое тело, связанное с данным объектом.
Returns: Возвращает твердое тело.  Тип <c>Teigha.DatabaseServices.Solid3d</c>.

Teigha.BoundaryRepresentation.Brep.Surf
Свойство <c>Surf</c> представляет поверхность, связанную с данным объектом.
Returns: Возвращает связанную с данным объектом поверхность.  Тип <c>Teigha.DatabaseServices.Surface</c>.

Teigha.BoundaryRepresentation.Brep.Vertices
Свойство <c>Vertices</c> представляет коллекцию всех вершин, связанных с данным объектом.
Returns: Возвращает коллекцию всех вершин.  Тип <c>BrepVertexCollection</c>.