Teigha.Colors.Transparency
Класс реализует объекты, которые представляют информацию о прозрачности объектов Drawable.

Teigha.Colors.Transparency.#ctor(Teigha.Colors.TransparencyMethod)
Конструктор создает новый экземпляр Transparency, используя входной объект TransparencyMethod.
method: Входной объект для копирования.  Тип TransparencyMethod.

Teigha.Colors.Transparency.#ctor(unsigned char)
Конструктор создает новый экземпляр Transparency с использованием входного символа.
alpha: Входной символ. Тип unsigned char.

Teigha.Colors.Transparency.Equals(Object)
Метод проверяет идентичность объектов Transparency.
obj: Объект, проверяемый на идентичность. Тип Object.
Returns: Возвращает <c>true</c>, если данный объект идентичен объекту <c>obj</c>.
В противном случае возвращает <c>false</c>.

Teigha.Colors.Transparency.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Returns: Возвращает хеш-код объекта. Тип <c>int</c>.

Teigha.Colors.Transparency.ToString
Метод формирует строковое представление данного объекта.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.Colors.Transparency.ToString(IFormatProvider)
Метод формирует строковое представление данного объекта с учетом языковых и региональных настроек.
provider: Провайдер формата региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки. Тип String.

Teigha.Colors.Transparency.Alpha
Свойство предоставляет альфа-значение данного объекта Transparency.
Returns: Возвращает альфа-значение. Тип Byte.
0 - полная прозрачность, 255 - полная непрозрачность.

Teigha.Colors.Transparency.IsByAlpha
Свойство позволяет проверить, что методом задания прозрачности является ByAlpha.
Returns: Возвращает <c>true</c>, если метод задания прозрачности - <c>ByAlpha</c>. В противном случае возвращает <c>false</c>.

Teigha.Colors.Transparency.IsByBlock
Свойство позволяет проверить, что методом задания прозрачности является ByBlock.
Returns: Возвращает <c>true</c>, если используется метод задания прозрачности <c>ByBlock</c>. В противном случае возвращает <c>false</c>.

Teigha.Colors.Transparency.IsByLayer
Свойство позволяет проверить, что методом задания прозрачности является ByLayer.
Returns: Возвращает <c>true</c>, если используется метод задания прозрачности <c>ByLayer</c>. В противном случае возвращает <c>false</c>.

Teigha.Colors.Transparency.IsClear
Свойство позволяет проверить, что для данного объекта Transparency методом задания прозрачности является ByALpha, и значение альфа равно нулю, что соответствует совершенно прозрачному состоянию.
Returns: Возвращает <c>true</c>, если для задания прозрачности используется метод <c>ByALpha</c>, и значение альфа равно нулю.
В противном случае возвращает <c>false</c>.

Teigha.Colors.Transparency.IsSolid
Свойство позволяет проверить, что для данного объекта Transparency методом задания прозрачности является ByALpha, и значение альфа равно 255, что соответствует совершенно непрозрачному состоянию.
Returns: Возвращает <c>true</c>, если для задания прозрачности используется метод <c>ByALpha</c>, а значение альфа равно 255.
В противном случае возвращает <c>false</c>.