Teigha.DatabaseServices.OsnapOverrule
Этот класс переопределяет подмножество операций объектной привязки, которые специфичны для объекта чертежа.

Teigha.DatabaseServices.OsnapOverrule.GetObjectSnapPoints(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.ObjectSnapModes,IntPtr,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Matrix3d,Teigha.Geometry.Point3dCollection,Teigha.Geometry.IntegerCollection)
Метод предназначен для получения точек объектной привязки.
entity: Объект чертежа, тип Entity.
snapMode: Требуемый режим объектной привязки, тип ObjectSnapModes.
gsSelectionMark: Маркер GS подсущности, участвующей в операции объектной привязки, тип  IntPtr.
pickPoint: Координаты в мировой системе координат (WCS) точки, указанной в ходе операции объектной привязки, тип Point3d.
lastPoint: Координаты WCS точки, выбранной непосредственно перед pickPoint, тип Point3d.
viewTransform: Матрица преобразования из WCS в систему координат видового экрана, тип Matrix3d.
snapPoints: Существующий массив для добавления точек привязки, тип Point3dCollection.
geometryIds: Аргумент зарезервирован для будущего использования.

Teigha.DatabaseServices.OsnapOverrule.GetObjectSnapPoints(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.ObjectSnapModes,IntPtr,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Matrix3d,Teigha.Geometry.Point3dCollection,Teigha.Geometry.IntegerCollection,Teigha.Geometry.Matrix3d)
Метод предназначен для получения точек объектной привязки.
entity: Объект чертежа, тип Entity.
snapMode: Требуемый режим объектной привязки, тип ObjectSnapModes.
gsSelectionMark: Маркер GS подсущности, участвующей в операции объектной привязки, тип  IntPtr.
pickPoint: Координаты в мировой системе координат (WCS) точки, указанной в ходе операции объектной привязки, тип Point3d.
lastPoint: Координаты WCS точки, выбранной непосредственно перед pickPoint, тип Point3d.
viewTransform: Матрица преобразования из WCS в систему координат видового экрана, тип Matrix3d.
snapPoints: Существующий массив для добавления точек привязки, тип Point3dCollection.
geometryIds: Аргумент зарезервирован для будущего использования.
insertionMat: Матрица преобразования для блока, тип Matrix3d.

Teigha.DatabaseServices.OsnapOverrule.SetCustomFilter
Этот метод включает использование метода IsApplicable, чтобы определять применимость объектного переопределения.

Teigha.DatabaseServices.OsnapOverrule.IsContentSnappable(Teigha.DatabaseServices.Entity)
Метод позволяет выяснить, определена ли объектная привязка для объекта чертежа.
entity: Объект чертежа, тип Entity.
Returns: Возвращает true, если объектная привязка возможна, и false в противном случае.

Teigha.DatabaseServices.OsnapOverrule.SetExtensionDictionaryEntryFilter(String)
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
entryName: Имя записи в словаре расширений, тип String.

Teigha.DatabaseServices.OsnapOverrule.SetIdFilter(array&lt;ObjectId&gt;)
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
ids: Массив идентификаторов ObjectId. Тип ObjectId[].

Teigha.DatabaseServices.OsnapOverrule.SetNoFilter
Метод отключает все методы предварительной фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метод IsApplicable, перед применением объектных переопределений.

Teigha.DatabaseServices.OsnapOverrule.SetXDataFilter(String)
Метод позволяет использовать расширенные данные в условии применимости объектного переопределения.
registeredApplicationName: Имя зарегистрированного приложения, тип String.