Teigha.Geometry.NurbCurve2dFitData.Equals(Object)
Метод предназначен для проверки равенства указанного объекта данному объекту.
obj: Входной объект, который проверяется на равенство данному объекту.
Returns: Возвращает <c>true</c>, если объект <c>obj</c> равен данному объекту.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2dFitData.GetHashCode
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает хеш-код объекта.
Тип <c>int</c>.

Teigha.Geometry.NurbCurve2dFitData.IsEqualTo(Teigha.Geometry.NurbCurve2dFitData)
Проверяет, равны ли интерполяционные данные данной NURBS кривой и указанной NURBS кривой.
a: Проверяемый на равенство объект. Тип <c>NurbCurve2dFitData</c>.
Returns: Возвращает <c>true</c>, если сравниваемые объекты можно считать равными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2dFitData.Degree
Свойство <c>Degree</c> представляет степень NURBS кривой.
Returns: Возвращает степень NURBS кривой. Тип <c>int</c>.

Teigha.Geometry.NurbCurve2dFitData.EndTangent
Свойство <c>EndTangent</c> представляет направление касательной в конечной точке кривой.
Returns: Возвращает касательный вектор в последней точке кривой. Тип <c>Vector2d</c>.

Teigha.Geometry.NurbCurve2dFitData.FitPoints
Свойство <c>FitPoints</c> представляет массив определяющих точек кривой.
Returns: Возвращает массив определяющих точек кривой. Тип <c>Point2dCollection</c>.

Teigha.Geometry.NurbCurve2dFitData.FitTolerance
Свойство <c>FitTolerance</c> представляет заданную точность интерполяции.
Returns: Возвращает точность интерполяции. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve2dFitData.KnotParam
Свойство <c>KnotParam</c> представляет метод узловой параметризации кривой.
Returns: Возвращает метод узловой параметризации кривой. Тип <c>KnotParameterizationEnum</c>.

Teigha.Geometry.NurbCurve2dFitData.StartTangent
Свойство <c>StartTangent</c> представляет направление касательной в начальной точке кривой.
Returns: Возвращает касательный вектор в начальной точке кривой.
Тип <c>Vector2d</c>.

Teigha.Geometry.NurbCurve2dFitData.TangentsExist
Свойство <c>TangentsExist</c> позволяет проверить, заданы ли касательные векторы на концах кривой.
Returns: Возвращает <c>true</c>, если касательные векторы на концах кривой заданы.
В противном случае возвращает <c>false</c>.