Teigha.DatabaseServices.XrefRedirectedEventArgs
Класс <c>XrefRedirectedEventArgs</c> представляет данные для события <c>XrefRedirected</c> базы данных.

Teigha.DatabaseServices.XrefRedirectedEventArgs.NewId
Свойство <c>NewId</c> представляет идентификатор объекта записи таблицы символов, на которую перенаправляется запись таблицы символов внешней ссылки.
Returns: Возвращает идентификатор объекта записи таблицы символов.
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.XrefRedirectedEventArgs.OldId
Свойство <c>OldId</c> представляет идентификатор объекта записи таблицы символов внешней ссылки, к которой в данный момент применяется перенаправление.
Returns: Возвращает идентификатор объекта записи таблицы символов.
Тип <c>ObjectId</c>.