Teigha.DatabaseServices.ArcDimension
Данный класс представляет размер длины дуги.

Teigha.DatabaseServices.ArcDimension.#ctor(IntPtr,System.Boolean)
Конструктор.
unmanagedObjPtr: Указатель на объект. Тип IntPtr.
autoDelete: Флаг автоудаления, тип bool.

Teigha.DatabaseServices.ArcDimension.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,String,DatabaseServices.ObjectId)
Основной конструктор.
centerPoint: Центр дуги. Тип Point3d.
xLine1Point: Начальная точка первой выносной линии. Тип Point3d.
xLine2Point: Начальная точка второй выносной линии. Тип Point3d.
arcPoint: Точка, лежащая на размерной дуге. Тип Point3d.
dimensionText: Текст, заменяющий текстовое представление измеренного значения. Тип String.
dimensionStyle: ObjectId размерного стиля, который используется для отображения данного углового размера. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.ArcDimension.ArcEndParam
Свойство предоставляет доступ к параметру конечной точки дуги размера.
Returns: Возвращает значение параметра. Тип double.

Teigha.DatabaseServices.ArcDimension.ArcStartParam
Свойство предоставляет доступ к параметру начальной точки дуги размера.
Returns: Возвращает значение параметра. Тип double.

Teigha.DatabaseServices.ArcDimension.ArcSymbolType
Свойство предоставляет доступ к типу символа дуги в размерном тексте размера.
Returns: Возвращает код символа дуги, int.

Teigha.DatabaseServices.ArcDimension.HasLeader
Свойство определяет, имеет ли размер дополнительную выноску, отображаемую для устранения неоднозначности.
Returns: Возвращает логическое значение, тип bool.

Teigha.DatabaseServices.ArcDimension.IsPartial
Свойство определяет, является ли размер длины дуги частичным.
Returns: Возвращает true, если размер длины дуги является частичным, иначе - false.

Teigha.DatabaseServices.ArcDimension.arcPoint
Свойство предоставляет доступ к точке, через которую проходит размерная дуга.
Returns: Возвращает точку, тип Point3d.

Teigha.DatabaseServices.ArcDimension.centerPoint
Свойство предоставляет доступ к точке центра дуги, длину которой определяет данный размер.
Returns: Возвращает точку, тип Point3d.

Teigha.DatabaseServices.ArcDimension.leader1Point
Свойство предоставляет доступ к начальной точке дополнительной выноски размера длины дуги, если выноска отображается.
Returns: Возвращает точку, тип Point3d.

Teigha.DatabaseServices.ArcDimension.leader2Point
Свойство предоставляет доступ к конечной точке дополнительной выноски размера длины дуги, если выноска отображается.
Returns: Возвращает точку, тип Point3d.

Teigha.DatabaseServices.ArcDimension.xLine1Point
Свойство предоставляет доступ к начальной точке первой выносной линии.
Returns: Возвращает точку, тип Point3d.

Teigha.DatabaseServices.ArcDimension.xLine2Point
Свойство предоставляет доступ к начальной точке второй выносной линии.
Returns: Возвращает точку, тип Point3d.