Teigha.DatabaseServices.LoftOptions
Класс представляет параметры лофта - операции вытягивания поверхности по сечениям, используемые для создания как поверхностных, так и твердых тел.  Параметры лофта используются для управления геометрией получаемой поверхности.

Teigha.DatabaseServices.LoftOptions.#ctor
Конструктор по умолчанию класса LoftOptions.

Teigha.DatabaseServices.LoftOptions.#ctor(Teigha.DatabaseServices.LoftOptions)
Конструктор класса LoftOptions. Создает новый объект <c>LoftOptions</c>, воспроизводя заданные параметры операции.
opts: Входной объект с параметрами операции лофта. Тип <c>LoftOptions</c>.

Teigha.DatabaseServices.LoftOptions.CheckCrossSectionCurves(array&lt;Entity&gt;,System.Boolean)
Метод позволяет проверить, допустимы ли кривые поперечных сечений для выполнения операции лофта.
crossSectionCurves: Массив кривых поперечных сечений. Тип <c>Entity[]</c>.
displayErrorMessages: Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип <c>bool</c>. Значение по умолчанию - <c>false</c>.
Returns: Возвращает объект типа <c>LoftOptionsCheckCurvesOut</c>, свойства которого предоставляют следующие данные:
* Если свойство <c>AllOpen</c>   равно <c>true</c>, то все поперечные сечения являются разомкнутыми.
* Если свойство <c>AllClosed</c> равно <c>true</c>, то все поперечные сечения являются замкнутыми.
* Если свойство <c>AllPlanar</c> равно <c>true</c>, то все поперечные сечения являются плоскими.

Teigha.DatabaseServices.LoftOptions.CheckGuideCurves(array&lt;Entity&gt;,System.Boolean)
Метод позволяет проверить, допустимы ли указанные направляющие для операции лофта.
guideCurves: Массив кривых, используемых в качестве направляющих в операции лофта. Тип <c>Entity[]</c>.
displayErrorMessages: Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип <c>bool</c>. Значение по умолчанию - <c>false</c>.

Teigha.DatabaseServices.LoftOptions.CheckLoftCurves(array&lt;Entity&gt;,array&lt;Entity&gt;,Teigha.DatabaseServices.Entity,System.Boolean)
Метод позволяет проверить, допустимо ли сочетание указанных поперечных сечений с траекторией вытягивания, либо массивом направляющих, для успешного выполнения операции лофта.
crossSectionCurves: Массив кривых поперечных сечений. Тип <c>Entity[]</c>.
guideCurves: Массив направляющих.  Тип <c>Entity[]</c>.
pPathCurve: Траектория вытягивания. Тип <c>Entity</c>.
displayErrorMessages: Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип <c>bool</c>. Значение по умолчанию - <c>false</c>.
Returns: Возвращает объект типа <c>LoftOptionsCheckCurvesOut</c>, свойства которого предоставляют следующие данные:
* Если свойство <c>AllOpen</c>   равно <c>true</c>, то все поперечные сечения являются разомкнутыми.
* Если свойство <c>AllClosed</c> равно <c>true</c>, то все поперечные сечения являются замкнутыми.
* Если свойство <c>AllPlanar</c> равно <c>true</c>, то все поперечные сечения являются плоскими.

Teigha.DatabaseServices.LoftOptions.CheckPathCurve(Teigha.DatabaseServices.Entity,System.Boolean)
Метод позволяет проверить, допустима ли указанная траектория для успешного выполнения данной операции лофта.
pathCurve: Кривая траектории для вытягивания по сечениям. Тип <c>Entity</c>.
displayErrorMessages: Флаг, определяющий, требуется ли отображать сообщения об ошибках. Тип <c>bool</c>. Значение по умолчанию - <c>false</c>.

Teigha.DatabaseServices.LoftOptions.Clone
Метод предназначен для клонирования данного объекта <c>LoftOptions</c>.
Returns: Возвращает клон данного объекта. Тип <c>Object</c>.

Teigha.DatabaseServices.LoftOptions.AlignDirection
Свойство позволяет проверить состояние флага-индикатора "правильной" взаимной ориентации нормалей заданных поперечных сечений.
Returns: Возвращает <c>true</c>, если взаимная ориентация поперечных сечений является корректной.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptions.ArcLengthParam
Свойство позволяет проверить, применяется ли параметризация по длине дуги.
Returns: Возвращает <c>true</c>, если параметризация применяется.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptions.Closed
Свойство позволяет проверить состояние флага замкнутости получаемой поверхности.
Returns: Возвращает <c>true</c>, если результирующая поверхность является замкнутой.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptions.DraftEnd
Свойство возвращает угол в радианах, под которым результирующая поверхность входит в последнее поперечное сечение (end draft angle, угол входа поверхности в сечение).
Returns: Возвращает угол сопряжения поверхности с последним поперечным сечением (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.LoftOptions.DraftEndMag
Свойство возвращает величину вытягивания для поверхности у последнего поперечного сечения (end draft magnitude).
Returns: Возвращает величину вытягивания. Тип <c>double</c>.

Teigha.DatabaseServices.LoftOptions.DraftStart
Свойство возвращает угол в радианах, под которым результирующая поверхность вытягивается из первого поперечного сечения (start draft angle, угол выхода поверхности из сечения).
Returns: Возвращает угол сопряжения поверхности с первым поперечным сечением (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.LoftOptions.DraftStartMag
Свойство возвращает величину вытягивания поверхности из первого поперечного сечения (start draft magnitude).
Returns: Возвращает величину вытягивания поверхности из первого поперечного сечения. Тип <c>double</c>.

Teigha.DatabaseServices.LoftOptions.NormalOption
Свойство возвращает настройку для нормали к плоскости в данном объекте.
Returns: Возвращает значение из перечисления <c>LoftOptionsNormalOption</c>.

Teigha.DatabaseServices.LoftOptions.NoTwist
Свойство возвращает значение опции <c>noTwist</c> (нет кручения).
Returns: Возвращает <c>true</c>, если установлена опция "нет кручения".
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptions.Ruled
Свойство возвращает состояние флага <c>ruled</c> (кусочно-линейная поверхность).
Returns: Возвращает <c>true</c>, если строится кусочно-линейная поверхность.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptions.Simplify
Свойство возвращает состояние флага <c>simplify</c> (упрощение), который определяет возможность использования простых типов поверхностей вместо общего там, где это возможно.
Returns: Возвращает <c>true</c>, если предписывается использовать простые типы поверхностей.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptions.VirtualGuide
Свойство позволяет определить, используется ли при создании лофт-поверхностей опция <c>virtual guide</c> (виртуальная направляющая).
Returns: Возвращает <c>true</c>, если опция <c>virtual guide</c> используется.
В противном случае возвращает <c>false</c>.