Teigha.DatabaseServices.MText
Данный класс представляет объекты типа <c>MText</c> в базе данных nanoCAD.

Teigha.DatabaseServices.MText.#ctor
Конструктор по умолчанию класса <c>MText</c>.

Teigha.DatabaseServices.MText.ConvertFieldToText
Метод позволяет преобразовать существующие в данном объекта MText поля в обычный текст с последующим удалением полей.

Teigha.DatabaseServices.MText.CorrectSpelling
Метод предназначен для проверки орфографии с целью исправления орфографических ошибок.
В текущей версии не реализован.
Returns: Возвращает 0 в случае успешного завершения. В противном случае возвращает 1.
Тип <c>int</c>.

Teigha.DatabaseServices.MText.ExplodeFragments(Teigha.DatabaseServices.MTextFragmentCallback)
Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции.
enumerator: Функция обработки текстовых фрагментов. Тип <c>MTextFragmentCallback</c>.

Teigha.DatabaseServices.MText.ExplodeFragments(Teigha.DatabaseServices.MTextFragmentCallback,Object)
Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции. Дополнительно метод принимает пользовательские данные, которые позволяют учесть специфику приложения при обработке фрагментов.
enumerator: Функция обработки текстовых фрагментов. Тип <c>MTextFragmentCallback</c>.
userData: Произвольные пользовательские данные. Тип <c>Object</c>.

Teigha.DatabaseServices.MText.ExplodeFragments(Teigha.DatabaseServices.MTextFragmentCallback,Object,GraphicsInterface.WorldDraw)
Метод предназначен для разбиения данного многострочного текста на простые текстовые фрагменты, каждый из которых передается на обработку указанной функции. Дополнительно метод принимает пользовательские данные, которые позволяют учесть специфику приложения при обработке фрагментов, а также контекст отрисовки объектов.
enumerator: Функция обработки текстовых фрагментов. Тип <c>MTextFragmentCallback</c>.
userData: Произвольные пользовательские данные. Тип <c>Object</c>.
context: Контекст отрисовки объектов. Тип <c>GraphicsInterface.WorldDraw</c>.

Teigha.DatabaseServices.MText.GetBoundingPoints
Метод возвращает граничные угловые точки WCS области текста данного объекта <c>MText</c>.
Returns: Возвращает коллекцию граничных угловых точек области текста данного объекта.
Тип <c>Geometry.Point3dCollection</c>.

Teigha.DatabaseServices.MText.GetColumnHeight(System.Int32)
Метод предоставляет высоту указанного столбца данного объекта.
index: Индекс столбца. Тип <c>int</c>.
Returns: Возвращает высоту столбца. Тип <c>double</c>.

Teigha.DatabaseServices.MText.getMTextWithFieldCodes
Метод позволяет преобразовать многострочный текст в строку, в которой поля представлены своими кодами.
Returns: Возвращает строку, в которой автоматические поля представлены своими кодами.
Тип <c>String</c>.

Teigha.DatabaseServices.MText.SetAttachmentMovingLocation(Teigha.DatabaseServices.AttachmentPoint)
Метод позволяет задать тип точки присоединения данного объекта <c>MText</c>.
value: Тип точки присоединения текста. Перечисление <c>AttachmentPoint</c>.

Teigha.DatabaseServices.MText.SetColumnHeight(System.Int32,System.Double)
Метод позволяет задать высоту столбца многострочного текста <c>MText</c>.
index: Индекс столбца. Тип <c>int</c>.
height: Новая высота указанного столбца. Тип <c>double</c>.

Teigha.DatabaseServices.MText.SetContentsRtf(String)
Метод позволяет сформировать многострочный текст объекта <c>MText</c> на основе текстовой строки в формате RTF.
value: Новый текст в формате RTF. Тип <c>String</c>.
Returns: Возвращает длину текстовой строки, полученной в результате преобразования из формата RTF. Тип <c>int</c>.

Teigha.DatabaseServices.MText.SetDynamicColumns(System.Double,System.Double,System.Boolean)
Метод задает столбцу (колонке текста) тип <c>DynamicColumns</c> с заданными шириной, просветом между столбцами и значением флага автоподбора высоты столбца.
width: Ширина столбца. Тип <c>double</c>.
gutter: Расстояние между столбцами текста (column gutter). Тип <c>double</c>.
auto_height: Флаг автоподбора высоты столбцов.  Тип <c>bool</c>. Значение <c>true</c> включает режим автоматического подбора высоты столбца.

Teigha.DatabaseServices.MText.SetStaticColumns(System.Double,System.Double,System.Int32)
Метод задает столбцу (колонке текста) тип <c>StaticColumns</c> с заданными шириной, просветом между столбцами и количеством столбцов.
width: Ширина столбца. Тип <c>double</c>.
gutter: Расстояние между столбцами текста (column gutter). Тип <c>double</c>.
count: Количество столбцов (колонок) текста. Тип <c>int</c>.

Teigha.DatabaseServices.MText.ActualHeight
Свойство возвращает фактическую высоту данного объекта MText (зависит от содержимого).
Returns: Возвращает фактическую высоту многострочного текста. Тип <c>double</c>.

Teigha.DatabaseServices.MText.ActualWidth
Свойство возвращает фактическую ширину габаритного бокса для данного объекта MText (зависит от содержимого).
Returns: Возвращает фактическую ширину габаритного бокса данного объекта. Тип <c>double</c>.

Teigha.DatabaseServices.MText.AlignChange
Свойство представляет строку изменения выравнивания "\A".
Returns: Возвращает строку изменения выравнивания. Тип <c>String</c>.

Teigha.DatabaseServices.MText.Ascent
Свойство возвращает высоту максимального верхнего выносного элемента для строчных букв первой строки этого объекта <c>MText</c>.
Returns: Возвращает высоту максимального выносного элемента. Тип <c>double</c>.

Teigha.DatabaseServices.MText.Attachment
Свойство представляет тип точки присоединения этого объекта <c>MText</c>.
Returns: Возвращает тип точки присоединения. Перечисление <c>AttachmentPoint</c>.

Teigha.DatabaseServices.MText.BackgroundFill
Свойство позволяет включить или отключить фоновую заливку для данного объекта <c>MText</c>.
Returns: Возвращает <c>true</c>, если фоновая заливка включена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MText.BackgroundFillColor
Свойство представляет  цвет фоновой заливки данного объекта <c>MText</c>.
Returns: Возвращает цвет фоновой заливки. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.MText.BackgroundScaleFactor
Свойство представляет масштабный коэффициент для фона данного объекта <c>MText</c>.
Returns: Возвращает масштабный коэффициент. Тип <c>double</c>.

Teigha.DatabaseServices.MText.BackgroundTransparency
Свойство представляет прозрачность фона данного объекта <c>MText</c>.
Returns: Возвращает прозрачность фона. Тип <c>Teigha.Colors.Transparency</c>.

Teigha.DatabaseServices.MText.BlockBegin
Свойство представляет строку начала блока "{".
Returns: Возвращает строку начала блока. Тип <c>String</c>.

Teigha.DatabaseServices.MText.BlockEnd
Свойство представляет строку окончания блока "}".
Returns: Возвращает строку окончания блока. Тип <c>String</c>.

Teigha.DatabaseServices.MText.ColorChange
Свойство возвращает строку изменения цвета "\C".
Returns: Возвращает строку изменения цвета.  Тип <c>String</c>.

Teigha.DatabaseServices.MText.ColumnAutoHeight
Свойство определяет, должны ли динамические столбцы использовать высоту <c>MText</c> или высоту, заданную пользователем для каждого столбца (каждой колонки текста).
Returns: Возвращает <c>true</c>, если динамические столбцы настроены на автоматическое использование высоты объекта <c>MText</c>.  В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MText.ColumnCount
Свойство представляет количество столбцов (текстовых колонок) у данного объекта <c>MText</c>.
Returns: Возвращает количество столбцов. Тип <c>int</c>.

Teigha.DatabaseServices.MText.ColumnFlowReversed
Свойство определяет, является ли поток столбцов данного объекта <c>MText</c> обратным.
Эта настройка влияет на способ добавления столбцов.
Returns: Возвращает <c>true</c>, если направление потока текстовых столбцов является обратным.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MText.ColumnGutterWidth
Свойство представляет расстояние между столбцами текста (просвет между текстовыми колонками).
Returns: Возвращает расстояние между столбцами. Тип <c>double</c>.

Teigha.DatabaseServices.MText.ColumnType
Свойство представляет тип текстовых колонок у данного объекта <c>MText</c>.
Returns: Возвращает текущий тип текстовых колонок. Перечисление <c>DatabaseServices.ColumnType</c>.

Teigha.DatabaseServices.MText.ColumnWidth
Свойство представляет ширину столбца, которая применяется к каждому столбцу данного объекта.
Returns: Возвращает ширину текстового столбца. Тип <c>double</c>.

Teigha.DatabaseServices.MText.Contents
Свойство представляет копию символьного содержимого данного объекта <c>MText</c>.
Коды форматирования, используемые для управления переносом, удаляются перед копированием строки.
Returns: Возвращает копию символьного содержимого данного объекта. Тип <c>String</c>.

Teigha.DatabaseServices.MText.Descent
Свойство возвращает высоту максимального нижнего выносного элемента букв последней строки этого объекта <c>MText</c>.
Returns: Возвращает высоту максимального нижнего выносного элемента у букв последней строки.
Тип <c>double</c>.

Teigha.DatabaseServices.MText.Direction
Свойство представляет вектор (WCS) направления оси <c>X</c> этого объекта <c>MText</c>.
Returns: Возвращает направления оси <c>X</c> этого объекта. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.MText.FlowDirection
Свойство представляет направление потока данного многострочного текста.
Returns: Возвращает направление потока текста.
Перечисление <c>DatabaseServices.FlowDirection</c>.

Teigha.DatabaseServices.MText.FontChange
Свойство возвращает строку изменения шрифта "\F".
Returns: Возвращает строку изменения шрифта. Тип <c>String</c>.

Teigha.DatabaseServices.MText.Height
Свойство представляет высоту ограничивающего бокса данного объекта <c>MText</c>.
Returns: Возвращает высоту ограничивающего бокса данного объекта. Тип <c>double</c>.

Teigha.DatabaseServices.MText.HeightChange
Свойство возвращает строку изменения высоты "\H".
Returns: Возвращает строку изменения высоты. Тип <c>String</c>.

Teigha.DatabaseServices.MText.LineBreak
Свойство возвращает строку разрыва строки "\p".
Returns: Возвращает строку, означающую разрыв строки. Тип <c>String</c>.

Teigha.DatabaseServices.MText.LineSpaceDistance
Свойство представляет межстрочный интервал в данном объекте.
Returns: Возвращает межстрочный интервал. Тип <c>double</c>.

Teigha.DatabaseServices.MText.LineSpacingFactor
Свойство представляет коэффициент межстрочного интервала в диапазоне [0,25 .. 4,0].
Returns: Возвращает коэффициент межстрочного интервала. Тип <c>double</c>.

Teigha.DatabaseServices.MText.LineSpacingStyle
Свойство представляет стиль межстрочного интервала, который определяет применение этого интервала в зависимости от размера символов.
Returns: Возвращает стиль межстрочного интервала. Перечисление <c>DatabaseServices.LineSpacingStyle</c>.

Teigha.DatabaseServices.MText.location
Свойство представляет точку вставки данного объекта <c>MText</c>.
Returns: Возвращает точку вставки данного объекта. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MText.NonBreakSpace
Свойство возвращает строку неразрывного пробела "\~".
Returns: Возвращает строку неразрывного пробела. Тип <c>String</c>.

Teigha.DatabaseServices.MText.Normal
Свойство представляет нормаль плоскости (WCS), в которой располагается данный объект <c>MText</c>.
Returns: Возвращает нормаль плоскости в мировой системе координат (WCS). Тип <c>Vector3d</c>.

Teigha.DatabaseServices.MText.ObliqueChange
Свойство возвращает строку изменения угла наклона текста "\Q".
Returns: Возвращает строку изменения угла наклона текста.
Тип <c>String</c>.

Teigha.DatabaseServices.MText.OverlineOff
Свойство возвращает строку перехода к незачёркнутому тексту "\o".
Returns: Возвращает строку перехода к незачёркнутому тексту. Тип <c>String</c>.

Teigha.DatabaseServices.MText.OverlineOn
Свойство возвращает строку перехода к зачёркнутому тексту "\O".
Returns: Возвращает строку перехода к зачёркнутому тексту. Тип <c>String</c>.

Teigha.DatabaseServices.MText.ParagraphBreak
Свойство возвращает строку перехода к новому абзацу "\P".
Returns: Возвращает строку перехода к новому абзацу. Тип <c>String</c>.

Teigha.DatabaseServices.MText.Rotation
Свойство представляет угол поворота данного объекта <c>MText</c> (в радианах).
Returns: Возвращает угол поворота текста. Тип <c>double</c>.

Teigha.DatabaseServices.MText.ShowBorders
Свойство управляет режимом отображения границ многострочного текста.
Returns: Возвращает <c>true</c>, если отображение границ многострочного текста включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MText.StackStart
Свойство возвращает строку перехода к дробному тексту "\S".
Returns: Возвращает строку перехода к дробному тексту.
Тип <c>String</c>.

Teigha.DatabaseServices.MText.Text
Свойство представляет текстовое содержимое многострочного текста, очищенное от кодов форматирования.
Returns: Возвращает очищенный от кодов форматирования текст данного объекта. Тип <c>String</c>.

Teigha.DatabaseServices.MText.TextHeight
Свойство представляет номинальную высоту текста в данном объекте <c>MText</c>.
Returns: Возвращает номинальную высоту текста. Тип <c>double</c>.

Teigha.DatabaseServices.MText.TextStyle
Свойство представляет идентификатор стиля текста, используемого данным объектом <c>MText</c>.
Устарело. Рекомендуется использовать свойство <c>TextStyleId</c>.
Returns: Возвращает идентификатор стиля текста. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.MText.TextStyleId
Свойство представляет идентификатор объекта стиля текста, используемого данным объектом <c>MText</c>.
Returns: Возвращает идентификатор объекта текстового стиля. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MText.TextStyleName
Свойство представляет имя текстового стиля, используемого данным объектом <c>MText</c>.
Returns: Возвращает имя текстового стиля. Тип <c>String</c>.

Teigha.DatabaseServices.MText.TrackChange
Свойство возвращает строку изменения трекинга "\T", т.е. переход к другому межбуквенному расстоянию.
Returns: Возвращает строку изменения трекинга. Тип <c>String</c>.

Teigha.DatabaseServices.MText.UnderlineOff
Свойство возвращает строку отмены подчеркивания текста "\l".
Returns: Возвращает строку отмены подчеркивания текста.
Тип <c>String</c>.

Teigha.DatabaseServices.MText.UnderlineOn
Свойство возвращает строку перехода к подчеркнутому тексту "\L".
Returns: Возвращает строку перехода к подчеркнутому тексту. Тип <c>String</c>.

Teigha.DatabaseServices.MText.UseBackgroundColor
Свойство определяет, используется ли цвет фона экрана в качестве цвета фона этого объекта <c>MText</c>.
Returns: Возвращает <c>true</c>, если цвет фона многострочного текста совпадает с цветом фона экрана.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MText.Width
Свойство представляет ширину абзаца многострочного текста.
Returns: Возвращает ширину абзаца. Тип <c>double</c>.

Teigha.DatabaseServices.MText.WidthChange
Свойство возвращает строку перехода к другой ширине текста "\W".
Returns: Возвращает строку перехода к другой ширине текста. Тип <c>String</c>.