Teigha.DatabaseServices.DBDictionaryEntry
Этот класс представляет запись в словаре DatabaseServices.DBDictionary, в которой содержатся ключ и идентификатор ObjectId объекта чертежа в базе данных.

Teigha.DatabaseServices.DBDictionaryEntry.ToString
Возвращает строковое представление данного объекта в виде экземпляра <c>String</c>.
Подробности см. в документации Microsoft .NET API.

Teigha.DatabaseServices.DBDictionaryEntry.ToString(IFormatProvider)
Возвращает строковое представление данного объекта в виде экземпляра <c>String</c>. Формат получаемой строки определяется настройками языка и региональных параметров. Подробнее см. в документации Microsoft .NET API.
provider: Входной аргумент типа System.IFormatProvider.
Returns: Возвращает экземпляр String.

Teigha.DatabaseServices.DBDictionaryEntry.#ctor(String,Teigha.DatabaseServices.ObjectId)
Этот конструктор создает новый экземпляр класса DBDictionaryEntry с заданными ключом и значением ObjectId.
key: Строковый ключ записи.
value: Идентификатор ObjectId объекта в данной записи .
Returns: Новый экземпляр класса DBDictionaryEntry.

Teigha.DatabaseServices.DBDictionaryEntry.Key
Свойство обеспечивает доступ к уникальному имени записи словаря.
Returns: Обеспечивает доступ к значению свойства Key в виде экземпляра String.

Teigha.DatabaseServices.DBDictionaryEntry.Value
Свойство обеспечивает доступ к идентификатору ObjectId включенного в словарь объекта документа/чертежа.
Returns: Обеспечивает доступ к значению свойства Value в виде экземпляра <c>ObjectId</c>.