Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection
Класс представляет коллекцию свойств вхождений динамических блоков DynamicBlockReferenceProperty.

Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection.CopyTo(array&lt;DynamicBlockReferenceProperty&gt;,System.Int32)
Метод предназначен для копирования данной коллекции в указанный массив по указанному индексу.
a: Массив, в который копируется коллекция. Тип DynamicBlockReferenceProperty[].
index: Индекс, начиная с которого в массиве сохраняется коллекция.  Тип <c>int</c>.

Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection.GetEnumerator
Метод возвращает перечислитель для данной коллекции.
Returns: Возвращает перечислитель коллекции. Тип IEnumerator.

Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection.Count
Свойство Count представляет текущее количество элементов в данной коллекции.
Returns: Возвращает количество элементов в коллекции.  Тип <c>int</c>.

Teigha.DatabaseServices.DynamicBlockReferencePropertyCollection.Item
Свойство Item представляет элемент коллекции по указанному индексу.
A_0: Индекс элемента коллекции.  Тип <c>int</c>.
Returns: Возвращает элемент коллекции свойств. Тип DynamicBlockReferenceProperty.