Teigha.DatabaseServices.LinkedData
Класс представляет в базе данных объекты <c>LinkedData</c> и обеспечивает связывание данных.

Teigha.DatabaseServices.LinkedData.Clear
Метод предназначен для удаления текущих данных. Должен быть реализован в производных классах.

Teigha.DatabaseServices.LinkedData.IsEmpty
Свойство позволяет проверить, содержит ли этот объект какие-либо данные.
Должно быть реализовано в производных классах.
Returns: Возвращает <c>true</c>, если данный объект содержит данные.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LinkedData.Name
Свойство представляет наименование связываемых данных.
Returns: Возвращает наименование данных. Тип <c>String</c>.