Teigha.BoundaryRepresentation.MeshControl
Класс <c>MeshControl</c> является базовым интерфейсным классом для элементов управления 2D-сетью.

Teigha.BoundaryRepresentation.MeshControl.Equals(Object)
Метод предназначен для проверки равенства двух объектов.
obj: Входной объект, который проверяется на равенство данному объекту.  Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если объекты равны.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.MeshControl.GetHashCode
Метод позволяет получить хеш-код для данного объекта.
Returns: Возвращает хеш-код данного объекта.
Тип <c>int</c>.

Teigha.BoundaryRepresentation.MeshControl.AngleTolerance
Свойство <c>AngleTolerance</c> предоставляет доступ к максимальной погрешности в значениях углов.
Returns: Возвращает максимальную погрешность значений углов.  Тип <c>double</c>.

Teigha.BoundaryRepresentation.MeshControl.DistanceTolerance
Свойство <c>DistanceTolerance</c> предоставляет доступ к максимальной погрешности для значений длины.
Returns: Возвращает максимальную погрешность значений длины.  Тип <c>double</c>.

Teigha.BoundaryRepresentation.MeshControl.MaxNodeSpacing
Свойство <c>MaxNodeSpacing</c> представляет максимально допустимое расстояние между узлами сети.
Returns: Возвращает максимально допустимое расстояние между узлами сети.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.MeshControl.MaxSubdivisions
Свойство <c>MaxSubdivisions</c> представляет максимально допустимое количество подразделений сети.
Returns: Возвращает максимально допустимое количество подразделений сети.
Тип <c>unsigned int</c>.