Teigha.Runtime.Interop
Класс <c>Interop</c> предоставляет средства для обеспечения взаимодействия управляемых и неуправляемых типов данных.

Teigha.Runtime.Interop.AttachUnmanagedObject(Teigha.Runtime.DisposableWrapper,IntPtr,System.Boolean)
Метод позволяет прикрепить обертку к совместимому с ней неуправляемому ресурсу.
obj: Входная обертка. Тип <c>DisposableWrapper</c>.
unmanagedPointer: Входной неуправляемый ресурс. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, является ли объект обертки владельцем базового неуправляемого ресурса. Тип <c>bool</c>. В случае значения <c>true</c> ресурс будет удаляться методом <c>Dispose()</c> автоматически.

Teigha.Runtime.Interop.Check(System.Int32)
Метод проверяет статус ошибки по её номеру в перечислении <c>Teigha.Runtime.ErrorStatus</c> с последующей генерацией найденного исключения.
returnValue: Входное значение. Тип <c>int</c>.

Teigha.Runtime.Interop.CheckAds(System.Int32)
Метод проверяет переданный аргумент на равенство значению <c>HostMgd.EditorInput.PromptStatus.OK</c>.
returnValue: Входное значение. Тип <c>int</c>.

Teigha.Runtime.Interop.CheckAdsForCancel(System.Int32)
Метод проверяет значение параметра <c>returnValue</c> на равенство значениям <c>HostMgd.EditorInput.PromptStatus.OK</c> (5100), <c>HostMgd.EditorInput.PromptStatus.None</c> (5000) и <c>HostMgd.EditorInput.PromptStatus.Cancel</c> (-5002).
returnValue: Входное значение. Тип <c>int</c>.
Returns: Метод вернет <c>false</c>, если параметр равен <c>HostMgd.EditorInput.PromptStatus.Cancel</c>.
Если параметр не равен <c>HostMgd.EditorInput.PromptStatus.OK</c> или <c>HostMgd.EditorInput.PromptStatus.None</c>, метод выбросит исключение <c>Teigha.Runtime.ErrorStatus.InvalidInput</c>.
Во всех остальных случаях метод возвращает <c>true</c>.

Teigha.Runtime.Interop.CheckBool(System.Boolean)
Метод проверяет переданное логическое значение.
returnValue: Входное логическое значение. Тип <c>bool</c>.

Teigha.Runtime.Interop.CheckBoolean(System.Int32)
Метод реализует проверку входного значения типа <c>BOOLEAN</c>.
returnValue: Входное значение. Тип <c>int</c>.

Teigha.Runtime.Interop.CheckCPPErrName(System.Int32)
Метод проверяет статус ошибки по её номеру в перечислении <c>Teigha.Runtime.ErrorStatus</c> с последующим выборосом найденного исключения и сообщения, соответствующего исключению.
returnValue: Входное значение. Тип <c>int</c>.

Teigha.Runtime.Interop.CheckNull(IntPtr)
Метод реализует проверку возвращаемого значения на равенство <c>null</c> или <c>System.IntPtr.Zero</c>.
returnValue: Входное значение.  Тип <c>IntPtr</c>.

Teigha.Runtime.Interop.DetachUnmanagedObject(Teigha.Runtime.DisposableWrapper)
Метод разрывает связь между оберткой и соответствующим неуправляемым ресурсом.
obj: Входная обертка. Тип <c>DisposableWrapper</c>.

Teigha.Runtime.Interop.SetAutoDelete(Teigha.Runtime.DisposableWrapper,System.Boolean)
Метод задаёт состояние флага, который определяет, является ли обертка владельцем связанного с ней неуправляемого ресурса.
obj: Входная обёртка. Тип <c>DisposableWrapper</c>.
value: Входное состояние флага автоудаления. Тип <c>bool</c>.

Teigha.Runtime.Interop.ThrowExceptionForErrorStatus(System.Int32)
Метод позволяет выбросить исключение <c>Teigha.Runtime.Exception</c> для переданного статуса ошибки.
errorStatus: Входной статус ошибки. Тип <c>int</c>.