Teigha.BoundaryRepresentation.BrepVertexCollection
Класс <c>BrepVertexCollection</c> представляет коллекцию вершин граничного представления B-Rep.

Teigha.BoundaryRepresentation.BrepVertexCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции вершин.
Returns: Возвращает перечислитель коллекции вершин B-Rep.
Тип <c>BrepVertexEnumerator</c>.