Teigha.DatabaseServices.LinkedTableData
Класс <c>LinkedTableData</c> реализует связывание с данными из внешних таблиц <c>Excel</c>.

Teigha.DatabaseServices.LinkedTableData.#ctor
Конструктор по умолчанию класса <c>LinkedTableData</c>.

Teigha.DatabaseServices.LinkedTableData.AppendColumn(System.Int32)
Метод добавляет в данную таблицу указанное количество столбцов.
columnsNumber: Количество добавляемых столбцов.  Тип <c>int</c>.
Returns: Возвращает индекс первого добавленного столбца. Тип <c>int</c>.
Notes
Если аргумент <c>columnsNumber</c> меньше или равен нулю, метод выбрасывает исключение <c>eInvalidInput</c>.

Teigha.DatabaseServices.LinkedTableData.AppendRow(System.Int32)
Метод добавляет в данную таблицу указанное количество строк.
rowsNumber: Количество добавляемых строк. Тип <c>int</c>.
Returns: Возвращает  индекс первой добавленной строки. Тип <c>int</c>.
Notes
Если аргумент <c>rowsNumber</c> меньше или равен нулю, метод выбрасывает исключение <c>eInvalidInput</c>.

Teigha.DatabaseServices.LinkedTableData.DataType(System.Int32,System.Int32)
Метод позволяет получить тип данных в первом элементе содержимого ячейки, заданной индексами строки и столбца.
row: Индекс строки, тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца, тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице
Returns: Возвращает тип данных в ячейке. Перечисление <c>DatabaseServices.DataType</c>.
Notes
При выходе индекса строки и/или индекса столбца за пределы допустимого диапазона метод выбрасывает исключение <c>eInvalidInput</c>.

Teigha.DatabaseServices.LinkedTableData.DeleteColumn(System.Int32,System.Int32)
Метод позволяет удалить из этой таблицы указанное количество столбцов, начиная со столбца с указанным индексом.
index: Индекс первого удаляемого столбца. Тип <c>int</c>.
columnsNumberToDelete: Количество удаляемых столбцов. Тип <c>int</c>.

Teigha.DatabaseServices.LinkedTableData.DeleteContent(System.Int32,System.Int32)
Метод позволяет удалить все содержимое из ячейки, заданной индексами строки и столбца.
row: Индекс строки,  тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца, тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.

Teigha.DatabaseServices.LinkedTableData.DeleteRow(System.Int32,System.Int32)
Метод позволяет удалить из данной таблицы заданное количество строк, начиная со строки с указанным индексом.
index: Индекс первой удаляемой строки. Тип <c>int</c>.
rowsNumberToDelete: Количество удаляемых строк.     Тип <c>int</c>.

Teigha.DatabaseServices.LinkedTableData.GetBlockAttributeValue(System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод позволяет получить значение атрибута блока, если первый элемент содержимого ячейки представляет собой блок с атрибутами.
row: Индекс строки.  Тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
attributeDefinitionId: Идентификатор объекта определения атрибута блока.  Тип <c>DatabaseServices.ObjectId</c>.
Returns: Возвращает значение указанного атрибута блока. Тип <c>String</c>.
Notes
Метод выбрасывает исключение <c>eInvalidInput</c>, если индексы строки и/или столбца меньше 0 или больше размера таблицы.

Teigha.DatabaseServices.LinkedTableData.GetBlockTableRecordId(System.Int32,System.Int32)
Метод позволяет получить идентификатор записи таблицы блоков, если первым элементом содержимого указанной ячейки является блок.
row: Индекс строки.  Тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает идентификатор записи таблицы блоков. Тип <c>DatabaseServices.ObjectId</c>.  Возвращает нулевой идентификатор, если первый элемент содержимого ячейки не является блоком.
Notes
Метод выбрасывает исключение <c>eInvalidInput</c>, если индексы строки и/или столбца меньше 0 или больше размера таблицы.

Teigha.DatabaseServices.LinkedTableData.GetCellState(System.Int32,System.Int32)
Метод позволяет получить состояние первого элемента содержимого указанной ячейки.
row: Индекс строки.  Тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает состояние первого элемента содержимого ячейки. Перечисление <c>CellStates</c>.
Notes
Метод выбрасывает исключение <c>eInvalidInput</c>, если индексы строки и/или столбца меньше 0 или больше размера таблицы.

Teigha.DatabaseServices.LinkedTableData.GetColumnName(System.Int32)
Метод позволяет получить имя столбца с указанным индексом.
index: Индекс столбца. Тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает имя столбца. Тип <c>String</c>.

Teigha.DatabaseServices.LinkedTableData.GetContentTypes(System.Int32,System.Int32)
Метод позволяет получить тип первого элемента содержимого указанной ячейки.
row: Индекс строки.  Тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает тип первого элемента содержимого ячейки. Перечисление <c>CellContentTypes</c>.

Teigha.DatabaseServices.LinkedTableData.GetCustomData(System.Int32,System.Int32,String)
Метод позволяет получить по ключу пользовательские данные ячейки, столбца или строки.
row: Индекс строки.  Тип <c>int</c>.  Индекс может равняться -1.
column: Индекс столбца. Тип <c>int</c>.  Индекс может равняться -1.
key: Ключ пользовательских данных. Тип <c>String</c>.
Returns: Возвращает пользовательские данные. Тип <c>Object</c>.

Teigha.DatabaseServices.LinkedTableData.GetDataFormat(System.Int32,System.Int32)
Метод позволяет получить формат данных в указанной ячейке.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает формат данных. Тип <c>String</c>.

Teigha.DatabaseServices.LinkedTableData.GetDataLink
Метод позволяет получить коллекцию всех идентификаторов объектов внешних ссылок.
Returns: Возвращает коллекцию идентификаторов внешних ссылок. Тип <c>DatabaseServices.ObjectIdCollection</c>.

Teigha.DatabaseServices.LinkedTableData.GetDataLink(System.Int32,System.Int32)
Метод позволяет получить идентификатор объекта внешней ссылки из указанной ячейки.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает идентификатор объекта внешней ссылки. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.LinkedTableData.GetDataLink(Teigha.DatabaseServices.CellRange)
Метод позволяет получить коллекцию внешних ссылок, заданных в указанном диапазоне ячеек.
range: Входной диапазон ячеек таблицы. Тип <c>CellRange</c>.
Returns: Возвращает коллекцию внешних ссылок из указанного диапазона ячеек.
Тип <c>DatabaseServices.ObjectIdCollection</c>.

Teigha.DatabaseServices.LinkedTableData.GetEnumerator
Метод позволяет получить перечислитель для данного объекта.
Returns: Возвращает перечислитель для таблицы. Тип <c>TableEnumerator</c>.

Teigha.DatabaseServices.LinkedTableData.GetEnumerator(Teigha.DatabaseServices.TableEnumeratorOption)
Метод позволяет получить перечислитель для данной таблицы, преднастроенный с учетом указанных опций.
option: Опции перечислителя таблицы. Перечисление <c>TableEnumeratorOption</c>.
Returns: Возвращает перечислитель для таблицы. Тип <c>TableEnumerator</c>.

Teigha.DatabaseServices.LinkedTableData.GetFieldId(System.Int32,System.Int32)
Метод позволяет получить идентификатор поля в указанной ячейке таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает идентификатор объекта поля. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.LinkedTableData.GetToolTip(System.Int32,System.Int32)
Метод позволяет получить подсказку для указанной ячейки таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает подсказку для указанной ячейки.  Тип <c>String</c>.

Teigha.DatabaseServices.LinkedTableData.GetValue(System.Int32,System.Int32)
Метод позволяет получить значение первого элемента содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает объект элемента содержимого ячейки.  Тип <c>Object</c>.

Teigha.DatabaseServices.LinkedTableData.GetValue(System.Int32,System.Int32,System.Int32,Teigha.DatabaseServices.FormatOption)
Метод позволяет получить значение указанного элемента содержимого заданной ячейки таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
content: Индекс элемента содержимого ячейки. Тип <c>int</c>.
formatOption: Уточнение формата, в котором требуется получить значение элемента. Тип <c>FormatOption</c>.
Returns: Возвращает значение элемента содержимого ячейки. Тип <c>Object</c>.

Teigha.DatabaseServices.LinkedTableData.InsertColumn(System.Int32,System.Int32)
Метод вставляет в данную таблицу указанное количество столбцов по указанному индексу столбца.
index: Индекс столбца, по которому вставляются новые столбцы. Тип <c>int</c>.
columnsNumber: Количество вставляемых столбцов. Тип <c>int</c>.
Returns: Возвращает начальный индекс вставленных столбцов. Тип <c>int</c>.
Notes
Метод выбрасывает исключение <c>eInvalidInput</c>, если значение <c>columnsNumber</c> окажется не положительным.

Teigha.DatabaseServices.LinkedTableData.InsertRow(System.Int32,System.Int32)
Метод вставляет в данную таблицу указанное количество строк по указанному индексу строки.
index: Индекс строки, по которому вставляются новые строки. Тип <c>int</c>.
rowsNumber: Количество вставляемых строк. Тип <c>int</c>.
Returns: Возвращает начальный индекс вставленных строк. Тип <c>int</c>.
Notes
Метод выбрасывает исключение <c>eInvalidInput</c>, если значение <c>rowsNumber</c> окажется не положительным.

Teigha.DatabaseServices.LinkedTableData.IsContentEditable(System.Int32,System.Int32)
Метод позволяет проверить, допустимо ли редактирование содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает <c>true</c>, если содержимое ячейки можно редактировать.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LinkedTableData.IsLinked(System.Int32,System.Int32)
Метод позволяет проверить, связана ли указанная ячейка с источником данных.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает <c>true</c>, если ячейка связана с источником данных.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LinkedTableData.SetBlockAttributeValue(System.Int32,System.Int32,DatabaseServices.ObjectId,String)
Метод позволяет задать значение атрибуту блока в ячейке, если первый элемент содержимого ячейки представляет собой блок с атрибутами.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
attributeDefinitionId: Идентификатор объекта определения атрибута.  Тип <c>DatabaseServices.ObjectId</c>.
value: Новое значение атрибута. Тип <c>String</c>.

Teigha.DatabaseServices.LinkedTableData.SetBlockTableRecordId(System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод позволяет задать идентификатор записи таблицы блоков в первом элементе содержимого указанной ячейки.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
value: Идентификатор записи таблицы блоков. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.LinkedTableData.SetCellState(System.Int32,System.Int32,Teigha.DatabaseServices.CellStates)
Метод позволяет задать состояние указанной ячейки.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
value: Состояние ячейки. Перечисление <c>CellStates</c>.

Teigha.DatabaseServices.LinkedTableData.SetColumnName(System.Int32,String)
Метод позволяет задать имя столбца.
index: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
name: Новое имя столбца. Тип <c>String</c>. Может быть пустым.

Teigha.DatabaseServices.LinkedTableData.SetCustomData(System.Int32,System.Int32,String,Object)
Метод позволяет задать пользовательские данные в ячейке, столбце или строке.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
key: Ключ для пользовательских данных.           Тип <c>String</c>.
value: Новое значение для пользовательских данных. Тип <c>Object</c>.

Teigha.DatabaseServices.LinkedTableData.SetDataFormat(System.Int32,System.Int32,String)
Метод позволяет задать формат данных в первом элементе содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
format: Формат данных. Тип <c>String</c>.

Teigha.DatabaseServices.LinkedTableData.SetDataLink(System.Int32,System.Int32,DatabaseServices.ObjectId,System.Boolean)
Метод позволяет задать в указанной ячейке идентификатор внешней ссылки.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
dataLinkId: Идентификатор внешней ссылки.  Тип <c>DatabaseServices.ObjectId</c>.
bUpdate: Флаг, указывающий, следует ли обновить данные по указанной внешней ссылке. Тип <c>bool</c>.

Teigha.DatabaseServices.LinkedTableData.SetDataLink(Teigha.DatabaseServices.CellRange,DatabaseServices.ObjectId,System.Boolean)
Метод позволяет задать идентификатор внешней ссылки для указанного диапазона ячеек данной таблицы.
range: Диапазон ячеек таблицы. Тип <c>CellRange</c>.
dataLinkId: Идентификатор внешней ссылки.  Тип <c>DatabaseServices.ObjectId</c>.
bUpdate: Флаг, указывающий, следует ли обновить данные по указанной внешней ссылке. Тип <c>bool</c>.

Teigha.DatabaseServices.LinkedTableData.SetDataType(System.Int32,System.Int32,DatabaseServices.DataType,DatabaseServices.UnitType)
Метод позволяет задать тип данных для первого элемента содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
dataType: Тип данных. Перечисление <c>DatabaseServices.DataType</c>.
unitType: Тип единиц измерения. Перечисление <c>DatabaseServices.UnitType</c>.

Teigha.DatabaseServices.LinkedTableData.SetFieldId(System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод позволяет задать идентификатор поля в первом элементе содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
value: Идентификатор объекта поля. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.LinkedTableData.SetSize(System.Int32,System.Int32)
Метод позволяет задать размеры для данной таблицы.
numRows: Количество строк в таблице.    Тип <c>int</c>.
numCols: Количество столбцов в таблице. Тип <c>int</c>.

Teigha.DatabaseServices.LinkedTableData.SetToolTip(System.Int32,System.Int32,String)
Метод позволяет задать подсказку для указанной ячейки таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
value: Строка подсказки. Тип <c>String</c>.

Teigha.DatabaseServices.LinkedTableData.SetValue(System.Int32,System.Int32,System.Int32,Object,Teigha.DatabaseServices.ParseOption)
Метод позволяет задать значение указанному элементу содержимого заданной ячейки таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
content: Индекс элемента содержимого ячейки. Тип <c>int</c>.
value: Задаваемое значение. Тип <c>Object</c>.
parseOption: Опции парсинга значения. Перечисление <c>ParseOption</c>.

Teigha.DatabaseServices.LinkedTableData.SetValue(System.Int32,System.Int32,Object)
Метод позволяет задать значение первому элементу содержимого заданной ячейки таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
value: Задаваемое значение. Тип <c>Object</c>.

Teigha.DatabaseServices.LinkedTableData.UnitType(System.Int32,System.Int32)
Метод позволяет получить тип единиц измерения для данных в первом элементе содержимого указанной ячейки таблицы.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
Returns: Возвращает тип единиц измерения. Перечисление <c>UnitType</c>.

Teigha.DatabaseServices.LinkedTableData.UpdateDataLink(System.Int32,System.Int32,Teigha.DatabaseServices.UpdateDirection,Teigha.DatabaseServices.UpdateOption)
Метод позволяет обновить внешнюю ссылку в указанной ячейке с учетом заданного направления и опций обновления.
row: Индекс строки.  Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>.  Индекс должен быть больше или равен нулю и меньше количества столбцов в таблице.
dir: Направление обновления данных.  Перечисление <c>UpdateDirection</c>.
option: Опции обновления данных. Перечисление <c>UpdateOption</c>.

Teigha.DatabaseServices.LinkedTableData.UpdateDataLink(Teigha.DatabaseServices.UpdateDirection,Teigha.DatabaseServices.UpdateOption)
Метод позволяет обновить внешние ссылки в данном объекте.
dir: Направление обновления данных.  Перечисление <c>UpdateDirection</c>.
option: Опции обновления данных. Перечисление <c>UpdateOption</c>.

Teigha.DatabaseServices.LinkedTableData.NumberOfColumns
Свойство представляет количество столбцов в данной таблице.
Returns: Возвращает количество столбцов. Тип <c>int</c>.

Teigha.DatabaseServices.LinkedTableData.NumberOfRows
Свойство представляет количество строк в данной таблице.
Returns: Возвращает количество строк. Тип <c>int</c>.