Teigha.DatabaseServices.FullSubentityPath
Этот класс реализует однозначную идентификацию подобъектов в базе данных.

Teigha.DatabaseServices.FullSubentityPath.#ctor(array&lt;ObjectId&gt;,Teigha.DatabaseServices.SubentityId)
Конструктор класса FullSubentityPath.
Инициализирует встроенную коллекцию идентификаторов <c>ObjectIdCollection</c> и индекс встроенного подобъекта <c>SubentityId</c>.
ids: Входной массив идентификаторов объектов. Тип <c>array<ObjectId></c>.
index: Входной идентификатор подобъекта. Тип <c>SubentityId</c>.

Teigha.DatabaseServices.FullSubentityPath.Equals(Object)
Метод предназначен для проверки идентичности данного объекта  указанному объекту.
obj: Объект, по отношению к которому выполняется проверка на идентичность. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если данный объект идентичен объекту <c>obj</c>.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.FullSubentityPath.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Returns: Возвращает хеш-код объекта. Тип <c>int</c>.

Teigha.DatabaseServices.FullSubentityPath.GetObjectIds
Метод позволяет получить массив идентификаторов всех объектов, которые составляют путь к подобъекту.
Returns: Возвращает массив идентификаторов объектов. Тип <c>ObjectId[]</c>.

Teigha.DatabaseServices.FullSubentityPath.Null
Свойство возвращает нулевой путь к подобъекту.
Returns: Возвращает нулевой путь к подобъекту. Тип <c>FullSubentityPath</c>.

Teigha.DatabaseServices.FullSubentityPath.SubentId
Свойство возвращает копию идентификатора встроенного подобъекта <c>SubentityId</c>.
Returns: Возвращает идентификатор подобъекта. Тип <c>SubentityId</c>.