Teigha.DatabaseServices.Extents3d
Класс Extents3d представляет трехмерный ограничивающий прямоугольный параллелепипед (бокс) минимального размера, в который вписан тот или иной геометрический объект.

Teigha.DatabaseServices.Extents3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса Extents3d. Создает ограничивающий бокс по двум точкам <c>Point3d</c>.
min: Минимальная точка. Тип <c>Point3d</c>.
max: Максимальная точка. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Extents3d.AddBlockExtents(Teigha.DatabaseServices.BlockTableRecord)
Метод предназначен для вычисления нового ограничивающего бокса, который включает в себя как текущий объект Extents3d, так и все объекты в указанном блоке.
pointerToBlockTableRecord: Указатель на запись таблицы блоков. Тип BlockTableRecord.

Teigha.DatabaseServices.Extents3d.AddExtents(Teigha.DatabaseServices.Extents3d)
Метод позволяет расширить данный объект Extents3d так, чтобы включить в свой объем указанный ограничивающий бокс.
source: Ограничивающий бокс, который следует включить в данный объект. Тип <c>Extents3d</c>.

Teigha.DatabaseServices.Extents3d.AddPoint(Teigha.Geometry.Point3d)
Метод позволяет расширить данный объект Extents3d так, чтобы включить в свой объем указанную точку Point3d.
pt: Входная 3D-точка. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Extents3d.Equals(Object)
Метод предназначен для проверки данного объекта на равенство другому объекту Extents3d.
obj: Объект, проверяемый на равенство. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если объект <c>obj</c> не является нулевым, и совпадают соответствующие координаты вершин сравниваемых объектов. В противном случае возвращает <c>false</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику -
если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод <c>Equals()</c> из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать <c>Extents3d.GetHashCode()</c>, в то время как метод <c>Equals()</c> может быть переопределен в производном классе.

Teigha.DatabaseServices.Extents3d.ExpandBy(Teigha.Geometry.Vector3d)
Метод позволяет расширить данный объект Extents3d в направлении и на величину, которые определяются указанным 3D-вектором.
vector: 3D-вектор, определяющий расположение новых точек.   Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Extents3d.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Returns: Возвращает целочисленный идентификатор, представляющий уникальное для каждого экземпляра класса число. Тип <c>int</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику -
если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод <c>Equals()</c> из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать <c>Extents3d.GetHashCode()</c>, в то время как метод <c>Equals()</c> может быть переопределен в производном классе.

Teigha.DatabaseServices.Extents3d.IsEqualTo(Teigha.DatabaseServices.Extents3d)
Метод позволяет сравнить данный объект с указанным объектом Extents3d.
a: Проверяемый объект. Тип <c>Extents3d</c>.
Returns: Возвращает <c>true</c>, если минимальные и максимальные точки сравниваемых объектов совпадают.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Extents3d.IsEqualTo(Teigha.DatabaseServices.Extents3d,Teigha.Geometry.Tolerance)
Метод позволяет сравнить данный объект с указанным объектом Extents3d в пределах заданного допуска.
a: Проверяемый объект.    Тип <c>Extents3d</c>.
tolerance: Геометрический допуск. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если минимальные и максимальные точки сравниваемых объектов совпадают в пределах допуска <c>tolerance</c>. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Extents3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет переопределить минимальную и максимальную точки данного ограничивающего бокса Extents3d.
min: Новая минимальная точка. Тип <c>Point3d</c>.
max: Новая максимальная точка. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Extents3d.ToString
Метод предназначен для получения эквивалентного строкового представления данного объекта.
Returns: Возвращает строку, в которой представлены минимальная и максимальная точки ограничивающего бокса.
Тип <c>String</c>.

Teigha.DatabaseServices.Extents3d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
provider: Провайдер языковых и региональных настроек. Тип <c>IFormatProvider</c>.
Returns: Возвращает представление данного объекта в виде строки. Тип <c>String</c>.

Teigha.DatabaseServices.Extents3d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
format: Предписанный формат строки. Тип <c>String</c>.
provider: Провайдер языковых и региональных настроек. Тип <c>IFormatProvider</c>.
Returns: Возвращает представление данного объекта в виде форматированной строки, содержащей координаты его минимальной и максимальной точек.  Тип <c>String</c>.

Teigha.DatabaseServices.Extents3d.TransformBy(Teigha.Geometry.Matrix3d)
Метод применяет к данному объекту Extents3d указанное геометрическое преобразование.
mat: Матрица геометрического преобразования. Тип <c>Matrix3d</c>.

Teigha.DatabaseServices.Extents3d.MaxPoint
Свойство обеспечивает доступ к максимальной точке данного объекта.
Returns: Возвращает максимальную точку данного объекта. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Extents3d.MinPoint
Свойство обеспечивает доступ к минимальной точке данного объекта.
Returns: Возвращает минимальную точку данного объекта. Тип <c>Point3d</c>.