Teigha.DatabaseServices.FieldEvaluationResult
Данный класс представляет результат вычисления поля.

Teigha.DatabaseServices.FieldEvaluationResult.Evaluated
Свойство <c>Evaluated</c> возвращает количество вычисленных полей.
Returns: Возвращает количество вычисленных полей.  Тип <c>int</c>.

Teigha.DatabaseServices.FieldEvaluationResult.Found
Свойство <c>Found</c> возвращает количество найденных полей.
Returns: Возвращает количество найденных полей. Тип <c>int</c>.