Teigha.Geometry.CurveBoundary
Класс <c>CurveBoundary</c> представляет геометрию криволинейных границ на ограниченной поверхности.

Teigha.Geometry.CurveBoundary.#ctor
Конструктор по умолчанию класса <c>CurveBoundary</c>.

Teigha.Geometry.CurveBoundary.#ctor(System.Int32,array&lt;Curve3d&gt;,array&lt;Curve2d&gt;,System.Boolean,System.Boolean)
Конструктор класса <c>CurveBoundary</c>. Создает экземпляр класса с указанными параметрами.
numberOfCurves: Количество кривых в данной криволинейной границе. Тип <c>int</c>.
curve3d: Массив 3D-кривых каждого элемента в криволинейной границе. Тип <c>Curve3d[]</c>.
curve2d: Массив 2D-кривых каждого элемента в криволинейной границе. Тип <c>Curve2d[]</c>.
orientation3d: Флаг ориентации для каждого элемента 3D-кривой (обычная или обратная). Имеет смысл только если аргумент <c>curve3d</c> не равен <c>NULL</c>.  Тип <c>bool</c>.
orientation2d: Флаг ориентации для каждого элемента 2D-кривой (обычная или обратная). Имеет смысл только если аргумент <c>curve2d</c> не равен <c>NULL</c>.  Тип <c>bool</c>.

Teigha.Geometry.CurveBoundary.Clone
Метод создает копию данного объекта.
Returns: Возвращает созданный клон данного объекта.
Тип <c>Object</c>.

Teigha.Geometry.CurveBoundary.Set(System.Int32,array&lt;Entity3d&gt;,array&lt;Curve2d&gt;,System.Boolean,System.Boolean)
Метод позволяет переопределить все параметры данной криволинейной границы.
numElements: Количество элементов в данной граничной кривой. Тип <c>int</c>.
curve3ds: Массив 3D-кривых каждого элемента в граничной кривой. Тип <c>Curve3d[]</c>.
curve2ds: Массив 2D-кривых каждого элемента в граничной кривой. Тип <c>Curve2d[]</c>.
orientation3d: Флаг ориентации для каждого элемента 3D-кривой (обычная или обратная). Имеет смысл только если аргумент <c>curve3ds</c> не равен <c>NULL</c>.  Тип <c>bool</c>.
orientation2d: Флаг ориентации для каждого элемента 2D-кривой (обычная или обратная). Имеет смысл только если аргумент <c>curve2ds</c> не равен <c>NULL</c>.  Тип <c>bool</c>.

Teigha.Geometry.CurveBoundary.SetToOwnCurves
Метод позволяет сделать данную криволинейную границу владельцем данных своего определения.

Teigha.Geometry.CurveBoundary.Contour
Свойство <c>Contour</c> представляет данные определения этой криволинейной границы.
Returns: Возвращает данные определения криволинейной границы.
Тип <c>CurveBoundaryData</c>.

Teigha.Geometry.CurveBoundary.DegenerateCurve
Свойство <c>DegenerateCurve</c> представляет 2D-кривую в параметрическом пространстве для вырожденной границы.
Returns: Возвращает двумерную кривую в параметрическом пространстве, которая соответствует вырожденной границе.
Тип <c>Curve2d</c>.

Teigha.Geometry.CurveBoundary.DegeneratePosition
Свойство <c>DegeneratePosition</c> представляет позицию в трехмерном пространстве для вырожденной границы.
Returns: Возвращает позицию вырожденной границы в трехмерном пространстве.
Тип <c>Position3d</c>.

Teigha.Geometry.CurveBoundary.IsDegenerate
Свойство <c>IsDegenerate</c> позволяет проверить тот факт, что граница кривой состоит из одного элемента и вырождена в одну точку трехмерного пространства.
Returns: Возвращает <c>true</c>, если граница кривой состоит из одного элемента и вырождена в одну точку трехмерного пространства.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CurveBoundary.IsOwnerOfCurves
Свойство <c>IsOwnerOfCurves</c> позволяет проверить, является ли данный объект <c>CurveBoundary</c> владельцем данных представления границы.
Returns: Возвращает <c>true</c>, если данные представления границы принадлежат данному объекту.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CurveBoundary.NumElements
Свойство <c>NumElements</c> представляет количество элементов в данной границе.
Returns: Возвращает количество элементов в данной границе. Тип <c>int</c>.