Teigha.Geometry.EllipticalArc2d
Класс <c>EllipticalArc2d</c> представляет эллиптические дуги и полные эллипсы в двумерном пространстве.

Teigha.Geometry.EllipticalArc2d.#ctor
Конструктор по умолчанию класса <c>EllipticalArc2d</c>.

Teigha.Geometry.EllipticalArc2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Double,System.Double)
Конструктор класса <c>EllipticalArc2d</c>.
Создает эллипс с указанными центром, осями и радиусами.
center: Центр эллипса. Тип <c>Point2d</c>.
majorAxis: Большая ось эллипса. Тип <c>Vector2d</c>.
minorAxis: Малая ось эллипса. Тип <c>Vector2d</c>.
majorRadius: Большой радиус эллипса. Тип <c>double</c>.
minorRadius: Малый радиус эллипса. Тип <c>double</c>.

Teigha.Geometry.EllipticalArc2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Double,System.Double,System.Double,System.Double)
Конструктор класса <c>EllipticalArc2d</c>.
Создает эллипс или эллиптическую дугу с указанными центром, осями, радиусами, а также начальным и конечным углами.
center: Центр эллипса.          Тип <c>Point2d</c>.
majorAxis: Большая ось эллипса.    Тип <c>Vector2d</c>.
minorAxis: Малая ось эллипса.      Тип <c>Vector2d</c>.
majorRadius: Большой радиус эллипса. Тип <c>double</c>.
minorRadius: Малый радиус эллипса.   Тип <c>double</c>.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип <c>double</c>.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной точки дуги).  Тип <c>double</c>.

Teigha.Geometry.EllipticalArc2d.#ctor(Teigha.Geometry.CircularArc2d)
Конструктор класса <c>EllipticalArc2d</c>.
Создает эллиптическую дугу на базе указанной круглой дуги.
arc: Входная круглая дуга. Тип <c>CircularArc2d</c>.

Teigha.Geometry.EllipticalArc2d.Create(IntPtr,System.Boolean)
Метод создает эллипс или эллиптическую дугу на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>EllipticalArc2d</c>.

Teigha.Geometry.EllipticalArc2d.IntersectWith(Teigha.Geometry.LinearEntity2d)
Метод вычисляет точки пересечения данного объекта с указанным линейным объектом.
Используется геометрическая точность по умолчанию.
line: Линейный объект, точки пересечения с которым требуется вычислить. Тип <c>LinearEntity2d</c>.
Returns: Возвращает массив из двух элементов. Тип <c>Point2d[]</c>.
Первый элемент соответствует первой точке пересечения (если она существует), а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc2d.IntersectWith(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод вычисляет точки пересечения данного объекта с указанным линейным объектом, используя заданную геометрическую точность.
line: Линейный объект, точки пересечения с которым требуется вычислить. Тип <c>LinearEntity2d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив из двух элементов. Тип <c>Point2d[]</c>.
Первый элемент соответствует первой точке пересечения (если она существует), а второй элемент соответствует второй точке пересечения (если она существует).

Teigha.Geometry.EllipticalArc2d.IsCircular
Метод позволяет проверить, не является ли данная дуга круглой.
Используется геометрическая точность по умолчанию.
Returns: Возвращает <c>true</c>, если с используемой точностью данную дугу можно считать круглой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.EllipticalArc2d.IsCircular(Teigha.Geometry.Tolerance)
Метод позволяет проверить, можно ли в пределах указанной геометрической точности считать данную эллиптическую дугу круглой.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах указанной геометрической точности данную эллиптическую дугу можно считать круглой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.EllipticalArc2d.IsInside(Teigha.Geometry.Point2d)
Метод позволяет убедиться, находится ли указанная точка внутри полного эллипса в пределах точности по умолчанию.
point: Проверяемая точка. Тип <c>Point2d</c>.
Returns: Возвращает <c>true</c>, если в пределах точности по умолчанию можно считать, что точка <c>point</c> находится в пределах полного эллипса.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.EllipticalArc2d.IsInside(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет убедиться, что указанная точка находится внутри полного эллипса в пределах заданной геометрической точности.
point: Проверяемая точка. Тип <c>Point2d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах заданной геометрической точности можно считать, что точка <c>point</c> находится внутри полного эллипса. В противном случае возвращает <c>false</c>.

Teigha.Geometry.EllipticalArc2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Double,System.Double)
Метод позволяет переопределить у данного объекта точку центра, оси и радиусы.
center: Центр эллипса. Тип <c>Point2d</c>.
majorAxis: Большая ось эллипса. Тип <c>Vector2d</c>.
minorAxis: Малая ось эллипса. Тип <c>Vector2d</c>.
majorRadius: Большой радиус эллипса. Тип <c>double</c>.
minorRadius: Малый радиус эллипса. Тип <c>double</c>.

Teigha.Geometry.EllipticalArc2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Double,System.Double,System.Double,System.Double)
Метод позволяет переопределить данный объект, используя указанные центр, оси, радиусы, а также начальный и конечный углы.
center: Центр эллипса.          Тип <c>Point2d</c>.
majorAxis: Большая ось эллипса.    Тип <c>Vector2d</c>.
minorAxis: Малая ось эллипса.      Тип <c>Vector2d</c>.
majorRadius: Большой радиус эллипса. Тип <c>double</c>.
minorRadius: Малый радиус эллипса.   Тип <c>double</c>.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип <c>double</c>.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной точки дуги).  Тип <c>double</c>.

Teigha.Geometry.EllipticalArc2d.Set(Teigha.Geometry.CircularArc2d)
Метод позволяет переопределить данный объект, используя указанную круглую дугу.
arc: Входная круглая дуга. Тип <c>CircularArc2d</c>.

Teigha.Geometry.EllipticalArc2d.SetAngles(System.Double,System.Double)
Метод позволяет переопределить начальный и конечный углы у данного объекта.
startAngle: Начальный угол эллиптической дуги (угловое смещение начальной точки дуги). Тип <c>double</c>.
endAngle: Конечный  угол эллиптической дуги (угловое смещение конечной точки дуги).  Тип <c>double</c>.

Teigha.Geometry.EllipticalArc2d.SetAxes(Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Метод позволяет переопределить направления большой и малой осей у данной эллиптической дуги.
majorAxis: Новое направление большой оси эллиптической дуги. Тип <c>Vector2d</c>.
minorAxis: Новое направление малой   оси эллиптической дуги. Тип <c>Vector2d</c>.

Teigha.Geometry.EllipticalArc2d.Center
Свойство <c>Center</c> предоставляет доступ к точке центра данной эллиптической дуги.
Returns: Возвращает точку центра дуги. Тип <c>Point2d</c>.

Teigha.Geometry.EllipticalArc2d.EndAngle
Свойство <c>EndAngle</c> представляет конечный угол данной эллиптической дуги.
Returns: Возвращает конечный угол эллиптической дуги. Тип <c>double</c>.

Teigha.Geometry.EllipticalArc2d.EndPoint
Свойство <c>EndPoint</c> представляет конечную точку данной эллиптической дуги.
Returns: Возвращает конечную точку эллиптической дуги. Тип <c>Point2d</c>.

Teigha.Geometry.EllipticalArc2d.IsClockWise
Свойство <c>IsClockWise</c> представляет направление данной эллиптической дуги (по часовой стрелке или против).
Returns: Возвращает <c>true</c>, если эллиптическая дуга имеет направление по часовой стрелке.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.EllipticalArc2d.MajorAxis
Свойство <c>MajorAxis</c> представляет направление большой оси данной эллиптической дуги.
Returns: Возвращает направление большой оси эллиптической дуги.  Тип <c>Vector2d</c>.

Teigha.Geometry.EllipticalArc2d.MajorRadius
Свойство <c>MajorRadius</c> предоставляет доступ к значению большого радиуса данной эллиптической дуги.
Returns: Возвращает значение большого радиуса эллиптической дуги.
Тип <c>double</c>.

Teigha.Geometry.EllipticalArc2d.MinorAxis
Свойство <c>MinorAxis</c> представляет направление малой оси данной эллиптической дуги.
Returns: Возвращает направление малой оси эллиптической дуги.
Тип <c>Vector2d</c>.

Teigha.Geometry.EllipticalArc2d.MinorRadius
Свойство <c>MinorRadius</c> предоставляет доступ к значению малого радиуса данной эллиптической дуги.
Returns: Возвращает значение малого радиуса данной эллиптической дуги.
Тип <c>double</c>.

Teigha.Geometry.EllipticalArc2d.StartAngle
Свойство <c>StartAngle</c> представляет значение начального угла данной эллиптической дуги.
Returns: Возвращает значение начального угла эллиптической дуги.
Тип <c>double</c>.

Teigha.Geometry.EllipticalArc2d.StartPoint
Свойство <c>StartPoint</c> представляет положение начальной точки данной эллиптической дуги.
Returns: Возвращает начальную точку эллиптической дуги.
Тип <c>Point2d</c>.