Teigha.GraphicsInterface.SubEntityTraits
Этот класс используется для управления текущими значениями атрибутов цвета, слоя, типа линии, типа заливки и атрибутов системного маркера для графических примитивов.

Teigha.GraphicsInterface.SubEntityTraits.SetSelectionMarker(IntPtr)
Метод назначает объекту SubEntityTraits использование нового текущего графического маркера для всех графических примитивов, отображаемых до следующего вызова этого метода или до завершения выполнения WorldDraw() или ViewportDraw().
markerId: Указатель на новый графический мартек. Тип IntPtr.

Teigha.GraphicsInterface.SubEntityTraits.Color
Свойство позволяет задать или получить текущий индекс цвета в объекте SubEntityTraits.
Returns: Возвращает индекс цвета. Тип Int16.

Teigha.GraphicsInterface.SubEntityTraits.DrawFlags
Свойство возвращает или изменяет текущее значение флагов отрисовки. По умолчанию используется kNoDrawFlags.
Returns: Возвращает текущее значение флагов отрисовки. Тип Int32.

Teigha.GraphicsInterface.SubEntityTraits.FillType
Свойство обеспечивает доступ к текущему типу заполнения FillType в объекте SubEntityTraits.
Returns: Возвращает тип заполнения как значение из перечисления GraphicsInterface.FillType.

Teigha.GraphicsInterface.SubEntityTraits.Layer
Свойство предоставляет доступ к ObjectId текущего слоя, который в объекте SubEntityTraits назначен для отображения графических примитивов.
Returns: Возвращает идентификатор объекта layerTableRecord. Тип DatabaseServices.ObjectId.

Teigha.GraphicsInterface.SubEntityTraits.LineType
Свойство предоставляет доступ к индентификатору ObjectId объекта LinetypeTableRecord, который в объекте SubEntityTraits назначен для отрисовки графических примитивов.
Returns: Возвращает идентификатор объекта linetypeTableRecord. Тип DatabaseServices.ObjectId.

Teigha.GraphicsInterface.SubEntityTraits.LineTypeScale
Свойство предоставляет доступ к масштабному коэффициенту типа линии, который в объекте SubEntityTraits назначен для отрисовки графических примитивов.
Returns: Возвращает масштабный коэффициент типа линии. Тип double.

Teigha.GraphicsInterface.SubEntityTraits.LineWeight
Свойство предоставляет доступ к весу линии, который в объекте SubEntityTraits назначен для отрисовки графических примитивов.
Returns: Возвращает вес линии как значение из перечисления DatabaseServices.LineWeight.

Teigha.GraphicsInterface.SubEntityTraits.Mapper
Свойство предоставляет доступ к определению активного мэппера GraphicsInterface.Mapper.
Returns: Возвращает активный мэппер. Тип GraphicsInterface.Mapper.

Teigha.GraphicsInterface.SubEntityTraits.Material
Свойство предоставляет доступ к идентификатору текущего материала, который в объекте SubEntityTraits назначен для отображения графических примитивов.
Returns: Возвращает идентификатор текущего материала. Тип DatabaseServices.ObjectId.

Teigha.GraphicsInterface.SubEntityTraits.PlotStyleDescriptor
Свойство предоставляет доступ к дескриптору стиля печати, который в объекте SubEntityTraits определяет стиль отображения графических примитивов при выводе на печать.
Returns: Возвращает дескриптор текущего стиля печати.  Тип DatabaseServices.PlotStyleDescriptor.

Teigha.GraphicsInterface.SubEntityTraits.Sectionable
Свойство предоставляет доступ к логическому флагу, который указывает на участие отображаемых с помощью этого объекта графических примитивов в операциях построения сечений.
Returns: Возвращает true, если отображаемые графические примитивы будут участвовать в построении сечений. Возвращает false, если операции построения сечений не влияют на графические примитивы.

Teigha.GraphicsInterface.SubEntityTraits.SelectionFlags
Свойство представляет текущее значение флагов выделения у данного объекта.
Returns: Возвращает значение из перечисления GraphicsInterface.SelectionFlags.

Teigha.GraphicsInterface.SubEntityTraits.SelectionOnlyGeometry
Данное свойство позволяет определить, выделена ли только геометрия.
Returns: Возвращает true, если выделена только геометрия.  В противном случае возвращает false.

Teigha.GraphicsInterface.SubEntityTraits.ShadowFlags
Свойство предоставляет доступ к текущему значению флагов отображения теней из перечисления GraphicsInterface.ShadowFlags. По умолчанию используется значение ShadowsCastAndReceive.
Returns: Возвращает флаг отображения теней из перечисления GraphicsInterface.ShadowFlags.

Teigha.GraphicsInterface.SubEntityTraits.Thickness
Свойство обеспечивает доступ к значению толщины выдавливания отображаемых объектов.
Returns: Возвращает значение толщины выдавливания. Тип double.

Teigha.GraphicsInterface.SubEntityTraits.Transparency
Свойство предоставляет доступ к настройке прозрачности отображаемых объектов.
Returns: Возвращает ссылку на объект типа Colors.Transparency.

Teigha.GraphicsInterface.SubEntityTraits.TrueColor
Свойство предоставляет доступ к значению цвета для отображения объектов.
Returns: Возвращает значению цвета в виде экземпляра класса Colors.EntityColor.

Teigha.GraphicsInterface.SubEntityTraits.VisualStyle
Свойство предоставляет доступ к идентификатору визуального стиля отображения графических объектов.
Returns: Возвращает идентификатор объекта. Тип DatabaseServices.ObjectId.