Teigha.DatabaseServices.NurbSurface
Класс <c>NurbSurface</c> представляет в базе данных поверхности, для математического описания которых используются неоднородные рациональные B-сплайны (NURBS).

Teigha.DatabaseServices.NurbSurface.#ctor
Конструктор по умолчанию класса <c>NurbSurface</c>.

Teigha.DatabaseServices.NurbSurface.#ctor(System.Int32,System.Int32,System.Boolean,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection)
Конструктор класса <c>NurbSurface</c>. Создает NURBS поверхность, используя предоставленные параметры.
uDegree: Степень сплайна в направлении <c>u</c>. Тип <c>int</c>.
vDegree: Степень сплайна в направлении <c>v</c>. Тип <c>int</c>.
rational: Если сплайн является рациональным, следует передать значение <c>true</c>, в противном случае передать <c>false</c>. Тип <c>bool</c>.
uNumControlPoints: Количество управляющих вершин в направлении <c>u</c>. Тип <c>int</c>.
vNumControlPoints: Количество управляющих вершин в направлении <c>v</c>. Тип <c>int</c>.
ctrlPts: Массив управляющих вершин сплайна. Тип <c>Point3dCollection</c>.
weights: Массив весов. Тип <c>DoubleCollection</c>.
uKnots: Узловой вектор в направлении <c>u</c>. Тип <c>KnotCollection</c>.
vKnots: Узловой вектор в направлении <c>v</c>. Тип <c>KnotCollection</c>.

Teigha.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double)
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров <c>(dU, dV)</c>.
dU: Параметр в направлении <c>U</c>. Тип <c>double</c>.
dV: Параметр в направлении <c>V</c>. Тип <c>double</c>.
Returns: Возвращает 3D-точку на NURBS поверхности. Тип <c>Point3d</c>.
Notes
Если поверхность не содержит никакой NURBS информации, выбрасывается исключение <c>eFail</c>.
Если любое из значений <c>dU</c> или <c>dV</c> выходит за пределы допустимого диапазона, генерируется исключение <c>eOutOfRange</c>. Если этот метод в конкретном моделере не реализован, выбрасывается исключение <c>eNotImplementedYet</c>.

Teigha.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,System.Int32,Point3d%,Vector3dCollection%)
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров <c>(dU, dV)</c>.
Дополнительно метод вычисляет массив производных по указанному параметру <c>u</c> или <c>v</c>.
dU: Входной параметр в направлении <c>U</c>. Тип <c>double</c>.
dV: Входной параметр в направлении <c>V</c>. Тип <c>double</c>.
derivDegree: Входной аргумент, определяющий выбор параметра <c>u</c> или <c>v</c> для вычисления массива <c>derivatives</c>.  Тип <c>int</c>. Параметру <c>u</c> соответствует значение 0, параметру <c>v</c> - значение 1.
point: Вычисленная 3D-точка на NURBS поверхности. Тип <c>Point3d</c>.
derivatives: Вычисленный массив первых производных по указанному параметру. Тип <c>Vector3dCollection</c>.

Teigha.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,Point3d%,Vector3d%,Vector3d%)
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров <c>(dU, dV)</c>.
Дополнительно метод вычисляет в этой точке первые производные по <c>u</c> и <c>v</c>.
dU: Входной параметр в направлении <c>U</c>. Тип <c>double</c>.
dV: Входной параметр в направлении <c>V</c>. Тип <c>double</c>.
pos: Вычисленная 3D-точка на NURBS поверхности. Тип <c>Point3d</c>.
uDeriv: Вычисленная первая производная по <c>u</c> в заданной точке. Тип <c>Vector3d</c>.
vDeriv: Вычисленная первая производная по <c>v</c> в заданной точке. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.NurbSurface.Evaluate(System.Double,System.Double,Point3d%,Vector3d%,Vector3d%,Vector3d%,Vector3d%,Vector3d%)
Метод предназначен для вычисления 3D-точки на NURBS поверхности для заданных значений параметров <c>(dU, dV)</c>.
Дополнительно метод вычисляет в этой точке первые и вторые производные по параметрам <c>u</c> и <c>v</c>.
dU: Входной параметр в направлении <c>U</c>. Тип <c>double</c>.
dV: Входной параметр в направлении <c>V</c>. Тип <c>double</c>.
pos: Вычисленная 3D-точка на NURBS поверхности. Тип <c>Point3d</c>.
uDeriv: Вычисленная первая производная по <c>u</c> в заданной точке. Тип <c>Vector3d</c>.
vDeriv: Вычисленная первая производная по <c>v</c> в заданной точке. Тип <c>Vector3d</c>.
uuDeriv: Вычисленная вторая производная по <c>u</c> в заданной точке. Тип <c>Vector3d</c>.
uvDeriv: Вычисленная вторая производная по <c>u</c> и по <c>v</c> в заданной точке. Тип <c>Vector3d</c>.
vvDeriv: Вычисленная вторая производная по <c>v</c> в заданной точке. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.NurbSurface.GetControlPointAt(System.Int32,System.Int32)
Метод позволяет вычислить управляющую вершину для заданной позиции в массиве управляющих вершин.
uIndex: Индекс управляющей вершины в направлении <c>u</c>. Тип <c>int</c>. Начальное значение индекса равно 0.
vIndex: Индекс управляющей вершины в направлении <c>v</c>. Тип <c>int</c>. Начальное значение индекса равно 0.
Returns: Возвращает положение управляющей вершины. Тип <c>Point3d</c>.

Teigha.DatabaseServices.NurbSurface.GetIsolineAtU(System.Double)
Метод предназначен для вычисления изопараметрической линии с заданным значением <c>u</c>.
Изолинии создаются в направлении <c>v</c>.
dU: Входное значение параметра <c>U</c>. Тип <c>double</c>.
Returns: Возвращает изолинию как массив кривых. Тип <c>Curve[]</c>.

Teigha.DatabaseServices.NurbSurface.GetIsolineAtV(System.Double)
Метод предназначен для вычисления изопараметрической линии с заданным значением <c>v</c>.
Изолинии создаются в направлении <c>u</c>.
dV: Входное значение параметра <c>V</c>. Тип <c>double</c>.
Returns: Возвращает изопараметрическую линию как массив кривых. Тип <c>Curve[]</c>.

Teigha.DatabaseServices.NurbSurface.GetNormal(System.Double,System.Double)
Метод вычисляет вектор нормали к поверхности в точке, заданной параметрическими координатами <c>([u, v])</c>.
dU: Входное значение параметра <c>U</c>. Тип <c>double</c>.
dV: Входное значение параметра <c>V</c>. Тип <c>double</c>.
Returns: Возвращает вектор нормали к поверхности. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.NurbSurface.GetParameterOfPoint(Teigha.Geometry.Point3d,[Out]double%,[Out]double%)
Метод позволяет определить параметры <c>u</c> и <c>v</c> для заданной точки на поверхности.
point: Точка, лежащая на данной поверхности. Тип <c>Point3d</c>.
dU: Выходное значение параметра <c>u</c>. Тип <c>double</c>.
dV: Выходное значение параметра <c>v</c>. Тип <c>double</c>.

Teigha.DatabaseServices.NurbSurface.GetWeight(System.Int32,System.Int32)
Метод позволяет определить значение веса в указанной позиции массива весов, заданной параметрами <c>iUIndex</c> и <c>iVIndex</c>.
iUIndex: Индекс веса в направлении <c>u</c>. Тип <c>int</c>. Начальное значение индекса равно нулю.
iVIndex: Индекс веса в направлении <c>v</c>. Тип <c>int</c>. Начальное значение индекса равно нулю.
Returns: Возвращает значение веса. Тип <c>double</c>.

Teigha.DatabaseServices.NurbSurface.InsertControlPointsAtU(System.Double,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection)
Метод позволяет вставить строку управляющих вершин для заданного значения параметра <c>u</c> узла.
dU: Входное значение параметра <c>U</c>. Тип <c>double</c>.
vCtrlPts: Входной массив добавляемых управляющих вершин. Тип <c>Point3dCollection</c>.
vWeights: Входной массив добавляемых весов, если поверхность является рациональной. Тип <c>DoubleCollection</c>.

Teigha.DatabaseServices.NurbSurface.InsertControlPointsAtV(System.Double,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection)
Метод позволяет вставить строку управляющих вершин для заданного значения параметра <c>v</c> узла.
dV: Входное значение параметра <c>V</c>.  Тип <c>double</c>.
vCtrlPts: Входной массив добавляемых управляющих вершин. Тип <c>Point3dCollection</c>.
vWeights: Входной массив добавляемых весов, если поверхность является рациональной. Тип <c>DoubleCollection</c>.

Teigha.DatabaseServices.NurbSurface.InsertKnotAtU(System.Double)
Метод вставляет узел с указанным значением параметра <c>u</c> без изменения формы поверхности.
dU: Входное значение параметра <c>U</c>. Тип <c>double</c>.

Teigha.DatabaseServices.NurbSurface.InsertKnotAtV(System.Double)
Метод вставляет узел с указанным значением параметра <c>v</c> без изменения формы поверхности.
dV: Входное значение параметра <c>V</c>. Тип <c>double</c>.

Teigha.DatabaseServices.NurbSurface.IsPlanar([Out]Point3d%,[Out]Vector3d%)
Метод позволяет проверить, является ли данная поверхность плоской.
Если поверхность представляет собой плоскость, метод дополнительно возвращает информацию о плоскости и ее нормали.
ptOnSurface: Если поверхность является плоской, возвращает точку на этой плоскости. Тип <c>Point3d</c>.
normal: Если поверхность является плоской, возвращает нормаль этой плоскости. Тип <c>Point3d</c>.
Returns: Возвращает <c>true</c>, если поверхность представляет собой плоскость.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.NurbSurface.IsPointOnSurface(Teigha.Geometry.Point3d)
Метод позволяет проверить, располагается ли указанная точка на данной поверхности.
point: Входная проверяемая точка. Тип <c>Point3d</c>.
Returns: Возвращает <c>true</c>, если точка принадлежит поверхности.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.NurbSurface.ModifyPosition(System.Double,System.Double,Teigha.Geometry.Point3d)
Метод позволяет изменить положение точки на поверхности с указанным параметром <c>([u, v])</c>.
В текущей версии не реализован.
dU: Входной параметр <c>U</c>. Тип <c>double</c>.
dV: Входной параметр <c>V</c>. Тип <c>double</c>.
point: Новые координаты точки на поверхности. Тип <c>Point3d</c>.

Teigha.DatabaseServices.NurbSurface.ModifyPositionAndTangent(System.Double,System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет изменить положение точки на поверхности с указанным параметром <c>([u, v])</c> и касательные вектора в этой точке. В текущей версии не реализован.
dU: Входной параметр <c>U</c>. Тип <c>double</c>.
dV: Входной параметр <c>V</c>. Тип <c>double</c>.
point: Новые координаты точки на поверхности. Тип <c>Point3d</c>.
uDeriv: Касательный вектор в направлении <c>u</c>. Тип <c>Vector3d</c>.
vDeriv: Касательный вектор в направлении <c>v</c>. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.NurbSurface.Rebuild(System.Int32,System.Int32,System.Int32,System.Int32)
Метод позволяет перестроить NURBS поверхность с заданными новыми степенями сплайна и количеством управляющих вершин в направлениях <c>u</c> и <c>v</c>.  В текущей версии не реализован.
iUDegree: Новая степень сплайна в направлении <c>u</c>. Тип <c>int</c>.
iVDegree: Новая степень сплайна в направлении <c>v</c>.  Тип <c>int</c>.
iNumUCtrlPts: Новое количество управляющих вершин в направлении <c>u</c>. Тип <c>int</c>.
iNumVCtrlPts: Новое количество управляющих вершин в направлении <c>v</c>.  Тип <c>int</c>.

Teigha.DatabaseServices.NurbSurface.Rebuild(System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean)
Метод позволяет перестроить NURBS поверхность с заданными новыми степенями сплайна и количеством управляющих вершин в направлениях <c>u</c> и <c>v</c>. Поддерживается режим восстановления поверхности.
В текущей версии не реализован.
iUDegree: Новая степень сплайна в направлении <c>u</c>. Тип <c>int</c>.
iVDegree: Новая степень сплайна в направлении <c>v</c>.  Тип <c>int</c>.
iNumUCtrlPts: Новое количество управляющих вершин в направлении <c>u</c>. Тип <c>int</c>.
iNumVCtrlPts: Новое количество управляющих вершин в направлении <c>v</c>.  Тип <c>int</c>.
bRestore: Флаг восстановления формы поверхности. Тип <c>bool</c>.

Teigha.DatabaseServices.NurbSurface.RemoveControlPointsAtU(System.Int32)
Метод удаляет из массива управляющих вершин ряд точек с указанным индексом в направлении <c>u</c>.
iUIndex: Исходный индекс в направлении <c>u</c> удаляемого ряда управляющих вершин. Тип <c>int</c>.

Teigha.DatabaseServices.NurbSurface.RemoveControlPointsAtV(System.Int32)
Метод удаляет из массива управляющих вершин ряд с указанным индексом в направлении <c>v</c>.
iVIndex: Исходный индекс в направлении <c>V</c> удаляемого ряда управляющих вершин. Тип <c>int</c>.

Teigha.DatabaseServices.NurbSurface.Set(System.Int32,System.Int32,System.Boolean,System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.Geometry.DoubleCollection,Teigha.Geometry.KnotCollection,Teigha.Geometry.KnotCollection)
Метод предоставляет возможность задать новые данные для существующей NURBS поверхности.
iUDegree: Новая степень сплайна в направлении <c>u</c>. Тип <c>int</c>.
iVDegree: Новая степень сплайна в направлении <c>v</c>. Тип <c>int</c>.
bRational: Входной флаг, который определяет, что поверхность является рациональной (новое значение). Тип <c>bool</c>.
iUNumControlPoints: Новое количество управляющих вершин в направлении <c>u</c>. Тип <c>int</c>.
iVNumControlPoints: Новое количество управляющих вершин в направлении <c>v</c>. Тип <c>int</c>.
ctrlPts: Новый массив управляющих вершин (в мировой системе координат WCS). Тип <c>Point3dCollection</c>.
weights: Новый массив весов в каждой управляющей вершине. Тип <c>DoubleCollection</c>.
knotsInU: Новый узловой вектор в направлении <c>u</c>. Тип <c>KnotCollection</c>.
knotsInV: Новый узловой вектор в направлении <c>v</c>. Тип <c>KnotCollection</c>.

Teigha.DatabaseServices.NurbSurface.SetControlPointAt(System.Int32,System.Int32,Teigha.Geometry.Point3d)
Метод позволяет задать новую управляющую вершину в указанной позиции массива управляющих вершин.
iUDegree: Индекс управляющей вершины в направлении <c>u</c>. Тип <c>int</c>. Начальное значение 0.
iVDegree: Индекс управляющей вершины в направлении <c>v</c>. Тип <c>int</c>. Начальное значение 0.
point: Новая управляющая вершина, которая создается в указанной позиции <c>[(u,v)]</c>. Тип <c>Point3d</c>. Координаты определяются в мировой системе координат WCS.

Teigha.DatabaseServices.NurbSurface.SetControlPoints(System.Int32,System.Int32,Teigha.Geometry.Point3dCollection)
Метод позволяет задать для поверхности новый массив управляющих вершин.
iUDegree: Новое количество управляющих вершин в направлении <c>u</c>. Тип <c>int</c>.
iVDegree: Новое количество управляющих вершин в направлении <c>v</c>. Тип <c>int</c>.
points: Новый массив управляющих вершин, заданных в координатах WCS. Тип <c>Point3dCollection</c>.

Teigha.DatabaseServices.NurbSurface.SetWeight(System.Int32,System.Int32,System.Double)
Метод позволяет задать новое значение веса в указанной позиции массива весов.
Если поверхность не является рациональной, метод ничего не делает.
iUDegree: Индекс значения веса в направлении <c>u</c>. Тип <c>int</c>.
iVDegree: Индекс значения веса в направлении <c>v</c>. Тип <c>int</c>.
dWeight: Новое значение веса, которое устанавливается в указанной позиции. Тип <c>double</c>.

Teigha.DatabaseServices.NurbSurface.ControlPoints
Свойство возвращает коллекцию, в которой представлены управляющее вершины данной поверхности для обоих направлений <c>u</c> и <c>v</c>.
Returns: Возвращает коллекцию управляющих вершин. Тип <c>Point3dCollection</c>.

Teigha.DatabaseServices.NurbSurface.DegreeInU
Свойство представляет степень NURBS поверхности в направлении <c>u</c>.
Returns: Возвращает степень NURBS поверхности. Тип <c>int</c>.

Teigha.DatabaseServices.NurbSurface.DegreeInV
Свойство представляет степень NURBS поверхности в направлении <c>v</c>.
Returns: Возвращает степень NURBS поверхности. Тип <c>int</c>.

Teigha.DatabaseServices.NurbSurface.IsClosedInU
Свойство позволяет проверить, является ли данная поверхность замкнутой в направлении <c>u</c>.
Returns: Возвращает <c>true</c>, если поверхность в указанном направлении является замкнутой.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.NurbSurface.IsClosedInV
Свойство позволяет проверить, является ли данная поверхность замкнутой в направлении <c>v</c>.
Returns: Возвращает <c>true</c>, если поверхность в указанном направлении является замкнутой.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.NurbSurface.IsPeriodicInU
Свойство позволяет проверить, является ли данная поверхность периодической в направлении <c>u</c>.
Returns: Возвращает <c>true</c>, если поверхность в указанном направлении является периодической.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.NurbSurface.IsPeriodicInV
Свойство позволяет проверить, является ли данная поверхность периодической в направлении <c>v</c>.
Returns: Возвращает <c>true</c>, если поверхность в указанном направлении является периодической.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.NurbSurface.IsRational
Свойство позволяет проверить, является ли данная поверхность рациональной.
Returns: Возвращает <c>true</c>, если поверхность является рациональной.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.NurbSurface.NumberOfControlPointsInU
Свойство представляет количество управляющих вершин данной поверхности в направлении <c>u</c>.
Returns: Возвращает количество управляющих вершин поверхности. Тип <c>int</c>.

Teigha.DatabaseServices.NurbSurface.NumberOfControlPointsInV
Свойство представляет количество управляющих вершин данной поверхности в направлении <c>v</c>.
Returns: Возвращает количество управляющих вершин поверхности. Тип <c>int</c>.

Teigha.DatabaseServices.NurbSurface.NumberOfKnotsInU
Свойство представляет количество узлов данной поверхности в направлении <c>u</c>.
Returns: Возвращает количество узлов поверхности в заданном направлении. Тип <c>int</c>.

Teigha.DatabaseServices.NurbSurface.NumberOfKnotsInV
Свойство представляет количество узлов данной поверхности в направлении <c>v</c>.
Returns: Возвращает количество узлов поверхности в заданном направлении. Тип <c>int</c>.

Teigha.DatabaseServices.NurbSurface.NumberOfSpansInU
Свойство представляет количество простых поверхностных фрагментов, "сшитых" в направлении <c>u</c>.
Returns: Возвращает количество простых поверхностных фрагментов в указанном направлении. Тип <c>int</c>.

Teigha.DatabaseServices.NurbSurface.NumberOfSpansInV
Свойство представляет количество простых поверхностных фрагментов, "сшитых" в направлении <c>v</c>.
Returns: Возвращает количество простых поверхностных фрагментов в указанном направлении. Тип <c>int</c>.

Teigha.DatabaseServices.NurbSurface.PeriodInU
Свойство представляет значение периода в направлении <c>u</c>, если данная поверхность является периодической в направлении <c>u</c>.
Returns: Возвращает значение периода в указанном направлении. Тип <c>double</c>.

Teigha.DatabaseServices.NurbSurface.PeriodInV
Свойство представляет значение периода в направлении <c>v</c>, если данная поверхность является периодической в направлении <c>v</c>.
Returns: Возвращает значение периода в указанном направлении. Тип <c>double</c>.

Teigha.DatabaseServices.NurbSurface.UKnots
Свойство представляет узловой вектор данной поверхности в направлении <c>u</c>.
Returns: Возвращает узловой вектор поверхности. Тип <c>KnotCollection</c>.

Teigha.DatabaseServices.NurbSurface.VKnots
Свойство представляет узловой вектор данной поверхности в направлении <c>v</c>.
Returns: Возвращает узловой вектор поверхности. Тип <c>KnotCollection</c>.