Teigha.DatabaseServices.AssocDependency
Класс AssocDependency является базовым классом для реализации ассоциативных зависимостей.

Teigha.DatabaseServices.AssocDependency.#ctor
Конструктор класса по умолчанию.

Teigha.DatabaseServices.AssocDependency.AttachToObject(Teigha.DatabaseServices.CompoundObjectId)
Метод позволяет прикрепить данную зависимость к одному или нескольким объектам в качестве постоянного реактора.
compoundId: Объекты базы данных, к которым прикрепляется данная зависимость. Тип CompoundObjectId.

Teigha.DatabaseServices.AssocDependency.DetachFromObject
Метод позволяет открепить данную зависимость от объекта DBObject, к которому она в данный момент прикреплена.

Teigha.DatabaseServices.AssocDependency.Evaluate
Метод обновляет зависимости ассоциативного действия, которые нуждаются в перевычислении.

Teigha.DatabaseServices.AssocDependency.GetDependenciesOnObject(Teigha.DatabaseServices.DBObject,System.Boolean,System.Boolean)
Метод позволяет получить все зависимости, связанные с указанным объектом базы данных.
dbObj: Идентификатор объекта, из которого извлекаются зависимости.  Тип DBObject.
readDependenciesWanted: Флаг, указывающий, следует ли извлекать зависимости чтения ("read-dependency").  Тип bool.
writeDependenciesWanted: Флаг, указывающий, следует ли извлекать зависимости записи ("write-dependency"). Тип bool.
Returns: Возвращает коллекцию ObjectId объектов, которые имеют зависимости чтения и/или записи от указанного объекта.
Тип ObjectIdCollection.

Teigha.DatabaseServices.AssocDependency.GetFirstDependencyOnObject(Teigha.DatabaseServices.DBObject)
Метод позволяет получить первую зависимость у заданного объекта DBObject.
dbObj: Идентификатор объекта, из которого извлекается зависимость.  Тип DBObject.  Объект должен быть открыт как минимум для чтения.
Returns: Возвращает первую зависимость от объекта DBObject или <c>ObjectId.Null</c>, если у DBObject отсутствуют прикрепленные зависимости. Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocDependency.NotifyDependenciesOnObject(Teigha.DatabaseServices.DBObject,Teigha.DatabaseServices.AssocStatus)
Метод уведомляет все ассоциативные зависимости указанного объекта DBObject о новом статусе.
dbObj: Объект базы данных DBObject, зависимости которого подлежат уведомлению о новом статусе. Тип DBObject.
newStatus: Новый статус в уведомлении.  Значение из перечисления AssocStatus.

Teigha.DatabaseServices.AssocDependency.SetDependentOnObject(Teigha.DatabaseServices.CompoundObjectId)
Метод устанавливает зависимость от объекта для данной зависимости с помощью идентификатора составного объекта CompoundObjectId.
compoundId: Идентификатор составного объекта, от которого должна зависеть данная зависимость (может быть нулевым).  Тип CompoundObjectId.

Teigha.DatabaseServices.AssocDependency.SetStatus(Teigha.DatabaseServices.AssocStatus,System.Boolean)
Метод устанавливает статус  AssocStatus данной зависимости.
newStatus: Новый статус ассоциативной зависимости.  Значение из перечисления <c>AssocStatus</c>.
notifyOwningNetwork: Флаг необходимости уведомить ассоциативную сеть-владельца.  Тип <c>bool</c>.

Teigha.DatabaseServices.AssocDependency.UpdateDependentOnObject
Метод позволяет обновить объект, от которого зависит ассоциативная зависимость, на основе информации, полученной зависимостью от родительского действия.

Teigha.DatabaseServices.AssocDependency.DependencyBody
Свойство обеспечивает доступ к ObjectId тела зависимости, которое принадлежит данной зависимости и представлено классом, производным от AssocDependencyBody.
Returns: Возвращает идентификатор тела пользовательской зависимости.  Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocDependency.DependentOnCompoundObject
Свойство возвращает родительский составной объект, к которому данная зависимость прикреплена как постоянный реактор.
Returns: Возвращает идентификатор составного объекта.  Тип CompoundObjectId.

Teigha.DatabaseServices.AssocDependency.DependentOnObject
Свойство возвращает объект базы данных, с которым связана данная зависимость.
Returns: Возвращает идентификатор связанного объекта.  Тип <c>Teigha.DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.AssocDependency.DependentOnObjectStatus
Свойство возвращает текущее состояние объекта DependentOnObject.
Returns: Возвращает состояние связанного объекта как значение из перечисления Teigha.Runtime.ErrorStatus.
Возможные состояния: <c>OK</c>, <c>NotInitializedYet</c> или <c>InvalidObjectId</c>.

Teigha.DatabaseServices.AssocDependency.HasCachedValue
Свойство позволяет установить, хранит ли данная зависимость кэшированное значение для объекта, с которым она связана.
Returns: Возвращает <c>true</c>, если зависимость хранит кэшированное значение для связанного объекта.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocDependency.IsActionEvaluationInProgress
Свойство позволяет установить, занята ли система в данный момент вычислением действия или сети действий.
Returns: Возвращает <c>true</c>, если в данный момент система выполняет обновление действия или сети действий.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocDependency.IsAttachedToObject
Свойство позволяет установить, связана ли данная зависимость с каким-либо объектом.
Returns: Возвращает <c>true</c>, если данная зависимость прикреплена к какому-либо объекту.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocDependency.IsDelegatingToOwningAction
Свойство проверяет или задает режим делегирования действию-владельцу некоторыми методами зависимостей, если метод не реализован непосредственно в зависимости или в объекте AssocDependencyBody, которым может владеть зависимость.
Returns: Возвращает <c>true</c>, если режим делегирования установлен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocDependency.IsDependentOnCompoundObject
Свойство позволяет проверить, является ли связанный с зависимостью объект составным, т.е. используется ли данной зависимостью идентификатор составного объекта CompoundObjectId.
Returns: Возвращает <c>true</c>, если зависимость использует идентификатор CompoundObjectId.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocDependency.IsObjectStateDependent
Свойство позволяет задать или проверить, требует ли владеющее зависимостью действие AssocAction, чтобы связанный DBObject находился в ожидаемом «состоянии объекта» с точки зрения списка зависимостей объекта, прежде чем действие можно будет перевычислить.
Returns: Возвращает <c>true</c>, если вычисление действия предполагает пребывание объекта в некотором определенном состоянии.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocDependency.IsReadDependency
Свойство позволяет указать или проверить, что данная зависимость использует связанный объект, не меняя его состояния.
Returns: Возвращает <c>true</c>, если действие-владелец зависимости лишь использует значение связанного объекта DBObject.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocDependency.IsRelevantChange
Свойство позволяет проверить, действительно ли изменение связанного объекта релевантно и меняет состояние данной зависимости.
Returns: Возвращает <c>true</c>, если изменение связанного объекта меняет состояние данной зависимости.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocDependency.IsWriteDependency
Свойство позволяет проверить или указать, что данная зависимость изменяет состояние связанного объекта.
Returns: Возвращает <c>true</c>, если зависимость изменяет состояние связанного объекта.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocDependency.NextDependencyOnObject
Свойство возвращает следующую зависимость после данной в списке зависимостей объекта DBObject или ObjectId.Null, если данная зависимость является последней в списке.
Returns: Возвращает идентификатор зависимости. Тип Teigha.DatabaseServices.ObjectId.
В случае последней в списке зависимости возвращает <c>ObjectId.Null</c>.

Teigha.DatabaseServices.AssocDependency.Order
Свойство позволяет получить или задать порядок зависимости, определяющий ее место в списке всех зависимостей связанного объекта DBObject.
Returns: Возвращает порядок зависимости в списке зависимостей связанного объекта. Тип <c>int</c>.

Teigha.DatabaseServices.AssocDependency.OwningAction
Свойство позволяет получить или задать ассоциативное действие AssocAction, являющееся владельцем данной зависимости.
Returns: Возвращает ObjectId действия-владельца данной зависимости.  Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocDependency.PrevDependencyOnObject
Свойство возвращает зависимость, которая предшествует данной в списке зависимостей связанного объекта DBObject.
Returns: Возвращает идентификатор зависимости. Тип Teigha.DatabaseServices.ObjectId.

Teigha.DatabaseServices.AssocDependency.Status
Свойство получает и устанавливает текущий статус AssocStatus данной зависимости.
Returns: Возвращает статус зависимости как значение из перечисления AssocStatus.