Teigha.DatabaseServices.Vertex2d
Класс <c>Vertex2d</c> представляет в базе данных вершины двумерной полилинии.

Teigha.DatabaseServices.Vertex2d.#ctor
Конструктор по умолчанию класса <c>Vertex2d</c>.

Teigha.DatabaseServices.Vertex2d.#ctor(Teigha.Geometry.Point3d,System.Double,System.Double,System.Double,System.Double)
Конструктор класса <c>Vertex2d</c>. Создает экземпляр класса с указанными параметрами.
position: Координаты вершины в системе координат объекта (OCS). Тип <c>Point3d</c>.
bulge: Величина прогиба сегмента полилинии, берущего начало в данной вершине. Тип <c>double</c>.
startWidth: Начальная ширина сегмента с началом в данной вершине. Тип <c>double</c>.
endWidth: Конечная ширина сегмента с началом в данной вершине. Тип <c>double</c>.
tangent: Направление касательной к кривой в данной вершине. Тип <c>double</c>.

Teigha.DatabaseServices.Vertex2d.Bulge
Свойство <c>Bulge</c> представляет безразмерную величину прогиба сегмента полилинии, берущего начало в данной вершине.
Returns: Возвращает безразмерный прогиб сегмента полилинии.
Тип <c>double</c>.

Teigha.DatabaseServices.Vertex2d.EndWidth
Свойство <c>EndWidth</c> представляет конечную ширину сегмента полилинии, следующего за этой вершиной.
Returns: Возвращает ширину конца сегмента полилинии. Тип <c>double</c>.

Teigha.DatabaseServices.Vertex2d.Position
Свойство <c>Position</c> представляет положение данной вершины в системе координат объекта (OCS).
Returns: Возвращает координатную точку данной вершины.
Тип <c>Point3d</c>.

Teigha.DatabaseServices.Vertex2d.StartWidth
Свойство <c>StartWidth</c> представляет начальную ширину сегмента полилинии, следующего за этой вершиной.
Returns: Возвращает начальную ширину сегмента полилинии.
Тип <c>double</c>.

Teigha.DatabaseServices.Vertex2d.Tangent
Свойство <c>Tangent</c> представляет направление касательной к кривой в данной вершине.
Returns: Возвращает угол в радианах между осью <c>X</c> объектной системы координат (OCS) полилинии и направлением касательной к кривой в данной вершине.
Тип <c>double</c>.

Teigha.DatabaseServices.Vertex2d.TangentUsed
Свойство <c>TangentUsed</c> позволяет определить, используется ли данной вершиной направление определяющей касательной к кривой.
Returns: Возвращает <c>true</c>, если направление касательной используется.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Vertex2d.VertexType
Свойство <c>VertexType</c> представляет тип вершины полилинии из перечисления <c>Vertex2dType</c>.
Returns: Возвращает тип вершины. Перечисление <c>Vertex2dType</c>.