Teigha.DatabaseServices.UnderlayReference
Класс <c>UnderlayReference</c> представляет подложки на чертеже.

Teigha.DatabaseServices.UnderlayReference.GenerateClipBoundaryFromPline(DatabaseServices.ObjectId)
Метод предназначен для создания границы обрезки из заданной полилинии.
polyId: Идентификатор объекта полилинии. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.UnderlayReference.GetClipBoundary
Метод предоставляет массив точек, определяющих границу обрезки данной подложки.
Returns: Возвращает массив точек границы обрезки. Тип <c>Point2d[]</c>.

Teigha.DatabaseServices.UnderlayReference.SetClipBoundary(array&lt;Point2d&gt;)
Метод позволяет задать массив точек, определяющих границу обрезки данной подложки.
points: Массив точек границы обрезки. Тип <c>Point2d[]</c>.

Teigha.DatabaseServices.UnderlayReference.AdjustColorForBackground
Свойство <c>AdjustColorForBackground</c> позволяет определить, настроено ли содержимое подложки для текущего цвета фона.
Returns: Возвращает <c>true</c>, если содержимое подложки настроено для текущего цвета фона.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.UnderlayReference.Contrast
Свойство <c>Contrast</c> представляет значение контраста подложки в диапазоне [0 – 100].
Returns: Возвращает  в диапазоне [0 – 100]. Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayReference.ContrastLowerLimit
Свойство <c>ContrastLowerLimit</c> представляет нижний предел возможных значений контраста.
Returns: Возвращает минимально возможное значение контраста. Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayReference.ContrastUpperLimit
Свойство <c>ContrastUpperLimit</c> представляет верхний предел возможных значений контраста.
Returns: Возвращает максимально возможное значение контраста. Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayReference.DefaultContrast
Свойство <c>DefaultContrast</c> представляет значение контраста по умолчанию.
Returns: Возвращает значение контраста по умолчанию.
Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayReference.DefaultFade
Свойство <c>DefaultFade</c> представляет значение затухания по умолчанию.
Returns: Возвращает значение затухания.
Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayReference.DefinitionId
Свойство <c>DefinitionId</c> представляет идентификатор объекта определения подложки, на который ссылается данная подложка.
Returns: Возвращает идентификатор объекта <c>UnderlayDefinition</c>.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.UnderlayReference.Fade
Свойство <c>Fade</c> представляет значение затухания для подложки в диапазоне [0 – 100].
Returns: Возвращает значение затухания в диапазоне [0 – 100].
Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayReference.FadeLowerLimit
Свойство <c>FadeLowerLimit</c> представляет нижнюю границу возможных значений затухания.
Returns: Возвращает нижнюю границу возможных значений затухания.
Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayReference.FadeUpperLimit
Свойство <c>FadeUpperLimit</c> представляет верхнюю границу возможных значений затухания.
Returns: Возвращает верхнюю границу возможных значений затухания.
Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayReference.Height
Свойство <c>Height</c> представляет высоту данной подложки на чертеже.
Returns: Возвращает высоту данной ссылки на подложку.
Тип <c>double</c>.

Teigha.DatabaseServices.UnderlayReference.IsClipped
Свойство <c>IsClipped</c> позволяет определить , обрезан ли по границе данный объект.
Returns: Возвращает <c>true</c>, если обрезка по границе применена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.UnderlayReference.IsOn
Свойство <c>IsOn</c> позволяет определить, отображается ли данная ссылка на подложку.
Returns: Возвращает <c>true</c>, если данный объект является видимым.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.UnderlayReference.Monochrome
Свойство <c>Monochrome</c> позволяет определить, отображается ли содержимое подложки в монохромном режиме.
Returns: Возвращает <c>true</c>, если используется монохромный режим.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.UnderlayReference.Name
Свойство <c>Name</c> представляет имя данного объекта.
Returns: Возвращает имя данного объекта.
Тип <c>String</c>.

Teigha.DatabaseServices.UnderlayReference.NameOfSheet
Свойство <c>NameOfSheet</c> представляет имя листа.
Returns: Возвращает имя листа.
Тип <c>String</c>.

Teigha.DatabaseServices.UnderlayReference.Normal
Свойство <c>Normal</c> представляет вектор нормали плоскости данной подложки.
Returns: Возвращает нормаль плоскости данного объекта.
Тип <c>Vector3d</c>.

Teigha.DatabaseServices.UnderlayReference.Path
Свойство <c>Path</c> представляет полный путь к файлу подложки.
Returns: Возвращает полный путь к файлу подложки.
Тип <c>String</c>.

Teigha.DatabaseServices.UnderlayReference.position
Свойство <c>Position</c> представляет положение подложки в мировой системе координат (WCS).
Returns: Возвращает 3D-точку, положение которой определяет положение подложки в WCS.
Тип <c>Point3d</c>.

Teigha.DatabaseServices.UnderlayReference.Rotation
Свойство <c>Rotation</c> представляет угол поворота (в радианах) вокруг оси, определяемой точкой привязки и вектором нормали плоскости данной подложки.
Returns: Возвращает угол поворота подложки в радианах.
Тип <c>double</c>.

Teigha.DatabaseServices.UnderlayReference.scaleFactors
Свойство <c>ScaleFactors</c> представляет коэффициенты масштабирования данной подложки.
Returns: Возвращает коэффициенты масштабирования подложки.
Тип <c>Scale3d</c>.

Teigha.DatabaseServices.UnderlayReference.Transform
Свойство <c>Transform</c> представляет матрицу преобразования данной подложки.
Returns: Возвращает матрицу геометрического преобразования данного объекта.
Тип <c>Matrix3d</c>.

Teigha.DatabaseServices.UnderlayReference.UnderlayLayerCollection
Свойство <c>UnderlayLayerCollection</c> представляет коллекцию слоев подложки в базе данных.
Returns: Возвращает коллекцию слоев подложки.
Тип <c>DatabaseServices.UnderlayLayerCollection</c>.

Teigha.DatabaseServices.UnderlayReference.Width
Свойство <c>Width</c> представляет ширину данной подложки на чертеже.
Returns: Возвращает  ширину подложки на чертеже.
Тип <c>double</c>.