Teigha.GraphicsInterface.ViewportGeometry
Данный класс определяет методы, которые позволяют объектам себя векторизовать.

Teigha.GraphicsInterface.ViewportGeometry.DeviceContextPolygon(Teigha.Geometry.Point3dCollection)
Метод предназначен для отрисовки заполненного многоугольника с вершинами, заданными в нормализованных координатах устройства.
points: Коллекция 3D-точек, представляющих вершины многоугольника. Тип <c>Point3dCollection</c>.
Returns: Возвращает <c>true</c>.
В случае ошибки метод выбрасывает соответствующее исключение.
Notes
Производный класс должен возвращать значение <c>false</c> (то есть 0), если примитив успешно сохранен в графической базе данных.
Возвращаемое значение <c>true</c> указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.ViewportGeometry.DeviceContextPolyline(Teigha.Geometry.Point3dCollection)
Метод предназначен для отрисовки полилинии с вершинами, заданными в нормализованных координатах устройства.
points: Коллекция 3D-точек вершин полилинии.  Тип <c>Point3dCollection</c>.
Returns: Возвращает <c>true</c>.
В случае ошибки метод выбрасывает соответствующее исключение.
Notes
Производный класс должен возвращать значение <c>false</c> (то есть 0), если примитив успешно сохранен в графической базе данных.
Возвращаемое значение <c>true</c> указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.ViewportGeometry.DeviceContextRasterImage(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Matrix2d,DatabaseServices.ObjectId,GraphicsInterface.ImageOrg,System.Int32,System.Int32,short,System.Boolean,GraphicsInterface.ImageSource,Teigha.Geometry.Vector3d,GraphicsInterface.ImageOrg,Teigha.Geometry.Matrix2d,System.Int32,System.Int32)
Метод предназначен для отрисовки растрового изображения.
origin: Точка привязки изображения. Тип <c>Point3d</c>.
u: Направление ширины изображения. Тип <c>Vector3d</c>.
v: Направление высоты изображения. Тип <c>Vector3d</c>.
pixel: Матрица геометрического преобразования координат (2D).  Тип <c>Matrix2d</c>.
entityId: Постоянный идентификатор объекта изображения.  Тип <c>DatabaseServices.ObjectId</c>.
imageOrg: Тип организации формата изображения. Перечисление <c>GraphicsInterface.ImageOrg</c>.
imageWidth: Ширина изображения в пикселях. Тип <c>int</c>.
imageHeight: Высота изображения в пикселях. Тип <c>int</c>.
imageColorDepth: Глубина цветности изображения (биты на пиксель).  Тип <c>short</c>.
transparency: Флаг, указывающий, имеет ли изображение прозрачные области. Тип <c>bool</c>.
source: Источник изображения. Перечисление <c>GraphicsInterface.ImageSource</c>.
unRotated: Начало неповернутого изображения. Тип <c>Vector3d</c>.
originalImage: Организация исходного изображения. Перечисление <c>GraphicsInterface.ImageOrg</c>.
unRotatedPixel: Матрица преобразования пикселей неповернутого изображения в координаты контекста устройства. Тип <c>Matrix2d</c>.
unRotatedImageWidth: Ширина неповернутого исходного изображения, указанная в пикселях. Тип <c>int</c>.
unRotatedImageHeight: Высота неповернутого исходного изображения, указанная в пикселях. Тип <c>int</c>.
Returns: Возвращает <c>true</c>.
В случае ошибки метод выбрасывает соответствующее исключение.
Notes
Производный класс должен возвращать значение <c>false</c> (то есть 0), если примитив успешно сохранен в графической базе данных.
Возвращаемое значение <c>true</c> указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.ViewportGeometry.PolygonEye(Teigha.Geometry.Point3dCollection)
Метод реализует отрисовку заполненного многоугольника с вершинами, указанными в координатах EyeSpace.
points: Коллекция 3D-точек, которые представляют вершины многоугольника. Тип <c>Point3dCollection</c>.
Returns: Возвращает <c>true</c>.
В случае ошибки метод выбрасывает соответствующее исключение.
Notes
Производный класс должен возвращать значение <c>false</c> (то есть 0), если примитив успешно сохранен в графической базе данных.
Возвращаемое значение <c>true</c> указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.ViewportGeometry.PolylineEye(Teigha.Geometry.Point3dCollection)
Метод реализует отрисовку полилинии с координатами точек, указанными в координатах EyeSpace.
points: Входная коллекция точек полилинии, определенных в координатах EyeSpace.  Тип <c>Point3dCollection</c>.
Returns: Возвращает <c>true</c>.
В случае ошибки метод выбрасывает соответствующее исключение.
Notes
Производный класс должен возвращать значение <c>false</c> (то есть 0), если примитив успешно сохранен в графической базе данных.
Возвращаемое значение <c>true</c> указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.