Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut
Класс <c>RevolveOptionsCheckRevolveCurveOut</c> представляет индикаторы возможных проблем, выявляемых при проверке возможности вращения объекта.

Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.#ctor
Конструктор по умолчанию класса <c>RevolveOptionsCheckRevolveCurveOut</c>.

Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.Closed
Свойство <c>Closed</c> позволяет определить, является ли объект профиля замкнутой областью.
Returns: Возвращает <c>true</c>, если объект является замкнутым.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.EndPointsOnAxis
Свойство <c>EndPointsOnAxis</c> позволяет определить, является ли вращаемый профиль незамкнутой кривой, концы которой лежат на оси вращения.
Returns: Возвращает <c>true</c>, если концы незамкнутого профиля лежат на оси вращения.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RevolveOptionsCheckRevolveCurveOut.Planar
Свойство <c>Planar</c> позволяет определить, является ли профиль плоской кривой.
Returns: Возвращает <c>true</c>, если профиль является плоским.
В противном случае возвращает <c>false</c>.