Teigha.DatabaseServices.Face
Класс Face реализует трехмерную грань как объект в базе данных и наследует базовую функциональность объектов чертежа Entity.

Teigha.DatabaseServices.Face.#ctor
Конструктор класса Face по умолчанию.

Teigha.DatabaseServices.Face.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Конструктор класса Face. Создает новую треугольную грань с указанными вершинами и значениями видимости ребер.
pointer1: Первая угловая вершина грани. Тип Point3d.
pointer2: Вторая угловая вершина грани. Тип Point3d.
pointer3: Третья угловая вершина грани. Тип Point3d.
value1: Флаг видимости первого ребра. Тип <c>bool</c>.
value2: Флаг видимости второго ребра. Тип <c>bool</c>.
value3: Флаг видимости третьего ребра. Тип <c>bool</c>.
value4: Флаг видимости четвертого ребра. Тип <c>bool</c>.

Teigha.DatabaseServices.Face.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Конструктор класса Face. Создает четырехугольную грань с указанными вершинами и значениями видимости ребер.
pointer1: Первая угловая вершина грани.    Тип Point3d.
pointer2: Вторая угловая вершина грани.    Тип Point3d.
pointer3: Третья угловая вершина грани.    Тип Point3d.
pointer4: Четвертая угловая вершина грани. Тип Point3d.
value1: Флаг видимости первого ребра.    Тип <c>bool</c>.
value2: Флаг видимости второго ребра.    Тип <c>bool</c>.
value3: Флаг видимости третьего ребра.   Тип <c>bool</c>.
value4: Флаг видимости четвертого ребра. Тип <c>bool</c>.

Teigha.DatabaseServices.Face.GetVertexAt(short)
Метод предназначен для получения точки в вершине с указанным индексом.
value: Индекс вершины грани (0, 1, 2 или 3). Тип <c>short</c>.
Returns: Возвращает точку в WCS. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Face.IsEdgeVisibleAt(short)
Метод позволяет проверить видимость ребра с указанным индексом.
vertexIndex: Индекс вершины грани (0, 1, 2 или 3). Тип <c>short</c>.
Returns: Возвращает <c>true</c>, если указанное ребро является видимым.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Face.MakeEdgeInvisibleAt(short)
Метод позволяет сделать невидимым ребро с указанным индексом.
vertexIndex: Индекс вершины грани (0, 1, 2 или 3). Тип <c>short</c>.

Teigha.DatabaseServices.Face.MakeEdgeVisibleAt(short)
Метод позволяет сделать видимым ребро с указанным индексом.
vertexIndex: Индекс вершины грани (0, 1, 2 или 3). Тип <c>short</c>.

Teigha.DatabaseServices.Face.SetVertexAt(short,Teigha.Geometry.Point3d)
Метод предоставляет возможность изменять положение в пространстве вершины с указанным индексом.
vertexIndex: Индекс вершины грани (0, 1, 2 или 3). Тип <c>short</c>.
vertexPosition: Новое положение вершины. Тип <c>Point3d</c>.