Teigha.Geometry.Plane
Класс <c>Plane</c> представляет параметризованную бесконечную плоскость в трехмерном пространстве.

Teigha.Geometry.Plane.#ctor
Конструктор по умолчанию класса <c>Plane</c>. Создает новую плоскость, совпадающую с плоскостью <c>XY</c>.

Teigha.Geometry.Plane.#ctor(System.Double,System.Double,System.Double,System.Double)
Конструктор класса <c>Plane</c>.
Создает экземпляр класса с указанными коэффициентами в общем уравнении плоскости.
a: Коэффициент <c>a</c> в общем уравнении плоскости. Тип <c>double</c>.
b: Коэффициент <c>b</c> в общем уравнении плоскости. Тип <c>double</c>.
c: Коэффициент <c>c</c> в общем уравнении плоскости. Тип <c>double</c>.
d: Коэффициент <c>d</c> в общем уравнении плоскости. Тип <c>double</c>.

Teigha.Geometry.Plane.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса <c>Plane</c>.
Создает плоскость по трем точкам, которые определяют оси и начало координат плоскости.
u: Точка, определяющая направление оси <c>uAxis</c>. Тип <c>Point3d</c>.
origin: Точка, определяющая начало координат плоскости.   Тип <c>Point3d</c>.
v: Точка, определяющая направление оси <c>vAxis</c>. Тип <c>Point3d</c>.

Teigha.Geometry.Plane.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор класса <c>Plane</c>.
Создает плоскость, используя заданные начало координат и нормальный вектор плоскости.
origin: Начало координат плоскости.  Тип <c>Point3d</c>.
normal: Нормаль плоскости. Тип <c>Vector3d</c>. Не может иметь ненулевую длину.

Teigha.Geometry.Plane.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса <c>Plane</c>.
Создает плоскость, используя заданные начало координат и направляющие векторы осей.
origin: Начало координат. Тип <c>Point3d</c>.
u: Направляющий вектор оси <c>uAxis</c>. Тип <c>Vector3d</c>.
v: Направляющий вектор оси <c>vAxis</c>. Тип <c>Vector3d</c>.

Teigha.Geometry.Plane.#ctor(Teigha.Geometry.Plane)
Конструктор класса <c>Plane</c>.
Создает экземпляр класса как копию указанной плоскости.
source: Входная плоскость. Тип <c>Plane</c>.

Teigha.Geometry.Plane.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>Plane</c>.

Teigha.Geometry.Plane.GetSignedDistanceTo(Teigha.Geometry.Point3d)
Метод вычисляет расстояние со знаком от данной плоскости до указанной точки.
pointValue: Входная точка, расстояние до которой от плоскости требуется определить. Тип <c>Point3d</c>.
Returns: Возвращает расстояние со знаком от данной плоскости до точки <c>pointValue</c>.
Тип <c>double</c>.

Teigha.Geometry.Plane.IntersectWith(Teigha.Geometry.BoundedPlane)
Метод вычисляет линейный сегмент, который представляет линию пересечения данной плоскости с указанной ограниченной плоскостью.
Используется точность по умолчанию.
boundPlane: Входная ограниченная плоскость.
Returns: Возвращает линейный сегмент, который представляет линию пересечения.
Тип <c>LineSegment3d</c>.

Teigha.Geometry.Plane.IntersectWith(Teigha.Geometry.BoundedPlane,Teigha.Geometry.Tolerance)
Метод вычисляет линейный сегмент, который представляет линию пересечения данной плоскости с указанной ограниченной плоскостью.
Используется предписанная точность.
boundPlane: Входная ограниченная плоскость.   Тип <c>BoundedPlane</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает линейный сегмент, который представляет линию пересечения.
Тип <c>LineSegment3d</c>.

Teigha.Geometry.Plane.IntersectWith(Teigha.Geometry.Plane)
Метод вычисляет линию пересечения данной плоскости и указанной плоскости.
Используется точность по умолчанию.
otherPlane: Входная плоскость, линию пересечения с которой требуется вычислить. Тип <c>Plane</c>.
Returns: Возвращает линию пересечения данной плоскости и плоскости <c>otherPlane</c>.
Тип <c>Line3d</c>.

Teigha.Geometry.Plane.IntersectWith(Teigha.Geometry.Plane,Teigha.Geometry.Tolerance)
Метод вычисляет линию пересечения данной плоскости и указанной плоскости.
Используется предписанная точность.
otherPlane: Входная плоскость, линию пересечения с которой требуется вычислить. Тип <c>Plane</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает линию пересечения данной плоскости и плоскости <c>otherPlane</c>.
Тип <c>Line3d</c>.

Teigha.Geometry.Plane.Set(System.Double,System.Double,System.Double,System.Double)
Метод переопределяет коэффициенты в общем уравнении данной плоскости.
a: Коэффициент <c>a</c> в общем уравнении плоскости. Тип <c>double</c>.
b: Коэффициент <c>b</c> в общем уравнении плоскости. Тип <c>double</c>.
c: Коэффициент <c>c</c> в общем уравнении плоскости. Тип <c>double</c>.
d: Коэффициент <c>d</c> в общем уравнении плоскости. Тип <c>double</c>.

Teigha.Geometry.Plane.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод переопределяет точки, которые задают оси и начало координат плоскости.
u: Точка, определяющая направление оси <c>uAxis</c>. Тип <c>Point3d</c>.
origin: Точка, определяющая начало координат плоскости.   Тип <c>Point3d</c>.
v: Точка, определяющая направление оси <c>vAxis</c>. Тип <c>Point3d</c>.

Teigha.Geometry.Plane.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод переопределяет плоскость, задавая новые начало координат и нормальный вектор плоскости.
pointValue: Новое начало координат плоскости.  Тип <c>Point3d</c>.
normal: Новая нормаль плоскости. Тип <c>Vector3d</c>. Не может иметь ненулевую длину.

Teigha.Geometry.Plane.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод переопределяет плоскость, используя новые начало координат и направляющие векторы осей.
origin: Начало координат. Тип <c>Point3d</c>.
u: Направляющий вектор оси <c>uAxis</c>. Тип <c>Vector3d</c>.
v: Направляющий вектор оси <c>vAxis</c>. Тип <c>Vector3d</c>.