Teigha.DatabaseServices.CellRange
Этот класс представляет диапазоны ячеек таблицы.

Teigha.DatabaseServices.CellRange.ClearStyleOverrides
Метод удаляет из ячеек переопределения стиля таблицы.

Teigha.DatabaseServices.CellRange.Create(Teigha.DatabaseServices.Table,System.Int32,System.Int32,System.Int32,System.Int32)
Метод создает диапазон ячеек, заключенный между двумя строками и двумя столбцами таблицы.
table: Таблица, содержащая ячейки, из которых следует сформировать диапазон ячеек. Тип <c>Table</c>.
topRow: Индекс верхней строки диапазона ячеек. Тип <c>int</c>.
leftColumn: Индекс левого столбца диапазона ячеек. Тип <c>int</c>.
bottomRow: Индекс нижней строки диапазона ячеек. Тип <c>int</c>.
rightColumn: Индекс правого столбца диапазона ячеек. Тип <c>int</c>.
Returns: Возвращает диапазон ячеек таблицы в указанных границах.  Тип <c>CellRange</c>.

Teigha.DatabaseServices.CellRange.DeleteContent
Метод предназначен для удаления содержимого ячеек данного диапазона.

Teigha.DatabaseServices.CellRange.Equals(Object)
Метод позволяет проверить на равенство два диапазона ячеек.
pRange: Диапазон, который проверяется на равенство данному объекту. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если диапазоны равны. В противном случае возвращает <c>false</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику -
если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод <c>Equals()</c> из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать этот GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.CellRange.GetCustomData(String)
Метод возвращает значение пользовательских данных из текущей ячейки данного диапазона.
key: Ключ, используемый для доступа к пользовательским данным. Тип <c>String</c>.
Returns: Возвращает пользовательские данные. Тип <c>Object</c>.

Teigha.DatabaseServices.CellRange.GetDataLink
Метод позволяет получить коллекцию внешних ссылок в этом диапазоне ячеек.
Returns: Возвращает коллекцию идентификаторов внешних ссылок. Тип <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.CellRange.GetEnumerator
Метод позволяет получить перечислитель для этого диапазона ячеек.
Returns: Возвращает перечислитель для диапазона ячеек. Тип <c>IEnumerator<CellReference></c>.

Teigha.DatabaseServices.CellRange.GetHashCode
Метод предоставляет хеш-код для данного диапазона ячеек.
Returns: Возвращает уникальный для каждого экземпляра класса целочисленный идентификатор. Тип <c>int</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику - если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод <c>Equals()</c> из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать этот GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.CellRange.GetStyleOverrides
Метод позволяет получить переопределения стиля ячеек в этом диапазоне ячеек.
Returns: Возвращает массив переопределений стиля ячеек. Тип <c>TableStyleOverride[]</c>.

Teigha.DatabaseServices.CellRange.IEnumerableGetEnumerator
Метод позволяет получить перечислитель для этого диапазона ячеек.
Returns: Возвращает перечислитель для диапазона ячеек. Тип <c>IEnumerator</c>.

Teigha.DatabaseServices.CellRange.SetCustomData(String,Object)
Метод позволяет задать значение пользовательских данных для ячеек этого диапазона.
key: Ключ для доступа к пользовательским данным. Тип <c>String</c>.
value: Значение пользовательских данных. Тип <c>Object</c>.

Teigha.DatabaseServices.CellRange.SetDataLink(Teigha.DatabaseServices.ObjectId,System.Boolean)
Метод позволяет задать внешнюю ссылку для ячеек этого диапазона.
dataLinkId: Идентификатор объекта внешней ссылки. Тип <c>ObjectId</c>.
bUpdate: Флаг, определяющий, следует ли после установки обновить данные по этой внешней ссылке. Тип <c>bool</c>.

Teigha.DatabaseServices.CellRange.Alignment
Свойство обеспечивает доступ к настройкам выравнивания в ячейках диапазона.
Returns: Возвращает значение выравнивания из перечисления Тип <c>CellAlignment</c>.

Teigha.DatabaseServices.CellRange.BackgroundColor
Свойство обеспечивает доступ к цвету фоновой заливки ячеек данного диапазона.
Returns: Возвращает цвет фона ячеек диапазона. Тип <c>Colors.Color</c>.

Teigha.DatabaseServices.CellRange.Borders
Свойство возвращает границы ячеек диапазона.
Returns: Возвращает границы ячеек. Тип <c>CellBorders</c>.

Teigha.DatabaseServices.CellRange.BottomRight
Свойство возвращает правую нижнюю ячейку диапазона.
Returns: Возвращает ячейку диапазона. Тип <c>Cell</c>.

Teigha.DatabaseServices.CellRange.BottomRightPlusOne
Свойство возвращает ячейку, следующую за правой нижней ячейкой диапазона.
Returns: Возвращает ячейку таблицы. Тип <c>Cell</c>.

Teigha.DatabaseServices.CellRange.BottomRow
Свойство возвращает индекс нижней строки диапазона ячеек.
Returns: Возвращает индекс нижней строки диапазона. Тип <c>int</c>.

Teigha.DatabaseServices.CellRange.CanDeleteColumns
Свойство позволяет определить, возможно ли удаление столбцов из диапазона.
Returns: Возвращает <c>true</c>, если удаление столбцов возможно.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.CanDeleteRows
Свойство позволяет определить, возможно ли удаление строк из диапазона.
Returns: Возвращает <c>true</c>, если удаление строк возможно.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.CanInsertColumn
Свойство позволяет определить, можно ли вставить столбец в диапазон.
Returns: Возвращает <c>true</c>, если вставить столбец можно.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.CanInsertRow
Свойство позволяет определить, можно ли вставить строку в диапазон.
Returns: Возвращает <c>true</c>, если вставить строку можно.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.ContentColor
Свойство обеспечивает доступ к цвету содержимого ячеек диапазона.
Returns: Возвращает цвет содержимого ячеек диапазона.
Тип <c>Colors.Color</c>.

Teigha.DatabaseServices.CellRange.ContentLayout
Свойство обеспечивает доступ к настройкам размещения содержимого ячеек диапазона из перечисления <c>CellContentLayout</c>.
Returns: Возвращает вариант размещения содержимого ячеек.  Значение из перечисления <c>CellContentLayout</c>.

Teigha.DatabaseServices.CellRange.DataFormat
Свойство обеспечивает доступ к формату данных в ячейках диапазона.
Returns: Возвращает формат данных. Тип <c>String</c>.

Teigha.DatabaseServices.CellRange.DataType
Свойство обеспечивает доступ к типу данных в ячейках диапазона.
Returns: Возвращает тип данных в ячейках диапазона. Тип <c>DataTypeParameter</c>.

Teigha.DatabaseServices.CellRange.IsBackgroundColorNone
Свойство позволяет проверить, задан ли цвет фона в ячейках диапазона.
Returns: Возвращает <c>true</c>, если цвет фона не задан. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.IsContentEditable
Свойство позволяет проверить, допустимо ли редактирование содержимого ячеек диапазона.
Returns: Возвращает <c>true</c>, если редактирование содержимого ячеек возможно.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.IsEmpty
Свойство позволяет проверить, является ли пустым данный диапазон.
Returns: Возвращает <c>true</c>, если диапазон является пустым.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.IsFormatEditable
Свойство позволяет проверить, возможно ли изменять формат ячеек данного диапазона.
Returns: Возвращает <c>true</c>, если формат ячеек диапазона можно редактировать.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.IsLinked
Свойство позволяет проверить наличие в ячейках диапазона внешних ссылок.
Returns: Возвращает <c>true</c>, если содержимое ячеек диапазона определяется внешними ссылками.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.IsMergeAllEnabled
Свойство позволяет проверить, включен ли режим слияния всех ячеек диапазона.
Returns: Возвращает <c>true</c>, если режим слияния всех ячеек диапазона включен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.IsMerged
Свойство позволяет проверить, выполнено ли слияние ячеек диапазона.
Returns: Возвращает <c>true</c>, если слияние ячеек диапазона выполнено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.IsNull
Свойство позволяет проверить, является ли нулевым объект диапазона ячеек.
Returns: Возвращает <c>true</c>, если объект диапазона ячеек является нулевым.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.IsSingleCell
Свойство позволяет проверить, состоит ли диапазон из единственной ячейки.
Returns: Возвращает <c>true</c>, если диапазон состоит из единственной ячейки.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CellRange.Item
Свойство возвращает ячейку с указанными индексами строки и столбца.
row: Индекс строки. Тип <c>int</c>.
column: Индекс столбца. Тип <c>int</c>.
Returns: Возвращает ячейку диапазона с указанными индексами строки и столбца.  Тип <c>Cell</c>.

Teigha.DatabaseServices.CellRange.LeftColumn
Свойство возвращает индекс левого столбца данного диапазона ячеек.
Returns: Возвращает индекс левого столбца диапазона. Тип <c>int</c>.

Teigha.DatabaseServices.CellRange.Parent
Свойство обеспечивает доступ к родительскому объекту данного диапазона ячеек.
Returns: Возвращает родительский объект диапазона. Тип <c>Object</c>.

Teigha.DatabaseServices.CellRange.ParentTable
Свойство возвращает родительскую таблицу данного диапазона ячеек.
Returns: Возвращает родительскую таблицу данного диапазона. Тип <c>Table</c>.

Teigha.DatabaseServices.CellRange.RightColumn
Свойство возвращает индекс правого столбца данного диапазона ячеек.
Returns: Возвращает индекс правого столбца диапазона.  Тип <c>int</c>.

Teigha.DatabaseServices.CellRange.State
Свойство управляет текущим состоянием ячеек данного диапазона.
Returns: Возвращает состояние ячеек данного диапазона из перечисления <c>CellStates</c>.

Teigha.DatabaseServices.CellRange.Style
Свойство позволяет управлять стилем ячеек диапазона.
Returns: Возвращает имя стиля ячеек. Тип <c>String</c>.

Teigha.DatabaseServices.CellRange.TextHeight
Свойство позволяет управлять высотой текста в ячейках диапазона.
Returns: Возвращает высоту текста в ячейках диапазона. Тип <c>double</c>.

Teigha.DatabaseServices.CellRange.TextStyleId
Свойство обеспечивает доступ к текстовому стилю ячеек диапазона.
Returns: Возвращает идентификатор объекта текстового стиля. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.CellRange.TopLeft
Свойство возвращает верхнюю левую ячейку диапазона.
Returns: Возвращает верхнюю левую ячейку диапазона. Тип <c>Cell</c>.

Teigha.DatabaseServices.CellRange.TopRow
Свойство возвращает индекс верхней строки этого диапазона ячеек.
Returns: Возвращает индекс верхней строки диапазона. Тип <c>int</c>.