Teigha.Geometry.PointOnCurve2d
Класс <c>PointOnCurve2d</c> представляет точку на параметрической 2D-кривой.

Teigha.Geometry.PointOnCurve2d.#ctor
Конструктор по умолчанию класса <c>PointOnCurve2d</c>.

Teigha.Geometry.PointOnCurve2d.#ctor(Teigha.Geometry.Curve2d)
Конструктор класса <c>PointOnCurve2d</c>.
Создает на указанной кривой точку с нулевым значением параметра.
curve: Входная кривая. Тип <c>Curve2d</c>.

Teigha.Geometry.PointOnCurve2d.#ctor(Teigha.Geometry.Curve2d,System.Double)
Конструктор класса <c>PointOnCurve2d</c>.
Создает на указанной кривой точку с заданным значением параметра.
curve: Входная кривая. Тип <c>Curve2d</c>.
parameter: Значение параметра для создаваемой точки. Тип <c>double</c>.

Teigha.Geometry.PointOnCurve2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>PointOnCurve2d</c>.

Teigha.Geometry.PointOnCurve2d.GetDerivative(System.Int32)
Метод вычисляет производную первого или второго порядка в данной точке на кривой.
order: Входной порядок производной. Тип <c>int</c>. Может принимать значения 1 или 2.
Returns: Возвращает вектор производной порядка <c>order</c> в данной точке на кривой.
Тип <c>Vector2d</c>.

Teigha.Geometry.PointOnCurve2d.GetDerivative(System.Int32,System.Double)
Метод переопределяет для данного объекта значение параметра и вычисляет в новой позиции производную кривой указанного порядка.
order: Входной порядок производной. Тип <c>int</c>. Может принимать значения 1 или 2.
parameter: Новое значение параметра в данной точке на кривой. Тип <c>double</c>.
Returns: Возвращает вектор производной порядка <c>order</c> в данной точке на кривой.
Тип <c>Vector2d</c>.

Teigha.Geometry.PointOnCurve2d.GetDerivative(System.Int32,Teigha.Geometry.Curve2d,System.Double)
Метод переопределяет для данного объекта кривую и значение параметра в точке и вычисляет в этой точке производную указанного порядка.
order: Входной порядок производной. Тип <c>int</c>. Может принимать значения 1 или 2.
curve: Новая кривая. Тип <c>Curve2d</c>.
parameter: Новое значение параметра в данной точке на кривой. Тип <c>double</c>.
Returns: Возвращает вектор производной порядка <c>order</c> в данной точке на кривой.
Тип <c>Vector2d</c>.

Teigha.Geometry.PointOnCurve2d.GetPointAtParameter(System.Double)
Метод переопределяет значение параметра у данного объекта и возвращает точку на кривой, соответствующую этому параметру.
parameter: Новое значение параметра. Тип <c>double</c>.
Returns: Возвращает точку, соответствующую значению параметра <c>parameter</c>. Тип <c>Point2d</c>.

Teigha.Geometry.PointOnCurve2d.GetPointOnCurve(Teigha.Geometry.Curve2d,System.Double)
Метод переопределяет для данного объекта кривую и значение параметра и возвращает соответствующую этому значению точку на указанной кривой.
curve: Новая кривая. Тип <c>Curve2d</c>.
parameter: Новое значение параметра. Тип <c>double</c>.
Returns: Возвращает на кривой <c>curve</c> точку, соответствующую значению параметра <c>parameter</c>. Тип <c>Point2d</c>.

Teigha.Geometry.PointOnCurve2d.Curve
Свойство <c>Curve</c> обеспечивает доступ к кривой, точку на которой представляет данный объект.
Returns: Возвращает двумерную кривую. Тип <c>Curve2d</c>.

Teigha.Geometry.PointOnCurve2d.Parameter
Свойство <c>Parameter</c> обеспечивает доступ к значению параметра точки на кривой, которую представляет данный объект.
Returns: Возвращает значение параметра точки на кривой.
Тип <c>double</c>.

Teigha.Geometry.PointOnCurve2d.Point
Свойство <c>Point</c> возвращает точку, которую представляет данный объект.
Returns: Возвращает точку на кривой. Тип <c>Point2d</c>.