Teigha.DatabaseServices.SectionHitTestInfo.Index
Свойство <c>Index</c> представляет отсчитываемый от нуля индекс сегмента на линии сечения, который проходит рядом или через точку попадания.
Returns: Возвращает индекс сегмента. Тип <c>int</c>.

Teigha.DatabaseServices.SectionHitTestInfo.PtOnSegment
Свойство <c>PtOnSegment</c> представляет координаты трехмерной точки на сегменте секущей плоскости, которая соответствует точке попадания.
Returns: Возвращает координаты трехмерной точки. Тип <c>Point3d</c>.

Teigha.DatabaseServices.SectionHitTestInfo.SubItem
Свойство <c>SubItem</c> обеспечивает доступ к флагам попадания указанной пользователем точки на индикатор секущей плоскости.
Returns: Возвращает флагам попадания точки в индикатор секущей плоскости.
Значение из перечисления <c>SectionSubItem</c>.