Teigha.DatabaseServices.MlineStyleElementCollection
Класс представляет коллекцию объектов <c>MlineStyleElement</c>.

Teigha.DatabaseServices.MlineStyleElementCollection.Add(Teigha.DatabaseServices.MlineStyleElement,System.Boolean)
Метод предназначен для добавления в коллекцию объекта <c>MlineStyleElement</c>.
element: Добавляемый в коллекцию элемент. Тип <c>MlineStyleElement</c>.
checkIfReferenced: Флаг, предписывающий проверку на наличие ссылок на <c>element</c>. Тип <c>bool</c>.
Returns: Возвращает индекс нового элемента коллекции.  Тип <c>int</c>.

Teigha.DatabaseServices.MlineStyleElementCollection.CopyTo(array&lt;MlineStyleElement&gt;,System.Int32)
Метод копирует элементы данной коллекции в указанный массив, начиная с заданной индексом позиции.
arr: Целевой массив. Тип <c>MlineStyleElement[]</c>.
index: Индекс в массиве, начиная с которого в массив копируются элементы коллекции.  Тип <c>int</c>.

Teigha.DatabaseServices.MlineStyleElementCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает перечислитель. Тип <c>MlineStyleElementCollectionEnumerator</c>.

Teigha.DatabaseServices.MlineStyleElementCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции элемент <c>MlineStyleElement</c> с указанным индексом.
index: Индекс удаляемого элемента коллекции. Тип <c>int</c>.  Индексы отсчитываются от нуля.

Teigha.DatabaseServices.MlineStyleElementCollection.Count
Свойство возвращает текущее количество элементов в данной коллекции.
Returns: Возвращает количество элементов в коллекции.
Тип <c>int</c>.

Teigha.DatabaseServices.MlineStyleElementCollection.default
Свойство возвращает элемент данной коллекции с указанным индексом.
index: Индекс элемента коллекции.  Тип <c>int</c>.
Returns: Возвращает элемент коллекции с индексом <c>index</c>.
Тип <c>MlineStyleElement</c>.