Teigha.DatabaseServices.Ellipse
Класс Ellipse реализует в базе данных объекты эллипса и эллиптической дуги.

Teigha.DatabaseServices.Ellipse.#ctor
Конструктор класса Ellipse по умолчанию.

Teigha.DatabaseServices.Ellipse.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double)
Конструктор класса Ellipse. Создает эллипс (или эллиптическую дугу) с указанными параметрами.
center: Центр эллипса в мировой системе координат (WCS). Тип <c>Point3d</c>.
unitNormal: Единичный вектор нормали к плоскости, в которой располагается эллипс. Задается в WCS. Тип <c>Vector3d</c>.
majorAxis: Направление большой оси эллипса в WCS. Тип <c>Vector3d</c>. По модулю составляет половину главной оси эллипса.
radiusRatio: Отношение малого радиуса эллипса к большому. Тип <c>double</c>. Для получения действительного эллипса этот параметр не должен быть меньше 1E-6 или больше 1.0.
startAngle: Начальный угол эллиптической дуги. Тип <c>double</c>.
endAngle: Конечный угол эллиптической дуги. Тип <c>double</c>.

Teigha.DatabaseServices.Ellipse.GetAngleAtParameter(System.Double)
Метод позволяет определить значение угла для точки на эллипсе, заданной параметрически.
value: Значение параметра в радианах. Тип <c>double</c>.
Returns: Возвращает угол в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.Ellipse.GetParameterAtAngle(System.Double)
Метод позволяет определить значение параметра, соответствующее указанному значению угла.
angle: Входное значение угла в радианах. Тип <c>double</c>.
Returns: Возвращает значение параметра в интервале от 0 до 2PI. Тип <c>double</c>.

Teigha.DatabaseServices.Ellipse.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double)
Метод позволяет задать параметрам этого эллипса указанные значения.
center: Центр эллипса в мировой системе координат (WCS). Тип Point3d.
unitNormal: Единичный вектор нормали плоскости, в которой располагается эллипс. Задается в WCS. Тип Vector3d.
majorAxis: Направление большой оси эллипса в WCS. Тип <c>Vector3d</c>. По модулю составляет половину главной оси эллипса.
radiusRatio: Отношение малого радиуса эллипса к большому. Тип <c>double</c>. Для получения действительного эллипса этот параметр не должен быть меньше 1E-6 или больше 1.0.
startAngle: Начальный угол эллиптической дуги в радианах. Тип <c>double</c>.
endAngle: Конечный угол эллиптической дуги в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.Ellipse.Center
Свойство Center позволяет задать или получить точку центра эллипса или эллиптической дуги (в системе координат WCS).
Returns: Возвращает центр эллипса или эллиптической дуги.  Тип <c>Point3d</c>.

Teigha.DatabaseServices.Ellipse.EndAngle
Свойство EndAngle предоставляет доступ к конечному углу эллипса или эллиптической дуги в радианах.
Returns: Возвращает конечный угол. Тип <c>double</c>.

Teigha.DatabaseServices.Ellipse.EndParam
Свойство EndParam обеспечивает доступ к конечному значению параметра данного эллипса.
Returns: Возвращает конечный параметр эллипса. Тип <c>double</c>.

Teigha.DatabaseServices.Ellipse.IsNull
Свойство IsNull позволяет определить, действителен ли данный эллипс или эллиптическая дуга.
Returns: Возвращает <c>true</c>, если эллипс (или эллиптическая дуга) оказался недействительным.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Ellipse.MajorAxis
Свойство MajorAxis возвращает направление большой оси эллипса или эллиптической дуги.
Returns: Возвращает направление большой оси эллипса или эллиптической дуги.  Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Ellipse.MajorRadius
Свойство MajorRadius возвращает длину большой полуоси эллипса или эллиптической дуги.
Returns: Возвращает длину большой полуоси эллипса. Тип <c>double</c>.

Teigha.DatabaseServices.Ellipse.MinorAxis
Свойство MinorAxis возвращает направление малой оси эллипса или эллиптической дуги.
Returns: Возвращает направление малой оси эллипса. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Ellipse.MinorRadius
Свойство MinorRadius возвращает длину малой полуоси эллипса или эллиптической дуги.
Returns: Возвращает длину малой полуоси эллипса. Тип <c>double</c>.

Teigha.DatabaseServices.Ellipse.Normal
Свойство Normal возвращает вектор нормали плоскости, которой принадлежит данный эллипс или эллиптическая дуга.
Returns: Возвращает вектор нормали плоскости. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Ellipse.RadiusRatio
Свойство RadiusRatio возвращает отношение длин малой и большой полуосей данного эллипса или эллиптической дуги.
Returns: Возвращает отношение длин полуосей эллипса или эллиптической дуги. Тип <c>double</c>.

Teigha.DatabaseServices.Ellipse.StartAngle
Свойство StartAngle возвращает значение начального угла данного эллипса или эллиптической дуги.
Returns: Возвращает значение начального угла эллипса или эллиптической дуги.  Тип <c>double</c>.

Teigha.DatabaseServices.Ellipse.StartParam
Свойство StartParam обеспечивает доступ к значению начального параметра эллипса или эллиптической дуги.
Returns: Возвращает значение начального параметра эллипса в радианах. Тип <c>double</c>.