Teigha.Geometry.Curve3d
Этот абстрактный класс является базовым классом для всех трехмерных кривых.

Teigha.Geometry.Curve3d.Create(IntPtr,System.Boolean)
Метод создает объект Curve3d на основе переданного указателя.
unmanagedPointer: Указатель на объект; тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает новый объект типа <c>Curve3d</c>.

Teigha.Geometry.Curve3d.EvaluatePoint(System.Double)
Метод позволяет получить точку на кривой, которая соответствует указанному значению параметра.
value: Входное значение параметра, которое соответствует искомой точке. Тип <c>double</c>.
Returns: Возвращает точку <c>Point3d</c>, которая соответствует значению параметра <c>value</c>.

Teigha.Geometry.Curve3d.Explode(Teigha.Geometry.Interval)
Метод разбивает кривую на составляющие ее подкривые.
interval: Интервал кривой, на котором выполняется разбиение на составляющие подкривые. Тип <c>Interval</c>.
Returns: Возвращает массив кривых. Тип <c>Curve3d[]</c>.

Teigha.Geometry.Curve3d.GetArea(System.Double,System.Double)
Метод вычисляет площадь под кривой на заданном параметрическом интервале.
startingParameter: Значение параметра начальной точки интервала. Тип <c>double</c>.
endingParameter: Значение параметра конечной точки интервала (должно превышать значение <c>startParameter</c>). Тип <c>double</c>.
Returns: Возвращает площадь под кривой.  Тип <c>double</c>.

Teigha.Geometry.Curve3d.GetArea(System.Double,System.Double,Teigha.Geometry.Tolerance)
Метод вычисляет площадь под кривой на заданном параметрическом интервале и с указанным допуском.
startingParameter: Значение параметра начальной точки интервала. Тип <c>double</c>.
endingParameter: Значение параметра конечной точки интервала (должно превышать значение <c>startParameter</c>). Тип <c>double</c>.
tolerance: Значение допуска. Тип <c>double</c>.
Returns: Возвращает площадь под кривой.  Тип <c>double</c>.

Teigha.Geometry.Curve3d.GetBoundBlockOf(Teigha.Geometry.Interval)
Метод позволяет определить ориентированный граничный бокс для участка данной кривой на указанном параметрическом подынтервале.
range: Параметрический подынтервал участка кривой, для которого строится ориентированный граничный бокс. Тип <c>Interval</c>.
Returns: Возвращает направленный ориентированный граничный бокс. Тип <c>BoundBlock3d</c>.
Notes
Ориентированный граничный бокс представляет собой прямоугольный параллелепипед минимального объема, в котором целиком помещается целевой геометрический объект. Ориентация такого бокса определяется пространственной ориентацией геометрического объекта, таким образом, ребра этого бокса не обязаны быть параллельными координатным осям.

Teigha.Geometry.Curve3d.GetClosestPointTo(Teigha.Geometry.Curve3d)
Метод позволяет найти ближайшие точки между данной кривой и кривой, переданной в аргументе.
curve3d: Кривая, на которой следует искать ближайшие точки.  Тип <c>Curve3d</c>.
Returns: Возвращает массив точек. Тип <c>PointOnCurve3d[]</c>.

Teigha.Geometry.Curve3d.GetClosestPointTo(Teigha.Geometry.Curve3d,Teigha.Geometry.Tolerance)
Метод позволяет найти с заданной точностью ближайшие точки между данной кривой и кривой, переданной в аргументе.
curve3d: Кривая, для которой следует искать ближайшие точки.  Тип <c>Curve3d</c>.
tolerance: Допуск, определяющий точность геометрических построений. Тип <c>Tolerance</c>.
Returns: Возвращает массив точек. Тип <c>PointOnCurve3d[]</c>.

Teigha.Geometry.Curve3d.GetClosestPointTo(Teigha.Geometry.Point3d)
Метод находит точку на данной кривой, ближайшую к указанной точке.
point: Входная точка, для которой следует найти ближайшую к ней точку на кривой.  Тип <c>Point3d</c>.
Returns: Возвращает точку на кривой.  Тип <c>PointOnCurve3d</c>.

Teigha.Geometry.Curve3d.GetClosestPointTo(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод находит точку на данной кривой, ближайшую к указанной точке в пределах указанного допуска.
point: Входная точка, для которой ищется ближайшая к ней точка на кривой.  Тип <c>Point3d</c>.
tolerance: Допуск, определяющий точность геометрических построений. Тип <c>Tolerance</c>.
Returns: Возвращает точку на кривой.  Тип <c>PointOnCurve3d</c>.

Teigha.Geometry.Curve3d.GetDistanceTo(Teigha.Geometry.Curve3d,Teigha.Geometry.Tolerance)
Метод вычисляет с заданной точностью минимальное расстояние между точками данной кривой и кривой, переданной в метод первым аргументом.
curve: Кривая, до которой вычисляются расстояния.  Тип <c>Curve3d</c>.
tolerance: Геометрический допуск, определяющий точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает минимальное расстояние между кривыми. Тип <c>double</c>.

Teigha.Geometry.Curve3d.GetDistanceTo(Teigha.Geometry.Curve3d)
Метод вычисляет минимальное расстояние между точками данной кривой и кривой, переданной в метод первым аргументом.
curve: Кривая, до которой вычисляются расстояния. Тип <c>Curve3d</c>.
Returns: Возвращает минимальное расстояние между кривыми. Тип <c>double</c>.

Teigha.Geometry.Curve3d.GetDistanceTo(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод вычисляет с заданной точностью минимальное расстояние между указанной точкой и данной кривой.
point: Точка, до которой вычисляется расстояние. Тип <c>Point3d</c>.
tolerance: Геометрический допуск, определяющий точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает минимальное расстояние от кривой до точки. Тип <c>double</c>.

Teigha.Geometry.Curve3d.GetDistanceTo(Teigha.Geometry.Point3d)
Метод вычисляет минимальное расстояние от указанной точки до данной кривой.
point: Точка, до которой вычисляется расстояние. Тип <c>Point3d</c>.
Returns: Возвращает минимальное расстояние от точки до кривой. Тип <c>double</c>.

Teigha.Geometry.Curve3d.GetInterval
Метод позволяет определить параметрический интервал данной кривой.
Returns: Возвращает параметрический интервал данной кривой. Тип <c>Interval</c>.

Teigha.Geometry.Curve3d.GetLength(System.Double,System.Double,System.Double)
Метод определяет длину вдоль кривой между двумя точками кривой, заданными параметрически.
fromParameter: Начальный параметр. Тип <c>double</c>.
toParameter: Конечный параметр. Тип <c>double</c>.
tolerance: Точность вычислений. Тип <c>double</c>.
Returns: Возвращает длину вдоль кривой. Тип <c>double</c>.

Teigha.Geometry.Curve3d.GetNormalPoint(Teigha.Geometry.Point3d)
Метод позволяет найти точку на кривой, в которой нормаль к кривой проходит через указанную точку.
point: Точка, через которую требуется провести нормаль к кривой.  Тип <c>Point3d</c>.
Returns: Возвращает точку на кривой. Тип <c>PointOnCurve3d</c>.

Teigha.Geometry.Curve3d.GetNormalPoint(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет найти точку на кривой, в которой нормаль к кривой проходит через заданную точку в пределах указанного допуска.
point: Точка в пространстве, через которую должна пройти нормаль к кривой. Тип <c>Point3d</c>.
tolerance: Точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает точку на кривой. Тип <c>PointOnCurve3d</c>.

Teigha.Geometry.Curve3d.GetOrthoBoundBlockOf(Teigha.Geometry.Interval)
Метод позволяет определить граничный бокс для участка кривой на заданном параметрическом подынтервале.
Ребра возвращаемого бокса ориентированы по осям системы координат.
range: Параметрический подынтервал участка кривой, для которого строится ограничивающий бокс. Тип <c>Interval</c>.
Returns: Возвращает ограничивающий бокс. Тип <c>BoundBlock3d</c>.
Notes
Граничный бокс представляет собой прямоугольный параллелепипед минимального объема, ребра которого параллельны координатным осям и в котором целиком помещается целевой геометрический объект. Ориентация граничного бокса не зависит от пространственной ориентации геометрического объекта.

Teigha.Geometry.Curve3d.GetOrthoProjectEntity(Teigha.Geometry.Plane,Teigha.Geometry.Tolerance)
Метод создает геометрический объект, являющийся ортогональной проекцией кривой на заданную плоскость. Геометрические построения выполняются с указанной точностью.
projectionPlane: Плоскость, на которую выполняется проецирование.  Тип <c>Plane</c>.
tolerance: Точность выполняемых вычислений.  Тип <c>Tolerance</c>.
Returns: Возвращает спроецированный объект.  Тип <c>Entity3d</c>.

Teigha.Geometry.Curve3d.GetOrthoProjectEntity(Teigha.Geometry.Plane)
Метод позволяет получить геометрический объект, являющийся ортогональной проекцией кривой на заданную плоскость.
projectionPlane: Плоскость, на которую выполняется проецирование.  Тип <c>Plane</c>.
Returns: Возвращает спроецированный объект.  Тип <c>Entity3d</c>.

Teigha.Geometry.Curve3d.GetParameterAtLength(System.Double,System.Double,System.Boolean,System.Double)
Метод позволяет получить значение параметра для точки на кривой, расстояние вдоль кривой до которой от указанной параметрически начальной точки равно заданной длине.
datumParameter: Значение параметра для начальной точки. Тип <c>double</c>.
length: Целевое расстояние между точками, вычисляемое вдоль кривой. Тип <c>double</c>.
direction: Направление изменения параметра. Тип <c>bool</c>.
tolerance: Точность вычисления искомого параметра. Тип <c>double</c>.
Returns: Возвращает значение параметра для точки на кривой. Тип <c>double</c>.

Teigha.Geometry.Curve3d.GetParameterOf(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет получить с указанной точностью значение параметра для заданной точки на кривой.
point: Точка на кривой. Тип <c>Point3d</c>.
tolerance: Точность вычисления параметра. Тип <c>Tolerance</c>.
Returns: Возвращает значение параметра для заданной точки на кривой. Тип <c>double</c>.

Teigha.Geometry.Curve3d.GetParameterOf(Teigha.Geometry.Point3d)
Метод позволяет получить значение параметра для заданной точки на кривой.
point: Точка на кривой. Тип <c>Point3d</c>.
Returns: Возвращает значение параметра для точки на кривой. Тип <c>double</c>.

Teigha.Geometry.Curve3d.GetProjectedClosestPointTo(Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d)
Метод находит точки на данной кривой и указанной кривой <c>Curve3d</c>, которые оказываются ближайшими точками на проекциях этих двух кривых на указанную плоскость.
curve3d: Входная 3D-кривая. Тип <c>Curve3d</c>.
projectDirection: Нормаль плоскости проецирования. Тип <c>Vector3d</c>.
Returns: Возвращает массив точек на 3D-кривой.  Тип <c>PointOnCurve3d[]</c>.
Notes
Данный метод используется в основном в задачах графической визуализации, где <c>projectDirection</c> служит направлением взгляда.
В этом случае метод возвращает точки двух кривых, которые в проекции кажутся ближайшими точками этих кривых (хотя, разумеется, в действительности ближайшими точками они могут и не быть).

Teigha.Geometry.Curve3d.GetProjectedClosestPointTo(Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод находит точки на данной кривой и указанной кривой <c>Curve3d</c>, которые оказываются ближайшими точками на проекциях этих двух кривых на заданную плоскость.  Метод позволяет задавать точность вычислений.
curve3d: Другая 3D-кривая. Тип <c>Curve3d</c>.
projectDirection: Нормаль плоскости проецирования. Тип <c>Vector3d</c>.
tolerance: Точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает массив "ближайших" точек на 3D-кривой.  Тип <c>PointOnCurve3d[]</c>.

Teigha.Geometry.Curve3d.GetProjectedClosestPointTo(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод находит точку на этой кривой, которая при проецировании кривой на заданную плоскость оказывается ближайшей точкой к проекции переданной в метод точки.  Метод использует указанную точность вычислений.
point: Заданная внешняя точка. Тип <c>Point3d</c>.
projectDirection: Нормаль плоскости проецирования. Тип <c>Vector3d</c>.
tolerance: Точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает точку на кривой. Тип <c>PointOnCurve3d</c>.

Teigha.Geometry.Curve3d.GetProjectedClosestPointTo(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод находит точку на этой кривой, которая при проецировании кривой на заданную плоскость оказывается ближайшей точкой к проекции указанной точки.
point: Заданная внешняя точка. Тип <c>Point3d</c>.
projectDirection: Нормаль плоскости проецирования. Тип <c>Vector3d</c>.
Returns: Возвращает точку на кривой. Тип <c>PointOnCurve3d</c>.
Notes
Данный метод используется в основном в задачах графической визуализации, где <c>projectDirection</c> служит направлением взгляда.
В этом случае метод возвращает точку на кривой, которая кажется ближайшей к переданной в метод внешней точке (хотя в действительности ближайшей точкой она может и не быть).

Teigha.Geometry.Curve3d.GetProjectedEntity(Teigha.Geometry.Plane,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет получить объект, который является результатом проецирования данной кривой в указанном направлении на заданную плоскость.
Метод использует указанную точность вычислений.
projectionPlane: Плоскость проецирования. Тип <c>Plane</c>.
projectDirection: Направление проецирования. Тип <c>Vector3d</c>.
tolerance: Точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает результат проецирования в виде объекта <c>Entity3d</c>.
Notes
Возвращаемый объект-проекция может отличаться по типу от исходной кривой, и может даже не быть кривой вовсе. Например, прямая линия проецируется в точку, если она параллельна вектору <c>projectDirection</c>.

Teigha.Geometry.Curve3d.GetProjectedEntity(Teigha.Geometry.Plane,Teigha.Geometry.Vector3d)
Метод позволяет получить объект, который является результатом проецирования данной кривой в указанном направлении на заданную плоскость.
projectionPlane: Плоскость проецирования. Тип <c>Plane</c>.
projectDirection: Направление проецирования. Тип <c>Vector3d</c>.
Returns: Возвращает результат проецирования в виде объекта <c>Entity3d</c>.
Notes
Возвращаемый объект-проекция может отличаться по типу от исходной кривой, и может даже не быть кривой вовсе.
Например, прямая линия проецируется в точку, если она параллельна вектору <c>projectDirection</c>.

Teigha.Geometry.Curve3d.GetReverseParameterCurve
Метод изменяет параметрическое направление кривой на противоположное.
Returns: Возвращает кривую <c>Curve3d</c> с инвертированным направлением изменения параметра.

Teigha.Geometry.Curve3d.GetSamplePoints(System.Double,System.Double,System.Double)
Метод позволяет получить массив точек на кривой в указанном параметрическом интервале.
fromParameter: Значение параметра, представляющее начало параметрического интервала. Тип <c>double</c>.
toParameter: Значение параметра, представляющее конец параметрического интервала. Тип <c>double</c>.
chordHeight: Высота хорды, определяющая шаг между соседними точками. Тип <c>double</c>.
Returns: Возвращает массив точек на кривой.  Тип <c>PointOnCurve3d[].
</c>

Teigha.Geometry.Curve3d.GetSamplePoints(System.Int32)
Метод формирует массив из указанного количества точек на кривой, равноотстоящих друг от друга в параметрическом представлении.
numSample: Заказанное количество точек, равноотстоящих друг от друга параметрически.  Тип <c>int</c>.
Returns: Возвращает массив точек на кривой.  Тип <c>PointOnCurve3d[]</c>.

Teigha.Geometry.Curve3d.GetSplitCurves(System.Double)
Метод делит кривую на два сегмента в точке с указанным значением параметра.
value: Значение параметра для точки, в которой выполняется разделение кривой на два сегмента. Тип <c>double</c>.
Returns: Возвращает массив из двух кривых, являющихся результатом разделения кривой. Тип <c>Curve3d[]</c>.
Notes
Если указанное значение параметра <c>value</c> оказывается за пределами параметрического интервала кривой или, если оно соответствует начальной или конечной точке кривой, массив может содержать нулевые объекты.

Teigha.Geometry.Curve3d.GetTrimmedOffset(System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.OffsetCurveExtensionType,Teigha.Geometry.Tolerance)
Метод позволяет получить одну или несколько кривых смещением данной кривой (с возможной обрезкой) при заданной точности вычислений.
distance: Величина смещения. Тип <c>double</c>.
planeNormal: Вектор нормали к плоскости кривой. Тип <c>Vector3d</c>.
extensionType: Значение из перечисления <c>OffsetCurveExtensionType</c>, которое определяет вариант смещения в точках излома исходной кривой (точки разрыва C1).
tolerance: Геометрический допуск. Тип <c>Tolerance</c>.
Returns: Возвращает массив кривых, полученных смещением.

Teigha.Geometry.Curve3d.GetTrimmedOffset(System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.OffsetCurveExtensionType)
Метод позволяет получить одну или несколько кривых смещением данной кривой (с возможной обрезкой).
distance: Величина смещения. Тип <c>double</c>.
planeNormal: Вектор нормали к плоскости кривой. Тип <c>Vector3d</c>.
extensionType: Значение из перечисления <c>OffsetCurveExtensionType</c>, которое определяет вариант смещения в точках излома исходной кривой (точки разрыва C1).
Returns: Возвращает массив кривых, полученных смещением.

Teigha.Geometry.Curve3d.IsClosed(Teigha.Geometry.Tolerance)
Метод проверяет, является ли данная кривая замкнутой в пределах заданного допуска.
tolerance: Допуск, в пределах которого проверяется совпадение концов кривой.  Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если кривая является замкнутой, и <c>false</c> в противном случае.

Teigha.Geometry.Curve3d.IsClosed
Метод проверяет,является ли данная кривая замкнутой.
Returns: Возвращает <c>true</c>, если начальная и конечная точки кривой совпадают. В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve3d.IsCoplanarWith(Teigha.Geometry.Curve3d,[Out]Plane%,Teigha.Geometry.Tolerance)
Метод проверяет, является ли переданная в метод кривая компланарной данной кривой при заданной точности вычислений.
В случае компланарности обеих кривых метод возвращает их общую плоскость.
curve3d: Произвольная 3D-кривая, компланарность с которой требуется проверить. Тип <c>Curve3d</c>.
plane: Плоскость, в которой располгаются обе кривые в случае их компланарности. Тип <c>Plane</c>.
tolerance: Требуемая точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c> в случае компланарности кривых, в противном случае возвращает <c>false</c>.
Notes
Возвращаемое значение <c>plane</c> действительно только в том случае, когда метод возврашает <c>true</c>.

Teigha.Geometry.Curve3d.IsCoplanarWith(Teigha.Geometry.Curve3d,[Out]Plane%)
Метод проверяет, является ли переданная в метод кривая компланарной данной кривой.
В случае компланарности обеих кривых метод возвращает их общую плоскость.
curve3d: Произвольная 3D-кривая, компланарность с которой требуется проверить. Тип <c>Curve3d</c>.
plane: Плоскость, в которой располгаются обе кривые в случае их компланарности. Тип <c>Plane</c>.
Returns: Возвращает <c>true</c> в случае компланарности кривых, в противном случае возвращает <c>false</c>.
Notes
Возвращаемое значение <c>plane</c> действительно только в том случае, когда метод возврашает <c>true</c>.

Teigha.Geometry.Curve3d.IsDegenerate([Out]Entity3d%,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли кривая вырожденной в пределах указанной точности вычислений, и если да, то возвращает тип объекта, в который выродилась кривая.
Returns: Возвращает true в случае, если данная кривая является вырожденной, иначе - false.

Teigha.Geometry.Curve3d.IsDegenerate([Out]Entity3d%)
Метод позволяет проверить, является ли кривая вырожденной, и если да, то возвращает тип объекта, в который выродилась кривая.
Returns: Возвращает <c>true</c> в случае, если данная кривая является вырожденной, иначе - <c>false</c>.

Teigha.Geometry.Curve3d.IsLinear([Out]Line3d%,Teigha.Geometry.Tolerance)
Метод проверяет, является ли данная кривая линейной в пределах заданного геометрического допуска.
line: Линия, с которой совпадает кривая в случае ее прямолинейности. Тип <c>Line3d</c>.
tolerance: Требуемая точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если кривая является линейной, и <c>false</c> в противном случае.

Teigha.Geometry.Curve3d.IsLinear([Out]Line3d%)
Метод проверяет, является ли данная кривая линейной.
line: Линия, с которой совпадает кривая в случае ее прямолинейности. Тип <c>Line3d</c>.
Returns: Возвращает <c>true</c>, если кривая является линейной, и <c>false</c> в противном случае.

Teigha.Geometry.Curve3d.IsOn(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет установить, находится ли указанная точка на данной кривой в пределах заданного допуска.
point: Произвольная точка <c>Point3d</c>.
tolerance: Требуемая точность проверки. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c> в случае, если указанная точка находится на данной кривой в пределах допуска <c>tolerance</c>, иначе - <c>false</c>.

Teigha.Geometry.Curve3d.IsOn(Teigha.Geometry.Point3d)
Метод позволяет установить, находится ли указанная точка на данной кривой.
point: Произвольная точка <c>Point3d</c>.
Returns: Возвращает <c>true</c> в случае, если указанная точка находится на данной кривой, иначе - <c>false</c>.

Teigha.Geometry.Curve3d.IsOn(Teigha.Geometry.Point3d,[Out]double%)
Метод позволяет установить, находится ли указанная точка на данной кривой. Дополнительно возвращает значение параметра для лежащей на кривой точки.
point: Произвольная точка <c>Point3d</c>.
value: Выходное значение параметра для точки на кривой (если точка лежит на кривой). Тип <c>double</c>.
Returns: Возвращает <c>true</c> в случае, если указанная точка находится на данной кривой, иначе - <c>false</c>.

Teigha.Geometry.Curve3d.IsOn(Teigha.Geometry.Point3d,[Out]double%,Teigha.Geometry.Tolerance)
Метод позволяет установить, находится ли указанная точка на данной кривой в пределах заданного допуска.
point: Произвольная точка <c>Point3d</c>.
value: Выходное значение параметра для точки на кривой (если точка лежит на кривой). Тип <c>double</c>.
tolerance: Геометрический допуск. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c> в случае, если точка <c>point</c> находится на данной кривой, иначе - <c>false</c>.

Teigha.Geometry.Curve3d.IsOn(System.Double,Teigha.Geometry.Tolerance)
Метод позволяет установить, находится ли указанное значение параметра в пределах параметрического интервала данной кривой при заданной точности вычислений.
value: Входное значение параметра для точки на кривой. Тип <c>double</c>.
tolerance: Входная точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c> в случае, если точка <c>point</c> находится на данной кривой, иначе - <c>false</c>.

Teigha.Geometry.Curve3d.IsOn(System.Double)
Метод позволяет установить, находится ли указанное значение параметра в пределах параметрического интервала данной кривой.
value: Входное значение параметра для точки на кривой. Тип <c>double</c>.
Returns: Возвращает <c>true</c> в случае, если точка <c>point</c> находится на данной кривой, иначе - <c>false</c>.

Teigha.Geometry.Curve3d.IsPeriodic([Out]double%)
Метод позволяет установить, является ли данная кривая периодической.
period: Выходное значение периода кривой (если она периодическая). Тип <c>double</c>.
Returns: Возвращает <c>true</c>, если кривая является периодической, иначе - <c>false</c>.

Teigha.Geometry.Curve3d.IsPlanar([Out]Plane%,Teigha.Geometry.Tolerance)
Метод проверяет, является ли данная кривая плоской в пределах указанного допуска.
plane: Плоскость, которой принадлежит кривая (если она плоская). Тип <c>Plane</c>.
tolerance: Заданный допуск. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c> в случае, если кривая является плоской, иначе - <c>false</c>.

Teigha.Geometry.Curve3d.IsPlanar([Out]Plane%)
Метод проверяет, является ли данная кривая плоской.
plane: Плоскость, которой принадлежит кривая (если она плоская). Тип <c>Plane</c>.
Returns: Возвращает <c>true</c> в случае, если кривая является плоской, иначе - <c>false</c>.

Teigha.Geometry.Curve3d.SetInterval(Teigha.Geometry.Interval)
Метод переопределяет параметрический интервал данной кривой.
value: Входной параметрический интервал, на котором определена кривая. Тип <c>Interval</c>.

Teigha.Geometry.Curve3d.BoundBlock
Свойство позволяет получить ориентированный граничный бокс для данной кривой.
Returns: Возвращает ориентированный граничный бокс для данной кривой. Тип <c>BoundBlock3d</c>.

Teigha.Geometry.Curve3d.EndPoint
Свойство <c>EndPoint</c> возвращает конечную точку кривой.
Returns: Возвращает конечную точку кривой. Тип <c>Point3d</c>.

Teigha.Geometry.Curve3d.HasEndPoint
Свойство позволяет установить, имеет ли данная кривая конечную точку.
Returns: Возвращает <c>true</c>, если кривая имеет конечную точку.
Возвращает <c>false</c>, если параметрический интервал кривой сверху не ограничен.

Teigha.Geometry.Curve3d.HasStartPoint
Свойство позволяет установить, имеет ли данная кривая начальную точку.
Returns: Возвращает <c>true</c>, если кривая имеет начальную точку.
Возвращает <c>false</c>, если параметрический интервал кривой снизу не ограничен.

Teigha.Geometry.Curve3d.OrthoBoundBlock
Свойство позволяет получить граничный бокс для данной кривой.
Ребра бокса ориентированы по осям системы координат.
Returns: Возвращает граничный бокс для данной кривой. Тип <c>BoundBlock3d</c>.

Teigha.Geometry.Curve3d.StartPoint
Свойство возвращает начальную точку кривой.
Returns: Возвращает начальную точку кривой. Тип <c>Point3d</c>.