Teigha.BoundaryRepresentation.BrepVertexEnumerator
Класс <c>BrepVertexEnumerator</c> представляет перечислитель коллекции вершин граничного представления B-Rep.

Teigha.BoundaryRepresentation.BrepVertexEnumerator.Current
Свойство <c>Current</c> представляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает вершину B-Rep, которая является текущим элементом данного перечислителя.
Тип <c>Vertex</c>.