Teigha.DatabaseServices.GroundPlaneBackground
Этот класс реализует объект фона в нулевой плоскости в видовом экране.

Teigha.DatabaseServices.GroundPlaneBackground.#ctor
Конструктор по умолчанию класса <c>GroundPlaneBackground</c>.

Teigha.DatabaseServices.GroundPlaneBackground.ColorGroundPlaneFar
Свойство предоставляет доступ к цвету фона на дальнем плане (ближе к горизонту).
Returns: Возвращает цвет объекта. Тип <c>EntityColor</c>.

Teigha.DatabaseServices.GroundPlaneBackground.ColorGroundPlaneNear
Свойство предоставляет доступ к цвету фона на ближнем плане (ближе к наблюдателю).
Returns: Возвращает цвет объекта. Тип <c>EntityColor</c>.

Teigha.DatabaseServices.GroundPlaneBackground.ColorSkyHorizon
Свойство предоставляет доступ к цвету неба на дальнем плане (ближе к горизонту).
Returns: Возвращает цвет объекта. Тип <c>EntityColor</c>.

Teigha.DatabaseServices.GroundPlaneBackground.ColorSkyZenith
Свойство предоставляет доступ к цвету неба в зените.
Returns: Возвращает цвет объекта. Тип <c>EntityColor</c>.

Teigha.DatabaseServices.GroundPlaneBackground.ColorUndergroundAzimuth
Свойство предоставляет доступ к цвету поднятой нулевой плоскости на ближнем плане.
Returns: Возвращает цвет объекта. Тип <c>EntityColor</c>.

Teigha.DatabaseServices.GroundPlaneBackground.ColorUndergroundHorizon
Свойство предоставляет доступ к цвету поднятой нулевой плоскости на дальнем плане.
Returns: Возвращает цвет объекта. Тип <c>EntityColor</c>.