Teigha.DatabaseServices.DgnDefinition
Этот класс представляет определения подложек DGN.

Teigha.DatabaseServices.DgnDefinition.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.DgnDefinition.#ctor(IntPtr,System.Boolean)
Конструктор класса DgnDefinition.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Флаг автоудаления исходного объекта. Тип bool.

Teigha.DatabaseServices.DgnDefinition.SetShowRasterRef
Свойство позволяет установить логический флаг, определяющий, следует ли отображать растровые изображения в файлах DGN, на которые имеются ссылки.
Returns: Возвращает <c>true</c>, если требуется отображать растровые изображения.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DgnDefinition.ShowRasterRef
Свойство возвращает значение логического флага, который определяет, следует ли отображать растровые изображения в файлах DGN, на которые имеются ссылки (xref).
Returns: Возвращает <c>true</c>, если растровые изображения отображаются.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DgnDefinition.UseMasterUnits
Свойство определяет, должна ли подложка использовать основные единицы измерения из файла DGN при преобразовании из формата DGN в формат DWG.
Если основные единицы не используются, то используются вспомогательные.
Returns: Возвращает <c>true</c>, если подложка должна использовать основные единицы измерения из файла DGN.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DgnDefinition.XrefDepth
Свойство представляет значение глубины вложенности внешней ссылки, которое используется при экспорте файла DWG в формат DGN.
При преобразовании из DWG в DGN подложки DGN становятся внешними ссылками DGN с указанным значением глубины вложенности.
Returns: Возвращает глубину вложенности внешних ссылок. Тип int.