Teigha.BoundaryRepresentation.MassProperties
Класс <c>MassProperties</c> представляет массо-центровочные характеристики объекта BREP - объем, масса, центр тяжести, радиусы инерции, моменты инерции твердого тела, центробежные моменты инерции, главные моменты и главные оси объекта BREP.

Teigha.BoundaryRepresentation.MassProperties.Centroid
Свойство <c>Centroid</c> предоставляет доступ к центру тяжести твердого тела.
Returns: Возвращает точку центра тяжести твердого тела.
Тип <c>Point3d</c>.

Teigha.BoundaryRepresentation.MassProperties.Mass
Свойство <c>Mass</c> представляет массу твердого тела.
Returns: Возвращает массу твердого тела.
Тип <c>double</c>.

Teigha.BoundaryRepresentation.MassProperties.MomentsOfIntertia
Свойство <c>MomentsOfIntertia</c> предоставляет доступ к моментам инерции твердого тела.
Returns: Возвращает моменты инерции твердого тела.
Тип <c>Vector3d</c>.

Teigha.BoundaryRepresentation.MassProperties.PrincipalMoments
Свойство <c>PrincipalMoments</c> предоставляет доступ к главным моментам твердого тела.
Returns: Возвращает главные моменты твердого тела.
Тип <c>Vector3d</c>.

Teigha.BoundaryRepresentation.MassProperties.ProductsOfIntertia
Свойство <c>ProductsOfIntertia</c> представляет центробежные моменты инерции твердого тела.
Returns: Возвращает центробежные моменты инерции.
Тип <c>Vector3d</c>.

Teigha.BoundaryRepresentation.MassProperties.RadiiOfGyration
Свойство <c>RadiiOfGyration</c> представляет радиусы инерции твердого тела.
Returns: Возвращает радиусы инерции твердого тела.
Тип <c>Vector3d</c>.

Teigha.BoundaryRepresentation.MassProperties.Volume
Свойство <c>Volume</c> представляет объем твердого тела.
Returns: Возвращает объем твердого тела.
Тип <c>double</c>.