Teigha.DatabaseServices.ImageBackground
Этот класс представляет в базе данных объекты фона, основанные на изображениях.

Teigha.DatabaseServices.ImageBackground.#ctor
Конструктор по умолчанию класса <c>ImageBackground</c>.

Teigha.DatabaseServices.ImageBackground.FitToScreen
Свойство позволяет проверить, должен ли данный фон на основе изображения быть вписанным в экран.
Returns: Возвращает <c>true</c>, если фон должен быть вписан в экран.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.ImageBackground.ImageFileName
Свойство представляет полный путь к файлу изображения, на базе которого создан данный объект.
Returns: Возвращает полный путь к файлу изображения. Тип <c>String</c>.

Teigha.DatabaseServices.ImageBackground.MaintainAspectRatio
Свойство позволяет выяснить, следует ли сохранять соотношение сторон исходного изображения в данном объекте.
Returns: Возвращает <c>true</c>, если соотношение сторон исходного изображения должно сохраняться.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.ImageBackground.Offset
Свойство предоставляет доступ к вектору смещения исходного изображения в данном объекте.
Returns: Возвращает вектор смещения исходного изображения. Тип <c>Vector2d</c>.

Teigha.DatabaseServices.ImageBackground.Scale
Свойство предоставляет доступ к масштабу исходного изображения в данном объекте.
Returns: Возвращает масштаб исходного изображения. Тип <c>Scale2d</c>.

Teigha.DatabaseServices.ImageBackground.UseTiling
Свойство позволяет проверить, является ли мозаичным данный фон на основе изображения.
Returns: Возвращает <c>true</c>, если фоновое изображение выкладывается мозаикой.
В противном случае возвращает <c>false</c>.