Teigha.Geometry.OffsetSurface
Класс <c>OffsetSurface</c> представляет 3D-поверхность, которая построена как точное смещение другой поверхности.

Teigha.Geometry.OffsetSurface.#ctor
Конструктор по умолчанию класса <c>OffsetSurface</c>.
Создает новый объект без каких-либо реальных данных (нулевой указатель базовой поверхности и нулевое смещение).

Teigha.Geometry.OffsetSurface.#ctor(Teigha.DatabaseServices.Surface,System.Double)
Конструктор класса <c>OffsetSurface</c>.
Создает поверхность, являющуюся точным смещением указанной базовой поверхности на заданное расстояние.
baseSurface: Входная базовая поверхность.   Тип <c>Surface</c>.
offsetDistance: Величина смещения (со знаком). Тип <c>double</c>.

Teigha.Geometry.OffsetSurface.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект.
Тип <c>OffsetSurface</c>.

Teigha.Geometry.OffsetSurface.Set(Teigha.DatabaseServices.Surface,System.Double)
Метод позволяет переопределить у данной кривой базовую поверхность и значение смещения.
surface: Входная базовая поверхность.   Тип <c>Surface</c>.
offsetDistance: Величина смещения (со знаком). Тип <c>double</c>.

Teigha.Geometry.OffsetSurface.ConstructionSurface
Свойство <c>ConstructionSurface</c> представляет базовую поверхность данного объекта.
Returns: Возвращает базовую поверхность.
Тип <c>Geometry.Surface</c>.

Teigha.Geometry.OffsetSurface.IsBoundedPlane
Свойство <c>IsBoundedPlane</c> позволяет определить, является ли поверхность смещения ограниченной плоскостью.
Returns: Возвращает <c>true</c>, если поверхность смещения представлена ограниченной плоскостью.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.OffsetSurface.IsCone
Свойство <c>IsCone</c> позволяет определить, является ли поверхность смещения конусом.
Returns: Возвращает <c>true</c>, если поверхность смещения представлена конусом.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.OffsetSurface.IsCylinder
Свойство <c>IsCylinder</c> позволяет определить, является ли поверхность смещения цилиндром.
Returns: Возвращает <c>true</c>, если  поверхность смещения представлена цилиндром.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.OffsetSurface.IsPlane
Свойство <c>IsPlane</c>  позволяет определить, является ли поверхность смещения плоскостью.
Returns: Возвращает <c>true</c>, если поверхность смещения является плоскостью.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.OffsetSurface.IsSphere
Свойство <c>IsSphere</c> позволяет определить, является ли поверхность смещения сферой.
Returns: Возвращает <c>true</c>, если поверхность смещения является плоскостью.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.OffsetSurface.IsTorus
Свойство <c>IsTorus</c> позволяет определить, является ли поверхность смещения тором.
Returns: Возвращает <c>true</c>, если поверхность смещения является тором.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.OffsetSurface.OffsetDist
Свойство <c>OffsetDist</c> представляет величину смещения (со знаком).
Returns: Возвращает величину смещения (со знаком). Тип <c>double</c>.

Teigha.Geometry.OffsetSurface.OriginalSurface
Свойство <c>OriginalSurface</c> вычисляет указатель на исходную поверхность.
Returns: Возвращает исходную поверхность.
Тип <c>Geometry.Surface</c>.