Teigha.LayerManager.LayerCollection
Класс <c>LayerCollection</c> представляет в базе данных коллекцию слоев.

Teigha.LayerManager.LayerCollection.Add(Teigha.DatabaseServices.ObjectId)
Метод позволяет добавить в данную коллекцию указанный объект.
value: Идентификатор добавляемого в коллекцию объекта. Тип <c>ObjectId</c>.

Teigha.LayerManager.LayerCollection.Clear
Метод позволяет очистить коллекцию, удалив из нее все объекты.

Teigha.LayerManager.LayerCollection.Contains(Teigha.DatabaseServices.ObjectId)
Метод позволяет проверить, содержится ли в коллекции объект с указанным идентификатором объекта.
value: Идентификатор искомого объекта.  Тип <c>ObjectId</c>.
Returns: Возвращает <c>true</c>, если искомый объект содержится в коллекции.
В противном случае возвращает <c>false</c>.

Teigha.LayerManager.LayerCollection.CopyTo(array&lt;ObjectId&gt;,System.Int32)
Метод копирует в данную коллекцию объекты из указанного массива.
array: Входной массив идентификаторов копируемых объектов.  Тип <c>ObjectId[]</c>.
index: Индекс в массиве, начиная с которого объекты массива будут копироваться в данную коллекцию.  Тип <c>int</c>.  Индексация элементов в массиве начинается с нуля.

Teigha.LayerManager.LayerCollection.GetEnumerator
Метод предоставляет объект перечислителя для данной коллекции.
Returns: Возвращает перечислитель коллекции.  Тип <c>IEnumerator</c>.

Teigha.LayerManager.LayerCollection.Remove(Teigha.DatabaseServices.ObjectId)
Метод удаляет из данной коллекции указанный объект.
value: Идентификатор удаляемого объекта.  Тип <c>ObjectId</c>.

Teigha.LayerManager.LayerCollection.Count
Свойство <c>Count</c> представляет текущее количество объектов в данной коллекции.
Returns: Возвращает количество объектов в коллекции.  Тип <c>int</c>.

Teigha.LayerManager.LayerCollection.Item
Свойство <c>Item</c> возвращает элемент коллекции с указанным индексом.
index: Индекс искомого элемента коллекции.  Тип <c>int</c>.
Returns: Возвращает идентификатор объекта, хранящегося в коллекции под индексом <c>index</c>.
Тип <c>ObjectId</c>.