Teigha.LayerManager.AndExpression
Класс <c>AndExpression</c> представляет выражения с логическим оператором <c>AND</c>.

Teigha.LayerManager.AndExpression.GetRelationalExpressions
Метод позволяет получать выражения для отношений, использующие логический оператор <c>AND</c>.
Returns: Возвращает массив логических выражений для отношений.
Тип <c>RelationalExpression[]</c>.