Teigha.DatabaseServices.Mline
Класс <c>Mline</c> представляет в базе данных объекты мультилиний.

Teigha.DatabaseServices.Mline.#ctor
Конструктор по умолчанию класса <c>Mline</c>.

Teigha.DatabaseServices.Mline.AppendSegment(Teigha.Geometry.Point3d)
Метод добавляет новую вершину в конец этого объекта <c>MLine</c>.
newVertex: Точка, которая используется для создания новой вершины мультилинии. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Mline.Element(Teigha.Geometry.Point3d)
Метод позволяет найти индекс элемента объекта <c>Mline</c>, который содержит указанную точку.
pt: Точка, проверяемая на пересечения с элементами мультилинии.  Тип <c>Point3d</c>.
Returns: В случае успеха возвращает индекс элемента мультилинии, который содержит указанную точку <c>pt</c>.  Тип <c>int</c>.
В противном случае возвращает <c>-1</c>.

Teigha.DatabaseServices.Mline.GetClosestPointTo(Teigha.Geometry.Point3d,System.Boolean,System.Boolean)
Метод позволяет найти точку на объекте <c>MLine</c>, которая является ближайшей к заданной точке.
givenPoint: Точка, для которой выполняется поиск ближайшей точки на объекте <c>Mline</c>. Тип <c>Point3d</c>.
extend: Флаг, который определяет, следует ли в процессе поиска ближайшей точки «виртуально» продлевать конечные сегменты объекта <c>Mline</c>. Тип <c>bool</c>.
excludeCaps: Флаг, определяющий, следует ли исключить из рассмотрения торцевые ограничители и обозначения стыков сегментов данной мультилинии. Тип <c>bool</c>.
Returns: Возвращает точку на объекте <c>MLine</c>, ближайшую к заданной.  Тип <c>Point3d</c>.

Teigha.DatabaseServices.Mline.GetClosestPointTo(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Boolean,System.Boolean)
Метод позволяет найти точку на объекте <c>MLine</c>, которая является ближайшей к проекции заданной точки на плоскость данной мультилинии.
givenPoint: Точка, для которой выполняется поиск ближайшей точки на объекте <c>Mline</c>. Тип <c>Point3d</c>.
normal: Нормаль плоскости, на которую выполняется проецирование.  Тип <c>Vector3d</c>.
extend: Флаг, который определяет, следует ли в процессе поиска ближайшей точки продлевать конечные элементы объекта <c>Mline</c>. Тип <c>bool</c>.
excludeCaps: Флаг, определяющий, следует ли исключить из рассмотрения торцевые ограничители и обозначения стыков сегментов данной мультилинии. Тип <c>bool</c>.
Returns: Возвращает точку на объекте <c>MLine</c>, ближайшую к проекции заданной точки <c>givenPoint</c>.  Тип <c>Point3d</c>.

Teigha.DatabaseServices.Mline.MoveVertexAt(System.Int32,Teigha.Geometry.Point3d)
Метод перемещает указанную вершину данного объекта <c>MLine</c> в новое положение, определяемое проекцией указанной 3D-точки на плоскость мультилинии.
index: Индекс перемещаемой вершины. Тип <c>int</c>.
newPosition: Точка в мировой системе координат (WCS), проекция которой на плоскость мультилинии задает новое положение вершины с индексом <c>index</c>.  Тип <c>Point3d</c>.

Teigha.DatabaseServices.Mline.RemoveLastSegment([Out]Point3d%)
Метод удаляет текущую последнюю вершину данной мультилинии, что приводит к удалению последнего сегмента объекта <c>Mline</c>, и возвращает новую последнюю вершину мультилинии.
lastVertex: Точка новой последней вершины мультилинии. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Mline.VertexAt(System.Int32)
Метод позволяет получить вершину данного объекта MLine с указанным индексом.
index: Индекс искомой вершины. Тип <c>int</c>.
Returns: Возвращает точку <c>Point3d</c> в вершине с индексом <c>index</c>.

Teigha.DatabaseServices.Mline.IsClosed
Свойство предоставляет возможность проверить, является ли данная мультилиния замкнутой.
Returns: Возвращает <c>true</c>, если мультилиния является замкнутой.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Mline.Justification
Свойство возвращает выравнивание в данной мультилинии.
Returns: Возвращает заданное выравнивание как значение из перечисления <c>MlineJustification</c>.

Teigha.DatabaseServices.Mline.Normal
Свойство представляет вектор нормали плоскости, в которой располагается данный объект <c>Mline</c>.
Returns: Возвращает вектор нормали плоскости данной мультилинии.  Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Mline.NumberOfVertices
Свойство представляет текущее количество вершин данной мультилинии.
Returns: Возвращает количество вершин. Тип <c>int</c>.

Teigha.DatabaseServices.Mline.Scale
Свойство представляет масштаб, заданный для данной мультилинии.
Returns: Возвращает текущее значение масштаба.  Тип <c>double</c>.

Teigha.DatabaseServices.Mline.Style
Свойство представляет идентификатор объекта <c>MLineStyle</c>, который определяет стиль данного объекта <c>MLine</c>.
Returns: Возвращает идентификатор стиля. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Mline.SupressEndCaps
Свойство предоставляет доступ к флагу, который управляет подавлением торцевого ограничителя на конце данной мультилинии.
Returns: Возвращает <c>true</c>, если торцевой ограничитель на конце мультилинии подавлен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Mline.SupressStartCaps
Свойство предоставляет доступ к флагу, который управляет подавлением торцевого ограничителя в начале данной мультилинии.
Returns: Возвращает <c>true</c>, если торцевой ограничитель в начале мультилинии подавлен.
В противном случае возвращает <c>false</c>.