HostMgd.EditorInput.PromptSelectionResultEventArgs
Класс, обеспечивающий данными событие PromptedForSelection
класса Editor.

HostMgd.EditorInput.PromptSelectionResultEventArgs.Result
Возвращает результат выбора.