Teigha.DatabaseServices.BeginWblockObjectsEventArgs
Класс представляет данные для события <c>BeginWblockObjects</c> базы данных.

Teigha.DatabaseServices.BeginWblockObjectsEventArgs.From
Свойство возвращает объект базы данных, для которой выполняется операция <c>Wblock</c>.
Returns: Возвращает объект базы данных. Тип Database.

Teigha.DatabaseServices.BeginWblockObjectsEventArgs.IdMapping
Returns: Возвращает объект мэппинга идентификаторов объектов. Тип DatabaseServices.IdMapping.