Teigha.Runtime.ProgressMeter
Класс <c>ProgressMeter</c> является базовым классом для измерителей прогресса, специфичных для платформы nanoCAD.

Teigha.Runtime.ProgressMeter.#ctor
Конструктор по умолчанию класса <c>ProgressMeter</c>.

Teigha.Runtime.ProgressMeter.MeterProgress
Метод увеличивает счетчик данного индикатора прогресса.

Teigha.Runtime.ProgressMeter.SetLimit(System.Int32)
Метод позволяет задать максимальное количество вызовов для метода <c>MeterProgress()</c>.
max: Верхний предел для количества вызовов <c>MeterProgress()</c>.  Тип <c>int</c>.

Teigha.Runtime.ProgressMeter.Start
Метод инициализирует индикатор прогресса начальным значением и делает его видимым.

Teigha.Runtime.ProgressMeter.Start(String)
Метод инициализирует индикатор прогресса начальным значением и делает его видимым.
Дополнительно можно передать строку текста для отображения на индикаторе.
displayString: Входная строка для отображения на индикаторе прогресса.

Teigha.Runtime.ProgressMeter.Stop
Метод вызывается для завершения данного объекта <c>ProgressMeter</c>.