Teigha.DatabaseServices.DatabaseSummaryInfo.Equals(Object)
Метод предназначен для проверки данного объекта на совпадение с указанным объектом.
obj: Объект, который проверяется на совпадение с данным объектом DatabaseSummaryInfo. Тип Object.
Returns: Возвращает <c>true</c>, если совместно выполняются все указанные ниже условия:
* Совпадают поля Title;
* Совпадают поля Subject;
* Совпадают поля Author;
* Совпадают поля Keywords;
* Совпадают поля Comments;
* Совпадают поля LastSavedBy;
* Совпадают поля RevisionNumber;
* Совпадают поля HyperlinkBase;
* Совпадают поля CustomProperties.
В противном случае возвращает <c>false</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c> должно выполняться согласованно с сохранением общей логики.
Если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.

Teigha.DatabaseServices.DatabaseSummaryInfo.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Returns: Возвращает хеш-код объекта. Тип <c>int</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c> должно выполняться согласованно с сохранением общей логики.
Если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.

Teigha.DatabaseServices.DatabaseSummaryInfo.ToString
Метод предназначен для формирования эквивалентного строкового представления данного объекта.
Returns: Возвращает эквивалентное представление данного объекта в виде строки. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.ToString(IFormatProvider)
Метод формирует строковое представление данного объекта с учетом языковых и региональных настроек.
provider: Заданный провайдер формата региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает эквивалентное представление данного объекта в виде строки. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.Author
Свойство предоставляет доступ к имени автора данного объекта DatabaseSummaryInfo.
Returns: Возвращает имя автора. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.Comments
Свойство предоставляет доступ к комментарию в данном объекте DatabaseSummaryInfo.
Returns: Возвращает комментарий. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.CustomProperties
Свойство предоставляет доступ к перечислителю для пользовательских свойств данного объекта DatabaseSummaryInfo.
Returns: Возвращает перечислитель коллекции пользовательских свойств. Тип System.Collections.IDictionaryEnumerator.

Teigha.DatabaseServices.DatabaseSummaryInfo.HyperlinkBase
Свойство обеспечивает доступ к базовому URL данного объекта.
Returns: Возвращает значение поля HyperlinkBase.
Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.Keywords
Свойство предоставляет доступ к ключевым словам данного объекта DatabaseSummaryInfo.
Returns: Возвращает значение поля Keywords.
Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.LastSavedBy
Свойство предоставляет доступ к данным о пользователе, который внёс в этот объект наиболее поздние изменения.
Returns: Возвращает значение поля LastSavedBy.
Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.RevisionNumber
Свойство предоставляет доступ к номеру ревизии данного объекта DatabaseSummaryInfo.
Returns: Возвращает номер ревизии данного объекта. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.Subject
Свойство предоставляет доступ к описанию назначения данного объекта или предметной области, к которой он относится.
Returns: Возвращает значение поля Subject. Тип String.

Teigha.DatabaseServices.DatabaseSummaryInfo.Title
Свойство предоставляет доступ к заголовку данного объекта DatabaseSummaryInfo.
Returns: Возвращает заголовок. Тип String.