Teigha.BoundaryRepresentation.BrepFaceEnumerator
Класс <c>BrepFaceEnumerator</c> представляет перечислитель граней, соответствующих граничному представлению.

Teigha.BoundaryRepresentation.BrepFaceEnumerator.Current
Свойство <c>Current</c> представляет текущий элемент данного перечислителя.
Returns: Возвращает грань, которая является текущим элементом данного перечислителя.
Тип <c>Face</c>.