Teigha.DatabaseServices.DataCellCollection
Класс представляет коллекцию объектов типа DataCell.

Teigha.DatabaseServices.DataCellCollection.#ctor
Конструктор по умолчанию класса DataCellCollection.

Teigha.DatabaseServices.DataCellCollection.Add(Teigha.DatabaseServices.DataCell)
Метод добавляет в коллекцию новый объект DataCell.
value: Добавляемый объект. Тип DataCell.
Returns: Возвращает отсчитываемый от нуля индекс нового элемента коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.DataCellCollection.Clear
Метод очищает коллекцию от ее содержимого.

Teigha.DatabaseServices.DataCellCollection.Contains(Teigha.DatabaseServices.DataCell)
Метод проверяет, содержит ли данная коллекция элемент, соответствующий указанному объекту DataCell.
value: Искомый объект типа DataCell.
Returns: Возвращает <c>true</c>, если коллекция содержит объект <c>value</c>.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DataCellCollection.CopyTo(array&lt; DataCell &gt;,System.Int32)
Копирует объекты из коллекции в указанный массив, начиная с заданного индекса.
arr: Массив, в который копируется коллекция. Тип DataCell[].
index: Индекс в массиве, начиная с которого выполняется копирование элементов коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.DataCellCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает перечислитель для коллекции. Тип Collections.IEnumerator.

Teigha.DatabaseServices.DataCellCollection.IndexOf(Teigha.DatabaseServices.DataCell)
Метод возвращает индекс элемента коллекции, соответствующего входному объекту DataCell.
value: Объект типа DataCell, для которого предполагается найти индекс.
Returns: Возвращает индекс элемента коллекции, если объект <c>value</c> найден. В противном случае возвращает -1.

Teigha.DatabaseServices.DataCellCollection.Insert(System.Int32,Teigha.DatabaseServices.DataCell)
Метод позволяет вставить указанный объект DataCell в эту коллекцию по заданному индексу.
index: Индекс, по которому вставляется объект value. Тип <c>int</c>.
value: Вставляемый в коллекцию объект.  Тип DataCell.

Teigha.DatabaseServices.DataCellCollection.Remove(Teigha.DatabaseServices.DataCell)
Метод удаляет из коллекции элемент, соответствующий входному объекту DataCell.
value: Удаляемый из коллекции элемент.  Тип DataCell.

Teigha.DatabaseServices.DataCellCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции элемент по указанному индексу.
index: Индекс удаляемого элемента коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.DataCellCollection.Count
Свойство возвращает текущее количество элементов в коллекции.
Returns: Возвращает количество элементов в коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.DataCellCollection.Item
Свойство позволяет получить или задать элемент коллекции по указанному индексу.
index: Индекс элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции. Тип DataCell.