Teigha.DatabaseServices.UcsTableRecord
Класс <c>UcsTableRecord</c> представляет записи в таблице <c>UcsTable</c>, каждая из которых связана с конкретной пользовательской системой координат, сохраненной в базе данных чертежа.

Teigha.DatabaseServices.UcsTableRecord.#ctor
Конструктор по умолчанию класса <c>UcsTableRecord</c>.

Teigha.DatabaseServices.UcsTableRecord.GetUcsBaseOrigin(DatabaseServices.OrthographicView)
Метод позволяет получить трехмерную точку начала пользовательской системы координат (UCS) для указанного ортогонального вида, при условии, что в системной переменной <c>UCSBASE</c> сохранено имя данной UCS.
view: Тип ортогонального вида из перечисления <c>DatabaseServices.OrthographicView</c>.
Returns: Возвращает точку начала пользовательской системы координат. Тип <c>Point3d</c>.

Teigha.DatabaseServices.UcsTableRecord.SetUcsBaseOrigin(Teigha.Geometry.Point3d,DatabaseServices.OrthographicView)
Метод позволяет задать трехмерную точку начала пользовательской системы координат (UCS) для указанного ортогонального вида, при условии, что в системной переменной <c>UCSBASE</c> сохранено имя данной UCS.
origin: Точка начала пользовательской системы координат. Тип <c>Point3d</c>.
view: Тип ортогонального вида из перечисления <c>DatabaseServices.OrthographicView</c>.

Teigha.DatabaseServices.UcsTableRecord.Origin
Свойство <c>Origin</c> представляет 3D-точку начала пользовательской системы координат для данной записи UCS.
Returns: Возвращает точку начала пользовательской системы координат. Тип <c>Point3d</c>.

Teigha.DatabaseServices.UcsTableRecord.XAxis
Свойство <c>XAxis</c> представляет 3D-вектор в мировой системе координат, который определяет направление оси <c>X</c> пользовательской системы координат для данного объекта <c>UcsTableRecord</c>.
Returns: Возвращает направление оси <c>X</c> пользовательской системы координат. Тип <c>Vector3d</c>. Задан в мировой системе координат.

Teigha.DatabaseServices.UcsTableRecord.YAxis
Свойство <c>YAxis</c> представляет 3D-вектор в мировой системе координат, который определяет направление оси <c>Y</c> пользовательской системы координат для данного объекта <c>UcsTableRecord</c>.
Returns: Возвращает направление оси <c>Y</c> пользовательской системы координат. Тип <c>Vector3d</c>. Задан в мировой системе координат.