Teigha.Geometry.OffsetCurve2d
Класс <c>OffsetCurve2d</c> представляет двумерную кривую, получаемую операцией смещения исходной (базовой) кривой.

Teigha.Geometry.OffsetCurve2d.#ctor(Teigha.Geometry.Curve2d,System.Double)
Конструктор класса <c>OffsetCurve2d</c>.
Создает кривую из указанной базовой кривой со смещением на заданное расстояние.
baseCurve: Входная базовая кривая. Тип <c>Curve2d</c>.
offsetDistance: Величина смещения. Тип <c>double</c>.

Teigha.Geometry.OffsetCurve2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект.
Тип <c>OffsetCurve2d</c>.

Teigha.Geometry.OffsetCurve2d.Curve
Свойство <c>Curve</c> представляет базовую кривую данной кривой смещения.
Returns: Возвращает базовую кривую для данного объекта. Тип <c>Curve2d</c>.

Teigha.Geometry.OffsetCurve2d.OffsetDistance
Свойство <c>OffsetDistance</c> представляет расстояние со знаком, которое определяет текущее смещение данной кривой относительно её базовой кривой.
Returns: Возвращает величину смещения (со знаком) данной кривой.
Тип <c>double</c>.

Teigha.Geometry.OffsetCurve2d.ParameterDirection
Свойство <c>ParameterDirection</c> позволяет определить направление изменения параметра у данной кривой относительно направления изменения параметра у базовой кривой.
Returns: Возвращает <c>true</c>, если направления изменения параметра у данной кривой и ее базовой кривой совпадают.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.OffsetCurve2d.Transformation
Свойство <c>Transformation</c> представляет матрицу геометрического преобразования, которое было применено к этой кривой путем вызова метода <c>TransformBy()</c>.
Returns: Возвращает матрицу геометрического преобразования, которое было применено к данной кривой.
Тип <c>Matrix2d</c>.