Teigha.Geometry.Entity3d
Класс <c>Entity3d</c> служит базовым классом для всех трехмерных геометрических объектов.

Teigha.Geometry.Entity3d.Clone
Метод предназначен для создания полной копии данного объекта.
Returns: Возвращает новый объект, являющийся полной копией данного объекта.
Тип <c>Object</c>.

Teigha.Geometry.Entity3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект.
Тип <c>Entity3d</c>.

Teigha.Geometry.Entity3d.IsEqualTo(Teigha.Geometry.Entity3d)
Метод позволяет проверить равен ли данный объект указанному объекту.
Используется геометрическая точность по умолчанию.
entity: Входной объект, с которым выполняется сравнение. Тип <c>Entity3d</c>.
Returns: Возвращает <c>true</c> в случае равенства объектов, т.е. оба объекта имеют один тип, совпадающие наборы точек в пределах указанной точности и одинаковую параметризацию.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.Entity3d.IsEqualTo(Teigha.Geometry.Entity3d,Teigha.Geometry.Tolerance)
Метод проверяет данный объект на равенство указанному объекту с использованием заданной геометрической точности.
entity: Входной объект, с которым выполняется сравнение. Тип <c>Entity3d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c> в случае равенства объектов, т.е. оба объекта имеют один тип, совпадающие наборы точек в пределах указанной точности и одинаковую параметризацию.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.Entity3d.IsOn(Teigha.Geometry.Point3d)
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Используется геометрическая точность по умолчанию.
point: Проверяемая точка. Тип <c>Point3d</c>.
Returns: Возвращает <c>true</c>, если в рамках используемой точности точка <c>point</c> лежит на данном объекте.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Entity3d.IsOn(Teigha.Geometry.Point3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Используется заданная геометрическая точность.
point: Проверяемая точка. Тип <c>Point3d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в рамках используемой точности точка <c>point</c> лежит на данном объекте.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Entity3d.Mirror(Teigha.Geometry.Plane)
Метод выполняет зеркальное отображение данного объекта относительно указанной плоскости.
plane: Плоскость зеркального отображения. Тип <c>Plane</c>.

Teigha.Geometry.Entity3d.RotateBy(System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Point3d)
Метод поворачивает данный объект на указанный угол вокруг заданной оси, определяемой точкой и вектором.
angle: Угол поворота. Тип <c>double</c>.
vector: Направление оси вращения. Тип <c>Vector3d</c>.
point: Точка на оси вращения. Тип <c>Point3d</c>.

Teigha.Geometry.Entity3d.ScaleBy(System.Double,Teigha.Geometry.Point3d)
Метод масштабирует данный объект на заданную величину относительно указанной точки.
scaleFactor: Коэффициент изменения масштаба объекта.  Тип <c>double</c>.
point: Точка, относительно которой выполняется масштабирование объекта.  Тип <c>Point3d</c>.

Teigha.Geometry.Entity3d.TransformBy(Teigha.Geometry.Matrix3d)
Метод применяет к данному объекту указанное трехмерное геометрическое преобразование.
transform: Матрица геометрического преобразования. Тип <c>Matrix3d</c>.

Teigha.Geometry.Entity3d.TranslateBy(Teigha.Geometry.Vector3d)
Метод выполняет трансляцию данного объекта на заданный вектор.
translateVector: Вектор, определяющий операцию трансляции.  Тип <c>Vector3d</c>.