Teigha.BoundaryRepresentation.BoundaryLoop
Класс <c>BoundaryLoop</c> представляет функционал, относящийся к уровню цикла грани BREP.

Teigha.BoundaryRepresentation.BoundaryLoop.#ctor(DatabaseServices.FullSubentityPath)
Конструктор класса <c>BoundaryLoop</c>. Создает экземпляр класса с указанными параметрами.
fullSubentPath: Полный путь к подобъекту.  Тип <c>DatabaseServices.FullSubentityPath</c>.

Teigha.BoundaryRepresentation.BoundaryLoop.GetEdgesStartingFrom(Teigha.BoundaryRepresentation.Edge)
Метод позволяет получить коллекцию рёбер цикла, которая начинается с указанного ребра.
startFrom: Начальное ребро для построения списка рёбер цикла.  Тип <c>Edge</c>.
Returns: Возвращает коллекцию рёбер цикла.  Тип <c>LoopEdgeCollection</c>.

Teigha.BoundaryRepresentation.BoundaryLoop.GetVerticesStartingFrom(Teigha.BoundaryRepresentation.Vertex)
Метод позволяет получить коллекцию вершин цикла, которая начинается с указанной стартовой вершины.
startFrom: Начальная вершина.  Тип <c>Vertex</c>.
Returns: Возвращает коллекцию вершин цикла. Тип <c>LoopVertexCollection</c>.

Teigha.BoundaryRepresentation.BoundaryLoop.Edges
Свойство <c>Edges</c> предоставляет доступ ко всем ребрам, связанным с данным циклом.
Returns: Возвращает коллекцию ребер цикла. Тип <c>LoopEdgeCollection</c>.

Teigha.BoundaryRepresentation.BoundaryLoop.Face
Свойство <c>Face</c> предоставляет доступ к грани, с которой связан данный цикл.
Returns: Возвращает грань цикла. Тип <c>BoundaryRepresentation.Face</c>.

Teigha.BoundaryRepresentation.BoundaryLoop.LoopType
Свойство <c>LoopType</c> представляет тип данного цикла.
Returns: Возвращает тип цикла из перечисления <c>Teigha.BoundaryRepresentation.LoopType</c>.

Teigha.BoundaryRepresentation.BoundaryLoop.Vertices
Свойство <c>Vertices</c> предоставляет доступ ко всем вершинам, связанным с данным циклом.
Returns: Возвращает коллекцию вершин цикла.
Тип <c>LoopVertexCollection</c>.