Teigha.DatabaseServices.DBVisualStyle
Данный класс описывает визуальный стиль как объект базы данных.

Teigha.DatabaseServices.DBVisualStyle.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.DBVisualStyle.#ctor(IntPtr,System.Boolean)
Конструктор класса DBVisualStyle.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Флаг автоудаления исходного объекта. Тип bool.

Teigha.DatabaseServices.DBVisualStyle.CopyFrom(Teigha.GraphicsInterface.VisualStyle)
Метод делает данный объект копией указанного визуального стиля VisualStyle.
pSrc: Визуальный стиль, являющийся источником данных для операции копирования. Тип VisualStyle.

Teigha.DatabaseServices.DBVisualStyle.CopyTo(Teigha.GraphicsInterface.VisualStyle)
Метод копирует данный визуальный стиль в указанный объект типа VisualStyle.
pDest: Визуальный стиль, в который копируются данные из этого стиля. Тип VisualStyle.

Teigha.DatabaseServices.DBVisualStyle.GetTrait(Teigha.GraphicsInterface.VisualStyleProperty)
Метод позволяет получить значение указанного свойства данного визуального стиля.
vsProp: Запрашиваемое свойство данного визуального стиля.  Значение из перечисления VisualStyleProperty.
Returns: Возвращает значение свойства. Тип GraphicsInterface.Variant.

Teigha.DatabaseServices.DBVisualStyle.GetTraitFlag(Teigha.GraphicsInterface.VisualStyleProperty,unsigned long)
Метод проверяет, установлен ли указанный флаг для указанного свойства визуального стиля.
vsProp: Запрашиваемое свойство визуального стиля. Значение из перечисления VisualStyleProperty.
flagValue: Проверяемый флаг. Тип <c>unsigned long</c>.
Returns: Возвращает <c>true</c>, если указанный флаг в этом свойстве выставлен. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,Colors.Color,Teigha.GraphicsInterface.VisualStyleOperation)
Метод задает значение свойству цвета визуального стиля.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
color: Цвет, который следует задать. Тип Colors.Color.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,Teigha.GraphicsInterface.Variant,Teigha.GraphicsInterface.VisualStyleOperation)
Метод позволяет задать значение типа <c>Variant</c> указанному свойству данного визуального стиля.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
val: Значение свойства, которое требуется задать. Тип <c>Variant</c>.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,System.Boolean,VisualStyleOperation )
Метод позволяет задать указанному свойству данного визуального стиля логическое значение.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
bVal: Логическое значение, которое требуется задать свойству. Тип <c>bool</c>.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,System.Double,Teigha.GraphicsInterface.VisualStyleOperation)
Метод позволяет задать указанному свойству данного визуального стиля значение с плавающей точкой двойной точности.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
bVal: Числовое значение, которое требуется задать свойству. Тип <c>double</c>.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,System.Double,System.Double,System.Double,Teigha.GraphicsInterface.VisualStyleOperation)
Метод позволяет задать значения RGB в свойствах визуального стиля.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
red: Красная компонента цвета.Тип <c>double</c>.
green: Зеленая компонента цвета.Тип <c>double</c>.
blue: Синяя компонента цвета.  Тип <c>double</c>.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTrait(Teigha.GraphicsInterface.VisualStyleProperty,System.Int32,Teigha.GraphicsInterface.VisualStyleOperation)
Метод позволяет задать указанному свойству данного визуального стиля целочисленное значение.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
nVal: Целочисленное значение для свойсва. Тип <c>double</c>.
vsOp: Операция, используемая для установки свойства. Значение из перечисления VisualStyleOperation.

Teigha.DatabaseServices.DBVisualStyle.SetTraitFlag(Teigha.GraphicsInterface.VisualStyleProperty,unsigned long,System.Boolean)
Метод позволяет задать значение флага в указанном свойстве данного стиля.
vsProp: Свойство визуального стиля, которое необходимо установить. Значение из перечисления VisualStyleProperty.
flagVal: Значение флага для свойства. Тип <c>unsigned long</c>.
bEnable: Тип операции, применяемой к свойству. Тип <c>bool</c>.

Teigha.DatabaseServices.DBVisualStyle.Description
Свойство обеспечивает доступ к описанию визуального стиля.
Returns: Возвращает описание стиля. Тип String.

Teigha.DatabaseServices.DBVisualStyle.InternalUseOnly
Свойство позволяет определить или указать, что данный объект предназначен только для внутреннего использования.
Returns: Возвращает <c>true</c>, если объект предназначен только для внутреннего использования.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DBVisualStyle.Name
Свойство предоставляет доступ к имени визуального стиля.
Returns: Возвращает имя стиля. Тип String.

Teigha.DatabaseServices.DBVisualStyle.Type
Свойство предоставляет доступ на изменение к типу визуального стиля.
Returns: Возвращает тип визуального стиля как значение из перечисления VisualStyleType.