HostMgd.EditorInput.PromptDoubleOptions.GetDefaultValueString
Вспомогательный метод. Предназначен для преобразования значения по умолчанию в строку (string).
Метод преобразовывает значение свойства DefaultValue в строку.
Returns: Возвращает строку string, в которой указано значение , заданное по умолчанию.