Teigha.GraphicsSystem.View
Класс <c>View</c> является абстрактным базовым классом для классов, реализующих объекты видового экрана <c>Viewport</c> в окнах графического пользовательского интерфейса nanoCAD. Каждый объект <c>Viewport</c> включает определяющие вид параметры камеры и коллекцию отображаемых объектов.

Teigha.GraphicsSystem.View.#ctor
Конструктор по умолчанию класса <c>View</c>.

Teigha.GraphicsSystem.View.Add(GraphicsInterface.Drawable)
Метод позволяет добавить к данному объекту <c>View</c> корневой узел графа сцены.
drawable: Корневой узел графа сцены. Тип <c>GraphicsInterface.Drawable</c>.
Returns: Этот метод всегда возвращает <c>true</c>.

Teigha.GraphicsSystem.View.Add(GraphicsInterface.Drawable,Teigha.GraphicsSystem.Model)
Метод позволяет определить, какие части каких моделей будут отображаться на данном виде, используя корневой узел графа сцены и объект <c>Model</c>.
drawable: Корневой узел графа сцены. Тип <c>GraphicsInterface.Drawable</c>.
model: Объект модели, которому направляются все уведомления узлов графа сцены. Тип <c>Model</c>.
Returns: Этот метод всегда возвращает <c>true</c>.

Teigha.GraphicsSystem.View.BeginInteractivity(System.Double)
Метод позволяет перевести данный вид в интерактивное состояние с указанием желательной частоты кадров.
frameRateInHz: Желательная частота кадров в секунду. Тип <c>double</c>. Значение по умолчанию 0.0.

Teigha.GraphicsSystem.View.ClearFrozenLayers
Метод позволяет очистить все ранее замороженные слои на данном виде.

Teigha.GraphicsSystem.View.CloneView
Метод позволяет получить новый объект <c>View</c>, являющийся полной копией данного вида.
Returns: Возвращает объект-клон данного вида.
Тип <c>View</c>.

Teigha.GraphicsSystem.View.CloneView(System.Boolean)
Метод позволяет получить новый объект <c>View</c>, являющийся копией данного вида, с возможностью включить или отключить копирование параметров вида.
cloneViewParameters: Флаг копирования параметров вида. Тип <c>bool</c>. Если флаг установлен, параметры вида копируются.
Returns: Возвращает объект-клон данного вида.
Тип <c>View</c>.

Teigha.GraphicsSystem.View.CloneView(System.Boolean,System.Boolean)
Метод позволяет получить новый объект <c>View</c>, являющийся копией данного вида, с возможностью включить или отключить копирование  геометрии и параметров вида.
cloneViewParameters: Флаг копирования параметров вида. Тип <c>bool</c>. Если флаг установлен, параметры вида копируются.
cloneGeometry: Флаг копирования геометрии вида.  Тип <c>bool</c>. Если флаг установлен, геометрия вида копируется.
Returns: Возвращает объект-клон данного вида.
Тип <c>View</c>.

Teigha.GraphicsSystem.View.Dolly(System.Double,System.Double,System.Double)
Метод предназначен для изменения положения камеры и точки цели при перемещении платформы камеры на указанную величину.
xDolly: Перемещение платформы камеры в направлении оси <c>X</c>. Тип <c>double</c>.
yDolly: Перемещение платформы камеры в направлении оси <c>Y</c>. Тип <c>double</c>.
zDolly: Перемещение платформы камеры в направлении оси <c>Z</c>. Тип <c>double</c>.

Teigha.GraphicsSystem.View.Dolly(Teigha.Geometry.Vector3d)
Метод предназначен для изменения положения камеры и точки цели при перемещении платформы камеры на указанный вектор.
dollyVector: Вектор перемещения платформы камеры.

Teigha.GraphicsSystem.View.EndInteractivity
Метод отменяет интерактивный режим для данного объекта <c>View</c>.

Teigha.GraphicsSystem.View.EnableDefaultLighting(System.Boolean)
Метод позволяет включать или отключать освещение по умолчанию для данного объекта <c>View</c>.
bEnable: Флаг включения освещения по умолчанию. Тип <c>bool</c>.

Teigha.GraphicsSystem.View.EnableDefaultLighting(System.Boolean,Teigha.DatabaseServices.DefaultLightingType)
Метод позволяет для данного объекта <c>View</c> включать или отключать освещение по умолчанию, а также устанавливать его тип.
bEnable: Флаг включения освещения по умолчанию. Тип <c>bool</c>.
type: Новый тип освещения по умолчанию. Перечисление <c>DefaultLightingType</c>.

Teigha.GraphicsSystem.View.Erase(GraphicsInterface.Drawable)
Метод предназначен для удаления указанного графа сцены из данного объекта <c>View</c>.
sceneGraph: Корневой узел удаляемого графа сцены.
Returns: Возвращает <c>true</c>, если корневой узел был найден и операция завершилась успешно.
Возвращает <c>false</c>, если предоставленный объект <c>Drawable</c> не был добавлен в этот вид.

Teigha.GraphicsSystem.View.EraseAll
Метод предназначен для удаления всех графов сцены из данного объекта <c>View</c>.

Teigha.GraphicsSystem.View.ExtentsInView(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет проверить, попадает ли указанный граничный бокс в пирамиду видимости текущего объекта <c>View</c> (хотя бы частично).
minPoint: Минимальная вершина граничного бокса в координатах МСК (WCS). Тип <c>Point3d</c>.
maxPoint: Максимальная вершина граничного бокса в координатах МСК (WCS). Тип <c>Point3d</c>.
Returns: Возвращает <c>true</c>, если указанный граничный бокс попадает (хотя бы частично) в пирамиду видимости данного вида.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.View.Flush
Метод позволяет очистить графический конвейер и отобразить данный объект <c>View</c>.
Этот метод следует вызывать только в интерактивном режиме.

Teigha.GraphicsSystem.View.FreezeLayer(DatabaseServices.ObjectId)
Метод позволяет заморозить указанный слой <c>Layer</c> в данном объекте <c>View</c>.
layerID: Постоянный идентификатор объекта слоя, который должен быть заморожен. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.GraphicsSystem.View.GetModel(GraphicsInterface.Drawable)
Метод позволяет получить объект <c>Model</c>, связанный с указанным объектом <c>Drawable</c> в данном объекте <c>View</c>.
drw: Входной отображаемый объект, для которого требуется найти ассоциированную модель графической системы.
Returns: Возвращает модель. Тип <c>Model</c>.

Teigha.GraphicsSystem.View.GetModelList
Метод позволяет получить все модели графической системы, которые связаны с данным видом.
Returns: Возвращает массив моделей графической системы. Тип <c>Model[]</c>.

Teigha.GraphicsSystem.View.GetNumPixelsInUnitSquare(Teigha.Geometry.Point3d)
Метод позволяет получить для данного объекта <c>View</c> плотность пикселей дисплея в указанной точке мирового пространства.
givenWorldpt: Центр единичного квадрата в мировой системе координат (МСК, WCS). Тип <c>Point3d</c>. В случае ортогональной проекции координаты этой точки на результат не влияют.
Returns: Возвращает 2D-точку, X и Y координаты которой равны количеству пикселей для горизонтального и вертикального размера единичного квадрата WCS.
Тип <c>Point2d</c>.

Teigha.GraphicsSystem.View.GetNumPixelsInUnitSquare(Teigha.Geometry.Point3d,System.Boolean)
Метод возвращает плотность пикселей дисплея в указанной точке МСК (WCS) для данного объекта <c>View</c>, позволяя учесть использование перспективного проецирования.
givenWorldpt: Центр единичного квадрата в мировой системе координат (МСК, WCS). Тип <c>Point3d</c>.
includePerspective: Если принимает значение <c>true</c>, вычисление плотности пикселей учитывает перспективную проекцию.
Returns: Возвращает 2D-точку, X и Y координаты которой равны количеству пикселей для горизонтального и вертикального размера единичного квадрата WCS.
Тип <c>Point2d</c>.

Teigha.GraphicsSystem.View.GetSnapshot(System.Drawing.Rectangle)
Метод позволяет получить снимок текущего состояния графики в указанной области на данном виде.
rectangle: Область на виде для получения снимка. Тип <c>System.Drawing.Rectangle</c>.
Returns: Возвращает снимок текущего состояния графики в области <c>rectangle</c>.
Тип <c>System.Drawing.Bitmap</c>.

Teigha.GraphicsSystem.View.Hide
Метод позволяет скрыть данный вид, сделав его невидимым.

Teigha.GraphicsSystem.View.InitLights(IEnumerator)
Метод позволяет связать с данным объектом <c>View</c> источники освещения, предоставленные указанным перечислителем.
pLightsIterator: Входной перечислитель источников освещения.

Teigha.GraphicsSystem.View.Invalidate
Метод позволяет пометить всю область данного вида как требующую обновления.

Teigha.GraphicsSystem.View.Invalidate(System.Drawing.Rectangle)
Метод позволяет отметить указанную область на данном виде как требующую обновления.
screenRect: Область вида, требующая обновления. Тип <c>System.Drawing.Rectangle</c>.

Teigha.GraphicsSystem.View.InvalidateCachedViewportGeometry
Метод позволяет сообщить графической системе, что вся независимая от вида геометрия <c>viewportDraw</c> перестала быть актуальной и нуждается в перерисовке в данном виде.

Teigha.GraphicsSystem.View.Orbit(System.Double,System.Double)
Метод выполняет заданное вращение камеры вокруг неподвижной точки цели.
xOrbit: Угол поворота вокруг оси X (в радианах). Тип <c>double</c>.
yOrbit: Угол поворота вокруг оси Y (в радианах). Тип <c>double</c>.

Teigha.GraphicsSystem.View.Pan(System.Double,System.Double)
Метод предназначен для панорамирования камеры с использованием заданных углов поворота точки цели камеры.
xPan: Угол вращения точки цели камеры вокруг оси X (в радианах). Тип <c>double</c>.
yPan: Угол вращения точки цели камеры вокруг оси Y (в радианах). Тип <c>double</c>.

Teigha.GraphicsSystem.View.PointInView(Teigha.Geometry.Point3d)
Метод позволяет проверить, попадает ли указанная точка в текущие границы усеченной пирамиды видимости данного вида.
point: Проверяемая точка в мировой системе координат. Тип <c>Point3d</c>.
Returns: Возвращает <c>true</c>, если указанная точка оказывается в текущих границах усеченной пирамиды видимости данного вида.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.View.PointInViewport(Teigha.Geometry.Point2d)
Метод позволяет проверить, попадает ли 2D-точка, заданная в системе координат устройства, в текущие границы видового экрана.
screenPoint: Проверяемая 2D-точка в системе координат устройства. Тип <c>Point2d</c>.
Returns: Возвращает <c>true</c>, если указанная точка попадает в текущие пределы видового экрана.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.View.RemoveViewportClipRegion
Метод удаляет область обрезки, которая была сформирована с использованием свойства <c>ViewportClipRegion</c>.

Teigha.GraphicsSystem.View.Roll(System.Double)
Метод поворачивает камеру на указанный угол вокруг вектора взгляда.
rollAngle: Угол вращения камеры (в радианах). Тип <c>double</c>.

Teigha.GraphicsSystem.View.Select(Teigha.Geometry.Point2dCollection,Teigha.GraphicsSystem.SelectionReactor,Teigha.GraphicsSystem.SelectionMode)
Метод позволяет запустить процедуру выделения в пределах данного объекта <c>View</c>.
pts: Коллекция 2D-точек, которые образуют границу области выделения.  Тип <c>Point2dCollection</c>.
pReactor: Объект реактора выделения.  Тип <c>SelectionReactor</c>.
mode: Режим выделения.  Перечисление <c>SelectionMode</c>.

Teigha.GraphicsSystem.View.SetLineweights(array&lt;unsigned char&gt;)
Метод позволяет задать веса линий для данного объекта <c>View</c>.
lineweights: Входной массив весов линий. Тип <c>array<unsigned char></c>.

Teigha.GraphicsSystem.View.SetView(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double)
Метод позволяет задать параметры камеры для данного объекта <c>View</c>, необходимые для определения преобразования координат из мировой системы координат (МСК, WCS) в нормализованные координаты устройства.
position: Точка положения камеры. Тип <c>Point3d</c>. Должна отличаться от точки <c>target</c>.
target: Точка цели камеры. Тип <c>Point3d</c>. Должна отличаться от точки <c>position</c>.
upVector: Вектор вертикали камеры (вектор вверх). Тип <c>Vector3d</c>. Не может быть параллелен направлению взгляда.
fieldWidth: Входная ширина плоскости (поля) проецирования. Тип <c>double</c>.
fieldHeight: Входная высота плоскости (поля) проецирования. Тип <c>double</c>.

Teigha.GraphicsSystem.View.SetView(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double,Projection)
Метод позволяет задать преобразования координат из мировой системы координат (МСК, WCS) в нормализованные координаты устройства через параметры камеры данного объекта <c>View</c> с учетом заданного типа проецирования.
position: Точка положения камеры. Тип <c>Point3d</c>. Должна отличаться от точки <c>target</c>.
target: Точка цели камеры. Тип <c>Point3d</c>. Должна отличаться от точки <c>position</c>.
upVector: Вектор вертикали камеры (вектор вверх). Тип <c>Vector3d</c>. Не может быть параллелен направлению взгляда.
fieldWidth: Входная ширина плоскости (поля) проецирования. Тип <c>double</c>.
fieldHeight: Входная высота плоскости (поля) проецирования. Тип <c>double</c>.
projection: Тип проецирования (ортогональное или перспективное). Перечисление <c>Projection</c>.

Teigha.GraphicsSystem.View.Show
Метод позволяет сделать данный объект <c>View</c> видимым.

Teigha.GraphicsSystem.View.ThawLayer(DatabaseServices.ObjectId)
Метод позволяет разморозить указанный слой <c>Layer</c> на данном виде.
layerID: Идентификатор объекта размораживаемого слоя. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.GraphicsSystem.View.Update
Метод предназначен для обновления данного вида.

Teigha.GraphicsSystem.View.ViewParameters(Teigha.GraphicsSystem.View)
Получает параметры вида данного объекта <c>View</c>.
pView: ОБъект типа <c>View</c>, в который передаются параметры вида.

Teigha.GraphicsSystem.View.Zoom(System.Double)
Метод изменяет фокусное расстояние камеры данного объекта <c>View</c>, создавая эффект зума.
zoomFactor: Входной масштабный коэффициент. Тип <c>double</c>. Должен быть положительным.

Teigha.GraphicsSystem.View.ZoomExtents(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод масштабирует камеру вида таким образом, чтобы заданный граничный бокс полностью вписался в пирамиду видимости (frustum) данного объекта <c>View</c>.
minPoint: Вершина граничного бокса с минимальными значениями координат (WCS).   Тип <c>Point3d</c>.
maxPoint: Вершина граничного бокса с максимальными значениями координат (WCS).  Тип <c>Point3d</c>.

Teigha.GraphicsSystem.View.ZoomWindow(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод масштабирует камеру вида таким образом, чтобы заданная область экрана оказалась полностью вписанной в пирамиду видимости (frustum) данного объекта <c>View</c>.
lowerLeft: Левый нижний угол области экрана в нормализованных координатах устройства.   Тип <c>Point2d</c>.
upperRight: Правый верхний угол области экрана в нормализованных координатах устройства. Тип <c>Point2d</c>.

Teigha.GraphicsSystem.View.BackClip
Свойство <c>BackClip</c> представляет удаление задней плоскости отсечения вида от точки цели камеры вдоль направления взгляда камеры.
Returns: Возвращает расстояние между точкой цели камеры и задней плоскостью отсечения вида.
Тип <c>double</c>.

Teigha.GraphicsSystem.View.Background
Свойство <c>Background</c> представляет идентификатор объекта, который является производным от класса Background и определяет фон на данном виде.
Returns: Возвращает идентификатор объекта, который определяет фон на данном виде, или <c>ObjectId.kNull</c>, если фон не задан.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.GraphicsSystem.View.Device
Свойство <c>Device</c> представляет устройство, с которым связан данный вид.
Returns: Возвращает устройство, с которым связан вид. Тип <c>GraphicsSystem.Device</c>.

Teigha.GraphicsSystem.View.EnableBackClip
Свойство <c>EnableBackClip</c> управляет включением задней плоскости отсечения.
Returns: Возвращает <c>true</c>, если задняя плоскость отсечения активна.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.View.EnableFrontClip
Свойство <c>EnableFrontClip</c> управляет включением передней плоскости отсечения.
Returns: Возвращает <c>true</c>, если передняя плоскость отсечения активна.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.View.EnableStereo
Свойство <c>EnableStereo</c> управляет режимом стереографического отображения на данном виде.
Returns: Возвращает <c>true</c>, если режим стереографического отображения включен.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.View.ExceededBounds
Свойство <c>ExceededBounds</c> позволяет определить, не превысили ли свои границы какие-либо параметры данного вида
(положение камеры, цель камеры, поле зрения камеры, расстояние до передней/задней плоскости отсечения и дальность видимости)
в процессе выполнения любого из следующих методов и свойств управления видом: <c>SetView()</c>, <c>FrontClip</c>, <c>BackClip</c>, <c>Dolly()</c>, <c>Roll()</c>, <c>Orbit()</c>, <c>Zoom()</c> и <c>Pan()</c>
с момента предыдущего обращения к свойству <c>ExceededBounds</c>
Returns: Возвращает <c>true</c>, если выход параметров вида за свои границы имел место.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.View.FieldHeight
Свойство <c>FieldHeight</c> представляет высоту поля камеры данного вида.
Returns: Возвращает высоту поля камеры.
Тип <c>double</c>.

Teigha.GraphicsSystem.View.FieldWidth
Свойство <c>FieldWidth</c> представляет ширину поля камеры данного вида.
Returns: Возвращает ширину поля камеры. Тип <c>double</c>.

Teigha.GraphicsSystem.View.FrontClip
Свойство <c>FrontClip</c> представляет удаление плоскости отсечения от точки цели камеры в направлении к точке положения камеры.
Returns: Возвращает расстояние от передней плоскости отсечения до точки цели камеры.
Тип <c>double</c>.

Teigha.GraphicsSystem.View.IsPerspective
Свойство <c>IsPerspective</c> позволяет определить, находится ли данный вид в режиме перспективного проецирования.
Returns: Возвращает <c>true</c>, если данный вид находится в режиме перспективного проецирования.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.View.IsValid
Свойство <c>IsValid</c> позволяет определить, является ли действительной отображаемая на виде графика.
Returns: Возвращает <c>true</c>, если изображение на виде действительно.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.View.IsVisible
Свойство <c>IsVisible</c> позволяет определить, является ли данный вид видимым или скрытым.
Returns: Возвращает <c>true</c>, если вид является видимым.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.View.LensLength
Свойство <c>LensLength</c> представляет фокусное расстояние камеры вида.
Returns: Возвращает фокусное расстояние камеры вида.
Тип <c>double</c>.

Teigha.GraphicsSystem.View.LinetypeScaleMultiplier
Свойство <c>LinetypeScaleMultiplier</c> представляет масштабный множитель типа линий.
Returns: Возвращает масштабный множитель.
Тип <c>double</c>.

Teigha.GraphicsSystem.View.LineweightToDcScale
Свойство <c>LineweightToDcScale</c> представляет коэффициент масштабирования при отображении толщины линий в данном объекте <c>View</c>.
Returns: Возвращает коэффициент масштаба толщины линий.
Тип <c>double</c>.

Teigha.GraphicsSystem.View.Mode
Свойство <c>Mode</c> представляет текущий режим рендеринга, установленный для данного вида.
Returns: Возвращает режим рендеринга.
Перечисление <c>GraphicsSystem.RenderMode</c>.

Teigha.GraphicsSystem.View.ObjectToDeviceMatrix
Свойство <c>ObjectToDeviceMatrix</c> представляет геометрическое преобразование из пространства модели в пространство устройства отображения.
Returns: Возвращает матрицу геометрического преобразования.
Тип <c>Matrix3d</c>.

Teigha.GraphicsSystem.View.Position
Свойство <c>Position</c> представляет текущую точку положения камеры.
Returns: Возвращает точку положения камеры.
Тип <c>Point3d</c>.

Teigha.GraphicsSystem.View.ProjectionMatrix
Свойство <c>ProjectionMatrix</c> представляет проекционную матрицу преобразования из пространства вида в нормализованное пространство устройства.
Returns: Возвращает матрицу геометрического преобразования.
Тип <c>Matrix3d</c>.

Teigha.GraphicsSystem.View.ScreenMatrix
Свойство <c>ScreenMatrix</c> представляет матрицу преобразования координат из нормализованного пространства устройства в пространство экрана.
Returns: Возвращает матрицу геометрического преобразования.
Тип <c>Matrix3d</c>.

Teigha.GraphicsSystem.View.StereoParameters
Свойство <c>StereoParameters</c> представляет текущее сочетание значений магнитуды разделения видов и параллакса.
Returns: Возвращает параметры стереоскопического вида как экземпляр класса <c>GraphicsSystem.StereoParameters</c>.

Teigha.GraphicsSystem.View.Target
Свойство <c>Target</c> представляет точку цели камеры данного вида.
Returns: Возвращает точку цели камеры.
Тип <c>Point3d</c>.

Teigha.GraphicsSystem.View.UpVector
Свойство <c>UpVector</c> представляет текущее направление вертикали камеры данного вида.
Returns: Возвращает направление вертикали камеры (направление вверх).
Тип <c>Vector3d</c>.

Teigha.GraphicsSystem.View.UserGiContext
Свойство <c>UserGiContext</c> представляет контекст пользовательского графического интерфейса.
Returns: Возвращает контекст пользовательского графического интерфейса.
Тип <c>GraphicsInterface.Context</c>.

Teigha.GraphicsSystem.View.ViewingMatrix
Свойство <c>ViewingMatrix</c> представляет  матрицу преобразования из мировой системы координат в пространство вида.
Returns: Возвращает матрицу геометрического преобразования.
Тип <c>Matrix3d</c>.

Teigha.GraphicsSystem.View.Viewport
Свойство <c>Viewport</c> представляет 2D-границы видового экрана в координатах устройства.
Returns: Возвращает двумерную граничную рамку.
Тип <c>DatabaseServices.Extents2d</c>.

Teigha.GraphicsSystem.View.ViewportBorderProperties
Свойство <c>ViewportBorderProperties</c> предоставляет доступ к свойствам границ видового экрана.
Returns: Возвращает свойства границ видового экрана.
Тип <c>GraphicsSystem.ViewportBorderProperties</c>.

Teigha.GraphicsSystem.View.ViewportBorderVisibility
Свойство <c>ViewportBorderVisibility</c> позволяет определить состояние видимости границ видового экрана.
Returns: Возвращает <c>true</c>, если границы отображаются.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsSystem.View.ViewportClipRegion
Свойство <c>ViewportClipRegion</c> представляет текущую область обрезки данного вида.
Returns: Возвращает границу области обрезки вида.
Тип <c>Point2dCollection[]</c>.

Teigha.GraphicsSystem.View.VisualStyle
Свойство <c>VisualStyle</c> представляет текущий визуальный стиль данного вида.
Returns: Возвращает текущий визуальный стиль.
Тип <c>GraphicsInterface.VisualStyle</c>.

Teigha.GraphicsSystem.View.VisualStyleId
Свойство <c>VisualStyleId</c> представляет идентификатор объекта визуального стиля данного вида.
Returns: Возвращает идентификатор объекта визуального стиля.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.GraphicsSystem.View.WorldToDeviceMatrix
Свойство <c>WorldToDeviceMatrix</c> представляет преобразование координат из мирового пространства в пространство устройства (экрана).
Returns: Возвращает матрицу преобразования координат.
Тип <c>Matrix3d</c>.

Teigha.GraphicsSystem.View.ClearColor
Свойство <c>ClearColor</c> позволяет задать режим удаления цветов на данном виде как значение из перечисления <c>Teigha.GraphicsSystem.ClearColor</c>.
Returns: Возвращает режим удаления цветов на виде.
Тип <c>Teigha.GraphicsSystem.ClearColor</c>.

Teigha.GraphicsSystem.View.ClientViewInfo
Свойство <c>ClientViewInfo</c> представляет экземпляр структуры <c>Teigha.GraphicsSystem.ClientViewInfo</c>, связанный с данным объектом <c>View</c>.
Returns: Возвращает экземпляр структуры <c>Teigha.GraphicsSystem.ClientViewInfo</c> для данного объекта <c>View</c>.