Teigha.GraphicsSystem.ViewportBorderProperties.#ctor(System.Drawing.Color,System.Int32)
Конструктор структуры <c>ViewportBorderProperties</c>. Создает экземпляр структуры с указанными цветом и толщиной линий.
color: Цвет границы. Тип <c>System.Drawing.Color</c>.
weight: Толщина границы в пикселях. Тип <c>int</c>.

Teigha.GraphicsSystem.ViewportBorderProperties.Color
Свойство <c>Color</c> представляет цвет линий границы видового экрана.
Returns: Возвращает цвет границы.  Тип <c>System.Drawing.Color</c>.

Teigha.GraphicsSystem.ViewportBorderProperties.Weight
Свойство <c>Weight</c> представляет толщину (в пикселях) линий границы видового экрана.
Returns: Возвращает толщину линий границы (в пикселях).
Тип <c>int</c>.