HostMgd.EditorInput.PromptIntegerOptionsEventArgs
Класс, обеспечивающий данными событие PromptingForInteger
класса Editor.

HostMgd.EditorInput.PromptIntegerOptionsEventArgs.Options
Возвращает входные параметры приглашения.