Teigha.DatabaseServices.AttributeCollection
Коллекция, которая служит контейнером для атрибутов вхождения блока.

Teigha.DatabaseServices.AttributeCollection.AppendAttribute(Teigha.DatabaseServices.AttributeReference)
Метод добавляет к вхождению блока новый атрибут.
attributeToAddToBlockReference: Атрибут, который следует добавить. Тип AttributeReference.
Returns: Возвращает <c>ObjectId</c> вхождения блока с новым атрибутом.

Teigha.DatabaseServices.AttributeCollection.CopyTo(array&lt;ObjectId&gt;,System.Int32)
Копирует объекты коллекции в массив.
array: Массив, в который предстоит копировать объекты коллекции.
index: Индекс массива, с которого начинается добавление объектов.

Teigha.DatabaseServices.AttributeCollection.GetEnumerator
Возвращает объект перечислителя для этой коллекции.

Teigha.DatabaseServices.AttributeCollection.Count
Свойство предоставляет доступ к количеству элементов в коллекции.

Teigha.DatabaseServices.AttributeCollection.Item
Свойство реализует быстрый поиск элемента коллекции по его индексу.
index: Индекс искомого элемента массива, тип int.
Returns: Возвращает ObjectId элемента коллекции с индексом, равным параметру index.