Teigha.DatabaseServices.RadialDimension
Класс <c>RadialDimension</c> представляет радиальный размер в базе данных.

Teigha.DatabaseServices.RadialDimension.#ctor
Конструктор по умолчанию класса <c>RadialDimension</c>.

Teigha.DatabaseServices.RadialDimension.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,System.Double,String,DatabaseServices.ObjectId)
Конструктор класса <c>RadialDimension</c>. Создает объект радиального размера с указанными параметрами.
center: Точка центра измеряемой окружности или дуги. Тип <c>Point3d</c>.
chordPoint: Точка хорды на измеряемой окружности или дуге, к которой проводится размерная линия. Тип <c>Point3d</c>.
leaderLength: Длина линии выноски (расстояние от точки хорды до линии полки размера). Тип <c>double</c>.
dimensionText: Размерный текст для замены текста измеренного значения. Тип <c>String</c>.
dimensionStyle: Идентификатор объекта размерного стиля, который используется для отрисовки объекта измерения.

Teigha.DatabaseServices.RadialDimension.center
Свойство <c>Center</c> представляет трехмерные координаты (WCS) центра измеряемой дуги или окружности.
Returns: Возвращает центр дуги или окружности в мировой системе координат (WCS).
Тип <c>Point3d</c>.

Teigha.DatabaseServices.RadialDimension.chordPoint
Свойство <c>ChordPoint</c> представляет точку пересечения размерной линии и дуги или окружности, для которых проставляется размер.
Returns: Возвращает координаты точки в мировой системе координат (WCS). Тип <c>Point3d</c>.

Teigha.DatabaseServices.RadialDimension.LeaderLength
Свойство <c>LeaderLength</c> представляет длину линии выноски данного размера.
Returns: Возвращает длину линии выноски. Тип <c>double</c>.