Teigha.DatabaseServices.AssocEvaluationCallback
Класс предоставляет ассоциативным действиям механизмы реализации уведомлений о ходе обновления ассоциативных связей, сообщений о результатах вычислений, уведомлений о задействованных и измененных объектах, механизмы, позволяющие клиенту прервать и отменить обновление, и т.д.

Teigha.DatabaseServices.AssocEvaluationCallback.BeginActionEvaluation(Teigha.DatabaseServices.AssocAction)
Метод реализует уведомление о том, что началось вычисление ассоциативного действия. Не реализован.
action: Вычисляемое ассоциативное действие. Тип AssocAction.

Teigha.DatabaseServices.AssocEvaluationCallback.BeginActionEvaluationUsingObject(Teigha.DatabaseServices.AssocAction,Teigha.DatabaseServices.ObjectId,System.Boolean,System.Boolean,Teigha.DatabaseServices.DBObject)
Метод предназначен для уведомления о том, что действие собирается использовать или изменять объект базы данных. Не реализован.
pAction: Вычисляемое действие. Тип AssocAction.
objectId: Объект DBObject, который будет использоваться или изменяться действием. Тип ObjectId.
objectIsGoingToBeUsed: Флаг, указывающий, что данные объекта будут использоваться. Тип bool.
objectIsGoingToBeModified: Флаг, указывающий, что данные объекта будут изменяться. Тип bool.
substituteObject: Объект, который опционально предоставляется клиентским кодом обратного вызова.

Teigha.DatabaseServices.AssocEvaluationCallback.CancelActionEvaluation
Returns: Возвращает <c>true</c>, если обновление (вычисление) действия должно быть отменено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AssocEvaluationCallback.DeleteUnmanagedObject
Метод удаляет указатель на неуправляемый объект.

Teigha.DatabaseServices.AssocEvaluationCallback.EndActionEvaluation(Teigha.DatabaseServices.AssocAction)
Метод реализует уведомление о том, что вычисление действия завершено.
action: Действие, вычисление которого завершено.  Тип AssocAction.

Teigha.DatabaseServices.AssocEvaluationCallback.EndActionEvaluationUsingObject(Teigha.DatabaseServices.AssocAction,Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.DBObject)
Метод реализует уведомление о том, что действие завершило операции чтения и/или записи над указанным объектом.
action: Вычисляемое действие. Тип AssocAction.
objectId: Тот же самый объект, который ранее был передан в метод <c>BeginActionEvaluationUsingObject()</c>. Тип ObjectId.
obj: Объект, над которым выполняются операции чтения или записи. Тип DBObject.