Teigha.Geometry.BoundBlock3d
Класс <c>BoundBlock3d</c> представляет трехмерную граничную рамку.

Teigha.Geometry.BoundBlock3d.#ctor
Конструктор по умолчанию класса <c>BoundBlock3d</c>.

Teigha.Geometry.BoundBlock3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса <c>BoundBlock3d</c>.
Создает граничную рамку в виде параллелепипеда с заданными сторонами и базовой точкой.
point1: Базовая точка граничной рамки.  Тип <c>Point3d</c>.
dir1: Вектор, определяющий направление и длину первой стороны параллелепипеда.  Тип <c>Vector3d</c>.
dir2: Вектор, определяющий направление и длину второй стороны параллелепипеда.  Тип <c>Vector3d</c>.
dir3: Вектор, определяющий направление и длину третьей стороны параллелепипеда.  Тип <c>Vector3d</c>.

Teigha.Geometry.BoundBlock3d.Contains(Teigha.Geometry.Point3d)
Метод позволяет проверить, содержит ли данная граничная рамка указанную точку.
pointToTest: Входная 3D-точка.  Тип <c>Point3d</c>.
Returns: Возвращает <c>true</c>, если и только если указанная точка находится в пределах данной граничной рамки.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.BoundBlock3d.Create(IntPtr,System.Boolean)
Метод создает объект <c>BoundBlock3d</c> на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект, на основе которого создается новый объект.  Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает новый объект типа <c>BoundBlock3d</c>.

Teigha.Geometry.BoundBlock3d.Extend(Teigha.Geometry.Point3d)
Метод изменяет размеры граничной рамки так, чтобы она включала указанную точку.
pointToInclude: Входная точка, которая должна находиться в пределах граничной рамки.

Teigha.Geometry.BoundBlock3d.GetMaximumPoint
Метод предоставляет максимальную точку данной граничной рамки.
Returns: Возвращает экземпляр класса <c>Point3d</c>, который представляет максимальную точку граничной рамки.

Teigha.Geometry.BoundBlock3d.GetMinimumPoint
Метод предоставляет минимальную точку данной граничной рамки.
Returns: Возвращает экземпляр класса <c>Point3d</c>, который представляет минимальную точку граничной рамки.

Teigha.Geometry.BoundBlock3d.IsDisjoint(Teigha.Geometry.BoundBlock3d)
Метод позволяет проверить, пересекается ли данная граничная рамка с другой граничной рамкой.
block: Входная граничная рамка, пересечение с которой требуется проверить.
Returns: Возвращает <c>true</c> тогда и только тогда, когда указанная граничная рамка не пересекается с данной.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.BoundBlock3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет переопределить минимальную и максимальную точки данной граничной рамки.
basePoint: Новая минимальная  точка граничной рамки. Тип <c>Point3d</c>.
maximumPoint: Новая максимальная точка граничной рамки. Тип <c>Point3d</c>.

Teigha.Geometry.BoundBlock3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет задать базовую точку и стороны граничной рамки с геометрией в виде параллелепипеда.
basePoint: Входная базовая точка граничной рамки. Тип <c>Point3d</c>.
dir1: Первая сторона параллелепипеда.  Тип <c>Vector3d</c>.
dir2: Вторая сторона параллелепипеда.  Тип <c>Vector3d</c>.
dir3: Третья сторона параллелепипеда.  Тип <c>Vector3d</c>.

Teigha.Geometry.BoundBlock3d.Swell(System.Double)
Метод раздвигает стороны данной граничной рамки на заданное расстояние.
distance: Величина смещения сторон граничной рамки.  Тип <c>double</c>.

Teigha.Geometry.BoundBlock3d.TransformBy(Teigha.Geometry.Matrix3d)
Метод выполняет геометрическое преобразование этой граничной рамки, определяемое заданной 3D матрицей преобразования.
A_0: Входная матрица преобразования.

Teigha.Geometry.BoundBlock3d.BasePoint
Свойство <c>BasePoint</c> предоставляет доступ к базовой точке данной граничной рамки.
Returns: Возвращает базовую точку данной граничной рамки. Тип <c>Point3d</c>.

Teigha.Geometry.BoundBlock3d.Direction1
Свойство <c>Direction1</c> представляет направление и длину первой стороны данной граничной рамки.
Returns: Возвращает вектор, определяющий первую сторону граничной рамки.
Тип <c>Vector3d</c>.

Teigha.Geometry.BoundBlock3d.Direction2
Свойство <c>Direction2</c> представляет направление и длину второй стороны данной граничной рамки.
Returns: Возвращает вектор, определяющий вторую сторону граничной рамки. Тип <c>Vector3d</c>.

Teigha.Geometry.BoundBlock3d.Direction3
Свойство <c>Direction3</c> представляет направление и длину третьей стороны данной граничной рамки.
Returns: Возвращает вектор, определяющий третью сторону граничной рамки. Тип <c>Vector3d</c>.

Teigha.Geometry.BoundBlock3d.IsBox
Свойство <c>IsBox</c> позволяет проверить, представлена ли граничная рамка прямоугольным параллелепипедом, который ориентирован вдоль осей системы координат.
Returns: Возвращает <c>true</c>, если граничная рамка представлена прямоугольным параллелепипедом, который ориентирован вдоль осей системы координат.
В противном случае возвращает <c>false</c>.