Teigha.DatabaseServices.GridPropertyParameter
Эта структура представляет свойства линий сетки для объектов <c>Table</c>.

Teigha.DatabaseServices.GridPropertyParameter.PropertyMask
Свойство представляет маску для указания параметров сетки.
Свойства сетки можно комбинировать с помощью операции OR для масок.
Returns: Возвращает свойство или комбинацию свойств сетки таблицы. Тип <c>DatabaseServices.GridProperties</c>.