Teigha.DatabaseServices.Ole2Frame
Этот класс обеспечивает поддержку объектов OLE 2 в чертежах nanoCAD.

Teigha.DatabaseServices.Ole2Frame.#ctor
Конструктор по умолчанию класса <c>Ole2Frame</c>.

Teigha.DatabaseServices.Ole2Frame.CreateFromFile(String)
Метод предназначен для создания объекта <c>Ole2Frame</c>, используя указанный файл в качестве источника данных.
FileName: Имя файла с данными. Тип <c>String</c>.
Returns: Возвращает <c>true</c> в случае успешного завершения операции.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Ole2Frame.getCompoundDocument(Runtime.StreamBuf)
Метод выполняет запись данных составного документа в указанный поток.
streamBuf: Буфер потока, в который выполняется запись данных.

Teigha.DatabaseServices.Ole2Frame.setCompoundDocument(System.Int32,Runtime.StreamBuf)
Метод выполняет чтение данных составного документа из указанного потока.
nSize: Размер считываемых составных данных в байтах. Тип <c>int</c>.
streamBuf: Буфер потока, из которого выполняется чтение данных.

Teigha.DatabaseServices.Ole2Frame.setHimetricSize(short,short)
Метод задает значения необрабатываемым полям.
В текущей версии не используется, в будущих релизах будет удален или переименован.
Width: Ширина окна. Тип <c>short</c>.
Height: Высота окна. Тип <c>short</c>.

Teigha.DatabaseServices.Ole2Frame.AutoOutputQuality
Свойство представляет качество печати, "автоматически выбираемое приложением".
Returns: Возвращает качество печати. Тип <c>byte</c>.

Teigha.DatabaseServices.Ole2Frame.DrawAspect
Свойство представляет характер представления объекта при отрисовке или получении данных.
Returns: Возвращает значение из перечисления <c>OleDvAspect</c>.

Teigha.DatabaseServices.Ole2Frame.HimetricHeight
Свойство представляет высоту окна в единицах измерения, не зависящих от разрешения устройства вывода.
Не используется, в будущих релизах будет удалено или переименовано.
Returns: Возвращает высоту окна.
Тип <c>short</c>.

Teigha.DatabaseServices.Ole2Frame.HimetricWidth
Свойство представляет ширину окна в единицах измерения, не зависящих от разрешения устройства вывода.
Не используется и в будущих релизах будет удалено или переименовано.
Returns: Возвращает ширину окна.
Тип <c>short</c>.

Teigha.DatabaseServices.Ole2Frame.IsLinked
Свойство позволяет проверить, является ли данный объект связанным.
Returns: Возвращает <c>true</c>, если данный объект является связанным.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Ole2Frame.LinkName
Свойство представляет имя файла и элемент, с которым связан данный объект <c>Ole2Frame</c>.
Returns: Возвращает строку, содержащую имя файла и элемент в файле, с которым связан OLE-объект.
Тип <c>String</c>.

Teigha.DatabaseServices.Ole2Frame.LinkPath
Свойство представляет имя файла, с которым связан данный объект <c>Ole2Frame</c>.
Returns: Возвращает полное имя файла. Тип <c>String</c>.

Teigha.DatabaseServices.Ole2Frame.Location
Свойство представляет координатную точку левого верхнего угла объекта OLE.
Returns: Возвращает точку привязки данного объекта.
Тип <c>Point3d</c>.

Teigha.DatabaseServices.Ole2Frame.LockAspect
Свойство позволяет управлять блокировкой пропорций окна данного объекта при изменении размеров окна.
Returns: Возвращает <c>true</c>, если при изменении размеров окна объекта пропорции окна должны оставаться неизменными.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Ole2Frame.OleObject
Свойство предоставляет доступ к объекту MFC, который в данный момент используется объектом <c>Ole2Frame</c>.
Returns: Возвращает используемый объект MFC. Тип <c>Object</c>.

Teigha.DatabaseServices.Ole2Frame.OutputQuality
Свойство представляет текущую установку качества печати для данного OLE-объекта.
Returns: Возвращает значение качества печати. Тип <c>byte</c>.

Teigha.DatabaseServices.Ole2Frame.Position2d
Свойство представляет координаты четырех угловых точек OLE-объекта в координатах GDI текущего видового экрана.
Returns: Возвращает четыре угловые точки OLE-объекта в виде объекта <c>System.Drawing.Rectangle</c>.

Teigha.DatabaseServices.Ole2Frame.Position3d
Свойство представляет координаты четырех угловых точек OLE-объекта в мировой системе координат (WCS).
Returns: Возвращает четыре угловых точки OLE-объекта в виде объекта <c>Rectangle3d</c>.

Teigha.DatabaseServices.Ole2Frame.Rotation
Свойство представляет угол поворота для этого OLE-объекта.
Returns: Возвращает угол поворота OLE-объекта (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.Ole2Frame.ScaleHeight
Свойство представляет масштабный коэффициент OLE-объекта по высоте, выраженный в процентах.
Returns: Возвращает масштаб OLE-объекта по высоте.
Тип <c>double</c>.

Teigha.DatabaseServices.Ole2Frame.ScaleWidth
Свойство представляет масштабный коэффициент OLE-объекта по ширине, выраженный в процентах.
Returns: Возвращает масштаб OLE-объекта по ширине.
Тип <c>double</c>.

Teigha.DatabaseServices.Ole2Frame.Type
Свойство представляет тип данного OLE-объекта.
Returns: Возвращает тип OLE-объекта из перечисления <c>ItemType</c>.

Teigha.DatabaseServices.Ole2Frame.UserType
Свойство представляет определяемое пользователем наименование типа OLE-объекта.
Returns: Возвращает пользовательское наименование типа OLE-объекта.
Тип <c>String</c>.

Teigha.DatabaseServices.Ole2Frame.WcsHeight
Свойство представляет фактическую высоту этого OLE-объекта в мировой системе координат (WCS).
Returns: Возвращает высоту OLE-объекта.
Тип <c>double</c>.

Teigha.DatabaseServices.Ole2Frame.WcsWidth
Свойство представляет фактическую ширину этого OLE-объекта в мировой системе координат (WCS).
Returns: Возвращает ширину OLE-объекта.
Тип <c>double</c>.