Teigha.DatabaseServices.DynamicDimensionDataCollection
Класс DynamicDimensionDataCollection представляет коллекцию объектов DynamicDimensionData.

Teigha.DatabaseServices.DynamicDimensionDataCollection.#ctor
Конструктор класса по умолчанию.

Teigha.DatabaseServices.DynamicDimensionDataCollection.Add(Teigha.DatabaseServices.DynamicDimensionData)
Метод Add() добавляет в коллекцию объект DynamicDimensionData.
data: Добавляемый в коллекцию объект. Тип DynamicDimensionData.
Returns: Возвращает позицию нового элемента в коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.DynamicDimensionDataCollection.Clear
Метод Clear() позволяет очистить коллекцию.

Teigha.DatabaseServices.DynamicDimensionDataCollection.CopyTo(array&lt;DynamicDimensionData&gt;,System.Int32)
Метод CopyTo() копирует эту коллекцию в указанный массив по указанному индексу.
arr: Массив, в который копируется данная коллекция. Тип DynamicDimensionData[].
index: Индекс в указанном массиве, начиная с которого в массиве сохраняются элементы коллекции.  Тип <c>int</c>.

Teigha.DatabaseServices.DynamicDimensionDataCollection.GetEnumerator
Метод <c>GetEnumerator()</c> позволяет получить перечислитель для этой коллекции.
Returns: Возвращает перечислитель. Тип <c>System.Collections.IEnumerator</c>.

Teigha.DatabaseServices.DynamicDimensionDataCollection.RemoveAt(System.Int32)
Метод <c>RemoveAt()</c> позволяет удалить из коллекции элемент с указанным индексом.
i: Индекс удаляемого элемента коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.DynamicDimensionDataCollection.Count
Свойство Count обеспечивает доступ к текущему количеству элементов в коллекции.
Returns: Возвращает количество элементов в коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.DynamicDimensionDataCollection.Item
Свойство Item задает или возвращает элемент коллекции с указанным индексом.
index: Индекс элемента коллекции. Тип <c>int</c>.
Returns: Возвращает элемент коллекции по его индексу.  Тип DynamicDimensionData.