Teigha.Geometry.LinearEntity3d
Класс <c>LinearEntity3d</c> является абстрактным базовым классом для всех классов трехмерных линейных объектов.

Teigha.Geometry.LinearEntity3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>LinearEntity3d</c>.

Teigha.Geometry.LinearEntity3d.GetLine
Метод предоставляет бесконечную линию, коллинеарную данному линейному объекту.
Returns: Возвращает бесконечную линию, коллинеарную данному линейному объекту.
Тип <c>Line3d</c>.

Teigha.Geometry.LinearEntity3d.GetPerpendicularPlane(Teigha.Geometry.Point3d)
Метод предоставляет плоскость, перпендикулярную данному линейному объекту и проходящую через указанную точку.
intersectionPoint: Входная произвольная точка. Тип <c>Point3d</c>.
Returns: Возвращает плоскость, перпендикулярную данному линейному объекту и проходящую через точку <c>intersectionPoint</c>.
Тип <c>Plane</c>.

Teigha.Geometry.LinearEntity3d.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод определяет точку пересечения данного объекта с другим линейным объектом.
line: Проверяемый линейный объект. Тип <c>LinearEntity3d</c>.
Returns: Возвращает массив из одного элемента с точкой пересечения.
Тип <c>Point3d[]</c>.

Teigha.Geometry.LinearEntity3d.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод определяет точку пересечения данного объекта с другим линейным объектом с некоторой заданной точностью.
line: Проверяемый линейный объект. Тип <c>LinearEntity3d</c>.
tolerance: Входное значение геометрической точности. Тип <c>Tolerance</c>.
Returns: Возвращает массив из одного элемента с точкой пересечения.
Тип <c>Point3d[]</c>.

Teigha.Geometry.LinearEntity3d.IntersectWith(Teigha.Geometry.PlanarEntity)
Метод вычисляет точку пересечения данного линейного объекта с указанной плоскостью.
plane: Входная плоскость. Тип <c>PlanarEntity</c>.
Returns: Возвращает массив из одного элемента с точкой пересечения.
Тип <c>Point3d[]</c>.

Teigha.Geometry.LinearEntity3d.IntersectWith(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод вычисляет с некоторой заданной точностью точку пересечения данного линейного объекта с указанной плоскостью.
plane: Входная плоскость. Тип <c>PlanarEntity</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив из одного элемента с точкой пересечения.
Тип <c>Point3d[]</c>.

Teigha.Geometry.LinearEntity3d.IsColinearTo(Teigha.Geometry.LinearEntity3d)
Метод позволяет проверить, является ли данный объект коллинеарным указанному линейному объекту.
line: Проверяемый линейный объект. Тип <c>LinearEntity3d</c>.
Returns: Возвращает <c>true</c>, если данный объект коллинеарен указанному линейному объекту.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.IsColinearTo(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, является ли данный объект коллинеарным указанному линейному объекту в пределах некоторой заданной точности.
line: Проверяемый линейный объект.      Тип <c>LinearEntity3d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах указанной точности объекты можно считать коллинеарными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.IsOn(Teigha.Geometry.Plane)
Метод проверяет, принадлежит ли данный объект указанной плоскости.
plane: Входная плоскость. Тип <c>Plane</c>.
Returns: Возвращает <c>true</c>, если данный объект лежит в указанной плоскости.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.IsOn(Teigha.Geometry.Plane,Teigha.Geometry.Tolerance)
Метод позволяет проверить, лежит ли данный объект в указанной плоскости в пределах заданной точности.
plane: Входная плоскость. Тип <c>Plane</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах точности <c>tolerance</c> данный объект лежит в плоскости <c>plane</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.IsParallelTo(Teigha.Geometry.LinearEntity3d)
Метод позволяет проверить параллельность данного объекта и указанного линейного объекта.
line: Входной линейный объект. Тип <c>LinearEntity3d</c>.
Returns: Возвращает <c>true</c>, если данный объект можно считать параллельным объекту <c>line</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.IsParallelTo(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет с некоторой заданной точностью проверить параллельность данного объекта и указанного линейного объекта.
line: Входной линейный объект. Тип <c>LinearEntity3d</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах точности <c>tolerance</c> данный объект и объект <c>line</c> можно считать параллельными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.IsParallelTo(Teigha.Geometry.PlanarEntity)
Метод позволяет проверить параллельность данного объекта и указанной плоскости.
plane: Входная плоскость. Тип <c>PlanarEntity</c>.
Returns: Возвращает <c>true</c>, если данный объект и плоскость <c>plane</c> параллельны друг другу.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.IsParallelTo(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет проверить параллельность данного объекта и указанной плоскости в пределах заданной точности.
plane: Входная плоскость. Тип <c>PlanarEntity</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах точности <c>tolerance</c> данный объект можно считать параллельным плоскости <c>plane</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.IsPerpendicularTo(Teigha.Geometry.LinearEntity3d)
Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта.
line: Входной линейный объект. Тип <c>LinearEntity3d</c>.
Returns: Возвращает <c>true</c>, если линейные объекты перпендикулярны друг другу.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.IsPerpendicularTo(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить перпендикулярность данного объекта и указанного линейного объекта в пределах заданной геометрической точности.
line: Входной линейный объект. Тип <c>LinearEntity3d</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах точности <c>tolerance</c> линейные объекты можно считать взаимно перпендикулярными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.IsPerpendicularTo(Teigha.Geometry.PlanarEntity)
Метод позволяет проверить перпендикулярность данного объекта и указанной плоскости.
plane: Входная плоскость. Тип <c>PlanarEntity</c>.
Returns: Возвращает <c>true</c>, если данный объект перпендикулярен указанной плоскости.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.IsPerpendicularTo(Teigha.Geometry.PlanarEntity,Teigha.Geometry.Tolerance)
Метод позволяет проверить перпендикулярность данного объекта и указанной плоскости в пределах заданной точности.
plane: Входная плоскость. Тип <c>PlanarEntity</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах точности <c>tolerance</c> данный объект можно считать перпендикулярным плоскости <c>plane</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.LinearEntity3d.Overlap(Teigha.Geometry.LinearEntity3d)
Метод позволяет определить область перекрытия данного объекта с указанным линейным объектом.
line: Входной линейный объект. Тип <c>LinearEntity3d</c>.
Returns: Возвращает объект, который представляет область перекрытия.
Тип <c>LinearEntity3d</c>.

Teigha.Geometry.LinearEntity3d.Overlap(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет определить область перекрытия данного объекта и указанного линейного объекта, вычисленную с некоторой заданной точностью.
line: Входной линейный объект. Тип <c>LinearEntity3d</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает объект, который представляет область перекрытия.
Тип <c>LinearEntity3d</c>.

Teigha.Geometry.LinearEntity3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d)
Метод позволяет вычислить пересечение проекций данного объекта и указанного линейного объекта.
line: Входной линейный объект. Тип <c>LinearEntity3d</c>.
projectionDirection: Направление проецирования. Тип <c>Vector3d</c>.
Returns: Возвращает массив точек пересечения из двух элементов. Тип <c>Point3d[]</c>.
Элемент с индексом 0 представляет точку пересечения на данном объекте, а элемент с индексом 1 - точку на объекте <c>line</c>.

Teigha.Geometry.LinearEntity3d.ProjectedIntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Tolerance)
Метод позволяет вычислить пересечение проекций данного объекта и указанного линейного объекта в пределах некоторой заданной точности.
line: Входной линейный объект. Тип <c>LinearEntity3d</c>.
projectionDirection: Направление проецирования. Тип <c>Vector3d</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив точек пересечения из двух элементов. Тип <c>Point3d[]</c>.
Элемент с индексом 0 представляет точку пересечения на данном объекте, а элемент с индексом 1 - точку на объекте <c>line</c>.

Teigha.Geometry.LinearEntity3d.Direction
Свойство <c>Direction</c> представляет единичный направляющий вектор данного линейного объекта.
Returns: Возвращает единичный направляющий вектор данного объекта.
Тип <c>Vector3d</c>.

Teigha.Geometry.LinearEntity3d.PointOnLine
Свойство <c>PointOnLine</c> представляет произвольную точку, гарантированно расположенную на данном линейном объекте.
Returns: Возвращает точку на данном линейном объекте. Тип <c>Point3d</c>.