Teigha.DatabaseServices.Filters.SpatialFilterDefinition
Этот класс инкапсулирует данные, необходимые для определения пространственного фильтра <c>SpatialFilter</c>.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Boolean)
Конструктор класса SpatialFilterDefinition.
pts: Коллекция вершин выдавливаемого 2D-контура, который определяет форму области фильтра в плане.
normal: Вектор, определяющий положительное направление выдавливания контура с вершинами <c>pts</c> в системе координат WCS. Тип <c>Vector3d</c>.
elevation: Расстояние от начала системы координат WCS до плоскости, в которой располагается выдавливаемый контур области фильтра.  Тип <c>double</c>. Значение <c>elevation</c> и вектор нормали <c>normal</c> определяют плоскость для системы координат объекта (ECS), в которой задаются вершины <c>pts</c> выдавливаемого контура.
frontClip: Расстояние в направлении вектора <c>normal</c> до передней плоскости отсечения. Тип <c>double</c>.
backClip: Расстояние до задней плоскости отсечения в отрицательном направлении выдавливания. Тип <c>double</c>.
enabled: Флаг состояния пространственной области фильтра. Тип <c>bool</c>. Если область отключена (значение <c>false</c>), то зоной действия фильтра становится все 3D-пространство.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.GetPoints
Метод позволяет получить коллекцию точек, которые определяют выдавливаемый контур области фильтра (её основание).
Returns: Возвращает коллекцию 2D-вершин основания области фильтра. Тип <c>Point2dCollection</c>.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.BackClip
Свойство возвращает расстояние задней плоскости отсечения в отрицательном направлении выдавливания.
Returns: Возвращает расстояние до задней плоскости отсечения. Тип <c>double</c>.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.Elevation
Свойство <c>Elevation</c> возвращает значение возвышения.  Совместно с вектором <c>normal</c> эта величина определяет плоскость системы координат ECS, в которой определены точки многоугольника основания.
Returns: Возвращает значение возвышения. Тип <c>double</c>.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.Enabled
Свойство <c>Enabled</c> позволяет определить, используется ли для фильтрации объектов чертежа граничная область фильтра или же всё трехмерное пространство.
Returns: Возвращает <c>true</c>, если для фильтрации объектов чертежа используется граничная область фильтра.
Если область отключена (значение <c>false</c>), то зоной действия фильтра становится все 3D-пространство.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.FrontClip
Свойство <c>FrontClip</c> возвращает расстояние до передней плоскости отсечения в положительном направлении выдавливания.
Returns: Возвращает расстояние до передней плоскости отсечения. Тип <c>double</c>.

Teigha.DatabaseServices.Filters.SpatialFilterDefinition.Normal
Свойство <c>Normal</c> возвращает положительное направление выдавливания 2D-контура области фильтра.
Returns: Возвращает вектор направления выдавливания. Тип <c>Vector3d</c>.