Teigha.Geometry.Matrix2dBuilder
Класс <c>Matrix2dBuilder</c> используется для создания экземпляров класса <c>Teigha.Geometry.Matrix2d</c>, который является неизменяемым типом.

Teigha.Geometry.Matrix2dBuilder.#ctor
Конструктор по умолчанию класса <c>Matrix2dBuilder</c>.

Teigha.Geometry.Matrix2dBuilder.#ctor(Teigha.Geometry.Matrix2d)
Конструктор класса <c>Matrix2dBuilder</c>.
Создает новый экземпляр класса на основе указанной матрицы.
value: Входная матрица, на основе которой создается новый экземпляр класса. Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2dBuilder.ToMatrix2d
Метод предоставляет двумерную матрицу, связанную с данным объектом.
Returns: Возвращает двумерную матрицу, связанную с данным объектом.
Тип <c>Matrix2d</c>.

Teigha.Geometry.Matrix2dBuilder.ElementAt
Свойство <c>ElementAt</c> представляет элемент матрицы с указанными индексами строки и столбца.
i: Индекс строки. Тип <c>int</c>.
j: Индекс столбца. Тип <c>int</c>.
Returns: Возвращает элемент матрицы с указанными индексами строки и столбца.
Тип <c>double</c>.