Teigha.DatabaseServices.Filters.Index
Этот класс является базовым классом для всех индексов.
Его наследниками являются классы <c>SpatialIndex</c> и <c>LayerIndex</c>.

Teigha.DatabaseServices.Filters.Index.GetIterator(Teigha.GraphicsInterface.Filter)
Метод предназначен для создания нового объекта FilteredBlockIterator, который обеспечивает доступ к объектам чертежа в этом объекте Index.
filter: Входной фильтр (запрос), который будет применен к индексу для обхода с использованием итератора.
Returns: Возвращает объект итератора. Тип <c>FilteredBlockIterator</c>.
В случае ошибки возвращает <c>null</c>.

Teigha.DatabaseServices.Filters.Index.RebuildFull(Teigha.DatabaseServices.Filters.IndexUpdateData)
Метод позволяет полностью перестроить данный объект Index с использованием объектов чертежа из записи таблицы блоков.
indexData: Входной объект <c>IndexUpdateData</c>, который будет использоваться при перестроении индекса.

Teigha.DatabaseServices.Filters.Index.IsUptoDate
Свойство <c>IsUptoDate</c> проверяет актуальность данного индекса.
Returns: Возвращает <c>true</c>, только если данный индекс актуален.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Filters.Index.LastUpdatedAt
Свойство <c>LastUpdatedAt</c> предоставляет доступ к временной метке по юлианскому календарю для данного объекта Index.
Returns: Возвращает временную метку для данного индекса по юлианскому календарю. Тип <c>DateTime</c>.

Teigha.DatabaseServices.Filters.Index.LastUpdatedAtU
Свойство <c>LastUpdatedAtU</c> предоставляет доступ к временной метке последнего обновления данного индекса по шкале всемирного времени (UT).
Returns: Возвращает временную метку последнего обновления индекса по шкале всемирного времени (UT).
Тип <c>DateTime</c>.

Teigha.DatabaseServices.Filters.Index.ObjectBeingIndexedId
Свойство возвращает идентификатор родительской записи таблицы блоков, с которой связан (и которой неявно принадлежит) данный индекс.
Returns: Возвращает идентификатор объекта записи таблицы блоков. Тип <c>DatabaseServices.ObjectId</c>.