Teigha.DatabaseServices.Layout
Объект Layout хранит характеристики каждого листа.
Объекты Layout хранятся в объекте Dictionary с ключом ACAD_LAYOUT, что облегчает их перебор и индексирование.

Teigha.DatabaseServices.Layout.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.Layout.AddToLayoutDictionary(DatabaseServices.Database,DatabaseServices.ObjectId)
Этот метод добавляет лист в словарь листов указанной базы данных и определяет для использования запись таблицы блоков.
toWhichDatabase: База данных, в которую добавляется лист, тип Database.
blockTableRecordId: Идентификатор используемой записи в таблице блоков, тип ObjectId.

Teigha.DatabaseServices.Layout.GetViewports
Метод возвращает коллекцию ObjectId всех видовых экранов, присутствующих в пространстве листа.
Returns: Возвращает коллекцию ObjectId всех видовых экранов, тип ObjectIdCollection.

Teigha.DatabaseServices.Layout.Initialize
Этот метод выполняет закулисную работу по созданию видового экрана для листа.
<p>Это позволяет настроить лист и подготовить его для создания в нем других видовых экранов и объектов, а также задать различные свойства листа.</p>
Returns: Возвращает ObjectId созданного видового экрана в пространстве листа.

Teigha.DatabaseServices.Layout.AnnoAllVisible
Свойство обеспечивает доступ к текущему значению системной переменной ANNOALLVISIBLE для базы данных.
Returns: Возвращает true, если отображаются все аннотативные объекты, и false, если отображаются только те аннотативные объекты, которые поддерживают текущий аннотативный масштаб.

Teigha.DatabaseServices.Layout.BlockTableRecordId
Получает доступ к ObjectId связанной с листом записи BlockTableRecord.
Returns: Возвращает ObjectId связанной с листом записи BlockTableRecord.

Teigha.DatabaseServices.Layout.Extents
Предоставляет доступ к текущей настройке границ листа.  Это значение может быть не фактическим размером геометрии на листе, а лишь последним сохраненным в листе значением.
Returns: Возвращает границы листа в виде объекта Extents3d.

Teigha.DatabaseServices.Layout.LayoutName
Обеспечивает доступ к имени листа, которое отображается на вкладке листа.
Returns: Возвращает отображаемое на вкладке имя листа, тип String.

Teigha.DatabaseServices.Layout.Limits
Обеспечивает доступ к лимитам листа.
Returns: Возвращает лимиты листа в виде объекта Extents2d.

Teigha.DatabaseServices.Layout.TabOrder
Предоставляет доступ к полю, управляющему порядком отображения листов в элементе управления вкладками, которое располагается в нижней части видового экрана.
Returns: Возвращает целочисленное значение, int.

Teigha.DatabaseServices.Layout.TabSelected
Включает/выключает доступ к вкладке листа при операциях выделения, затрагивающих несколько вкладок.
Returns: Возвращает true, если включен доступ к вкладке листа при операциях выделения, затрагивающих несколько вкладок, и false в противном случае.

Teigha.DatabaseServices.Layout.Thumbnail
Предоставляет доступ к текущему буферу, в котором хранится растровая миниатюра данного листа.
Returns: Возвращает/получает тип Bitmap.

Teigha.DatabaseServices.Layout.CurrentViewportId
Свойство предоставляет доступ к ObjectId активного видового экрана документа.
Returns: Возвращает ObjectId активного видового экрана документа.