HostMgd.EditorInput.PromptIntegerResult
Класс, содержащий результаты ввода целого числа после
приглашения.

HostMgd.EditorInput.PromptIntegerResult.ToString(IFormatProvider)
Возвращает строку, соответствующую введенному вещественному
числу в соответствии с заданным форматом, зависящим от
локализации.
provider: Формат, зависящей от локализации

HostMgd.EditorInput.PromptIntegerResult.Value
Возвращает или задает значение целого числа, введенного
пользователем.