Teigha.DatabaseServices.SectionType
Перечисление <c>SectionType</c> задает возможные типы создаваемых сечений, каждый из которых определяет свой собственный комплекс свойств порождаемой геометрии сечения.