Teigha.DatabaseServices.CustomScale
Этот класс предназначен для хранения значений числителя и знаменателя, используемых для формирования пользовательского масштаба печати.

Teigha.DatabaseServices.CustomScale.#ctor(System.Double,System.Double)
Конструктор класса CustomScale.
numerator: Числитель.   Тип double.
denominator: Знаменатель. Тип double.

Teigha.DatabaseServices.CustomScale.Equals(Object)
Метод предназначен для проверки объектов CustomScale на совпадение.
obj: Объект, который проверяется на совпадение с данным объектом CustomScale. Тип Object.
Returns: Возвращает <c>true</c>, если переданный объект <c>obj</c> не является нулевым и имеет те же самые значения числителя и знаменателя масштаба.
В противном случае возвращает <c>false</c>.
Notes

Teigha.DatabaseServices.CustomScale.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Returns: Возвращает хеш-код объекта. Тип <c>int</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c> должно выполняться согласованно с сохранением общей логики.
Если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов обязаны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хэш-коды должны формироваться с использованием полей, на которых основано равенство объектов.

Teigha.DatabaseServices.CustomScale.IsEqualTo(Teigha.DatabaseServices.CustomScale)
Метод предназначен для проверки данного объекта на совпадение с входным объектом CustomScale.
a: Пользовательский масштаб, с которым данный объект проверяется на равенство. Тип CustomScale.
Returns: Возвращает <c>true</c>, если входной объект <c>a</c> не является нулевым и имеет те же самые значения числителя и знаменателя масштаба.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CustomScale.IsEqualTo(Teigha.DatabaseServices.CustomScale,Teigha.Geometry.Tolerance)
Метод предназначен для проверки данного объекта на совпадение с входным объектом CustomScale в пределах указанного допуска.
a: Пользовательский масштаб, с которым данный объект проверяется на равенство. Тип CustomScale.
tolerance: Заданный допуск для сравнения на равенство. Тип Tolerance.
Returns: Возвращает <c>true</c>, если входной объект <c>a</c> не является нулевым и имеет совпадающие в пределах допуска значения числителя и знаменателя масштаба.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.CustomScale.ToString
Метод предназначен для формирования эквивалентного строкового представления данного объекта.
Returns: Возвращает строку, которая содержит значения числителя и знаменателя пользовательского масштаба. Тип String.

Teigha.DatabaseServices.CustomScale.ToString(IFormatProvider)
Метод формирует строковое представление данного объекта с учетом языковых и региональных настроек.
provider: Провайдер формата региональных и языковых настроек. Тип IFormatProvider.
Returns: Возвращает представление данного объекта в виде строки. Тип String.
Строка содержит значения числителя и знаменателя пользовательского масштаба.

Teigha.DatabaseServices.CustomScale.Denominator
Свойство представляет знаменатель этого пользовательского масштаба.
Returns: Возвращает знаменатель пользовательского масштаба. Тип double.

Teigha.DatabaseServices.CustomScale.Numerator
Свойство представляет числитель этого пользовательского масштаба.
Returns: Возвращает числитель пользовательского масштаба.  Тип double.