Teigha.DatabaseServices.MlineStyleElement.#ctor(System.Double,Teigha.Colors.Color,Teigha.DatabaseServices.ObjectId)
Конструктор класса <c>MlineStyleElement</c>.
Создает элемент стиля с указанным смещением, цветом и идентификатором типа линии.
offset: Смещение элемента. 		Тип <c>double</c>.
color: Цвет элемента. 			Тип <c>Color</c>.
linetypeId: Идентификатор типа линии. 	Тип <c>ObjectId</c>.

Teigha.DatabaseServices.MlineStyleElement.ToString
Метод формирует эквивалентное представление данного объекта в виде текстовой строки.
Returns: Возвращает текстовою строку, представляющую данный объект. Тип <c>String</c>.

Teigha.DatabaseServices.MlineStyleElement.ToString(IFormatProvider)
Метод формирует эквивалентное представление данного объекта в виде текстовой строки, которое учитывает предписанные языковые и региональные настройки.
provider: Провайдер языковых и региональных настроек. Тип <c>IFormatProvider</c>.
Returns: Возвращает текстовою строку, представляющую данный объект. Тип <c>String</c>.

Teigha.DatabaseServices.MlineStyleElement.Color
Свойство возвращает цвет данного элемента стиля.
Returns: Возвращает цвет элемента стиля. Тип <c>Colors.Color</c>.

Teigha.DatabaseServices.MlineStyleElement.LinetypeId
Свойство возвращает идентификатор объекта типа линий, используемого как часть элемента стиля.
Returns: Возвращает идентификатор объекта типа линий. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.MlineStyleElement.Offset
Свойство возвращает смещение для данного элемента стиля.
Returns: Возвращает смещение для данного элемента стиля. Тип <c>double</c>.