Teigha.DatabaseServices.ObjectContextManager
Класс <c>ObjectContextManager</c> предназначен для управления коллекцией доступных в чертеже типов контекста.

Teigha.DatabaseServices.ObjectContextManager.#ctor
Конструктор по умолчанию класса <c>ObjectContextManager</c>.

Teigha.DatabaseServices.ObjectContextManager.GetContextCollection(String)
Метод предоставляет коллекцию контекстов, зарегистрированную в данном менеджере контекстов под указанным именем.
collectionName: Имя контекста.  Тип <c>String</c>.
Returns: Возвращает зарегистрированную коллекцию контекстов. Тип <c>ObjectContextCollection</c>.
В случае отсутствия такой коллекции, возвращает нулевой указатель.

Teigha.DatabaseServices.ObjectContextManager.RegisterContextCollection(String,Teigha.DatabaseServices.ObjectContextCollection)
Метод позволяет зарегистрировать в данном менеджере контекстов коллекцию контекстов под указанным именем.
collectionName: Имя для регистрации коллекции контекстов. Тип <c>String</c>.
collection: Коллекция контекстов. Тип <c>ObjectContextCollection</c>.

Teigha.DatabaseServices.ObjectContextManager.UnregisterContextCollection(String)
Метод предназначен для отмены регистрации коллекции контекстов в данном менеджере контекстов.
collectionName: Имя коллекции контекстов. Тип <c>String</c>.