Teigha.DatabaseServices.OpenModeAttribute
Класс представляет атрибут, который сообщает об режиме открытия объекта.

Teigha.DatabaseServices.OpenModeAttribute.#ctor(DatabaseServices.OpenMode)
Конструктор класса <c>OpenModeAttribute</c>.
mode: Режим открытия объекта. Значение из перечисления <c>DatabaseServices.OpenMode</c>.

Teigha.DatabaseServices.OpenModeAttribute.OpenMode
Свойство представляет режим открытия объекта.
Returns: Возвращает режим открытия объекта. Значение из перечисления <c>DatabaseServices.OpenMode</c>.