Teigha.GraphicsInterface.CommonDraw
Класс CommonDraw абстрагирует общность классов ViewportDraw и WorldDraw.
CommonDraw позволяет разрабатывать код графических процедур, который будет работать в обоих случаях.

Teigha.GraphicsInterface.CommonDraw.Deviation(Teigha.GraphicsInterface.DeviationType,Teigha.Geometry.Point3d)
Метод позволяет получить рекомендуемое максимальное отклонение для типа тесселяции, переданного в метод в аргументе deviationType.
deviationType: Входной тип тесселяции. Тип DeviationType.
pointOnCurve: Входная точка, определяющая кривую или поверхность для тесселяции.	Тип Point3d.
Returns: Возвращает максимальное отклонение при тесселяции.
Тип double.

Teigha.GraphicsInterface.CommonDraw.Context
Свойство возвращает управляющий контекст.  Указатель гарантированно не равен NULL.
Returns: Возвращает управляющий контекст. Тип GraphicsInterface.Context.

Teigha.GraphicsInterface.CommonDraw.IsDragging
Свойство позволяет выяснить, перетаскивается ли объект в данный момент.
Returns: Возвращает true, если объект в данный момент перетаскивается. В противном случае возвращает false.

Teigha.GraphicsInterface.CommonDraw.NumberOfIsolines
Свойство возвращает предлагаемое количество изолиний, которые будут использоваться для представления объекта.
Returns: Возвращает количество изолиний. Тип Int32.

Teigha.GraphicsInterface.CommonDraw.RawGeometry
Свойство возвращает текущий класс геометрии как Geometry.
Указатель гарантированно не равен NULL.
Returns: Возвращает текущий класс геометрии как класс Geometry.

Teigha.GraphicsInterface.CommonDraw.RegenAbort
Свойство предоставляет возможность узнать, запрашивает ли система немедленное прекращение регенерации графики.
Returns: Возвращает состояние флага немедленного прекращения регенерации графики. Тип bool.
Если возвращаемое значение равно true, следует незамедлительно прекратить обновление графики, выполнить очистку и возврат.

Teigha.GraphicsInterface.CommonDraw.RegenType
Свойство возвращает текущий режим регенерации графики.
Returns: Возвращает текущий режим регенерации. Значение из перечисления GraphicsInterface.RegenType.

Teigha.GraphicsInterface.CommonDraw.SubEntityTraits
Свойство возвращает объект SubEntityTraits, который предоставляет доступ к значениями атрибутов текущей геометрии (цвет, слой, тип линий и т.п.).
Returns: Возвращает объект GraphicsInterface.SubEntityTraits.