Teigha.DatabaseServices.MeshPointMap.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор структуры <c>MeshPointMap</c>.
sourcePt: Исходная точка.   Тип <c>Point2d</c>.
destPt: Точка назначения. Тип <c>Point2d</c>.

Teigha.DatabaseServices.MeshPointMap.DestPoint
Свойство <c>DestPoint</c> представляет точку назначения.
Returns: Возвращает точку назначения. Тип <c>Point2d</c>.

Teigha.DatabaseServices.MeshPointMap.SourcePoint
Свойство <c>SourcePoint</c> представляет исходную точку.
Returns: Возвращает исходную точку. Тип <c>Point2d</c>.