HostMgd.EditorInput.PromptDoubleOptions
Класс, представляющий необязательные параметры приглашения
для ввода вещественного числа.

HostMgd.EditorInput.PromptDoubleOptions.DefaultValue
Возвращает и устанавливает значение по умолчанию, которое
используется при вводе Enter без ввода каких-либо других
символов.

HostMgd.EditorInput.PromptDoubleOptions.#ctor(String)
Конструктор.
message: Приглашающее сообщение

HostMgd.EditorInput.PromptDoubleOptions.#ctor(String,String)
Конструктор.
messageAndKeywords: Приглашающая строка с ключевыми словами
globalKeywords: Строка ключевых слов (глобальные имена)