Teigha.DatabaseServices.AssocArrayCommonParameters
Класс AssocArrayCommonParameters предоставляет интерфейс для управления параметрами ассоциативного массива, которые являются общими для параметров прямоугольного и кругового массива, а также массива по траектории.

Teigha.DatabaseServices.AssocArrayCommonParameters.GetLevelCount([Out] String,[Out] String)
Метод предоставляет количество уровней в этом массиве.
expression: Выражение для параметра. Тип String.
evaluatorId: Полученный в виде строки идентификатор вычислителя. Тип String.
Returns: Возвращает количество уровней. Тип int.

Teigha.DatabaseServices.AssocArrayCommonParameters.GetLevelSpacing([Out] String,[Out] String)
Метод предоставляет расстояние между уровнями в данном массиве.
expression: Выражение для параметра. Тип String.
evaluatorId: Полученный идентификатор вычислителя в строковом представлении. Тип String.
Returns: Возвращает расстояние между уровнями. Тип double.

Teigha.DatabaseServices.AssocArrayCommonParameters.GetRowCount([Out] String,[Out] String)
Метод позволяет получить количество рядов в данном массиве.
expression: Выражение для параметра. Тип String.
evaluatorId: Полученное строковое представление идентификатора вычислителя. Тип String.
Returns: Возвращает количество рядов в массиве. Тип int.

Teigha.DatabaseServices.AssocArrayCommonParameters.GetRowElevation([Out] String,[Out] String)
Метод извлекает приращение отметок между рядами массива.
Returns: Возвращает приращение отметок между рядами массива. Тип <c>double</c>.

Teigha.DatabaseServices.AssocArrayCommonParameters.GetRowSpacing([Out] String,[Out] String)
Метод извлекает расстояние между рядами в массиве.
Returns: Возвращает приращение расстояние между рядами массива. Тип <c>double</c>.

Teigha.DatabaseServices.AssocArrayCommonParameters.SetLevelCount(System.Int32,String,String)
Метод позволяет задать количество уровней в массиве.
count: Новое количество уровней. Тип <c>int</c>.
expression: Выражение для параметра. Тип <c>String</c>. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип <c>String</c>. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayCommonParameters.SetLevelSpacing(System.Double,String,String)
Метод позволяет задать расстояние между уровнями ассоциативного массива.
spacing: Входное расстояние между уровнями ассоциативного массива. Тип double.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayCommonParameters.SetRowCount(System.Int32,String,String)
Метод позволяет задать количество рядов (строк) в массиве.
count: Входное количество рядов в массиве. Тип int.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayCommonParameters.SetRowElevation(System.Double,String,String)
Метод позволяет задать приращение отметок между рядами массива.
value: Приращение отметок между рядами массива. Тип double.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayCommonParameters.SetRowSpacing(System.Double,String,String)
Метод позволяет задать расстояние между рядами в массиве.
value: Расстояние между рядами в массиве. Тип double.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayCommonParameters.BaseNormal
Свойство предоставляет доступ к вектору нормали базовой плоскости.
Returns: Возвращает вектор нормали. Тип Vector3d.

Teigha.DatabaseServices.AssocArrayCommonParameters.BasePlane
Свойство обеспечивает доступ к геометрии базовой плоскости.
Returns: Возвращает объект FaceRef.

Teigha.DatabaseServices.AssocArrayCommonParameters.BasePoint
Свойство обеспечивает доступ к базовой точке базовой плоскости.
Returns: Возвращает объект VertexRef.

Teigha.DatabaseServices.AssocArrayCommonParameters.LevelCount
Свойство обеспечивает доступ к количеству уровней ассоциативного массива.
Returns: Возвращает количество уровней в массиве. Тип int.

Teigha.DatabaseServices.AssocArrayCommonParameters.LevelSpacing
Свойство обеспечивает доступ к расстоянию между уровнями ассоциативного массива.
Returns: Возвращает расстояние между уровнями. Тип double.

Teigha.DatabaseServices.AssocArrayCommonParameters.RowCount
Свойство обеспечивает доступ к количеству рядов (строк) в массиве.
Returns: Возвращает количество рядов. Тип int.

Teigha.DatabaseServices.AssocArrayCommonParameters.RowElevation
Свойство обеспечивает доступ к приращению отметок между рядами массива.
Returns: Возвращает приращение отметок между рядами. Тип double.

Teigha.DatabaseServices.AssocArrayCommonParameters.RowSpacing
Свойство обеспечивает доступ к расстоянию между рядами в массиве.
Returns: Возвращает расстояние между рядами. Тип double.