Teigha.DatabaseServices.PatternDefinition.#ctor(System.Double,Teigha.Geometry.Point2d,Teigha.Geometry.Point2d,Teigha.Geometry.DoubleCollection)
Конструктор класса <c>PatternDefinition</c>.
patternAngle: Угол штриховки. Тип <c>double</c>.
basePoint: Координаты точки привязки. Тип <c>Point2d</c>.
offsetVector: Вектор смещения.  Тип <c>Point2d</c>.
dashOffsets: Смещения штрихов. Тип <c>DoubleCollection</c>.

Teigha.DatabaseServices.PatternDefinition.GetDashes
Метод предоставляет коллекцию значений, определяющих штрихи в определении штриховки.
Returns: Возвращает коллекцию штрихов. Тип <c>DoubleCollection</c>.

Teigha.DatabaseServices.PatternDefinition.Angle
Свойство представляет угол поворота штриховки.
Returns: Возвращает угол поворота в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.PatternDefinition.BaseX
Свойство представляет x-координату базовой точки.
Returns: Возвращает x-координату базовой точки. Тип <c>double</c>.

Teigha.DatabaseServices.PatternDefinition.BaseY
Свойство представляет y-координату базовой точки.
Returns: Возвращает y-координату базовой точки. Тип <c>double</c>.

Teigha.DatabaseServices.PatternDefinition.OffsetX
Свойство представляет x-компоненту смещения.
Returns: Возвращает x-компоненту смещения. Тип <c>double</c>.

Teigha.DatabaseServices.PatternDefinition.OffsetY
Свойство представляет y-компоненту смещения.
Returns: Возвращает y-компоненту смещения.
Тип <c>double</c>.