Teigha.DatabaseServices.Extents2d
Этот класс представляет двумерные ограничивающие боксы для различных графических объектов.

Teigha.DatabaseServices.Extents2d.#ctor(System.Double,System.Double,System.Double,System.Double)
Конструктор класса Extents2d.
Создает 2D ограничивающий бокс с указанными координатами минимальной и максимальной точек.
minX: X-координата минимальной точки. Тип <c>double</c>.
minY: Y-координата минимальной точки. Тип <c>double</c>.
maxX: X-координата максимальной точки. Тип <c>double</c>.
maxY: Y-координата максимальной точки. Тип <c>double</c>.

Teigha.DatabaseServices.Extents2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса Extents2d. Создает двумерный ограничивающий бокс, заданный парой двумерных точек Point2d в качестве вершин главной диагонали.
minimum: Минимальная точка. Тип <c>Point2d</c>.
maximum: Максимальная точка. Тип <c>Point2d</c>.

Teigha.DatabaseServices.Extents2d.Equals(Object)
Метод предназначен для проверки данного объекта на равенство другому объекту Extents2d.
obj: Объект, проверяемый на равенство. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если объект <c>obj</c> не является нулевым, и совпадают соответствующие координаты вершин сравниваемых объектов. В противном случае возвращает <c>false</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику -
если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать Extents2d.GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.Extents2d.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Returns: Возвращает целочисленный идентификатор, представляющий уникальное для каждого экземпляра класса число. Тип <c>int</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику -
если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хэш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод Equals() из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать Extents2d.GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.Extents2d.IsEqualTo(Teigha.DatabaseServices.Extents2d)
Метод проверяет совпадение данного объекта с указанным объектом Extents2d.
a: Проверяемый объект. Тип <c>Extents2d</c>.
Returns: Возвращает <c>true</c>, если минимальные и максимальные точки сравниваемых объектов совпадают.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Extents2d.IsEqualTo(Teigha.DatabaseServices.Extents2d,Teigha.Geometry.Tolerance)
Метод проверяет совпадение данного объекта с указанным объектом Extents2d в пределах заданного допуска.
a: Проверяемый объект. Тип <c>Extents2d</c>.
tolerance: Геометрический допуск. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если минимальные и максимальные точки сравниваемых объектов совпадают в пределах допуска <c>tolerance</c>. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Extents2d.ToString
Метод предназначен для получения эквивалентного строкового представления данного объекта.
Returns: Возвращает строку, в которой представлены минимальная и максимальная точки ограничивающего бокса.
Тип <c>String</c>.

Teigha.DatabaseServices.Extents2d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
provider: Провайдер языковых и региональных настроек. Тип <c>IFormatProvider</c>.
Returns: Возвращает представление данного объекта в виде строки. Тип <c>String</c>.

Teigha.DatabaseServices.Extents2d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
format: Предписанный формат строки. Тип <c>String</c>.
provider: Провайдер языковых и региональных настроек. Тип <c>IFormatProvider</c>.
Returns: Возвращает представление данного объекта в виде форматированной строки, содержащей координаты его минимальной и максимальной точек.  Тип <c>String</c>.

Teigha.DatabaseServices.Extents2d.MaxPoint
Свойство обеспечивает доступ к максимальной точке данного объекта.
Returns: Возвращает максимальную точку данного объекта. Тип <c>Point2d</c>.

Teigha.DatabaseServices.Extents2d.MinPoint
Свойство обеспечивает доступ к минимальной точке данного объекта.
Returns: Возвращает минимальную точку данного объекта. Тип <c>Point2d</c>.