Teigha.Geometry.PointEntity2d
Класс <c>PointEntity2d</c> является базовым классом для всех классов двумерных точечных объектов.

Teigha.Geometry.PointEntity2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>PointEntity2d</c>.

Teigha.Geometry.PointEntity2d.Point
Свойство <c>Point</c> представляет двумерные координаты данного объекта.
Returns: Возвращает двумерные координаты точки.
Тип <c>Point2d</c>.