Teigha.DatabaseServices.IdMapping
Класс <c>IdMapping</c> используется в операциях глубокого клонирования для сопоставления (мэппинга) идентификаторов исходных объектов и идентификаторов их клонов. Пары идентификаторов (ID исходного объекта - ID его клона) реализуются объектами <c>IdPair</c>.

Teigha.DatabaseServices.IdMapping.#ctor
Конструктор по умолчанию класса <c>IdMapping</c>.

Teigha.DatabaseServices.IdMapping.Add(Teigha.DatabaseServices.IdPair)
Метод позволяет добавить указанный объект <c>IdPair</c> к данному объекту <c>IdMapping</c>.
pairToAdd: Добавляемая пара сопоставленных идентификаторов. Тип <c>IdPair</c>.

Teigha.DatabaseServices.IdMapping.Change(Teigha.DatabaseServices.IdPair)
Метод заменяет существующий в данном <c>IdMapping</c> объект <c>IdPair</c> новым объектом <c>IdPair</c> с тем же ключом.
pairToChange: Аргумент предоставляет ключ для поиска и принимает значение.  Тип <c>IdPair</c>.

Teigha.DatabaseServices.IdMapping.Contains(Teigha.DatabaseServices.ObjectId)
Метод позволяет проверить, содержится ли в данном объекте <c>IdMapping</c> объект <c>IdPair</c> с указанным ключом.
key: Идентификатор исходного объекта как ключ для поиска объекта <c>IdPair</c>. Тип <c>ObjectId</c>.
Returns: Возвращает <c>true</c>, если объект <c>IdPair</c> с указанным ключом найден.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.IdMapping.Delete(Teigha.DatabaseServices.ObjectId)
Метод позволяет удалить объект <c>IdPair</c> с указанным ключом из данного объекта <c>IdMapping</c>.
key: Идентификатор исходного объекта клонирования как ключ удаляемого объекта <c>IdPair</c>. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.IdMapping.GetEnumerator
Метод позволяет получить перечислитель для данного объекта.
Returns: Возвращает перечислитель. Тип <c>System.Collections.IEnumerator</c>.

Teigha.DatabaseServices.IdMapping.Lookup(Teigha.DatabaseServices.ObjectId)
Метод предназначен для поиска в объекте <c>IdMapping</c> объекта <c>IdPair</c> с указанным ключом.
key: Идентификатор исходного объекта клонирования как ключ для поиска объекта <c>IdPair</c>. Тип <c>ObjectId</c>.
Returns: Возвращает объект <c>IdPair</c> с заданным ключом <c>key</c> или <c>NULL</c>, если поиск успехом не увенчался.

Teigha.DatabaseServices.IdMapping.DeepCloneContext
Свойство обеспечивает доступ к типу операции глубокого клонирования <c>DeepCloneType</c>, в которой используется этот объект <c>IdMapping</c>.
Returns: Возвращает тип операции глубокого клонирования. Перечисление <c>DatabaseServices.DeepCloneType</c>.

Teigha.DatabaseServices.IdMapping.DestinationDatabase
Свойство предоставляет доступ к целевой базе данных операции глубокого клонирования, использующей этот объект <c>IdMapping</c>.
Returns: Возвращает целевую базу данных операции глубокого клонирования. Тип <c>Database</c>.

Teigha.DatabaseServices.IdMapping.DuplicateRecordCloning
Свойство возвращает тип клонирования повторяющихся записей для этого объекта <c>IdMapping</c>.
Returns: Возвращает тип клонирования повторяющихся записей. Тип <c>DuplicateRecordCloning</c>.

Teigha.DatabaseServices.IdMapping.Item
Свойство предоставляет доступ к объекту <c>IdPair</c> по его ключу.
key: Ключ объекта <c>IdPair</c>. Тип <c>ObjectId</c>.
Returns: Возвращает объект <c>IdPair</c> ключом <c>key</c>.

Teigha.DatabaseServices.IdMapping.OriginalDatabase
Свойство обеспечивает доступ к исходной базе данных для операции глубокого клонирования, в которой используется этот объект <c>IdMapping</c>.
Returns: Возвращает исходную базу данных. Тип <c>Database</c>.