Teigha.Geometry.KnotCollection
Класс <c>KnotCollection</c> представляет однородный узловой вектор сплайна как неубывающую последовательность действительных значений.

Teigha.Geometry.KnotCollection.#ctor
Конструктор по умолчанию класса <c>KnotCollection</c>.

Teigha.Geometry.KnotCollection.Add(System.Double)
Метод добавляет к данному узловому вектору новый узел и возвращает его индекс в коллекции.
value: Добавляемый узел. Тип <c>double</c>.
Returns: Возвращает индекс нового узла в коллекции. Тип <c>int</c>.

Teigha.Geometry.KnotCollection.Clear
Метод удаляет из коллекции все элементы.

Teigha.Geometry.KnotCollection.Contains(System.Double)
Метод позволяет проверить, содержится ли указанное значение в данной коллекции.
value: Проверяемое значение. Тип <c>double</c>.
Returns: Возвращает <c>true</c>, если значение <c>value</c> содержится в коллекции.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.KnotCollection.CopyTo(cli.array&lt;double&gt;,System.Int32)
Метод копирует данную коллекцию узлов в указанный массив.
a: Массив, в который копируются значения из коллекции. Тип <c>double[]</c>.
index: Индекс в массиве, начиная с которого в массиве сохраняются элементы коллекции. Тип <c>int</c>.

Teigha.Geometry.KnotCollection.GetDistinctKnots
Метод позволяет получить последовательность уникальных узлов в данной коллекции.
Returns: Возвращает коллекцию уникальных узлов.
Тип <c>DoubleCollection</c>.

Teigha.Geometry.KnotCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции узлов.
Returns: Возвращает перечислитель для данной коллекции.
Тип <c>IEnumerator</c>.

Teigha.Geometry.KnotCollection.GetInterval(System.Int32,System.Double,[Out] Interval%)
Метод находит ненулевой узловой интервал, в который попадает точка с указанным значением параметра.
order: Входной порядок сплайна. Тип <c>int</c>.
parameter: Входное значение параметра, определяющее точку в коллекции узлов. Тип <c>double</c>.
interval: Найденный узловой интервал. Тип <c>Interval</c>.
Returns: Возвращает индекс найденного узлового интервала <c>interval</c>.
Тип <c>int</c>.

Teigha.Geometry.KnotCollection.GetMultiplicityAt(System.Int32)
Метод определяет кратность узла с указанным индексом.
i: Индекс узла. Тип <c>int</c>.
Returns: Возвращает кратность узла с указанным индексом.
Тип <c>int</c>.

Teigha.Geometry.KnotCollection.Insert(System.Int32,System.Double)
Метод вставляет в данную коллекцию указанное значение в позицию с заданным индексом.
index: Индекс позиции в коллекции. Тип <c>int</c>.
value: Вставляемое в коллекцию значение. Тип <c>double</c>.

Teigha.Geometry.KnotCollection.IsOn(System.Double)
Метод позволяет проверить, является ли указанный узел элементом данной коллекции узлов в пределах заданной точности <c>KnotCollection.Tolerance</c>.
knot: Проверяемое значение. Тип <c>double</c>.
Returns: Возвращает <c>true</c>, если значение <c>knot</c> является элементом данной коллекции в пределах заданной точности.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.KnotCollection.RemoveAt(System.Int32)
Метод предназначен для удаления из данной коллекции узла с указанным индексом.
index: Индекс удаляемого узла.

Teigha.Geometry.KnotCollection.Reverse
Метод изменяет порядок узлов в данной коллекции на обратный.

Teigha.Geometry.KnotCollection.SetRange(System.Double,System.Double)
Метод позволяет переопределить общий интервал значений данного узлового вектора.
lower: Новый нижний узел. Должен быть меньше нового верхнего узла. Тип <c>double</c>.
upper: Новый верхний узел. Должен быть больше нового нижнего узла. Тип <c>double</c>.

Teigha.Geometry.KnotCollection.Split(System.Double,System.Int32,System.Int32)
Метод предназначен для разделения данного узлового вектора (коллекции узлов) на две части в точке, которая задается указанным значением входного параметра.
parameter: Параметр, определяющий точку разделения данной коллекции (узлового вектора) на две части. Тип <c>double</c>.
multiplicityLast: Кратность последнего узла головной части. Тип <c>int</c>.
multiplicityFirst: Кратность первого узла хвостовой части. Тип <c>int</c>.
Returns: Возвращает массив из двух узловых векторов, полученных в результате разделения на две части исходного узлового вектора.
Тип <c>KnotCollection[]</c>.
Нулевой элемент массива содержит головную часть разделения, а первый - хвостовую.

Teigha.Geometry.KnotCollection.Count
Свойство <c>Count</c> представляет общее количество элементов в коллекции.
Returns: Возвращает общее количество элементов в коллекции.
Тип <c>int</c>.

Teigha.Geometry.KnotCollection.EndParameter
Свойство <c>EndParameter</c> представляет значение параметра в конечном узле коллекции.
Returns: Возвращает значение параметра в конечном узле коллекции.
Тип <c>double</c>.

Teigha.Geometry.KnotCollection.IsFixedSize
Свойство <c>IsFixedSize</c> позволяет проверить, является ли фиксированным размер данной коллекции.
Returns: Возвращает <c>true</c>, если размер данной коллекции является фиксированным.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.KnotCollection.IsReadOnly
Свойство <c>IsReadOnly</c> позволяет определить, доступна ли эта коллекция только для чтения.
Returns: Возвращает <c>true</c>, если коллекция доступна только для чтения.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.KnotCollection.IsSynchronized
Свойство <c>IsSynchronized</c> позволяет проверить, является ли доступ к этой коллекции потокобезопасным.
Returns: Возвращает <c>true</c>, если доступ к этой коллекции является потокобезопасным.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.KnotCollection.Item
Свойство <c>Item</c> представляет элемент коллекции с указанным индексом.
A_0: Входной индекс элемента коллекции. Тип <c>int</c>.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип <c>double</c>.

Teigha.Geometry.KnotCollection.NumberOfIntervals
Свойство <c>NumberOfIntervals</c> представляет количество узловых интервалов, связанных с данной коллекцией.
Returns: Возвращает количество узловых интервалов.
Тип <c>int</c>.

Teigha.Geometry.KnotCollection.StartParameter
Свойство <c>StartParameter</c> представляет параметр в начальном узле коллекции.
Returns: Возвращает параметр в начальном узле коллекции.
Тип <c>double</c>.

Teigha.Geometry.KnotCollection.SyncRoot
Свойство <c>SyncRoot</c> представляет объект, используемый для синхронизации доступа к данной коллекции.
Returns: Возвращает объект, используемый для синхронизации доступа к данной коллекции.
Тип <c>Object</c>.

Teigha.Geometry.KnotCollection.Tolerance
Свойство <c>Tolerance</c> представляет доступ к точности, которая используется в данной коллекции для проверки узлов на совпадение.
Returns: Возвращает точность для проверки узлов на совпадение.
Тип <c>double</c>.