Teigha.DatabaseServices.Field
Класс Field представляет объекты Field в базе данных.
Объект Field является контейнером для вычисляемого выражения, вычисленного результата и других данных.

Teigha.DatabaseServices.Field.#ctor
Конструктор по умолчанию класса Field.

Teigha.DatabaseServices.Field.#ctor(String)
Конструктор класса, создающий объект Field с указанным кодом поля.
fieldCode: Код поля. Тип <c>String</c>.

Teigha.DatabaseServices.Field.#ctor(String,System.Boolean)
Конструктор класса Field. Создает объект Field с указанным кодом поля <c>fieldCode</c>.
Дополнительно позволяет указать, является ли это поле текстовым.
fieldCode: Код поля. Тип <c>String</c>.
textField: Флаг, определяющий, является ли это поле текстовым. Тип <c>bool</c>. Если принимает значение <c>true</c>, поле является текстовым. В противном случае аргумент должен принимать значение <c>false</c>.

Teigha.DatabaseServices.Field.ConvertToTextField
Метод предоставляет возможность преобразовать поле в текстовое. Не реализовано.

Teigha.DatabaseServices.Field.Evaluate
Метод предназначен для вычисления выражения в поле.

Teigha.DatabaseServices.Field.Evaluate(System.Int32,DatabaseServices.Database)
Метод предназначен для вычисления выражения в данном объекте с учетом указанных опций.
evaluationOptions: Контекст вычисления выражения. Тип <c>int</c>. Флаг контекста может принимать значения из перечисления <c>FieldEvaluationContext</c> или значения, определяемые пользователем.
database: База данных, используемая для вычисления выражения. Тип <c>DatabaseServices.Database</c>.  Может равняться <c>null</c>.

Teigha.DatabaseServices.Field.GetChildren
Метод позволяет получить дочерние поля данного объекта.
Returns: Возвращает массив дочерних полей данного объекта. Тип <c>Field[]</c>.
Notes
Возвращаемый объект поля открывается в предписанном режиме, если это поле является резидентным в базе данных.
За закрытие объекта поля после его использования отвечает вызывающее приложение.

Teigha.DatabaseServices.Field.GetData(String)
Метод предназначен для получения данных из объекта поля по указанному ключу.
key: Ключ для извлечения данных. Тип <c>String</c>.  Не может быть <c>null</c> или пустой строкой.
Returns: Возвращает данные по указанному ключу. Тип <c>Object</c>.

Teigha.DatabaseServices.Field.GetFieldCode
Метод предназначен для извлечения кода поля в виде текстовой строки.
Returns: Возвращает текстовую строку с кодом поля.  Тип <c>String</c>.

Teigha.DatabaseServices.Field.GetFieldCode(Teigha.DatabaseServices.FieldCodeFlags)
Метод предназначен для получения кода поля в виде строки, сформированной с учетом указанных флагов кодов поля.
flags: Флаг или набор флагов из перечисления <c>FieldCodeFlags</c>.
Returns: Возвращает строку с кодом поля.  Тип <c>String</c>.

Teigha.DatabaseServices.Field.GetFieldCodeWithChildren
Метод позволяет извлечь код поля с дочерними полями в различных видах.
Returns: Возвращает код поля.  Тип <c>FieldCodeWithChildren</c>.

Teigha.DatabaseServices.Field.GetFieldCodeWithChildren(Teigha.DatabaseServices.FieldCodeFlags)
Метод позволяет извлечь код поля с дочерними полями в различных видах, используя аргумент с флагами кодов поля.
flags: Флаг или набор флагов из перечисления <c>FieldCodeFlags</c>.
Returns: Возвращает код поля.  Тип <c>FieldCodeWithChildren</c>.

Teigha.DatabaseServices.Field.GetStringValue
Метод позволяет получить строковое значение, связанное с данным полем.
Returns: Возвращает строковое значение, связанное с данным полем. Тип <c>String</c>.

Teigha.DatabaseServices.Field.SetData(String,Object)
Метод предоставляет возможность задать в этом поле данные с указанным ключом.
key: Ключ, с которым ассоциированы сохраняемые в поле данные. Тип <c>String</c>. Не может иметь значение <c>null</c> или быть пустой строкой.
data: Данные для поля. Тип <c>Object</c>.

Teigha.DatabaseServices.Field.SetData(String,Object,System.Boolean)
Метод предоставляет возможность установить в этом поле данные с указанным ключом. Дополнительно возможно задать рекурсивную установку этих данных во всех дочерних полях.
key: Ключ, с которым ассоциированы сохраняемые в поле данные. Тип <c>String</c>. Не может иметь значение <c>null</c> или быть пустой строкой.
data: Данные для поля. Тип <c>Object</c>.
recursive: Флаг, определяющий, следует ли рекурсивно устанавливать данные во всех дочерних полях. Тип <c>bool</c>. Значение <c>true</c> предписывает рекурсивный проход по всем дочерним полям.

Teigha.DatabaseServices.Field.SetFieldCode(String)
Метод позволяет установить для этого объекта указанный код поля.
fieldCode: Код поля, который требуется задать. Тип <c>String</c>.

Teigha.DatabaseServices.Field.SetFieldCodeWithChildren(Teigha.DatabaseServices.FieldCodeFlags,Teigha.DatabaseServices.FieldCodeWithChildren)
Метод позволяет задать код поля и группу вложенных (дочерних) полей для этого поля и его вложенных полей с учетом указанных флагов кодов полей.
flag: Флаги из перечисления <c>FieldCodeFlags</c>.
fieldCode: Входной код поля и вложенные поля, которые следует задать.  Тип <c>FieldCodeWithChildren</c>.

Teigha.DatabaseServices.Field.SetFieldCodeWithChildren(Teigha.DatabaseServices.FieldCodeWithChildren)
Метод позволяет задать код поля и группу вложенных (дочерних) полей для этого поля и его вложенных полей.
fieldCode: Входной код поля и вложенные поля, которые следует задать.  Тип <c>FieldCodeWithChildren</c>.

Teigha.DatabaseServices.Field.DataType
Свойство <c>DataType</c> возвращает тип результата вычисления поля.
Returns: Возвращает тип результата как значение из перечисления <c>Teigha.DatabaseServices.DataType</c>.

Teigha.DatabaseServices.Field.EvaluationOption
Свойство <c>EvaluationOption</c> представляет доступ к опциям вычисления данного поля.
Returns: Возвращает опции вычисления данного поля как значение из перечисления <c>FieldEvaluationOptions</c>.

Teigha.DatabaseServices.Field.EvaluationStatus
Свойство <c>EvaluationStatus</c> возвращает статус вычисления данного поля.
Returns: Возвращает статус вычисления поля. Тип <c>FieldEvaluationStatusResult</c>.

Teigha.DatabaseServices.Field.EvaluatorId
Свойство <c>EvaluatorId</c> представляет идентификатор вычислителя, который используется для данного поля.
Returns: Возвращает идентификатор вычислителя. Тип <c>String</c>.

Teigha.DatabaseServices.Field.FilingOption
Свойство <c>FilingOption</c> представляет опции сохранения этого поля в файле.
Returns: Возвращает опции сохранения в файл. Тип <c>FieldFilingOptions</c>.

Teigha.DatabaseServices.Field.Format
Свойство <c>Format</c> представляет формат вывода для данного поля.
Returns: Возвращает формат вывода для поля. Тип <c>String</c>.

Teigha.DatabaseServices.Field.HyperLink
Свойство <c>HyperLink</c> представляет гиперссылку, связанную с данным полем.
Returns: Возвращает гиперссылку, связанную с данным полем.  Тип <c>HyperLink</c>.

Teigha.DatabaseServices.Field.IsTextField
Свойство <c>IsTextField</c> позволяет определить, является ли данный объект текстовым полем с внедренными полями.
Returns: Возвращает <c>true</c>, если данный объект является текстовым полем с внедренными полями.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Field.State
Свойство State возвращает текущее состояние поля одним из значений перечисления <c>FieldState</c> или их комбинацией.
Returns: Возвращает состояние поля как значение (или комбинация значений) из перечисления <c>FieldState</c>.

Teigha.DatabaseServices.Field.Value
Свойство <c>Value</c> возвращает значение поля в исходном типе данных.
Returns: Возвращает значение поля. Тип <c>Object</c>.