Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator
Данный класс представляет перечислитель для коллекции объектов <c>MlineStyleElement</c>.

Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.#ctor(Teigha.DatabaseServices.MlineStyleElementCollection)
Конструктор класса <c>MlineStyleElementCollectionEnumerator</c>.
Создает перечислитель для указанной коллекции объектов <c>MlineStyleElement</c>.
col: Коллекция объектов <c>MlineStyleElement</c>, для которой создается перечислитель.

Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.MoveNext
Метод выполняет переход к следующему элементу в коллекции.
Returns: Возвращает <c>true</c>, если новое значение индекса остается в допустимом диапазоне.
Если новое значение индекса выходит за пределы коллекции, метод возвращает <c>false</c>.

Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.Reset
Метод реинициализирует перечислитель, устанавливая его индекс в значение -1.

Teigha.DatabaseServices.MlineStyleElementCollectionEnumerator.Current
Свойство представляет текущий элемент перечислителя.
Returns: Возвращает текущий элемент перечислителя. Тип <c>MlineStyleElement</c>.