Teigha.DatabaseServices.Xrecord
Класс Xrecord — это класс для хранения и управления произвольными данными.

Teigha.DatabaseServices.Xrecord.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.Xrecord.Data
Данное свойство обеспечивает доступ к данным XRecord.
Returns: Возвращает или изменяет данные XRecord. Тип ResultBuffer.

Teigha.DatabaseServices.Xrecord.XlateReferences
Данное свойство предоставляет доступ к логическому значению, которое указывает, требуется ли трансляция ссылок.
Returns: Возвращает или задает логическое значение, которое определяет необходимость трансляции ссылок. Тип bool.

Teigha.DatabaseServices.Xrecord.MergeStyle
Данное свойство задает стиль слияния для операций вставки.
Returns: Возвращает стиль слияния из перечисления Teigha.DatabaseServices.DuplicateRecordCloning.