Teigha.Geometry.Line3d
Класс представляет бесконечные линии в трехмерном пространстве.

Teigha.Geometry.Line3d.#ctor
Конструктор по умолчанию. Создает бесконечную линию, совпадающую с осью X.

Teigha.Geometry.Line3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор. Создает бесконечную линию, проходящую через две несовпадающие точки.
point1: Первая опорная точка. Тип Point3d.
point2: Вторая опорная точка. Тип Point3d.

Teigha.Geometry.Line3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор. Создает бесконечную линию по точке и вектору.
point: Входная опорная точка. Тип Point3d.
vector: Входной вектор, задающий ориентацию прямой в пространстве. Тип Vector3d.

Teigha.Geometry.Line3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод изменяет определение линии так, чтобы она проходила через две несовпадающие опорные точки.
point1: Первая опорная точка. Тип Point3d.
point2: Вторая опорная точка. Тип Point3d.

Teigha.Geometry.Line3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод изменяет определение линии так, чтобы она проходила через указанную точку в заданном направлении.
point: Новая опорная точка. Тип Point3d.
vector: Новый вектор, задающий направление прямой. Тип Vector3d.

Teigha.Geometry.Line3d.Create(IntPtr,System.Boolean)
Метод создает новую бесконечную линию Line3d из исходного объекта, который передан через указатель.
unmanagedPointer: Указатель на исходный объект. Тип IntPtr.
autoDelete: Флаг автоматического удаления исходного объекта. Тип bool.
Returns: Возвращает новый объект Line3d.