Teigha.DatabaseServices.MatchProperties
Этот класс является базовым для классов, реализующих копирование свойств между объектами чертежа.

Teigha.DatabaseServices.MatchProperties.CopyProperties(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.Entity,System.Int32)
Метод предназначен для копирования предписанных свойств из исходного объекта в указанный целевой объект.
sourceEntity: Объект-источник свойств.   Тип <c>Entity</c>.
targetEntity: Объект-получатель свойств. Тип <c>Entity</c>.
flag: Флаг, представляющий комбинацию копируемых свойств. Тип <c>int</c>.