Teigha.BoundaryRepresentation.FaceLoopCollection
Класс <c>FaceLoopCollection</c> представляет набор циклов грани BREP.

Teigha.BoundaryRepresentation.FaceLoopCollection.GetEnumerator
Метод позволяет получить перечислитель для данной коллекции.
Returns: Возвращает перечислитель циклов грани BREP.
Тип <c>FaceLoopEnumerator</c>.