Teigha.DatabaseServices.Group
Этот класс представляет объекты группы в экземпляре базы данных.

Teigha.DatabaseServices.Group.#ctor
Конструктор по умолчанию класса <c>Group</c>.

Teigha.DatabaseServices.Group.#ctor(String,System.Boolean)
Конструктор класса Group. Создает экземпляр класса с указанным именем группы и предписанным режимом выделения (групповое / индивидуальное).

Teigha.DatabaseServices.Group.Append(DatabaseServices.ObjectId)
Метод предназначен для добавления в данную группу указанного объекта чертежа.
id: Идентификатор добавляемого в группу объекта чертежа. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Group.Append(Teigha.DatabaseServices.ObjectIdCollection)
Метод предназначен для добавления в данную группу нескольких объектов списком.
ids: Коллекция идентификаторов объектов чертежа, которые добавляются в данную группу. Тип <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.Group.Clear
Метод позволяет очистить эту группу от элементов, делая ее пустой.

Teigha.DatabaseServices.Group.GetAllEntityIds
Метод позволяет получить массив идентификаторов объектов чертежа, принадлежащих данной группе.
Returns: Возвращает массив идентификаторов объектов-членов данной группы. Тип <c>ObjectId[]</c>.

Teigha.DatabaseServices.Group.GetIndex(DatabaseServices.ObjectId)
Метод позволяет получить индекс указанного объекта в данной группе.
id: Идентификатор объекта чертежа. Тип <c>DatabaseServices.ObjectId</c>.
Returns: Возвращает индекс указанного объекта в данной группе. Тип <c>int</c>. Метод выбрасывает исключение <c>eInvalidInput</c>, если объект с указанным <c>id</c> в данной группе отсутствует.

Teigha.DatabaseServices.Group.Has(Teigha.DatabaseServices.Entity)
Метод позволяет проверить, имеется ли в данной группе указанный объект.
entity: Искомый объект чертежа. Тип <c>Entity</c>.
Returns: Возвращает <c>true</c>, если указанный объект <c>entity</c> входит в данную группу.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Group.InsertAt(System.Int32,DatabaseServices.ObjectId)
Метод позволяет вставить указанный объект чертежа в данную группу по указанному индексу.
index: Индекс, по которому следует вставить в группу новый объект чертежа. Тип <c>int</c>.
id: Идентификатор вставляемого объекта. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Group.InsertAt(System.Int32,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет вставить указанную коллекцию объектов в данный объект <c>Group</c> по указанному индексу.
index: Индекс в группе, по которому вставляются объекты из коллекции.   Тип <c>int</c>.
ids: Коллекция идентификаторов вставляемых в группу объектов чертежа. Тип <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.Group.Prepend(DatabaseServices.ObjectId)
Метод предназначен для добавления указанного объекта в начало списка членов данной группы.
id: Идентификатор вставляемого объекта. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Group.Prepend(Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет вставить указанные в коллекции объекты в начало списка членов данной группы.
ids: Идентификаторы вставляемых объектов. Тип <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.Group.Remove(DatabaseServices.ObjectId)
Метод позволяет удалить указанный объект из данной группы.
id: Идентификатор удаляемого объекта. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Group.Remove(Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет удалить указанные объекты из данной группы.
ids: Идентификаторы удаляемых объектов. Тип <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.Group.RemoveAt(System.Int32)
Метод предназначен для удаления из группы объекта с указанным индексом.
index: Индекс удаляемого объекта группы. Тип <c>int</c>.

Teigha.DatabaseServices.Group.RemoveAt(System.Int32,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет удалить из данной группы указанные объекты, причем они должны иметь индексы равные или больше некоторого заданного индекса.
index: Индекс, начиная с которого будут удаляться объекты из коллекции <c>ids</c>. Тип <c>int</c>.
ids: Коллекция удаляемых объектов. Тип <c>ObjectIdCollection</c>. Все объекты должны находиться в этой группе и иметь индекс, равный или превышающий указанное значение <c>index</c>.

Teigha.DatabaseServices.Group.Replace(DatabaseServices.ObjectId,DatabaseServices.ObjectId)
Метод предназначен для замены в составе данной группы одного объекта другим.
oldId: Удаляемый из группы объект. Тип <c>DatabaseServices.ObjectId</c>.
newId: Объект, добавляемый в группу взамен объекта <c>oldId</c>. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Group.Reverse
Этот метод меняет на обратный порядок индексирования объектов в этой группе.

Teigha.DatabaseServices.Group.SetAnonymous
Этот метод позволяет сделать данную группу анонимной.
При этом текущее имя группы заменяется на автоматически созданное имя анонимной группы.

Teigha.DatabaseServices.Group.SetColor(Teigha.Colors.Color)
Метод позволяет назначить новый цвет всем объектам данной группы.
color: Новое значение цвета для объектов группы. Тип <c>Color</c>.

Teigha.DatabaseServices.Group.SetColorIndex(System.Int32)
Метод позволяет назначить всем объектам данной группы новый цвет, указанный индексом.
color: Индекс нового цвета объектов группы. Тип <c>int</c>.

Teigha.DatabaseServices.Group.SetHighlight(System.Boolean)
Метод позволяет подсветить или отменить подсветку объектов данной группы.
value: Флаг подсветки объектов группы. Тип <c>bool</c>. Если он принимает значение <c>true</c>, будут подсвечены все объекты в группе. В противном случае подсветка отменяется.

Teigha.DatabaseServices.Group.SetLayer(DatabaseServices.ObjectId)
Метод позволяет для всех объектов данной группы задать слой с указанным идентификатором.
value: Идентификатор объекта <c>LayerTableRecord</c>. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Group.SetLayer(String)
Метод позволяет для всех объектов данной группы задать слой с указанным именем.
value: Имя слоя, назначаемого объектам группы. Тип <c>String</c>.

Teigha.DatabaseServices.Group.SetLinetype(DatabaseServices.ObjectId)
Метод позволяет задать иной тип линий для всех объектов в этой группе.
value: Идентификатор типа линий <c>LinetypeTableRecord</c>.   Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Group.SetLinetype(String)
Метод позволяет задать всем объектам этой группы тип линий с указанным именем.
value: Имя типа линий.  Тип <c>String</c>.

Teigha.DatabaseServices.Group.SetLinetypeScale(System.Double)
Метод позволяет задать масштаб типа линий для всех объектов в данной группе.
value: Масштаб типа линий. Тип <c>double</c>.

Teigha.DatabaseServices.Group.SetVisibility(System.Boolean)
Метод позволяет установить статус видимости для всех объектов в данной группе.
value: Флаг, определяющий видимость объектов группы. Тип <c>bool</c>. Если флаг принимает значение <c>true</c>, объекты становятся видимыми. В противном случае вся группа оказывается невидимой.

Teigha.DatabaseServices.Group.Transfer(System.Int32,System.Int32,System.Int32)
Этот метод предоставляет возможность изменять порядок следования элементов внутри группы целыми диапазонами индексов.
fromIndex: Индекс первого перемещаемого объекта. Тип <c>int</c>.
toIndex: Новый индекс первого перемещаемого объекта. Тип <c>int</c>.
numItems: Количество перемещаемых объектов группы. Тип <c>int</c>.

Teigha.DatabaseServices.Group.Description
Свойство обеспечивает доступ к описанию данного объекта <c>Group</c>.
Returns: Возвращает описание группы. Тип <c>String</c>.

Teigha.DatabaseServices.Group.IsAnonymous
Свойство позволяет определить, является ли данная группа анонимной.
Returns: Возвращает <c>true</c>, если данная группа является анонимной. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Group.IsNotAccessible
Свойство позволяет определить, является ли эта группа недоступной.
Returns: Возвращает <c>true</c>, если группа помечена как недоступная.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Group.Name
Свойство обеспечивает доступ к имени данного объекта <c>Group</c>.
Returns: Возвращает имя данной группы. Тип <c>String</c>.

Teigha.DatabaseServices.Group.NumEntities
Свойство возвращает текущее количество объектов в этой группе.
Returns: Возвращает количество объектов в группе. Тип <c>int</c>.

Teigha.DatabaseServices.Group.Selectable
Свойство позволяет определить, возможно ли выделение всей группы целиком.
Returns: Возвращает <c>true</c>, если группа допускает выделение.
В противном случае возвращает <c>false</c>.