Teigha.DatabaseServices.Filters.SpatialFilterVolume
Класс представляет данные, необходимые для описания объема пространственного фильтра.

Teigha.DatabaseServices.Filters.SpatialFilterVolume.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector2d)
Конструктор класса <c>SpatialFilterVolume</c>.
fromPoint: Точка «от» преобразованной границы отсечения. Тип <c>Point3d</c>.
toPoint: Точка «до» преобразованной границы отсечения. Тип <c>Point3d</c>.
upDir: Вектор нормали преобразованной границы отсечения. Тип <c>Vector3d</c>.
viewField: Вектор поля зрения преобразованной границы отсечения. Тип <c>Vector2d</c>.

Teigha.DatabaseServices.Filters.SpatialFilterVolume.FromPoint
Свойство <c>FromPoint</c> возвращает точку "от" преобразованной границы отсечения.
Returns: Возвращает точку "от" преобразованной границы отсечения. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Filters.SpatialFilterVolume.ToPoint
Свойство <c>ToPoint</c> возвращает точку "до" преобразованной границы отсечения.
Returns: Возвращает точку "до" преобразованной границы отсечения. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Filters.SpatialFilterVolume.UpDirection
Свойство <c>UpDirection</c> возвращает вектор нормали преобразованной границы отсечения.
Returns: Возвращает вектор нормали. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Filters.SpatialFilterVolume.ViewField
Свойство <c>ViewField</c> возвращает вектор области просмотра преобразованной границы отсечения.
Returns: Возвращает вектор области просмотра. Тип <c>Vector2d</c>.