Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.#ctor(Procedure,Destination)
Конструктор структуры <c>ProcedureAndDestinationParameter</c>.
Создает экземпляр структуры с указанными параметрами.
p: Процедура рендеринга (тип визуального контента). Значение из перечисления <c>Procedure</c>.
d: Направление вывода рендеринга. Значение из перечисления <c>Destination</c>.

Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.Destination
Свойство <c>Destination</c> представляет текущее значение параметра направления вывода рендеринга.
Returns: Возвращает направление вывода рендеринга. Значение из перечисления <c>Destination</c>.

Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestinationParameter.Procedure
Свойство <c>Procedure</c> представляет текущее значение параметра процедуры рендеринга.
Returns: Возвращает процедуру рендеринга. Значение из перечисления <c>Procedure</c>.