Teigha.Geometry.CoordinateSystem3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Конструктор класса <c>CoordinateSystem3d</c>. Создает экземпляр класса с указанными параметрами.
o: Точка начала системы координат.   Тип <c>Point3d</c>.
x: Направляющий вектор оси <c>X</c>. Тип <c>Vector3d</c>.
y: Направляющий вектор оси <c>Y</c>. Тип <c>Vector3d</c>.

Teigha.Geometry.CoordinateSystem3d.Equals(Object)
Метод предназначен для проверки равенства объектов.
obj: Объект, с которым проверяется равенство.
Returns: Возвращает <c>true</c>, если переданная система координат <c>obj</c> не является нулевой и имеет те же начальную точку и направляющие векторы осей <c>X</c>, <c>Y</c> и <c>Z</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CoordinateSystem3d.GetHashCode
Метод позволяет получить хеш-код данного объекта.
Returns: Возвращает хеш-код данного объекта.
Тип <c>int</c>.

Teigha.Geometry.CoordinateSystem3d.IsEqualTo(Teigha.Geometry.CoordinateSystem3d)
Метод позволяет проверить, совпадает ли с данным объектом переданная в метод координатная система <c>CoordinateSystem3d</c>.
a: Входная система координат, которая сравнивается с данной.
Returns: Возвращает <c>true</c>, если переданная система координат <c>a</c> не является нулевой и имеет те же начальную точку и направляющие векторы осей <c>X</c>, <c>Y</c> и <c>Z</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CoordinateSystem3d.IsEqualTo(Teigha.Geometry.CoordinateSystem3d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, совпадает ли с данным объектом переданная в метод координатная система <c>CoordinateSystem3d</c> в пределах заданной точности.
a: Проверяемая система координат. Тип <c>CoordinateSystem3d</c>.
tolerance: Заданная точность вычислений.  Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если переданная система координат <c>a</c> не является нулевой и имеет те же начальную точку и направляющие векторы осей <c>X</c>, <c>Y</c> и <c>Z</c>.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.CoordinateSystem3d.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Returns: Возвращает строковое представление данного объекта.
Тип <c>String</c>.

Teigha.Geometry.CoordinateSystem3d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек.
provider: Заданный провайдер региональных и языковых настроек.  Тип <c>IFormatProvider</c>.
Returns: Возвращает строковое представление данного объекта.  Тип <c>String</c>.

Teigha.Geometry.CoordinateSystem3d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
format: Предписанный формат строки. Тип <c>String</c>.
provider: Входной провайдер региональных и языковых настроек.  Тип <c>IFormatProvider</c>.
Returns: Возвращает строковое представление данного объекта.
Тип <c>String</c>.

Teigha.Geometry.CoordinateSystem3d.Origin
Свойство <c>Origin</c> представляет точку начала данной системы координат.
Returns: Возвращает точку начала данной системы координат.
Тип <c>Point3d</c>.

Teigha.Geometry.CoordinateSystem3d.Xaxis
Свойство <c>Xaxis</c> представляет направляющий вектор оси <c>X</c> данной системы координат.
Returns: Возвращает направляющий вектор оси <c>X</c>.
Тип <c>Vector3d</c>.

Teigha.Geometry.CoordinateSystem3d.Yaxis
Свойство <c>Yaxis</c> представляет направляющий вектор оси <c>Y</c> данной системы координат.
Returns: Возвращает направляющий вектор оси <c>Y</c> данной системы координат.
Тип <c>Vector3d</c>.

Teigha.Geometry.CoordinateSystem3d.Zaxis
Свойство <c>Zaxis</c> представляет направляющий вектор оси <c>Z</c> данной системы координат.
Returns: Возвращает направляющий вектор оси <c>Z</c> данной системы координат.
Тип <c>Vector3d</c>.