HostMgd.EditorInput.PromptEntityResult
Класс, содержащий результаты ввода геометрического объекта
после приглашения.

HostMgd.EditorInput.PromptEntityResult.ObjectId
Возвращает геометрический объект, на который указал
пользователь.

HostMgd.EditorInput.PromptEntityResult.PickedPoint
Возвращает точку, используемую для указания на геометрический
объект.

HostMgd.EditorInput.PromptEntityResult.ToString(IFormatProvider)
Возвращает строку, представляющую данный объект, в
соответствии с заданным форматом, зависящим от локализации.
provider: Формат, зависящей от локализации