HostMgd.EditorInput.PromptForEntityEndingEventArgs
Класс, обеспечивающий данными событие PromptForEntityEnding
класса Editor.

HostMgd.EditorInput.PromptForEntityEndingEventArgs.ReplaceSelectedObject(SelectedObject)
Заменяет выделенный объект на объект, являющийся параметром
метода.
newValue: Новый объект, который заменяет выбранный

HostMgd.EditorInput.PromptForEntityEndingEventArgs.Result
Результат операции по приглашению.