HostMgd.EditorInput.PromptSelectionOptions
Класс, обеспечивающий необязательные параметры приглашения
для выбора объектов.

HostMgd.EditorInput.PromptSelectionOptions.AllowDuplicates
Свойство возвращает и устанавливает признак разрешения
добавления в результирующий набор дублирующихся значений.

HostMgd.EditorInput.PromptSelectionOptions.AllowSubSelections
Возвращает или устанавливает признак, разрешен ли выбор
подмножества объектов после приглашения.

HostMgd.EditorInput.PromptSelectionOptions.ForceSubSelections
Устанавливает или возвращает признак того, будет ли
обязательно производиться выбор подмножества объектов после
появления приглашения на выбор. Значение true означает, что
выбирается обязательно подмножество объектов.

HostMgd.EditorInput.PromptSelectionOptions.Keywords
Возвращает или устанавливает коллекцию ключевых слов.

HostMgd.EditorInput.PromptSelectionOptions.MessageForAdding
Строка сообщения при добавлении в набор выбранных объектов.

HostMgd.EditorInput.PromptSelectionOptions.MessageForRemoval
Строка сообщения при удалении из набора выбранных объектов.

HostMgd.EditorInput.PromptSelectionOptions.PrepareOptionalDetails
Устанавливает или возвращает режим N для HostSSGet.

HostMgd.EditorInput.PromptSelectionOptions.#ctor
Конструктор.

HostMgd.EditorInput.PromptSelectionOptions.RejectObjectsFromNonCurrentSpace
Устанавливает или возвращает значение свойства
RejectObjectsFromNonCurrentSpace.

HostMgd.EditorInput.PromptSelectionOptions.RejectObjectsOnLockedLayers
Свойство, запрещающее (true) или разрешающее (false) выбор
объектов на заблокированных слоях.

HostMgd.EditorInput.PromptSelectionOptions.RejectPaperspaceViewport
Устанавливает или возвращает значение свойства
RRejectPaperspaceViewport.

HostMgd.EditorInput.PromptSelectionOptions.SelectEverythingInAperture
Устанавливает режим :E для HostSSGet.

HostMgd.EditorInput.PromptSelectionOptions.SetKeywords(String,String)
Этот метод устанавливает отображаемые ключевые слова и
глобальные ключевые слова в globalKeywords. Набор
отображаемых ключевых слов должен быть заключен в скобки "["
в начале набора и "]" в конце. Сами ключевые слова набора
должны быть отделены между собой символом "/".
Каждое отображаемое в строке messageAndKeywords ключевое
слово должно также быть представленным строке на той же
позиции в строке globalKeywords. Ключевые слова в строке
globalKeywords дожн отделяться друг от друга одним пробелом.
Если список ключевых слов в скобках "[" и "]" ошибочный или
пустой, то возникает событие System.ArgumentException. Если
количество глобальных ключевых слов не совпадает с
количеством отображаемых ключевых слов, возникает событие
System.ArgumentException.
keywords: Ключевые слова (отображаемые)
globalKeywords: Ключевые слова (глобальные имена)

HostMgd.EditorInput.PromptSelectionOptions.SingleOnly
Устанавливает режим :S для HostSSGet.

HostMgd.EditorInput.PromptSelectionOptions.SinglePickInSpace
Может применяться для выбора только по одинарному щелчку
(установка режима :A для HostSSGet).