Teigha.DatabaseServices.LineAngularDimension2
Класс <c>LineAngularDimension2</c> представляет угловой размер между двумя линиями.

Teigha.DatabaseServices.LineAngularDimension2.#ctor
Конструктор по умолчанию класса <c>LineAngularDimension2</c>.

Teigha.DatabaseServices.LineAngularDimension2.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,String,DatabaseServices.ObjectId)
Конструктор класса <c>LineAngularDimension2</c>. Создает новый объект <c>LineAngularDimension2</c> с указанными параметрами.
line1Start: Начальная точка первой опорной линии углового размера. Тип <c>Point3d</c>.
line1End: Конечная точка первой опорной линии углового размера, она же является начальной точкой первой выносной линии. Тип <c>Point3d</c>.
line2Start: Начальная точка второй опорной линии углового размера. Тип <c>Point3d</c>.
line2End: Конечная точка второй опорной линии углового размера, она же является начальной точкой второй выносной линии. Тип <c>Point3d</c>.
arcPoint: Точка, гарантированно принадлежащая размерной дуге. Тип <c>Point3d</c>.
dimensionText: Размерный текст для замены текста реального измеренного значения. Тип <c>String</c>.
dimensionStyle: Идентификатор объекта размерного стиля, который используется для отрисовки размера. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.LineAngularDimension2.arcPoint
Свойство представляет 3D-точку, определяющую положение размерной дуги данного размера.
Returns: Возвращает точку на размерной дуге (в мировой системе координат, WCS). Тип <c>Point3d</c>.

Teigha.DatabaseServices.LineAngularDimension2.xLine1End
Свойство представляет конечную точку первой опорной линии данного размера.
Returns: Возвращает конечную точку первой опорной линии размера. Тип <c>Point3d</c>.

Teigha.DatabaseServices.LineAngularDimension2.xLine1Start
Свойство представляет начальную точку первой опорной линии данного размера.
Returns: Возвращает начальную точку первой опорной линии размера. Тип <c>Point3d</c>.

Teigha.DatabaseServices.LineAngularDimension2.xLine2End
Свойство представляет конечную точку второй опорной линии данного размера.
Returns: Возвращает конечную точку второй опорной линии размера. Тип <c>Point3d</c>.

Teigha.DatabaseServices.LineAngularDimension2.xLine2Start
Свойство представляет начальную точку второй опорной линии данного размера.
Returns: Возвращает начальную точку второй опорной линии размера. Тип <c>Point3d</c>.