Teigha.DatabaseServices.LayerViewportProperties
Этот класс определяет свойства видовых экранов слоев, которые используются в <c>LayerTableRecord</c>.

Teigha.DatabaseServices.LayerViewportProperties.RemoveOverrides
Метод предназначен для удаления всех переопределений, связанных со слоем и видовым экраном.

Teigha.DatabaseServices.LayerViewportProperties.Color
Свойство представляет цвет слоя.
Returns: Возвращает цвет слоя. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.LayerViewportProperties.IsColorOverridden
Свойство позволяет проверить, переопределён ли цвет для связанного слоя и видового экрана.
Returns: Возвращает <c>true</c>, если цвет переопределен. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LayerViewportProperties.IsLinetypeOverridden
Свойство позволяет проверить, переопределен ли тип линий для связанного слоя и видового экрана.
Returns: Возвращает <c>true</c>, если тип линий переопределен. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LayerViewportProperties.IsLineWeightOverridden
Свойство позволяет проверить, переопределена ли толщина (вес) линий для связанного слоя и видового экрана.
Returns: Возвращает <c>true</c>, если толщина (вес) линий переопределена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LayerViewportProperties.IsPlotStyleOverridden
Свойство позволяет проверить, переопределен ли стиль печати для связанного слоя и видового экрана.
Returns: Возвращает <c>true</c>, если стиль печати переопределен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LayerViewportProperties.LinetypeObjectId
Свойство представляет идентификатор объекта слоя в связанном видовом экране.
Returns: Возвращает идентификатор связанного видового экрана.
Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.LayerViewportProperties.LineWeight
Свойство представляет значение толщины линий на слое в связанном видовом экране.
Returns: Возвращает толщину линий. Перечисление <c>DatabaseServices.LineWeight</c>.

Teigha.DatabaseServices.LayerViewportProperties.PlotStyleName
Свойство представляет имя стиля печати.
Returns: Возвращает имя стиля печати. Тип <c>String</c>.

Teigha.DatabaseServices.LayerViewportProperties.PlotStyleNameId
Свойство представляет идентификатор имени стиля печати.
Returns: Возвращает идентификатор имени стиля печати.
Тип <c>DatabaseServices.ObjectId</c>.