Teigha.DatabaseServices.SectionSettings
Класс <c>SectionSettings</c> представляет настройки геометрии секущей плоскости.

Teigha.DatabaseServices.SectionSettings.#ctor
Конструктор по умолчанию класса <c>SectionSettings</c>.

Teigha.DatabaseServices.SectionSettings.Color(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить цвет указанной геометрии сечения.
nSecType: Входной тип создаваемого сечения. Перечисление <c>SectionType</c>.
nGeometry: Входной тип геометрии сечения.    Перечисление <c>SectionGeometry</c>.
Returns: Возвращает экземпляр класса <c>Teigha.Colors.Color</c>, который представляет настройки цвета указанной геометрии.

Teigha.DatabaseServices.SectionSettings.DestinationBlock(Teigha.DatabaseServices.SectionType)
Метод предоставляет идентификатор целевого блока, который подлежит замене в процессе создания сечения, если для генерации сечения установлен флаг <c>SectionGeneration.DestinationReplaceBlock</c>.
nSecType: Входной тип создаваемого сечения, для которого возвращается целевой блок. Перечисление <c>SectionType</c>.
Returns: Возвращает идентификатор объекта целевого блока. Тип <c>DatabaseServices.ObjectId</c>.
Если целевой блок не задан, возвращает <c>null</c>.

Teigha.DatabaseServices.SectionSettings.DestinationFile(Teigha.DatabaseServices.SectionType)
Метод предоставляет имя файла, в котором сохраняется созданное сечение, если в опциях генерации выставлен флаг <c>SectionGeneration.DestinationFile</c>.
nSecType: Входной тип создаваемого сечения из перечисления <c>SectionType</c>.
Returns: Возвращает имя файла, в котором сохраняется сечение. Тип <c>String</c>.

Teigha.DatabaseServices.SectionSettings.DivisionLines(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет определить, отображаются ли линии разделения для указанной геометрии.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает <c>true</c>, если линии разделения отображаются для указанного типа и геометрии сечения.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SectionSettings.EdgeTransparency(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод предоставляет значение прозрачности рёбер геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает прозрачность рёбер геометрии указанного типа.
Тип <c>int</c>.

Teigha.DatabaseServices.SectionSettings.FaceTransparency(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод предоставляет значение прозрачности граней геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает прозрачность граней геометрии указанного типа.
Тип <c>int</c>.

Teigha.DatabaseServices.SectionSettings.GenerationOptions(Teigha.DatabaseServices.SectionType)
Метод позволяет получить текущие опции генерации для указанного типа сечения.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
Returns: Возвращает флаги настройки процесса генерации сечения. Перечисление <c>SectionGeneration</c>.

Teigha.DatabaseServices.SectionSettings.GetHatchPatternName(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить имя образца штриховки геометрии сечения указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает имя образца штриховки. Тип <c>String</c>.

Teigha.DatabaseServices.SectionSettings.GetHatchPatternType(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить тип образца штриховки геометрии сечения указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает тип образца штриховки. Перечисление <c>HatchPatternType</c>.

Teigha.DatabaseServices.SectionSettings.GetSourceObjects(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет получить коллекцию исходных объектов для случаев, когда выставлен флаг <c>SectionGeneration.SourceSelectedObjects</c>.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
ids: Полученная коллекция идентификаторов исходных объектов. Тип <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.SectionSettings.HatchAngle(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить значение угла наклона штриховки геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает угол наклона штриховки в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.SectionSettings.HatchScale(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить масштаб штриховки геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает значение масштаба штриховки. Тип <c>double</c>.

Teigha.DatabaseServices.SectionSettings.HatchSpacing(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить интервал штриховки для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает значение интервала штриховки. Тип <c>double</c>.

Teigha.DatabaseServices.SectionSettings.HatchVisibility(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет определить, отображается ли штриховка для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает <c>true</c>, если штриховка отображается.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SectionSettings.HiddenLine(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет определить, отображаются ли скрытые линии для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает <c>true</c>, если скрытые линии отображаются.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SectionSettings.Layer(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить имя слоя для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает имя слоя. Тип <c>String</c>.

Teigha.DatabaseServices.SectionSettings.Linetype(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить имя типа линий для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает имя типа линий. Тип <c>String</c>.

Teigha.DatabaseServices.SectionSettings.LinetypeScale(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить масштаб типа линий, который используется для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает значение масштаба типа линий. Тип <c>double</c>.

Teigha.DatabaseServices.SectionSettings.LineWeight(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить вес линий, используемых для построения геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает вес (толщину) линий как значение из перечисления <c>DatabaseServices.LineWeight</c>.

Teigha.DatabaseServices.SectionSettings.PlotStyleName(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет получить имя стиля печати для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает имя стиля печати.
Тип <c>String</c>.

Teigha.DatabaseServices.SectionSettings.Reset
Метод сбрасывает к значениям по умолчанию все настройки для всех типов сечений.

Teigha.DatabaseServices.SectionSettings.Reset(Teigha.DatabaseServices.SectionType)
Метод сбрасывает к значениям по умолчанию все настройки для указанного типа сечения.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.

Teigha.DatabaseServices.SectionSettings.SetColor(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,Colors.Color)
Метод позволяет задать цвет для отображения геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
color: Новое значение цвета. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.SectionSettings.SetDestinationBlock(Teigha.DatabaseServices.SectionType,DatabaseServices.ObjectId)
Метод позволяет задать идентификатор целевого блока, который подлежит замене в процессе создания сечения, если для генерации сечения установлен флаг <c>SectionGeneration.DestinationReplaceBlock</c>.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
id: Идентификатор объекта блока. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.SectionSettings.SetDestinationFile(Teigha.DatabaseServices.SectionType,String)
Метод позволяет задать имя файла, в котором сохраняется созданное сечение, если в опциях генерации выставлен флаг <c>SectionGeneration.DestinationFile</c>.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
pszFileName: Имя файла, в котором сохраняется сечение. Тип <c>String</c>.

Teigha.DatabaseServices.SectionSettings.SetDivisionLines(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Boolean)
Метод позволяет задать видимость линий разделения для указанной геометрии.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
bShow: Флаг, определяющий, должны ли отображаться линии разделения. Тип <c>bool</c>. Линии видимы в случае значения <c>true</c>.

Teigha.DatabaseServices.SectionSettings.SetEdgeTransparency(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Int32)
Метод позволяет задать значение прозрачности рёбер геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
nTransparency: Значение прозрачности рёбер геометрии указанного типа. Тип <c>int</c>.

Teigha.DatabaseServices.SectionSettings.SetFaceTransparency(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Int32)
Метод позволяет задать значение прозрачности граней геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
nTransparency: Значение прозрачности граней геометрии указанного типа. Тип <c>int</c>.

Teigha.DatabaseServices.SectionSettings.SetGenerationOptions(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeneration)
Метод позволяет задать опции генерации для указанного типа сечения как комбинацию флагов из перечисления <c>SectionGeneration</c>.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nOptions: Флаги настройки процесса генерации сечения. Перечисление <c>SectionGeneration</c>.

Teigha.DatabaseServices.SectionSettings.SetHatchAngle(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Double)
Метод позволяет задать значение угла наклона штриховки геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
fAngle: Угол наклона штриховки в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.SectionSettings.SetHatchPatternName(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,String)
Метод позволяет задать имя образцу штриховки геометрии сечения указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
sNewName: Имя образца штриховки. Тип <c>String</c>.

Teigha.DatabaseServices.SectionSettings.SetHatchPatternType(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,Teigha.DatabaseServices.HatchPatternType)
Метод позволяет задать тип образца штриховки геометрии сечения указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
nPatternType: Тип образца штриховки. Перечисление <c>HatchPatternType</c>.

Teigha.DatabaseServices.SectionSettings.SetHatchScale(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Double)
Метод позволяет задать масштаб штриховки геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
fScale: Значение масштаба штриховки. Тип <c>double</c>.

Teigha.DatabaseServices.SectionSettings.SetHatchSpacing(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Double)
Метод позволяет задать интервал штриховки для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
fSpacing: Значение интервала штриховки.  Тип <c>double</c>.

Teigha.DatabaseServices.SectionSettings.SetHatchVisibility(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Boolean)
Метод позволяет управлять видимостью штриховки для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
bVisible: Входной флаг видимости штриховки. Тип <c>bool</c>. Передать значение <c>true</c>, если штриховка должна быть видимой. В противном случае передать <c>false</c>.

Teigha.DatabaseServices.SectionSettings.SetHiddenLine(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Boolean)
Метод позволяет управлять видимостью скрытых линий для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
bHiddenLine: Входной флаг видимости скрытых линий. Тип <c>bool</c>. Передать значение <c>true</c>, если скрытые линии должны быть видимыми. В противном случае передать <c>false</c>.

Teigha.DatabaseServices.SectionSettings.SetLayer(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,String)
Метод позволяет задать имя слоя для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
pszLayer: Строка с именем слоя. Тип <c>String</c>.

Teigha.DatabaseServices.SectionSettings.SetLinetype(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,String)
Метод позволяет задать имя типа линий для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
pszLinetype: Имя типа линий. Тип <c>String</c>.

Teigha.DatabaseServices.SectionSettings.SetLinetypeScale(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Double)
Метод позволяет задать масштаб типа линий для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
fScale: Масштаб типа линий. Тип <c>double</c>.

Teigha.DatabaseServices.SectionSettings.SetLineWeight(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,DatabaseServices.LineWeight)
Метод позволяет задать вес линий для геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
nLineWeight: Вес линий. Перечисление <c>DatabaseServices.LineWeight</c>.

Teigha.DatabaseServices.SectionSettings.SetPlotStyleName(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,String)
Метод позволяет задать имя стиля печати для вывода на печать геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
pszPlotStyleName: Имя стиля печати. Тип <c>String</c>.

Teigha.DatabaseServices.SectionSettings.SetSourceObjects(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.ObjectIdCollection)
Метод позволяет задать коллекцию исходных объектов для случаев, когда выставлен флаг <c>SectionGeneration.SourceSelectedObjects</c>.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
ids: Коллекция идентификаторов исходных объектов. Тип <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.SectionSettings.SetVisibility(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry,System.Boolean)
Метод позволяет управлять видимостью создаваемой геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
bVisible: Флаг видимости геометрии. Тип <c>bool</c>. Передать в метод значение <c>true</c>, если геометрия должна отображаться, в противном случае передать значение <c>false</c>.

Teigha.DatabaseServices.SectionSettings.Visibility(Teigha.DatabaseServices.SectionType,Teigha.DatabaseServices.SectionGeometry)
Метод позволяет проверить, включено ли отображение геометрии указанного типа.
nSecType: Тип сечения. Перечисление <c>SectionType</c>.
nGeometry: Типы элементов геометрии сечения. Перечисление <c>SectionGeometry</c>.
Returns: Возвращает <c>true</c>, если отображение геометрии включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SectionSettings.CurrentSectionType
Свойство <c>CurrentSectionType</c> представляет текущий тип сечения или разреза.
Returns: Возвращает тип сечения. Перечисление <c>SectionType</c>.