Teigha.DatabaseServices.BeginWblockEntireDatabaseEventArgs
Класс представляет данные для события <c>BeginWblockEntireDatabase</c> базы данных.

Teigha.DatabaseServices.BeginWblockEntireDatabaseEventArgs.From
Свойство предоставляет доступ к базе данных, для которой выполняется операция <c>Wblock</c>.
Returns: Возвращает объект базы данных. Тип Database.