HostMgd.EditorInput.PromptStringResultEventArgs
Класс, обеспечивающий данными событие PromptedForString
редактора.

HostMgd.EditorInput.PromptStringResultEventArgs.Result
Возвращает результат ввода строки.