Teigha.Runtime.Dictionary
Класс <c>Dictionary</c> представляет коллекцию указателей на объект, которая поддерживает поиск сохраненных в коллекции значений либо по текстовому ключу, либо по 32-битному идентификатору.

Teigha.Runtime.Dictionary.At(System.Int32)
Метод позволяет получить объект в словаре по идентификатору объекта.
id: Идентификатор искомого объекта.  Тип <c>int</c>.
Returns: Возвращает найденный объект или значение <c>NULL</c>, если идентификатор в словаре не найден.
Тип <c>RXObject</c>.

Teigha.Runtime.Dictionary.At(String)
Метод позволяет получить объект по его ключу в словаре.
key: Ключ для объекта в словаре.  Тип <c>String</c>.
Returns: Возвращает найденный объект или <c>NULL</c>, если указанный ключ в словаре не найден.
Тип <c>RXObject</c>.

Teigha.Runtime.Dictionary.AtKeyAndIdPut(String,System.Int32,Teigha.Runtime.RXObject)
Метод позволяет добавить в словарь объект с существующим идентификатором.
newKey: Входной ключ для добавляемого в словарь значения. Тип <c>String</c>.
id: Входной идентификатор записи словаря, в которой будет размещено добавляемое значение. Тип <c>int</c>.
value: Добавляемое в словарь значение. Тип <c>RXObject</c>.

Teigha.Runtime.Dictionary.AtPut(System.Int32,Teigha.Runtime.RXObject)
Метод предназначен для замены объекта в словаре с указанным идентификатором.
id: Идентификатор, под которым в словаре размещается значение.  Тип <c>int</c>.  Идентификатор должен быть положительным.
value: Входное значение для добавления в словарь.  Тип <c>RXObject</c>.  Не может быть <c>NULL</c>.
Returns: Метод возвращает указатель на объект, который был под указанным идентификатором до этого вызова.  Тип <c>RXObject</c>.
Если словарь был настроен на удаление своих записей, метод возвращает <c>NULL</c>.
Notes
Этот метод можно использовать ТОЛЬКО для замены объектов с существующими идентификаторами.

Teigha.Runtime.Dictionary.AtPut(String,Teigha.Runtime.RXObject)
Метод предназначен для размещения значения в словаре с указанным ключом в качестве ключа поиска.
key: Входной ключ для размещаемого в словаре значения.  Тип <c>String</c>.  Значение <c>NULL</c> недопустимо.
value: Входное значение для добавления в словарь.  Тип <c>RXObject</c>.  Значение <c>NULL</c> недопустимо.
Returns: Возвращает указатель на объект, который хранился в словаре этим с ключом до вызова данного метода.
Тип <c>RXObject</c>.  Если словарь был настроен на удаление своих записей, метод возвращает <c>NULL</c>.

Teigha.Runtime.Dictionary.AtPut(String,Teigha.Runtime.RXObject,[Out]int%)
Метод предназначен для размещения в словаре нового значения с указанным ключом и возвращает идентификатор новой записи в словаре, который может использоваться для поиска записи наравне с ключом.
key: Входной ключ для размещаемого в словаре значения.  Тип <c>String</c>.  Значение <c>NULL</c> недопустимо.
value: Входное значение для добавления в словарь.  Тип <c>RXObject</c>.  Значение <c>NULL</c> недопустимо.
retId: Выходное значение идентификатора записи с только что добавленным значением. Тип <c>int</c>.
Returns: Возвращает указатель на объект, который хранился в словаре с ключом <c>key</c> до вызова данного метода.
Тип <c>RXObject</c>.  Метод возвращает <c>NULL</c>, если в словаре не было значений с данным ключом, или если словарь был настроен на удаление своих записей.

Teigha.Runtime.Dictionary.Contains(System.Int32)
Метод позволяет проверить, содержится ли в данном словаре объект, соответствующий указанному идентификатору.
id: Идентификатор искомого значения.  Тип <c>int</c>.
Returns: Возвращает <c>true</c>, если в словаре существует значение с указанным идентификатором.
В противном случае возвращает <c>false</c>.

Teigha.Runtime.Dictionary.Contains(String)
Метод позволяет проверить, содержится ли в данном словаре объект, соответствующий указанному ключу.
key: Ключ для искомого значения.  Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если в словаре существует значение с указанным ключом.
В противном случае возвращает <c>false</c>.

Teigha.Runtime.Dictionary.CopyTo(array&lt;DictionaryEntry&gt;,System.Int32)
Метод копирует объекты из массива в данный словарь.
array: Входной массив копируемых записей.  Тип <c>DictionaryEntry[]</c>.
index: Индекс элемента массива, начиная с которого начинается копирование элементов массива в данный словарь.  Тип <c>int</c>.

Teigha.Runtime.Dictionary.GetEnumerator
Метод предоставляет объект перечислителя для данного словаря.
Returns: Возвращает объект перечислителя.
Тип <c>IDictionaryEnumerator</c>.

Teigha.Runtime.Dictionary.IdAt(String)
Метод позволяет выяснить идентификатор записи, хранящейся в данном словаре с указанным ключом.
key: Ключ для поиска значения. Тип <c>String</c>.
Returns: Возвращает идентификатор записи в данном словаре с ключом <c>key</c>.  Тип <c>int</c>.  Если ключ не найден, возвращает 0.
Notes
См. также метод <c>KeyAt()</c>.

Teigha.Runtime.Dictionary.KeyAt(System.Int32)
Метод позволяет выяснить ключ для записи, хранящейся в данном словаре с указанным идентификатором.
id: Идентификатор искомой записи словаря.  Тип <c>int</c>.  Передаваемое значение должно быть положительным.
Returns: Возвращает ключ для записи с идентификатором <c>id</c>.  Тип <c>String</c>.
Notes
Не следует предпринимать никаких попыток освободить память, выделенную для возвращаемой строки.
См. также метод <c>IdAt()</c>.

Teigha.Runtime.Dictionary.Remove(System.Int32)
Метод удаляет из словаря запись с указанным идентификатором.
id: Идентификатор удаляемой из словаря записи.  Тип <c>int</c>.  Передаваемое значение должно быть положительным.
Returns: Возвращает значение, хранящееся в словаре с идентификатором <c>id</c>.
Тип <c>RXObject</c>.

Teigha.Runtime.Dictionary.Remove(String)
Метод предназначен для удаления из словаря записи с указанным ключом.
key: Ключ удаляемой из словаря записи.  Тип <c>String</c>.
Returns: Возвращает удаленный из словаря объект.  Тип <c>RXObject</c>.  В случае отсутствия записи с указанным ключом возвращает <c>null</c>.

Teigha.Runtime.Dictionary.ResetKey(System.Int32,String)
Метод задает копию указанной строки в качестве ключа для записи словаря с указанным идентификатором.
id: Идентификатор записи словаря.  Тип <c>int</c>.  Значение должно быть положительным.
newKey: Новое значение ключа для записи словаря.  Тип <c>String</c>.  Значение не может равняться <c>NULL</c>.

Teigha.Runtime.Dictionary.ResetKey(String,String)
Метод позволяет изменить значение ключа у существующей записи словаря.
oldKey: Текущее значение ключа записи.  Тип <c>String</c>.  Не должно равняться <c>NULL</c>.
newKey: Новое значение ключа записи.    Тип <c>String</c>.  Не должно равняться <c>NULL</c>.

Teigha.Runtime.Dictionary.Count
Свойство <c>Count</c> представляет количество записей в данном словаре.
Returns: Возвращает текущее количество записей в словаре.
Тип <c>int</c>.

Teigha.Runtime.Dictionary.DeletesObjects
Свойство <c>DeletesObjects</c> позволяет проверить, настроен ли словарь на удаление объектов при удалении из словаря связанных с этими объектами записей.
Returns: Возвращает <c>true</c>, если словарь настроен на удаление объектов.
В противном случае возвращает <c>false</c>.

Teigha.Runtime.Dictionary.IsCaseSensitive
Свойство <c>IsCaseSensitive</c> позволяет проверить, чувствительны ли к регистру ключи данного словаря.
Returns: Возвращает <c>true</c>, если ключи данного словаря чувствительны к регистру символов.
В противном случае возвращает <c>false</c>.

Teigha.Runtime.Dictionary.IsSorted
Свойство <c>IsSorted</c> позволяет проверить, является ли данный словарь отсортированным.
Returns: Возвращает <c>true</c>, если словарь отсортирован.
В противном случае возвращает <c>false</c>.

Teigha.Runtime.Dictionary.Item
Свойство <c>Item</c> возвращает запись словаря по ее ключу.
s: Ключ записи.  Тип <c>String</c>.
Returns: Возвращает значение, сохраненное в словаре с ключом <c>s</c>.  Тип <c>RXObject</c>.