Teigha.BoundaryRepresentation.MeshEntity
Класс <c>MeshEntity</c> представляет базовый интерфейсный класс для объектов и подобъектов сети.

Teigha.BoundaryRepresentation.MeshEntity.Equals(Object)
Метод предназначен для проверки равенства двух объектов.
obj: Входной объект сети, который проверяется на равенство данному объекту.  Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если объекты равны.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.MeshEntity.GetHashCode
Метод позволяет получить хеш-код для данного объекта.
Returns: Возвращает хеш-код данного объекта.
Тип <c>int</c>.

Teigha.BoundaryRepresentation.MeshEntity.EntityAssociated
Свойство <c>EntityAssociated</c> предоставляет доступ к топологическому объекту наименьшей размерности, связанному с данным объектом сети.
Returns: Возвращает объект BREP, связанный с данным объектом сети.
Тип <c>BrepEntity</c>.

Teigha.BoundaryRepresentation.MeshEntity.IsBrepChanged
Свойство <c>IsBrepChanged</c> позволяет проверить, изменилось ли связанное граничное представление BREP с момента последнего обновления данного объекта.
Returns: Возвращает <c>true</c>, если связанный объект BREP изменился или если невозможно определить, изменился ли он.
Возвращает <c>false</c>, если связанный объект BREP не изменился, или если он не является резидентным в базе данных.

Teigha.BoundaryRepresentation.MeshEntity.IsNull
Свойство <c>IsNull</c> позволяет проверить, был ли данный объект инициализирован.
Returns: Возвращает <c>true</c>, только если данный объект не является инициализированным.
В противном случае возвращает <c>false</c>.

Teigha.BoundaryRepresentation.MeshEntity.ValidationLevel
Свойство <c>ValidationLevel</c> представляет уровень проверки, который будет использоваться во всех запросах данных, требующих доступа к связанному объекту nanoCAD.
Returns: Возвращает уровень проверки, связанный с данным объектом.
Перечисление <c>Teigha.BoundaryRepresentation.ValidationLevel</c>.