Teigha.DatabaseServices.AssocArrayRectangularParameters
Класс предоставляет интерфейс для управления параметрами прямоугольного ассоциативного массива.

Teigha.DatabaseServices.AssocArrayRectangularParameters.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.AssocArrayRectangularParameters.#ctor(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Double,System.Double)
Конструктор класса.  Создает новый объект класса с указанными параметрами.
columnSpacing: Расстояние между столбцами массива.  Тип double.
rowSpacing: Расстояние между рядами массива.  Тип double.
levelSpacing: Расстояние между уровнями в массиве.  Тип double.
columnCount: Количество столбцов в массиве. Тип int.
rowCount: Количество рядов в массиве. Тип int.
levelCount: Количество уровней в массиве. Тип int.
rowElevation: Приращение отметок между соседними рядами массива. Тип double.
axesAngle: Угол между первым рядом и первым столбцом массива. Тип double.

Teigha.DatabaseServices.AssocArrayRectangularParameters.GetAxesAngle([Out] String,[Out] String)
Метод позволяет получить угол между первым рядом и первым столбцом массива.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
Returns: Возвращает угол наклона столбцов массива в радианах.  Тип double.

Teigha.DatabaseServices.AssocArrayRectangularParameters.GetColumnCount([Out] String,[Out] String)
Метод позволяет получить количество столбцов в массиве.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
Returns: Возвращает количество столбцов в массиве. Тип int.

Teigha.DatabaseServices.AssocArrayRectangularParameters.GetColumnSpacing([Out] String,[Out] String)
Метод позволяет получить расстояние между столбцами массива.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.
Returns: Возвращает расстояние между столбцами массива. Тип double.

Teigha.DatabaseServices.AssocArrayRectangularParameters.SetAxesAngle(System.Double,String,String)
Метод позволяет задать угол между первым рядом и первым столбцом массива.
val: Значение угла в радианах. Тип double.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayRectangularParameters.SetColumnCount(System.Int32,String,String)
Метод позволяет задать количество столбцов в массиве.
count: Количество столбцов. Тип int.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayRectangularParameters.SetColumnSpacing(System.Double,String,String)
Метод позволяет задать расстояние между столбцами массива.
spacing: Расстояние между столбцами массива. Тип double.
expression: Выражение для параметра. Тип String. Строка может быть пустой.
evaluatorId: Строковое представление идентификатора вычислителя. Тип String. Строка может быть пустой.

Teigha.DatabaseServices.AssocArrayRectangularParameters.AxesAngle
Свойство обеспечивает доступ к текущему значению угла между первым рядом и первым столбцом массива.
Returns: Возвращает угол в радианах между первым рядом и первым столбцом массива. Тип double.

Teigha.DatabaseServices.AssocArrayRectangularParameters.ColumnCount
Свойство обеспечивает доступ к количеству стобцов в массиве.
Returns: Возвращает количеству стобцов в массиве. Тип int.

Teigha.DatabaseServices.AssocArrayRectangularParameters.ColumnSpacing
Свойство обеспечивает доступ к расстоянию между соседними столбцами массива.
Returns: Возвращает расстояние между соседними столбцами массива. Тип double.

Teigha.DatabaseServices.AssocArrayRectangularParameters.XAxisDirection
Свойство обеспечивает доступ к направлению рядов массива.
Returns: Возвращает направление рядов массива. Тип Vector3d.

Teigha.DatabaseServices.AssocArrayRectangularParameters.YAxisDirection
Свойство обеспечивает доступ к направлению столбцов массива.
Returns: Возвращает направление столбцов массива. Тип Vector3d.