Teigha.DatabaseServices.Rectangle3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор структуры <c>Rectangle3d</c>. Создает 3D-прямоугольник, используя заданные вершины.
upperLeft: Вершина в верхнем левом  углу прямоугольника.  Тип <c>Point3d</c>.
upperRight: Вершина в верхнем правом углу прямоугольника.  Тип <c>Point3d</c>.
lowerLeft: Вершина в нижнем  левом  углу прямоугольника.  Тип <c>Point3d</c>.
lowerRight: Вершина в нижнем  правом углу прямоугольника.  Тип <c>Point3d</c>.

Teigha.DatabaseServices.Rectangle3d.ToString
Метод позволяет получить эквивалентное представление данного объекта в виде текстовой строки.
Returns: Возвращает эквивалентное строковое представление данного объекта. Тип <c>String</c>.

Teigha.DatabaseServices.Rectangle3d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное представление данного объекта в виде текстовой строки, учитывающее заданные языковые и региональные настройки.
provider: Входной провайдер языковых и региональных настроек. Тип <c>IFormatProvider</c>.
Returns: Возвращает эквивалентное строковое представление данного объекта с учетом заданных языковых и региональных настроек.
Тип <c>String</c>.

Teigha.DatabaseServices.Rectangle3d.LowerLeft
Свойство <c>LowerLeft</c> представляет нижнюю левую вершину прямоугольника.
Returns: Возвращает указанную вершину прямоугольника. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Rectangle3d.LowerRight
Свойство <c>LowerRight</c> представляет правую нижнюю вершину прямоугольника.
Returns: Возвращает указанную вершину прямоугольника. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Rectangle3d.UpperLeft
Свойство <c>UpperLeft</c> представляет верхнюю левую вершину прямоугольника.
Returns: Возвращает указанную вершину прямоугольника. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Rectangle3d.UpperRight
Свойство <c>UpperRight</c> представляет правую верхнюю вершину прямоугольника.
Returns: Возвращает указанную вершину прямоугольника. Тип <c>Point3d</c>.