Teigha.Runtime.CommandFlags
Данное перечисление определяет значения, которые могут быть переданы как аргумент <c>commandFlags</c> функции NRX <c>NcEdCommandStack.addCommand()</c>.  В .NET API nanoCAD эти значения могут быть переданы как аргумент <c>flags</c> в метод <c>Teigha.Runtime.CommandMethodAttribute()</c>.