Teigha.Geometry.CurveCurveIntersector2d
Класс <c>CurveCurveIntersector2d</c> представляет геометрию пересечений 2D-кривых общего вида.

Teigha.Geometry.CurveCurveIntersector2d.#ctor
Конструктор по умолчанию класса <c>CurveCurveIntersector2d</c>.

Teigha.Geometry.CurveCurveIntersector2d.#ctor(IntPtr,System.Boolean)
Конструктор класса <c>CurveCurveIntersector2d</c>.
Создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.

Teigha.Geometry.CurveCurveIntersector2d.#ctor(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d)
Конструктор класса <c>CurveCurveIntersector2d</c>. Создает объект с двумя переданными кривыми.
curve1: Первая входная кривая. Тип <c>Curve2d</c>.
curve2: Вторая входная кривая. Тип <c>Curve2d</c>.

Teigha.Geometry.CurveCurveIntersector2d.#ctor(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Geometry.Tolerance)
Конструктор класса <c>CurveCurveIntersector2d</c>.
Создает объект с двумя переданными кривыми и заданной геометрической точностью.
curve1: Первая входная кривая. Тип <c>Curve2d</c>.
curve2: Вторая входная кривая. Тип <c>Curve2d</c>.
tolerance: Входное значение геометрической точности. Тип <c>Geometry.Tolerance</c>.

Teigha.Geometry.CurveCurveIntersector2d.#ctor(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Teigha.Geometry.Interval,Teigha.Geometry.Interval)
Конструктор класса <c>CurveCurveIntersector2d</c>.
Создает объект для вычисления пересечений фрагментов указанных кривых, которые определены заданными параметрическими интервалами.
curve1: Первая входная кривая. Тип <c>Curve2d</c>.
curve2: Вторая входная кривая. Тип <c>Curve2d</c>.
range1: Параметрический интервал для первой кривой. Тип <c>Interval</c>.
range2: Параметрический интервал для второй кривой. Тип <c>Interval</c>.

Teigha.Geometry.CurveCurveIntersector2d.#ctor(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Geometry.Tolerance)
Конструктор класса <c>CurveCurveIntersector2d</c>.
Создает объект для вычисления с заданной точностью пересечений фрагментов указанных кривых, которые определены заданными параметрическими интервалами.
curve1: Первая входная кривая. Тип <c>Curve2d</c>.
curve2: Вторая входная кривая. Тип <c>Curve2d</c>.
range1: Параметрический интервал для первой кривой. Тип <c>Interval</c>.
range2: Параметрический интервал для второй кривой. Тип <c>Interval</c>.
tolerance: Входное значение геометрической точности. Тип <c>Geometry.Tolerance</c>.

Teigha.Geometry.CurveCurveIntersector2d.ChangeCurveOrder
Метод предназначен для изменения порядка кривых в данном объекте, делая первую кривую второй и наоборот.

Teigha.Geometry.CurveCurveIntersector2d.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает новый объект <c>CurveCurveIntersector2d</c>.

Teigha.Geometry.CurveCurveIntersector2d.GetIntersectionParameters(System.Int32)
Метод вычисляет значения параметров для каждой из кривых в точке пересечения с указанным индексом.
intersection: Индекс точки пересечения, в которой требуется вычислить параметры для пересекающихся кривых. Тип <c>int</c>.
Returns: Возвращает массив из двух элементов. Тип <c>double[]</c>.
Первое значение представляет параметр для первой кривой в точке пересечения, а второе значение — параметр для второй кривой в точке пересечения.

Teigha.Geometry.CurveCurveIntersector2d.GetIntersectionPoint(System.Int32)
Метод предоставляет 2D-точку пересечения с указанным индексом.
number: Порядковый индекс искомой точки пересечения. Тип <c>int</c>.
Returns: Возвращает 2D-точку пересечения с индексом <c>number</c>. Тип <c>Point2d</c>.

Teigha.Geometry.CurveCurveIntersector2d.GetIntersectionPointTolerance(System.Int32)
Метод предоставляет геометрическую точность, которая использовалась для вычисления точки пересечения с заданным индексом.
intersection: Индекс интересующей точки пересечения. Тип <c>int</c>.
Returns: Возвращает геометрическую точность вычисления указанной точки пересечения. Тип <c>double</c>.

Teigha.Geometry.CurveCurveIntersector2d.GetIntersectionRanges
Метод предоставляет параметрические интервалы, на которых вычисляются точки пересечения кривых.
Returns: Возвращает массив параметрических интервалов. Тип <c>Interval[]</c>. Массив содержит ровно два элемента, которые представляют параметрические интервалы для первой и второй кривой, соответственно.

Teigha.Geometry.CurveCurveIntersector2d.GetOverlapRanges(System.Int32)
Метод позволяет вычислить для обеих кривых параметрические интервалы, которые соответствуют указанному по индексу участку перекрытия (совпадения) кривых.
overlapNumber: Индекс участка перекрытия (совпадения) кривых. Тип <c>int</c>. Значение <c>overlapNumber</c> должно быть неотрицательным и быть меньше количества перекрытий, возвращаемого свойством <c>OverlapCount</c>.
Returns: Возвращает массив из двух элементов, которые представляют параметрические интервалы для первой и второй кривой, соответственно.  Тип <c>Interval[]</c>.

Teigha.Geometry.CurveCurveIntersector2d.GetPointOnCurve1(System.Int32)
Метод позволяет получить точку пересечения с заданным индексом как точку <c>PointOnCurve2d</c> на первой кривой.
intersection: Входной индекс точки пересечения кривых. Тип <c>int</c>.
Returns: Возвращает объект <c>PointOnCurve2d</c> для точки пересечения на первой кривой.

Teigha.Geometry.CurveCurveIntersector2d.GetPointOnCurve2(System.Int32)
Метод позволяет получить точку пересечения с заданным индексом как точку <c>PointOnCurve2d</c> на второй кривой.
intersection: Входной индекс точки пересечения кривых. Тип <c>int</c>.
Returns: Возвращает объект <c>PointOnCurve2d</c> для точки пересечения на второй кривой.

Teigha.Geometry.CurveCurveIntersector2d.IsTangential(System.Int32)
Метод позволяет проверить, являются ли кривые касательными друг к другу в указанной точке пересечения.
intersection: Входной индекс точки пересечения кривых. Тип <c>int</c>.
Returns: Возвращает <c>true</c>, если в указанной точке кривые являются касательными.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CurveCurveIntersector2d.IsTransversal(System.Int32)
Метод позволяет проверить, являются ли кривые трансверсальными (пересекающимися) в указанной точке пересечения.
intersection: Входной индекс точки пересечения кривых. Тип <c>int</c>.
Returns: Возвращает <c>true</c>, если пересечение кривых в указанной точке является трансверсальным.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CurveCurveIntersector2d.OrderWithRegardsTo1
Метод сортирует точки пересечения по возрастанию значений параметра первой кривой.

Teigha.Geometry.CurveCurveIntersector2d.OrderWithRegardsTo2
Метод сортирует точки пересечения по возрастанию значений параметра второй кривой.

Teigha.Geometry.CurveCurveIntersector2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d)
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах точности по умолчанию.
curve1: Первая входная кривая. Тип <c>Curve2d</c>.
curve2: Вторая входная кривая. Тип <c>Curve2d</c>.

Teigha.Geometry.CurveCurveIntersector2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Geometry.Tolerance)
Метод позволяет переопределить обе кривые в данном объекте.
Точки пересечения вычисляются в пределах указанной точности.
curve1: Первая входная кривая. Тип <c>Curve2d</c>.
curve2: Вторая входная кривая. Тип <c>Curve2d</c>.
tolerance: Входное значение геометрической точности. Тип <c>Geometry.Tolerance</c>.

Teigha.Geometry.CurveCurveIntersector2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Teigha.Geometry.Interval,Teigha.Geometry.Interval)
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения вычисляются в пределах точности по умолчанию.
curve1: Первая входная кривая. Тип <c>Curve2d</c>.
curve2: Вторая входная кривая. Тип <c>Curve2d</c>.
range1: Параметрический интервал для первой кривой. Тип <c>Interval</c>.
range2: Параметрический интервал для второй кривой. Тип <c>Interval</c>.

Teigha.Geometry.CurveCurveIntersector2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Teigha.Geometry.Interval,Teigha.Geometry.Interval,Geometry.Tolerance)
Метод позволяет переопределить в данном объекте обе кривые и параметрические интервалы для каждой из них.
Точки пересечения вычисляются в пределах указанной точности.
curve1: Первая входная кривая. Тип <c>Curve2d</c>.
curve2: Вторая входная кривая. Тип <c>Curve2d</c>.
range1: Параметрический интервал для первой кривой. Тип <c>Interval</c>.
range2: Параметрический интервал для второй кривой. Тип <c>Interval</c>.
tolerance: Входная геометрическая точность.  Тип <c>Geometry.Tolerance</c>.

Teigha.Geometry.CurveCurveIntersector2d.Curve1
Свойство <c>Curve1</c> представляет указатель на первую кривую в данном объекте.
Returns: Возвращает первую кривую. Тип <c>Geometry.Curve2d</c>.

Teigha.Geometry.CurveCurveIntersector2d.Curve2
Свойство <c>Curve2</c> представляет указатель на вторую кривую в данном объекте.
Returns: Возвращает вторую кривую. Тип <c>Geometry.Curve2d</c>.

Teigha.Geometry.CurveCurveIntersector2d.NumberOfIntersectionPoints
Свойство <c>NumberOfIntersectionPoints</c> представляет количество найденных точек пересечения двух кривых.
Returns: Возвращает количество точек пересечения двух кривых. Тип <c>int</c>.

Teigha.Geometry.CurveCurveIntersector2d.OverlapCount
Свойство <c>OverlapCount</c> представляет количество интервалов перекрытия для двух кривых в данном объекте.
Returns: Возвращает количество интервалов перекрытия двух кривых. Тип <c>int</c>.

Teigha.Geometry.CurveCurveIntersector2d.OverlapDirection
Свойство <c>OverlapDirection</c> позволяет проверить взаимную ориентацию кривых на участке их перекрытия.
Returns: Возвращает <c>true</c>, если две кривые ориентированы в одном направлении на участке их перекрытия.
В случае противоположной ориентации перекрывающихся кривых возвращает значение <c>false</c>. Тип <c>bool</c>.

Teigha.Geometry.CurveCurveIntersector2d.Tolerance
Свойство <c>Tolerance</c> представляет текущее значение точности, которое будет использоваться при вычислении пересечений двух кривых.
Returns: Возвращает текущее значение точности. Тип <c>Geometry.Tolerance</c>.