HostMgd.EditorInput.PromptEntityResultEventArgs
Класс, обеспечивающий данными событие PromptedForEntity
класса Editor.

HostMgd.EditorInput.PromptEntityResultEventArgs.Result
Возвращает результат выбора объекта.