Teigha.DatabaseServices.DataColumn
Класс DataColumn представляет один столбец таблицы данных DataTable.

Teigha.DatabaseServices.DataColumn.#ctor
Конструктор класса DataColumn по умолчанию.

Teigha.DatabaseServices.DataColumn.#ctor(Teigha.DatabaseServices.CellType,String)
Конструктор класса DataColumn. Создает столбец с заданным именем и указанным типом данных в его ячейках.
type: Тип данных в ячейках данного столбца. Тип CellType.
columnName: Имя столбца. Тип String.

Teigha.DatabaseServices.DataColumn.#ctor(Teigha.DatabaseServices.DataColumn)
Конструктор копирования класса DataColumn.
column: Входной объект для копирования. Тип DataColumn.

Teigha.DatabaseServices.DataColumn.AppendCell(Teigha.DatabaseServices.DataCell)
Метод добавляет указанную ячейку в конец столбца.
cell: Добавляемая в столбец ячейка. Тип DataCell.

Teigha.DatabaseServices.DataColumn.Assign(Teigha.DatabaseServices.DataColumn)
Метод назначает этому объекту новый столбец.
col: Исходный столбец. Тип DataColumn.

Teigha.DatabaseServices.DataColumn.GetCellAt(System.Int32)
Метод предоставляет ячейку данных, которая находится в этом столбце по указанному индексу.
index: Индекс ячейки данных. Тип <c>int</c>.
Returns: Возвращает ячейку данных. Тип DataCell.

Teigha.DatabaseServices.DataColumn.GetIndexAtCell(Teigha.DatabaseServices.DataCell)
Метод возвращает индекс первой найденной ячейки в столбце, которая по своим данным соответствует указанному объекту DataCell.
cell: Входной объект для поиска ячейки данных в столбце. Тип DataCell.
Returns: Возвращает индекс найденной ячейки. Тип <c>int</c>.
Если ячейка данных отсутствует, происходит завершение работы приложения и появляется сообщение 'Operation is not valid due to the current state of the object.' (Операция не может быть выполнена вследствие текущего состояния объекта.)

Teigha.DatabaseServices.DataColumn.InsertCellAt(System.Int32,Teigha.DatabaseServices.DataCell)
Метод вставляет в столбец ячейку данных DataCell по указанному индексу.
cell: Вставляемая ячейка данных. Тип DataCell.
index: Индекс, по которому следует вставить ячейку объект <c>cell</c>. Тип <c>int</c>.

Teigha.DatabaseServices.DataColumn.RemoveCellAt(System.Int32)
Метод удаляет из столбца ячейку данных по указанному индексу.
index: Индекс удаляемой ячейки данных. Тип <c>int</c>.

Teigha.DatabaseServices.DataColumn.SetCellAt(System.Int32,Teigha.DatabaseServices.DataCell)
Метод устанавливает входную ячейку данных по указанному индексу.
cell: Входная ячейка данных. Тип DataCell.
index: Индекс ячейки. Тип <c>int</c>. В случае недействительного индекса происходит завершение работы приложения, сопровождаемое сообщением 'Operation is not valid due to the current state of the object.' (Текущее состояния объекта не позволяет выполнить эту операцию.)

Teigha.DatabaseServices.DataColumn.ColumnName
Свойство возвращает или задает имя этого столбца данных.
Returns: Возвращает имя столбца данных. Тип String.

Teigha.DatabaseServices.DataColumn.ColumnType
Свойство обеспечивает доступ к типу данных в этом столбце.
Returns: Возвращает тип данных в этом столбце. Значение из перечисления Teigha.DatabaseServices.CellType.

Teigha.DatabaseServices.DataColumn.GrowLength
Свойство возвращает или позволяет изменить величину приращения длины столбца. Не реализовано.
Returns: Свойство не реализовано. Всегда возвращает -200.

Teigha.DatabaseServices.DataColumn.NumCells
Свойство возвращает количество ячеек в этом столбце.
Returns: Возвращает количество ячеек. Тип int.

Teigha.DatabaseServices.DataColumn.PhysicalLength
Свойство возвращает физическую длину данного столбца.
Returns: Возвращает количество строк в столбце. Тип <c>int</c>.