Teigha.DatabaseServices.MLeader
Класс <c>MLeader</c> представляет объект мультивыноски.

Teigha.DatabaseServices.MLeader.#ctor
Конструктор по умолчанию класса <c>MLeader</c>.

Teigha.DatabaseServices.MLeader.AddFirstVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет вставить новую первую вершину в указанную линию выноски.
leaderLineIndex: Индекс линии выноски, в которую будет добавлена вершина. Тип <c>int</c>.
point: Точка, определяющая положение новой вершины. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.AddLastVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет добавить новую последнюю вершину в указанную линию выноски.
leaderLineIndex: Индекс линии выноски, в которую будет добавлена вершина. Тип <c>int</c>.
point: Точка, определяющая положение новой вершины. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.AddLeader
Метод позволяет добавить к данному объекту <c>MLeader</c> новый кластер выноски, состоящий из выносной линии и полки.
Returns: Возвращает индекс добавленного кластера. Тип <c>int</c>.

Teigha.DatabaseServices.MLeader.AddLeaderLine(System.Int32)
Добавляет линию выноски в кластер выноски с указанным индексом.
leaderIndex: Индекс кластера выноски. Тип <c>int</c>.
Returns: Возвращает индекс добавленной линии выноски. Тип <c>int</c>.

Teigha.DatabaseServices.MLeader.AddLeaderLine(Teigha.Geometry.Point3d)
Метод позволяет добавить к данному объекту <c>MLeader</c> новую линию выноски с началом в указанной точке.
point: Первая точка новой линии выноски. Тип <c>Point3d</c>.
Returns: Возвращает индекс добавленной линии выноски. Тип <c>int</c>.

Teigha.DatabaseServices.MLeader.ConnectionPoint(Teigha.Geometry.Vector3d)
Метод возвращает точку присоединения этой мультивыноски в указанном направлении.
direction: Направление для искомой точки. Тип <c>Vector3d</c>.
Returns: Возвращает точку присоединения. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.ConnectionPoint(Teigha.Geometry.Vector3d,Teigha.DatabaseServices.TextAttachmentDirection)
Метод возвращает точку присоединения линии выноски в заданном направлении с учетом ориентации полки.
direction: Направление для искомой точки. Тип <c>Vector3d</c>.
attachDirection: Ориентация полки.  Перечисление
<link Teigha:
Returns: Возвращает точку присоединения. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.GetArrowSize(System.Int32)
Метод возвращает размер стрелки для указанной линии выноски.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
Returns: Возвращает размер стрелки. Тип <c>double</c>.

Teigha.DatabaseServices.MLeader.GetArrowSymbolId(System.Int32)
Метод предоставляет идентификатор объекта символа стрелки для указанной линии выноски.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
Returns: Возвращает идентификатор объекта символа стрелки. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeader.GetBlockAttribute(DatabaseServices.ObjectId)
Метод позволяет получить атрибут блока данной мультивыноски с указанным определением атрибута.
attDefId: Идентификатор определения атрибута блока. Тип <c>DatabaseServices.ObjectId</c>.
Returns: Возвращает атрибут блока. Тип <c>AttributeReference</c>.

Teigha.DatabaseServices.MLeader.GetContentGeomExtents
Метод позволяет получить ограничивающий бокс для данной мультивыноски.
Returns: Возвращает ограничивающий бокс. Тип <c>Extents3d</c>.

Teigha.DatabaseServices.MLeader.getContextDataManager
Метод возвращает указатель на менеджер данных контекста этой мультивыноски.
Returns: Возвращает указатель на объект менеджера данных контекста мультивыноски.  Тип <c>IntPtr</c>.

Teigha.DatabaseServices.MLeader.GetDogleg(System.Int32)
Метод предоставляет направление полки для указанного кластера выносной линии.
leaderIndex: индекс кластера выносной линии. Тип <c>int</c>.
Returns: Возвращает направление полки. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.MLeader.GetDoglegLength(System.Int32)
Метод позволяет определить длину полки для указанного кластера выносной линии.
leaderIndex: Индекс кластера выносной линии. Тип <c>int</c>.
Returns: Возвращает длину указанной полки. Тип <c>double</c>.

Teigha.DatabaseServices.MLeader.GetFirstVertex(System.Int32)
Метод позволяет определить первую вершину выносной линии с указанным индексом.
leaderLineIndex: Индекс выносной линии. Тип <c>int</c>.
Returns: Возвращает точку первой вершины. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.GetLastVertex(System.Int32)
Метод позволяет определить последнюю вершину выносной линии с указанным индексом.
leaderLineIndex: Индекс выносной линии. Тип <c>int</c>.
Returns: Возвращает точку последней вершины. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.GetLeaderIndex(System.Int32)
Метод предоставляет возможность получить индекс кластера, в котором содержится линия выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
Returns: Возвращает индекс кластера с искомой выносной линией. Тип <c>int</c>.

Teigha.DatabaseServices.MLeader.GetLeaderIndexes
Метод предоставляет массив индексов линий выносок данного объекта <c>MLeader</c>.
Returns: Возвращает массив индексов линий выносок. Тип <c>System.Collections.ArrayList</c>.

Teigha.DatabaseServices.MLeader.GetLeaderLineColor(System.Int32)
Метод предоставляет цвет линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
Returns: Возвращает цвет линии выноски. Тип <c>Colors.Color</c>.

Teigha.DatabaseServices.MLeader.GetLeaderLineIndexes(System.Int32)
Метод предоставляет массив индексов всех линейных сегментов указанной линии выноски.
leaderIndex: индекс выноски. Тип <c>int</c>.
Returns: Возвращает массив индексов всех линейных сегментов указанной линии выноски. Тип <c>ArrayList</c>.

Teigha.DatabaseServices.MLeader.GetLeaderLineType(System.Int32)
Метод позволяет получить тип линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
Returns: Возвращает тип линии выноски. Перечисление <c>Teigha.DatabaseServices.LeaderType</c>.

Teigha.DatabaseServices.MLeader.GetLeaderLineTypeId(System.Int32)
Метод возвращает идентификатор объекта типа линии для выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
Returns: Возвращает идентификатор объекта типа линии для выноски. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeader.GetLeaderLineWeight(System.Int32)
Метод возвращает толщину (вес) линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
Returns: Возвращает толщину (вес) линии выноски. Перечисление <c>DatabaseServices.LineWeight</c>.

Teigha.DatabaseServices.MLeader.getOverridedMLeaderStyle(Teigha.DatabaseServices.MLeaderStyle)
Метод предоставляет набор свойств данной мультивыноски, включая значения переопределений.
mleaderStyle: Возвращаемые свойства объекта <c>MLeader</c>. Тип <c>MLeaderStyle</c>.

Teigha.DatabaseServices.MLeader.GetPlane
Метод возвращает плоскость, в которой располагается данный объект <c>MLeader</c>.
Returns: Возвращает плоскость в мировой системе координат (WCS). Тип <c>Plane</c>.

Teigha.DatabaseServices.MLeader.GetTextAttachmentType(Teigha.DatabaseServices.LeaderDirectionType)
Метод позволяет получить вариант расположения точки прикрепления выносной линии к объекту <c>MText</c>.
leaderDirection: Вариант ориентации полки из перечисления <c>LeaderDirectionType</c>.
Returns: Возвращает тип прикрепления выносной линии к многострочному тексту. Перечисление <c>TextAttachmentType</c>.

Teigha.DatabaseServices.MLeader.GetVertex(System.Int32,System.Int32)
Метод позволяет получить точку заданной вершины линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски.         Тип <c>int</c>.
index: Индекс вершины линии выноски. Тип <c>int</c>.
Returns: Возвращает точку указанной вершины. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.HasContent
Метод позволяет проверить, определено ли содержимое в данном объекте <c>MLeader</c>.
Returns: Возвращает <c>true</c>, если содержимое определено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeader.MoveMLeader(Teigha.Geometry.Vector3d,Teigha.DatabaseServices.MoveType)
Метод перемещает данный объект <c>MLeader</c> на заданный вектор.
vec: Вектор, определяющий направление и величину перемещения объекта. Тип <c>Vector3d</c>.
type: Вариант перемещения мультивыноски. Значение из перечисления <c>MoveType</c>.

Teigha.DatabaseServices.MLeader.PostMLeaderToDb(DatabaseServices.Database)
Метод предназначен для добавления этого объекта <c>MLeader</c> в блок пространства модели указанной базы данных.
db: База данных, в которую следует добавить мультивыноску <c>MLeader</c>.

Teigha.DatabaseServices.MLeader.recomputeBreakPoints
Метод перевычисляет точки разбиения данной мультивыноски.

Teigha.DatabaseServices.MLeader.RemoveFirstVertex(System.Int32)
Метод позволяет удалить первую вершину из указанной линии выноски.
leaderLineIndex: Индекс линии выноски, у которой удаляется вершина. Тип <c>int</c>.

Teigha.DatabaseServices.MLeader.RemoveLastVertex(System.Int32)
Метод позволяет удалить последнюю вершину из указанной линии выноски.
leaderLineIndex: Индекс линии выноски, у которой удаляется вершина. Тип <c>int</c>.

Teigha.DatabaseServices.MLeader.RemoveLeader(System.Int32)
Метод позволяет удалить из данной мультивыноски кластер с указанным индексом
index: Индекс удаляемого кластера. Тип <c>int</c>.

Teigha.DatabaseServices.MLeader.RemoveLeaderLine(System.Int32)
Метод удаляет линию выноски с указанным индексом.
leaderLineIndex: Индекс удаляемой линии выноски. Тип <c>int</c>.

Teigha.DatabaseServices.MLeader.SetArrowSize(System.Int32,System.Double)
Метод позволяет задать размер стрелки для линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
arrowSize: Размер стрелки. Тип <c>double</c>.

Teigha.DatabaseServices.MLeader.SetArrowSymbolId(System.Int32,DatabaseServices.ObjectId)
Метод позволяет задать символ стрелки для указанной линии выноски.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
id: Идентификатор символа стрелки. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeader.SetBlockAttribute(DatabaseServices.ObjectId,Teigha.DatabaseServices.AttributeReference)
Метод задает значение указанному атрибуту в содержимом блока данной мультивыноски.
attDefId: Идентификатор объекта определения атрибута блока. Тип <c>DatabaseServices.ObjectId</c>.
attributeValue: Задаваемое значение атрибута. Тип <c>AttributeReference</c>.

Teigha.DatabaseServices.MLeader.SetContextDataManager(IntPtr)
Метод позволяет задать указатель на менеджер данных контекста этой мультивыноски.
contextDataManager: Менеджер данных контекста. Тип <c>IntPtr</c>.

Teigha.DatabaseServices.MLeader.SetDogleg(System.Int32,Teigha.Geometry.Vector3d)
Метод позволяет задать направление полки линии выноски с указанным индексом.
leaderIndex: Индекс линии выноски. Тип <c>int</c>.
vector: Направление полки.    Тип <c>Vector3d</c>.

Teigha.DatabaseServices.MLeader.SetDoglegLength(System.Int32,System.Double)
Метод позволяет задать длину полки в указанном кластере линии выноски.
leaderIndex: Индекс линии выноски. Тип <c>int</c>.
doglegLength: Длина полки. Тип <c>double</c>.

Teigha.DatabaseServices.MLeader.SetFirstVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет переопределить положение первой вершины указанной линии выноски.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
point: Новое положение вершины линии выноски. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.SetLastVertex(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет изменить положение последней вершины указанной линии выноски.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
point: Новое положение вершины линии выноски. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.SetLeaderLineColor(System.Int32,Colors.Color)
Метод позволяет задать цвет линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
leaderLineTypeId: Новый цвет линии выноски.  Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.MLeader.SetLeaderLineType(System.Int32,DatabaseServices.LeaderType)
Метод позволяет задать тип линии выноски с указанным индексом (прямая, сплайн, невидимая).
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
leaderLineType: Тип линии выноски из перечисления <c>DatabaseServices.LeaderType</c>.

Teigha.DatabaseServices.MLeader.SetLeaderLineTypeId(System.Int32,DatabaseServices.ObjectId)
Метод позволяет задать новый тип линии для линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
leaderLineTypeId: Идентификатор нового типа линии. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeader.SetLeaderLineWeight(System.Int32,DatabaseServices.LineWeight)
Метод позволяет задать новое значение толщины (вес) линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
leaderLineWeight: Новое значение толщины (вес) линии выноски из перечисления <c>DatabaseServices.LineWeight</c>.

Teigha.DatabaseServices.MLeader.SetPlane(Teigha.Geometry.Plane)
Метод позволяет переопределить плоскость, в которой располагается данная мультивыноска.
value: Новая плоскость для мультивыноски. Тип <c>Plane</c>.

Teigha.DatabaseServices.MLeader.SetTextAttachmentType(Teigha.DatabaseServices.TextAttachmentType,Teigha.DatabaseServices.LeaderDirectionType)
Метод позволяет задать вариант расположения точки прикрепления выносной линии к многострочному тексту данного объекта.
textAttachmentType: Тип прикрепления выносной линии к многострочному тексту из перечисления
<c><link Teigha:
leaderDirection: Вариант ориентации полки из перечисления <c>LeaderDirectionType</c>.

Teigha.DatabaseServices.MLeader.SetVertex(System.Int32,System.Int32,Teigha.Geometry.Point3d)
Метод позволяет переопределить положение конкретной вершины указанной линии выноски.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
index: Индекс вершины. Тип <c>int</c>.
point: Новое положение вершины. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.VerticesCount(System.Int32)
Метод позволяет получить количество вершин у линии выноски с указанным индексом.
leaderLineIndex: Индекс линии выноски. Тип <c>int</c>.
Returns: Возвращает количество вершин. Тип <c>int</c>.

Teigha.DatabaseServices.MLeader.ArrowSize
Свойство представляет размер стрелки для данного объекта <c>MLeader</c>.
Returns: Возвращает размер стрелки. Тип <c>double</c>.

Teigha.DatabaseServices.MLeader.ArrowSymbolId
Свойство представляет идентификатор объекта символа стрелки для данного объекта <c>MLeader</c>.
Returns: Возвращает идентификатор объекта символа стрелки. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.MLeader.BlockColor
Свойство представляет цвет, используемый для отрисовки содержимого блока.
Returns: Возвращает цвет содержимого блока. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.MLeader.BlockConnectionType
Свойство представляет вариант соединения блока с линиями выноски в данном объекте <c>MLeader</c>.
Returns: Возвращает вариант соединения блока с линиями выноски из перечисления <c>DatabaseServices.BlockConnectionType</c>.

Teigha.DatabaseServices.MLeader.BlockContentId
Свойство представляет идентификатор <c>ObjectId</c> блока, на который ссылается данный объект <c>MLeader</c>.
Returns: Возвращает идентификатор объекта блока. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeader.BlockPosition
Свойство представляет точку вставки блока, на который ссылается данный объект <c>MLeader</c>.
Returns: Возвращает точку вставки блока. Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.BlockRotation
Свойство представляет угол поворота блока, используемого данным объектом <c>MLeader</c>.
Returns: Возвращает угол поворота блока (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.MLeader.blockScale
Свойство представляет масштаб отрисовки блока, используемого данным объектом <c>MLeader</c>.
Returns: Возвращает масштаб блока. Тип <c>Scale3d</c>.

Teigha.DatabaseServices.MLeader.ContentType
Свойство представляет тип содержимого данного объекта <c>MLeader</c>.
Returns: Возвращает тип содержимого мультивыноски. Значение из перечисления <c>DatabaseServices.ContentType</c>.

Teigha.DatabaseServices.MLeader.DoglegLength
Свойство представляет длину полки в данном объекте <c>MLeader</c>.
Returns: Возвращает длину полки. Тип <c>double</c>.

Teigha.DatabaseServices.MLeader.EnableAnnotationScale
Свойство позволяет проверить, включено ли масштабирование аннотаций для данной мультивыноски.
Returns: Возвращает <c>true</c>, если масштабирование аннотаций включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeader.EnableDogleg
Свойство позволяет контролировать отображение полки на выносной линии мультивыноски.
Returns: Возвращает <c>true</c>, если отображение линии полки включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeader.EnableFrameText
Свойство позволяет проверить видимость рамки вокруг текста у данной мультивыноски.
Returns: Возвращает <c>true</c>, если рамка отображается.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeader.EnableLanding
Свойство должно управлять отображением зазора между концом линии полки и содержимым мультивыноски.
В текущей реализации платформы всегда считается равным <c>true</c>.
Returns: Всегда возвращает <c>true</c>, т.е. отображение зазора между линией полки и контентом мультивыноски всегда включено.

Teigha.DatabaseServices.MLeader.ExtendLeaderToText
Свойство позволяет проверить, продлеваются ли горизонтальные линии выносок автоматически до текста.
Returns: Возвращает <c>true</c>, если линии выноски автоматически продлеваются до текста.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.MLeader.LandingGap
Свойство представляет величину зазора между концом линии полки и связанным многострочным текстом данной мультивыноски.
Returns: Возвращает величину зазора между концом линии полки и содержимым мультивыноски. Тип <c>double</c>.

Teigha.DatabaseServices.MLeader.LeaderCount
Свойство представляет количество выносных линий у этой мультивыноски.
В текущей версии не реализовано.
Рекомендуется использовать метод <c>GetLeaderIndexes</c>.
Returns: Возвращает количество выносных линий. Тип <c>int</c>.

Teigha.DatabaseServices.MLeader.LeaderLineColor
Свойство представляет цвет линии выноски у данного объекта <c>MLeader</c>.
Returns: Возвращает цвет линии выноски. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.MLeader.LeaderLineCount
Свойство представляет количество выносных линий у данного объекта <c>MLeader</c>.
В текущей версии не реализовано.
Используйте метод <c>GetLeaderLineIndexes</c>.
Returns: Возвращает количество выносных линий. Тип <c>int</c>.

Teigha.DatabaseServices.MLeader.LeaderLineType
Свойство представляет тип линий выноски (прямая, сплайн, невидимая).
Returns: Возвращает тип линий выноски из перечисления <c>DatabaseServices.LeaderType</c>.

Teigha.DatabaseServices.MLeader.LeaderLineTypeId
Свойство представляет идентификатор <c>ObjectId</c> типа линии, используемого для отрисовки выносных линий данного объекта <c>MLeader</c>.
Returns: Возвращает идентификатор типа линии. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeader.LeaderLineWeight
Свойство представляет толщину (вес) линий, которая используется данным объектом <c>MLeader</c>.
Returns: Возвращает толщину (вес) линий из перечисления <c>DatabaseServices.LineWeight</c>.

Teigha.DatabaseServices.MLeader.MLeaderStyle
Свойство представляет идентификатор <c>ObjectId</c> используемого стиля мультивыноски.
Returns: Возвращает идентификатор стиля мультивыноски. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeader.MText
Свойство представляет многострочный текст, связанный с данной мультивыноской.
Returns: Возвращает объект многострочного текста. Тип <c>DatabaseServices.MText</c>.

Teigha.DatabaseServices.MLeader.Normal
Свойство представляет вектор нормали плоскости, в которой располагается данная мультивыноска.
Returns: Возвращает вектор нормали плоскости. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.MLeader.TextAlignmentType
Свойство представляет тип выравнивания многострочного текста данного объекта <c>MLeader</c>.
Returns: Возвращает тип выравнивания многострочного текста. Значение из перечисления <c>DatabaseServices.TextAlignmentType</c>.

Teigha.DatabaseServices.MLeader.TextAngleType
Свойство представляет выбор угла для размещения многострочного текста относительно последнего сегмента линии выноски.
Returns: Возвращает выбор угла для размещения текста.
Значение из перечисления <c>DatabaseServices.TextAngleType</c>.

Teigha.DatabaseServices.MLeader.TextAttachmentDirection
Свойство представляет направление полки линий выноски данного объекта <c>MLeader</c>.
Returns: Возвращает ориентацию полки выносной линии. Значение из перечисления <c>DatabaseServices.TextAttachmentDirection</c>.

Teigha.DatabaseServices.MLeader.TextAttachmentType
Свойство представляет вариант расположения точки прикрепления выносной линии к многострочному тексту.
Returns: Возвращает вариант расположения точки прикрепления. Перечисление <c>DatabaseServices.TextAttachmentType</c>.

Teigha.DatabaseServices.MLeader.TextColor
Свойство представляет цвет многострочного текста данного объекта <c>MLeader</c>.
Returns: Возвращает цвет многострочного текста. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.MLeader.TextHeight
Свойство представляет текущую высоту многострочного текста.
Returns: Возвращает высоту текста. Тип <c>double</c>.

Teigha.DatabaseServices.MLeader.TextLocation
Свойство представляет точку привязки многострочного текста данного объекта <c>MLeader</c>.
Returns: Возвращает точку привязки многострочного текста.  Тип <c>Point3d</c>.

Teigha.DatabaseServices.MLeader.TextStyleId
Свойство представляет идентификатор <c>ObjectId</c> текстового стиля, который применяется к многострочному тексту данной мультивыноски.
Returns: Возвращает идентификатор текстового стиля. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.MLeader.ToleranceLocation
Свойство представляет точку привязки содержимого допуска данной мультивыноски.
Returns: Возвращает точку привязки допуска. Тип <c>Point3d</c>.