Teigha.Geometry.ExternalSurface
Класс <c>ExternalSurface</c> представляет неограниченные поверхности, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.

Teigha.Geometry.ExternalSurface.#ctor
Конструктор по умолчанию класса <c>ExternalSurface</c>.

Teigha.Geometry.ExternalSurface.#ctor(IntPtr,Geometry.ExternalEntityKind)
Конструктор класса <c>ExternalSurface</c>.
Создает объект на основе указателя на определение внешней поверхности и сведений о системе, в которой было создано ее определение.
surfaceDefinition: Входное определение внешней поверхности. Тип <c>IntPtr</c>.
surfaceKind: Информация о системе, в которой было создано определение внешней поверхности. Перечисление <c>ExternalEntityKind</c>.

Teigha.Geometry.ExternalSurface.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект.
Тип <c>ExternalSurface</c>.

Teigha.Geometry.ExternalSurface.Set(IntPtr,Teigha.Geometry.ExternalEntityKind)
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
surfaceDef: Указатель на определение внешней поверхности. Тип <c>IntPtr</c>.
surfaceKind: Информация о системе, в которой было создано определение внешней поверхности. Перечисление <c>ExternalEntityKind</c>.

Teigha.Geometry.ExternalSurface.SetToOwnSurface
Метод делает этот объект владельцем данных своего определения.

Teigha.Geometry.ExternalSurface.ExternalSurfaceDefiniton
Свойство <c>ExternalSurfaceDefiniton</c> представляет определение внешней поверхности, связанной с данным объектом.
Returns: Возвращает определение внешней поверхности, связанной с данным объектом.
Тип <c>IntPtr</c>.

Teigha.Geometry.ExternalSurface.ExternalSurfaceKind
Свойство <c>ExternalSurfaceKind</c> представляет информацию о системе, в которой было создано определение внешней поверхности.
Returns: Возвращает информацию о системе, в которой было создано определение внешней поверхности.
Перечисление <c>ExternalEntityKind</c>.

Teigha.Geometry.ExternalSurface.IsCone
Свойство <c>IsCone</c> позволяет проверить, является ли данная внешняя поверхность конусом.
Returns: Возвращает <c>true</c>, если данная внешняя поверхность является конусом.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalSurface.IsCylinder
Свойство <c>IsCylinder</c> позволяет проверить, является ли данная внешняя поверхность цилиндром.
Returns: Возвращает <c>true</c>, если данная внешняя поверхность является цилиндром.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalSurface.IsDefined
Свойство <c>IsDefined</c> позволяет проверить, является ли данный объект определенным.
Returns: Возвращает <c>true</c>, если данный объект имеет определение поверхности.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalSurface.IsEllipCone
Свойство <c>IsEllipCone</c> позволяет проверить, является ли данная внешняя поверхность эллиптическим конусом.
Returns: Возвращает <c>true</c>, если данная внешняя поверхность является эллиптическим конусом.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalSurface.IsEllipCylinder
Свойство <c>IsEllipCylinder</c> позволяет проверить, является ли данная внешняя поверхность эллиптическим цилиндром.
Returns: Возвращает <c>true</c>, если данная внешняя поверхность является эллиптическим цилиндром.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalSurface.IsNativeSurface
Свойство <c>IsNativeSurface</c> позволяет проверить, поддерживает ли геометрическая библиотека платформы нативное представление данной внешней поверхности.
Returns: Возвращает <c>true</c>, если геометрическая библиотека платформы поддерживает нативное представление данной внешней поверхности.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalSurface.IsNurbSurface
Свойство <c>IsNurbSurface</c> позволяет проверить, может ли данный экземпляр внешней поверхности быть представлен определением, которое является нативным для графической системы платформы.
Returns: Возвращает <c>true</c>, если данный экземпляр внешней поверхности может быть представлен нативным определением в графической системе платформы.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalSurface.IsOwnerOfSurface
Свойство <c>IsOwnerOfCurve</c> позволяет убедиться, что данный объект является владельцем данных своего определения.
Returns: Возвращает <c>true</c>, если данный объект является владельцем данных своего определения.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalSurface.IsPlane
Свойство <c>IsPlane</c> позволяет проверить, является ли данная внешняя поверхность плоскостью.
Returns: Возвращает <c>true</c>, если данная внешняя поверхность является плоскостью.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalSurface.IsSphere
Свойство <c>IsSphere</c> позволяет проверить, является ли данная внешняя поверхность сферой.
Returns: Возвращает <c>true</c>, если данная внешняя поверхность является сферой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalSurface.IsTorus
Свойство <c>IsTorus</c> позволяет проверить, является ли данная внешняя поверхность тором.
Returns: Возвращает <c>true</c>, если данная внешняя поверхность является тором.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalSurface.nativeSurface
Свойство <c>nativeSurface</c> обеспечивает доступ к нативному представлению данной внешней поверхности в графической системе платформы.
Returns: Возвращает нативное представление данной внешней поверхности в графической системе платформы.
Тип <c>Surface</c>.