Teigha.LayerManager.LayerFilter
Класс <c>LayerFilter</c> представляет в базе данных объекты фильтров слоев.

Teigha.LayerManager.LayerFilter.#ctor
Конструктор по умолчанию класса <c>LayerFilter</c>.

Teigha.LayerManager.LayerFilter.CompareTo(Teigha.LayerManager.LayerFilter)
Метод проверяет эквивалентность двух объектов <c>LayerFilter</c>.
otherFilter: Входной объект, который сравнивается с данным.  Тип <c>LayerFilter</c>.
Returns: Возвращает <c>true</c>, если два объекта эквивалентны.
В противном случае возвращает <c>false</c>.

Teigha.LayerManager.LayerFilter.Filter(Teigha.DatabaseServices.LayerTableRecord)
Метод позволяет проверить, что указанная запись <c>LayerTableRecord</c> будет видимой в случае применения данного фильтра.
layer: Входной слой.  Тип <c>LayerTableRecord</c>.
Returns: Возвращает <c>true</c>, если слой <c>layer</c> будет видимым.
В противном случае возвращает <c>false</c>.

Teigha.LayerManager.LayerFilter.GenerateNested
Метод предназначен для генерации вложенного фильтра.

Teigha.LayerManager.LayerFilter.GetFilterExpressionTree
Метод позволяет получить дерево выражений только для чтения, представляющее данный фильтр.
Returns: Возвращает массив логических выражений, связанных операторами <c>AND</c>.
Тип <c>AndExpression[]</c>.

Teigha.LayerManager.LayerFilter.AllowDelete
Свойство <c>AllowDelete</c> позволяет проверить, возможно ли удаление данного фильтра.
Returns: Возвращает <c>true</c>, если фильтр можно удалить.
В противном случае возвращает <c>false</c>.

Teigha.LayerManager.LayerFilter.AllowNested
Свойство <c>AllowNested</c> позволяет проверить, допускает ли данный фильтр вложенные фильтры.
Returns: Возвращает <c>true</c>, если вложенные фильтры допустимы.
В противном случае возвращает <c>false</c>.

Teigha.LayerManager.LayerFilter.AllowRename
Свойство <c>AllowRename</c> позволяет проверить, разрешено ли переименование данного фильтра.
Returns: Возвращает <c>true</c>, если переименование фильтра разрешено.
В противном случае возвращает <c>false</c>.

Teigha.LayerManager.LayerFilter.DynamicallyGenerated
Свойство <c>DynamicallyGenerated</c> позволяет проверить, генерируется ли данный фильтр динамически своим родителем.
Returns: Возвращает <c>true</c>, если фильтр является динамически генерируемым.
В противном случае возвращает <c>false</c>.

Teigha.LayerManager.LayerFilter.FilterExpression
Свойство <c>FilterExpression</c> представляет выражение фильтра в форме Бэкуса — Наура.
Returns: Возвращает выражение фильтра в виде БНФ.
Тип <c>String</c>.

Teigha.LayerManager.LayerFilter.IsIdFilter
Свойство <c>IsIdFilter</c> позволяет проверить, фильтрует ли данный фильтр слои только по идентификатору объекта слоя.
Returns: Возвращает <c>true</c>, если фильтр фильтрует слои только по идентификаторам объекта слоя.
В противном случае возвращает <c>false</c>.

Teigha.LayerManager.LayerFilter.IsProxy
Свойство <c>IsProxy</c> позволяет проверить, является ли данный фильтр прокси-фильтром.
Returns: Возвращает <c>true</c>, если данный фильтр является прокси-фильтром.
В противном случае возвращает <c>false</c>.

Teigha.LayerManager.LayerFilter.Name
Свойство <c>Name</c> представляет имя фильтра.
Returns: Возвращает имя фильтра.  Тип <c>String</c>.

Teigha.LayerManager.LayerFilter.NestedFilters
Свойство <c>NestedFilters</c> представляет массив вложенных фильтров данного фильтра.
Returns: Возвращает массив вложенных фильтров.
Тип <c>LayerFilterCollection</c>.

Teigha.LayerManager.LayerFilter.Parent
Свойство <c>Parent</c> представляет родительский фильтр данного фильтра.
Returns: Возвращает родительский фильтр данного фильтра.
Тип <c>LayerFilter</c>.