Teigha.BoundaryRepresentation.EdgeLoopCollection
Класс <c>EdgeLoopCollection</c> представляет коллекцию циклов, соответствующих ребру BREP.

Teigha.BoundaryRepresentation.EdgeLoopCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции.
Returns: Возвращает перечислитель коллекции циклов ребра BREP.
Тип <c>EdgeLoopEnumerator</c>.