Teigha.Geometry.LineSegment3d
Класс <c>LineSegment3d</c> представляет линейные сегменты в трехмерном пространстве.

Teigha.Geometry.LineSegment3d.#ctor
Конструктор по умолчанию класса <c>LineSegment3d</c>.

Teigha.Geometry.LineSegment3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Конструктор класса <c>LineSegment3d</c>. Создает экземпляр класса с указанными параметрами.
Строит линейный сегмент с концами в указанных точках.
point1: Первая входная точка (начальная).  Тип <c>Point3d</c>.
point2: Вторая входная точка (конечная).   Тип <c>Point3d</c>.

Teigha.Geometry.LineSegment3d.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор класса <c>LineSegment3d</c>. Создает экземпляр класса с указанными параметрами.
Создает линейный сегмент с началом в указанной точке, направление и длина которого определяются заданным вектором.
point1: Начальная точка линейного сегмента.     Тип <c>Point3d</c>.
vector: Направляющий вектор линейного сегмента. Тип <c>Vector3d</c>. Определяет как направление, так и конечную точку линейного сегмента. Не может быть нулевой длины.

Teigha.Geometry.LineSegment3d.BaryComb(System.Double)
Метод вычисляет позицию точки на коллинеарной сегменту прямой, которая определяется средневзвешенным значением координат начальной и конечной точек данного сегмента в зависимости от указанного значения весового коэффициента.
blendCoefficient: Коэффициент, определяющий положение средневзвешенной точки.
Returns: Возвращает средневзвешенную точку. Тип <c>Point3d</c>.
Возможны следующие варианты положения этой точки.
<xtable>
<c>blendCoefficient</c>     Возвращаемая позиция
-----------------------     -----------------------------
0                           Начальная точка.
1                           Конечная точка.
0.5                         Середина линейного сегмента.
0 - 1                       Промежуточная точка на этом сегменте.
< 0 или > 1                 Точка лежит вне сегмента, но на коллинеарной ему бесконечной прямой.
</xtable>

Teigha.Geometry.LineSegment3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>LineSegment3d</c>.

Teigha.Geometry.LineSegment3d.GetBisector
Метод вычисляет серединный перпендикуляр для данного линейного сегмента.
Returns: Возвращает бесконечную прямую, которая представляет собой серединный перпендикуляр для данного линейного сегмента.
Тип <c>Plane</c>.

Teigha.Geometry.LineSegment3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод позволяет переопределить начальную и конечную точки данного линейного сегмента.
point1: Новая начальная точка.  Тип <c>Point3d</c>.
point2: Новая конечная  точка.  Тип <c>Point3d</c>.

Teigha.Geometry.LineSegment3d.Set(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод позволяет переопределить начальную точку и вектор данного линейного сегмента.
point: Новая начальная точка.     Тип <c>Point3d</c>.
vector: Новый направляющий вектор. Тип <c>Vector3d</c>. Определяет направление линейного сегмента и его конечную точку.

Teigha.Geometry.LineSegment3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Point3d,System.Double)
Метод переопределяет данный объект таким образом, чтобы линейный сегмент оказался касательным к указанной кривой и проходил через заданную точку.
curve: Входная кривая, касательность к которой требуется обеспечить.   Тип <c>Curve3d</c>.
point: Входная точка, через которую должен проходить линейный сегмент. Тип <c>Point3d</c>.
parameter: Входное значение параметра точки на кривой <c>curve</c>, в которой кривая касается линейного сегмента.  Тип <c>double</c>.

Teigha.Geometry.LineSegment3d.Set(Teigha.Geometry.Curve3d,Teigha.Geometry.Curve3d,System.Double,System.Double)
Метод переопределяет данный линейный сегмент таким образом, чтобы он оказался касательным к обеим указанным кривым.
curve1: Первая входная кривая, касательность к которой требуется обеспечить. Тип <c>Curve3d</c>.
curve2: Вторая входная кривая, касательность к которой требуется обеспечить. Тип <c>Curve3d</c>.
parameter1: Значение параметра точки на кривой <c>curve1</c>, в которой кривая касается линейного сегмента. Тип <c>double</c>.
parameter2: Значение параметра точки на кривой <c>curve2</c>, в которой кривая касается линейного сегмента. Тип <c>double</c>.

Teigha.Geometry.LineSegment3d.EndPoint
Свойство <c>EndPoint</c> представляет конечную точку данного линейного сегмента.
Returns: Возвращает конечную точку линейного сегмента.
Тип <c>Point3d</c>.

Teigha.Geometry.LineSegment3d.Length
Свойство <c>Length</c> представляет длину данного линейного сегмента.
Returns: Возвращает длину линейного сегмента. Тип <c>double</c>.

Teigha.Geometry.LineSegment3d.MidPoint
Свойство <c>MidPoint</c> представляет среднюю точку данного линейного сегмента.
Returns: Возвращает среднюю точку линейного сегмента. Тип <c>Point3d</c>.

Teigha.Geometry.LineSegment3d.StartPoint
Свойство <c>StartPoint</c> представляет начальную точку данного линейного сегмента.
Returns: Возвращает начальную точку линейного сегмента.
Тип <c>Point3d</c>.