Teigha.GraphicsInterface.WorldGeometry
Класс WorldGeometry отвечает за помещение геометрии в графический кэш для последующего отображения.  Объект этого класса является частью каждого объекта WorldDraw, передаваемого в метод WorldDraw() объекта, которому потребовалась генерация графики.

Teigha.GraphicsInterface.WorldGeometry.SetExtents(DatabaseServices.Extents3d)
Метод позволяет задать экстенты - габаритные границы текущего объекта в мировой системе координат.
extents: Массив из двух точек Point3d, которые определяют новый ограничивающий бокс для текущего объекта в мировой системе координат (WCS). Тип DatabaseServices.Extents3d.

Teigha.GraphicsInterface.WorldGeometry.StartAttributesSegment
Метод начинает сегмент атрибутов блока.