Teigha.Geometry.Curve2d
Класс <c>Curve2d</c> является базовым классом для всех двумерных кривых.

Teigha.Geometry.Curve2d.Create(IntPtr,System.Boolean)
Метод создает объект <c>Curve2d</c> на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, из которого создается данный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданную трехмерную кривую.
Тип <c>Curve2d</c>.

Teigha.Geometry.Curve2d.EvaluatePoint(System.Double)
Метод позволяет получить на кривой точку, соответствующую указанному значению параметра.
parameter: Входное значение параметра. Тип <c>double</c>.
Returns: Возвращает точку на кривой, соответствующую заданному значению параметра.
Тип <c>Point2d</c>.

Teigha.Geometry.Curve2d.Explode(Teigha.Geometry.Interval)
Метод позволяет разбить данную кривую на составляющие ее подкривые.
interval: Параметрический интервал, на котором выполняется разбиение на подкривые.
Returns: Возвращает массив подкривых.
Тип <c>Curve2d[]</c>.

Teigha.Geometry.Curve2d.GetArea(System.Double,System.Double)
Метод вычисляет площадь под кривой на указанном параметрическом интервале.
startParameter: Входное значение параметра для начала интервала. Тип <c>double</c>.
endParameter: Входное значение параметра для конца интервала. Должно превышать значение <c>startParameter</c>. Тип <c>double</c>. +
Returns: Возвращает значение площади под кривой на указанном параметрическом интервале.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetArea(System.Double,System.Double,Teigha.Geometry.Tolerance)
Метод вычисляет площадь под кривой с заданной точностью на указанном параметрическом интервале.
startParameter: Входное значение параметра для начала интервала. Тип <c>double</c>.
endParameter: Входное значение параметра для конца интервала. Должно превышать значение <c>startParameter</c>. Тип <c>double</c>.
tolerance: Заданная точность вычисления площади.  Тип <c>Tolerance</c>.
Returns: Возвращает значение площади под кривой на указанном параметрическом интервале.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetBoundBlockOf(Teigha.Geometry.Interval)
Метод позволяет получить двумерную граничную рамку для этой кривой на указанном параметрическом подынтервале.
Граничная рамка ориентирована по осям системы координат.
range: Входной параметрический интервал.
Returns: Возвращает двумерную граничную рамку.
Тип <c>BoundBlock2d</c>.

Teigha.Geometry.Curve2d.GetClosestPointTo(Teigha.Geometry.Point2d)
Метод позволяет получить точку на этой кривой, ближайшую к заданной точке.
point: Входная точка, для которой требуется найти ближайшую точку на кривой.
Returns: Возвращает точку на кривой, которая является ближайшей к заданной точке <c>point</c>.
Тип <c>PointOnCurve2d</c>.

Teigha.Geometry.Curve2d.GetClosestPointTo(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет с заданной точностью получить точку на этой кривой, ближайшую к указанной точке.
point: Входная точка, для которой требуется найти ближайшую точку на кривой.  Тип <c>Point2d</c>.
tolerance: Входная точность вычислений.  Тип <c>Tolerance</c>.
Returns: Возвращает точку на кривой, которая является ближайшей к заданной точке <c>point</c>.
Тип <c>PointOnCurve2d</c>.

Teigha.Geometry.Curve2d.GetClosestPointTo(Teigha.Geometry.Curve2d)
Метод позволяет получить одну точку на данной кривой и другую точку на указанной кривой такие, что расстояние между этими точками является минимальным.
curve: Входная кривая, на которой требуется найти точку, ближайшую к данной кривой.
Returns: Возвращает массив из двух ближайших точек на каждой из кривых. Тип <c>PointOnCurve2d[]</c>.
Точка с индексом 0 принадлежит данной кривой, а точка с индексом 1 принадлежит переданной кривой <c>curve</c>.

Teigha.Geometry.Curve2d.GetClosestPointTo(Teigha.Geometry.Curve2d,Teigha.Geometry.Tolerance)
Метод позволяет с указанной точностью получить одну точку на данной кривой и другую точку на указанной кривой такие, что расстояние между этими точками является минимально возможным.
curve: Входная кривая, на которой требуется найти точку, ближайшую к данной кривой. Тип <c>Curve2d</c>.
tolerance: Входная точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает массив из двух ближайших точек на каждой из кривых. Тип <c>PointOnCurve2d[]</c>.
Точка с индексом 0 принадлежит данной кривой, а точка с индексом 1 принадлежит переданной кривой <c>curve</c>.

Teigha.Geometry.Curve2d.GetDistanceTo(Teigha.Geometry.Point2d)
Метод вычисляет расстояние от указанной точки до ближайшей точки на данной кривой.
point: Входная двумерная точка, до которой вычисляется расстояние.
Returns: Возвращает расстояние от точки <c>point</c> до ближайшей точки на данной кривой.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetDistanceTo(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод вычисляет расстояние от указанной точки до ближайшей точки на данной кривой с предписанной точностью.
point: Входная двумерная точка, до которой вычисляется расстояние. Тип <c>Point2d</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает расстояние от точки <c>point</c> до ближайшей точки на данной кривой.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetDistanceTo(Teigha.Geometry.Curve2d)
Метод вычисляет расстояние между ближайшими точками на этой кривой и указанной кривой.
curve: Входная кривая.  Тип <c>Curve2d</c>.
Returns: Возвращает минимальное расстояние между точками на обеих кривых.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetDistanceTo(Teigha.Geometry.Curve2d,Teigha.Geometry.Tolerance)
Метод вычисляет расстояние между ближайшими точками на этой кривой и указанной кривой с заданной точностью.
curve: Входная кривая.  Тип <c>Curve2d</c>.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает минимальное расстояние между точками на обеих кривых.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetInterval
Метод позволяет получить параметрический интервал данной кривой.
Returns: Возвращает параметрический интервал данной кривой.
Тип <c>Interval</c>.

Teigha.Geometry.Curve2d.GetLength(System.Double,System.Double)
Метод вычисляет длину кривой на заданном параметрическом интервале с точностью по умолчанию.
fromParameter: Значение параметра в начальной точке интервала. Тип <c>double</c>.
toParameter: Значение параметра в конечной  точке интервала. Тип <c>double</c>.
Returns: Возвращает длину кривой на заданном параметрическом интервале.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetLength(System.Double,System.Double,Teigha.Geometry.Tolerance)
Метод вычисляет длину кривой на заданном параметрическом интервале с заданной точностью.
fromParameter: Значение параметра в начальной точке интервала. Тип <c>double</c>.
toParameter: Значение параметра в конечной  точке интервала. Тип <c>double</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает длину кривой на заданном параметрическом интервале.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetNormalPoint(Teigha.Geometry.Point2d)
Метод находит на данной кривой точку, в которой нормаль к кривой пройдет через указанную точку.
point: Произвольная двумерная точка, через которую должна пройти нормаль к кривой. Тип <c>Point2d</c>.
Returns: Возвращает точку на кривой, в которой нормаль к кривой пройдет через входную точку <c>point</c>.
Тип <c>PointOnCurve2d</c>.

Teigha.Geometry.Curve2d.GetNormalPoint(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод с заданной точностью находит на данной кривой точку, в которой нормаль к кривой пройдет через указанную точку.
point: Входная точка, через которую должна пройти нормаль к кривой.  Тип <c>Point2d</c>.
tolerance: Заданная геометрическая точность.  Тип <c>Tolerance</c>.
Returns: Возвращает точку на кривой, в которой нормаль к кривой пройдет через входную точку <c>point</c>.
Тип <c>PointOnCurve2d</c>.

Teigha.Geometry.Curve2d.GetOrthoBoundBlockOf(Teigha.Geometry.Interval)
Метод предоставляет граничную рамку для участка данной кривой, который соответствует заданному параметрическому подынтервалу.
range: Входной параметрический подынтервал.  Тип <c>Interval</c>.
Returns: Возвращает граничную рамку для указанного участка кривой.
Тип <c>BoundBlock2d</c>.

Teigha.Geometry.Curve2d.GetParameterAtLength(System.Double,System.Double,System.Boolean)
Метод находит значение параметра для точки на кривой, длина вдоль кривой до которой от заданной точки равна заданному значению.
datumParameter: Входное значение параметра для точки отсчета длины. Тип <c>double</c>.
length: Входная длина вдоль кривой.       Тип <c>double</c>.
parameterDirection: Направление изменения параметра.  Тип <c>bool</c>.
Returns: Возвращает значение параметра для искомой точки на кривой.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetParameterAtLength(System.Double,System.Double,System.Boolean,Teigha.Geometry.Tolerance)
Метод находит значение параметра для точки на кривой, длина вдоль кривой до которой от заданной точки с указанной точностью равна заданному значению.
datumParameter: Входное значение параметра для точки отсчета длины. Тип <c>double</c>.
length: Входная длина вдоль кривой.         Тип <c>double</c>.
parameterDirection: Направление изменения параметра.    Тип <c>bool</c>.
tolerance: Заданная точность вычисления длины. Тип <c>Tolerance</c>.
Returns: Возвращает значение параметра для искомой точки на кривой.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetParameterOf(Teigha.Geometry.Point2d)
Метод вычисляет значение параметра для заданной точки на кривой.
point: Входная точка на кривой. Тип <c>Point2d</c>.
Returns: Возвращает значение параметра для точки <c>point</c>.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetParameterOf(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод вычисляет с указанной точностью значение параметра для заданной точки на кривой.
point: Входная точка на кривой.      Тип <c>Point2d</c>.
tolerance: Заданная точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает значение параметра для точки <c>point</c>.
Тип <c>double</c>.

Teigha.Geometry.Curve2d.GetReverseParameterCurve
Метод изменяет направление параметра для данной кривой на противоположное.
Returns: Возвращает кривую с инвертированным параметрическим интервалом.
Тип <c>Curve2d</c>.

Teigha.Geometry.Curve2d.GetSamplePoints(System.Double,System.Double,System.Double)
Метод позволяет получить массив точек на кривой на заданном параметрическом подынтервале.
Шаг между любыми двумя последовательными точками ограничен сверху указанным предельным прогибом кривой над соединяющим точки линейным сегментом.
fromParameter: Начало параметрического подынтервала. Тип <c>double</c>.
toParameter: Конец параметрического подынтервала. Тип <c>double</c>.
approxEps: Предельный прогиб кривой между любыми двумя последовательными точками массива. Тип <c>double</c>.
Returns: Возвращает массив точек на кривой.
Тип <c>PointOnCurve2d[]</c>.

Teigha.Geometry.Curve2d.GetSamplePoints(System.Int32)
Метод позволяет получить указанное количество точек на кривой, равномерно распределенных в параметрическом пространстве кривой.
numSample: Заказанное количество точек. Тип <c>int</c>.
Returns: Возвращает массив точек на кривой.
Тип <c>Point2d[]</c>.

Teigha.Geometry.Curve2d.GetSplitCurves(System.Double)
Метод позволяет получить два сегмента этой кривой, делящие данную кривую в точке с указанным значением параметра.
value: Входное значение параметра для точки разделения кривой на два сегмента.
Returns: Возвращает массив из двух кривых, полученных разбиением данной кривой в заданной точке.
Тип <c>Curve2d[]</c>.

Teigha.Geometry.Curve2d.GetTrimmedOffset(System.Double,Teigha.Geometry.OffsetCurveExtensionType)
Метод предоставляет массив кривых, полученных в результате операции смещения данной кривой на заданное расстояние.
distance: Величина смещения. Тип <c>double</c>.
extensionType: Вариант сопряжения смещаемых сегментов кривой. Тип <c>OffsetCurveExtensionType</c>.
Returns: Возвращает массив кривых, полученных в результате операции смещения данной кривой.
Тип <c>Curve2d[]</c>.

Teigha.Geometry.Curve2d.GetTrimmedOffset(System.Double,Teigha.Geometry.OffsetCurveExtensionType,Teigha.Geometry.Tolerance)
Метод предоставляет массив кривых, полученных в результате операции смещения данной кривой на заданное расстояние.
В вычислениях используется заданная точность.
distance: Величина смещения. Тип <c>double</c>.
extensionType: Вариант сопряжения смещаемых сегментов кривой. Тип <c>OffsetCurveExtensionType</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив кривых, полученных в результате операции смещения данной кривой.
Тип <c>Curve2d[]</c>.

Teigha.Geometry.Curve2d.IsClosed
Метод выполняет проверку, замкнута ли данная кривая.
Returns: Возвращает <c>true</c>, если начальная и конечная точки кривой совпадают в пределах точности <c>Tolerance.Global</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsClosed(Teigha.Geometry.Tolerance)
Метод выполняет проверку, замкнута ли данная кривая с учетом заданной точности.
tolerance: Входная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если начальная и конечная точки кривой совпадают с точностью <c>tolerance</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsDegenerate([Out]Entity2d%)
Метод проверяет, является ли данная кривая вырожденной.
Returns: Возвращает <c>true</c>, если вырождение имеет место.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsDegenerate([Out]Entity2d%,Teigha.Geometry.Tolerance)
Метод проверяет, является ли данная кривая вырожденной в пределах заданной геометрической точности.
Returns: Возвращает <c>true</c>, если вырождение имеет место.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsLinear([Out]Line2d%)
Метод проверяет линейность данной кривой.
line: Выходная линия, совпадающая с данной кривой. Тип <c>Line2d</c>. Содержит значимый объект, только если метод возвращает <c>true</c>.
Returns: Возвращает <c>true</c>, если данную кривую можно считать линейной.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsLinear([Out]Line2d%,Teigha.Geometry.Tolerance)
Метод проверяет линейность данной кривой с указанной геометрической точностью.
line: Выходная линия, совпадающая с данной кривой. Тип <c>Line2d</c>. Содержит значимый объект, только если метод возвращает <c>true</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в пределах указанной точности <c>tolerance</c> данную кривую можно считать линейной.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsOn(System.Double)
Метод проверяет, находится ли указанное значение параметра в допустимом параметрическом интервале кривой.
parameter: Входное проверяемое значение параметра. Тип <c>double</c>.
Returns: Возвращает <c>true</c>, если переданное значение аргумента <c>parameter</c> находится в пределах параметрического интервала данной кривой.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsOn(System.Double,Teigha.Geometry.Tolerance)
Метод проверяет, находится ли указанное значение параметра в допустимом параметрическом интервале кривой в пределах заданной точности.
parameter: Входное проверяемое значение параметра.  Тип <c>double</c>.
tolerance: Входная точность.  Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если переданное значение аргумента <c>parameter</c> находится в пределах параметрического интервала данной кривой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsOn(Teigha.Geometry.Point2d)
Метод позволяет проверить, лежит ли указанная точка на данной кривой.
point: Проверяемая точка.  Тип <c>Point2d</c>.
Returns: Возвращает <c>true</c>, если точка <c>point</c> лежит на данной кривой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsOn(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, лежит ли указанная точка на данной кривой в пределах заданной точности.
point: Проверяемая точка. Тип <c>Point2d</c>.
tolerance: Заданная точность проверки. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если точка <c>point</c> лежит на данной кривой в пределах точности <c>tolerance</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsOn(Teigha.Geometry.Point2d,[Out]double%)
Метод позволяет проверить, лежит ли указанная точка на данной кривой, и если это так, определяет соответствующее этой точке значение параметра.
point: Проверяемая точка. Тип <c>Point2d</c>.
value: Выходное значение параметра, соответствующее проверяемой точке. Тип <c>double</c>. Это значение действительно только в том случае, если метод возвращает значение <c>true</c>.
Returns: Возвращает <c>true</c>, если точка <c>point</c> лежит на данной кривой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsOn(Teigha.Geometry.Point2d,[Out]double%,Teigha.Geometry.Tolerance)
Метод позволяет проверить, лежит ли указанная точка на данной кривой в пределах указанной точности, и если это так, определяет соответствующее этой точке значение параметра.
point: Проверяемая точка. Тип <c>Point2d</c>.
value: Выходное значение параметра, соответствующее проверяемой точке. Тип <c>double</c>. Это значение действительно только в том случае, если метод возвращает значение <c>true</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если точка <c>point</c> лежит на данной кривой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.IsPeriodic([Out]double%)
Метод позволяет проверить, является ли данная кривая периодической.
period: Выходной параметр, содержащий период данной кривой. Тип <c>double</c>.  Это значение действительно только в том случае, если метод возвращает значение <c>true</c>.
Returns: Возвращает <c>true</c>, если кривая является периодической.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.SetInterval(Teigha.Geometry.Interval)
Метод позволяет переопределить параметрический интервал данной кривой.
value: Новый параметрический интервал кривой.

Teigha.Geometry.Curve2d.BoundBlock
Свойство <c>BoundBlock</c> представляет ориентированную двумерную граничную рамку для данной кривой.
Стороны такой граничной рамки не обязаны быть параллельными осям системы координат.
Returns: Возвращает двумерную граничную рамку для данной кривой.
Тип <c>BoundBlock2d</c>.

Teigha.Geometry.Curve2d.EndPoint
Свойство <c>EndPoint</c> представляет конечную точку данной кривой.
Returns: Возвращает конечную точку данной кривой.
Тип <c>Point2d</c>.

Teigha.Geometry.Curve2d.HasEndPoint
Свойство <c>HasEndPoint</c> позволяет проверить, существует ли у данной кривой конечная точка.
Returns: Возвращает <c>true</c>, если кривая имеет конечную точку.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.HasStartPoint
Свойство <c>HasStartPoint</c> позволяет проверить, существует ли у данной кривой начальная точка.
Returns: Возвращает <c>true</c>, если у данной кривой начальная точка существует.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve2d.OrthoBoundBlock
Свойство <c>OrthoBoundBlock</c> представляет двумерную граничную рамку для данной кривой.
Граничная рамка ориентирована по осям системы координат.
Returns: Возвращает двумерную граничную рамку для данной кривой.
Тип <c>BoundBlock2d</c>.

Teigha.Geometry.Curve2d.StartPoint
Свойство <c>StartPoint</c> представляет начальную точку данной кривой.
Returns: Возвращает начальную точку кривой.
Тип <c>Point2d</c>.