Teigha.DatabaseServices.Region
Класс <c>Region</c> представляет объекты 2D-области (региона) в базе данных.

Teigha.DatabaseServices.Region.#ctor
Конструктор по умолчанию класса <c>Region</c>.

Teigha.DatabaseServices.Region.BooleanOperation(Teigha.DatabaseServices.BooleanOperationType,Teigha.DatabaseServices.Region)
Метод реализует логические операции между данной и указанной областями.
operation: Тип логической операции из перечисления <c>BooleanOperationType</c>.
otherRegion: Другая область, участвующая вторым аргументом в логической операции. Тип <c>Region</c>.

Teigha.DatabaseServices.Region.CreateFromCurves(Teigha.DatabaseServices.DBObjectCollection)
Метод предназначен для создания новых областей из замкнутых контуров, образованных указанными сегментами кривой.
curveSegments: Массив сегментов кривой. Тип <c>DBObjectCollection</c>.
Returns: Возвращает коллекцию созданных областей. Тип <c>DBObjectCollection</c>.
Notes
Вновь созданные области не являются резидентными объектами базы данных.
Вызывающее приложение может либо добавить их в базу данных, либо их удалить.

Teigha.DatabaseServices.Region.Area
Свойство <c>Area</c> представляет площадь данной области.
Returns: Возвращает площадь данной области. Тип <c>double</c>.

Teigha.DatabaseServices.Region.Body
Свойство <c>Body</c> представляет указатель на текущую геометрию моделлера для данной области.
Returns: Возвращает указатель на текущую геометрию моделлера для области.
Тип <c>IntPtr</c>.

Teigha.DatabaseServices.Region.IsNull
Свойство <c>IsNull</c> позволяет проверить факт отсутствия модели ACIS, связанной с этой областью.
Returns: Возвращает <c>true</c>, если модель ACIS отсутствует.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Region.Normal
Свойство <c>Normal</c> представляет нормаль плоскости, в которой располагается данная область.
Returns: Возвращает вектор нормали плоскости данного объекта.
Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Region.NumChanges
Свойство <c>NumChanges</c> представляет количество изменений в геометрии области с момента ее создания.
Returns: Возвращает количество изменений в геометрии области.
Тип <c>int</c>.

Teigha.DatabaseServices.Region.Perimeter
Свойство <c>Perimeter</c> представляет текущий периметр данной области.
Returns: Возвращает периметр области. Тип <c>double</c>.