Teigha.DatabaseServices.HatchLoop
Этот класс представляет данные для определения контура границы штриховки.

Teigha.DatabaseServices.HatchLoop.#ctor(DatabaseServices.HatchLoopTypes)
Конструктор класса HatchLoop.
loopType: Тип контура штриховки. Перечисление <c>DatabaseServices.HatchLoopTypes</c>.

Teigha.DatabaseServices.HatchLoop.Curves
Свойство возвращает коллекцию кривых, составляющих данный контур штриховки.
Returns: Возвращает коллекцию кривых, составляющих данный контур штриховки. Тип <c>Curve2dCollection</c>.

Teigha.DatabaseServices.HatchLoop.IsPolyline
Свойство позволяет определить, имеет ли этот контур штриховки тип <c>HatchLoopTypes.Polyline</c>.
Returns: Возвращает <c>true</c>, если данный контур штриховки представлен полилинией и, соответственно, имеет тип <c>HatchLoopTypes.Polyline</c>. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.HatchLoop.LoopType
Свойство возвращает тип этого контура штриховки.
Returns: Возвращает тип контура штриховки. Перечисление <c>HatchLoopTypes</c>.

Teigha.DatabaseServices.HatchLoop.Polyline
Свойство возвращает полилинию, которая образует данный контур штриховки.
Returns: Возвращает полилинию в виде коллекции типа <c>BulgeVertexCollection</c>.