Teigha.BoundaryRepresentation.Element2dNodeEnumerator
Класс <c>Element2dNodeEnumerator</c> представляет перечислитель узлов объекта <c>Element2d</c>.

Teigha.BoundaryRepresentation.Element2dNodeEnumerator.Current
Свойство <c>Current</c> представляет текущий элемент данного перечислителя.
Returns: Возвращает текущий элемент перечислителя.
Тип <c>Node</c>.