HostMgd.EditorInput.SelectionAddedEventArgs
Класс, обеспечивающий данными событие SelectionAdded класса
Editor.

HostMgd.EditorInput.SelectionAddedEventArgs.Add(HostMgd.EditorInput.SelectedObject)
Метод добавляет объект в набор выбранных объектов. При этом
происходит проверка на наличие такого объекта в наборе (по
Id).
value: Добавляемый объект

HostMgd.EditorInput.SelectionAddedEventArgs.AddSubEntity(HostMgd.EditorInput.SelectedSubObject)
Добавляет геометрический подобъект к выбранному подобъекту.
value: Добавляемый геометрический подобъект

HostMgd.EditorInput.SelectionAddedEventArgs.AddedObjects
Возвращает набор объектов, добавленных к набору выбранных
объектов.

HostMgd.EditorInput.SelectionAddedEventArgs.Flags
Возвращает признаки, которые обеспечивают информацию о
деталях процесса выбора при его выполнении.

HostMgd.EditorInput.SelectionAddedEventArgs.Highlight(System.Int32,Teigha.DatabaseServices.FullSubentityPath)
Выделяет выбранный объект, базируясь на значении
subSelectionIndex и полном пути к выделяемому геометрическому
подобъекту path.
subSelectionIndex: Индекс подобъекта
path: Путь к выделяемому геометрическому

HostMgd.EditorInput.SelectionAddedEventArgs.Remove(System.Int32)
Удаляет из выделенного набора объект, определенный индексом.
index: Индекс удаляемого объекта

HostMgd.EditorInput.SelectionAddedEventArgs.RemoveSubEntity(System.Int32,System.Int32)
Удаляет геометрический подобъект, определяемый индексом этого
подобъекта и индексом геометрического объекта.
entityIndex: Индекс геометрического объекта
subEntityIndex: Индекс геометрического подобъекта

HostMgd.EditorInput.SelectionAddedEventArgs.Selection
Возвращает набор выбранных в настоящее время объектов.