Teigha.DatabaseServices.HyperLinkCollection
Класс <c>HyperlinkCollection</c> представляет собой коллекцию объектов <c>Hyperlink</c>.

Teigha.DatabaseServices.HyperLinkCollection.Add(Teigha.DatabaseServices.HyperLink)
Метод позволяет добавить в данную коллекцию указанный объект <c>HyperLink</c>.
value: Добавляемая гиперссылка. Тип <c>HyperLink</c>.
Returns: Возвращает текущее количество объектов в коллекции после добавления гиперссылки <c>value</c>.  Тип <c>int</c>.

Teigha.DatabaseServices.HyperLinkCollection.Clear
Метод предназначен для полной очистки данной коллекции.

Teigha.DatabaseServices.HyperLinkCollection.Contains(Teigha.DatabaseServices.HyperLink)
Метод позволяет проверить, содержит ли эта коллекция гиперссылку, соответствующую указанному объекту <c>HyperLink</c>.
value: Проверяемая гиперссылка.  Тип <c>HyperLink</c>.
Returns: Возвращает <c>true</c>, если в коллекции уже содержится указанный объект <c>value</c>.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.HyperLinkCollection.CopyTo(array&lt;HyperLink&gt;,System.Int32)
Метод предназначен для копирования этой коллекции в указанный массив по указанному индексу.
arr: Массив, в который копируется данная коллекция. Тип <c>HyperLink[]</c>.
index: Индекс массива, начиная с которого в массиве сохраняются элементы коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.HyperLinkCollection.GetEnumerator
Метод позволяет получить перечислитель для данной коллекции.
Returns: Возвращает перечислитель коллекции. Тип <c>IEnumerator</c>.

Teigha.DatabaseServices.HyperLinkCollection.IndexOf(Teigha.DatabaseServices.HyperLink)
Метод позволяет получить индекс объекта <c>HyperLink</c> в этой коллекции, соответствующий указанной гиперссылке.
value: Гиперссылка, для которой вычисляется индекс в данной коллекции. Тип <c>HyperLink</c>.
Returns: Возвращает индекс указанного объекта <c>HyperLink</c> в этой коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.HyperLinkCollection.Insert(System.Int32,Teigha.DatabaseServices.HyperLink)
Метод позволяет вставить указанную гиперссылку <c>HyperLink</c> в эту коллекцию по указанному индексу.
index: Индекс в коллекции, по которому выполняется вставка нового элемента. Тип <c>int</c>.
value: Вставляемый элемент. Тип <c>HyperLink</c>.

Teigha.DatabaseServices.HyperLinkCollection.Remove(Teigha.DatabaseServices.HyperLink)
Метод предназначен для удаления из коллекции гиперссылки, соответствующей указанному объекту <c>HyperLink</c>.
value: Удаляемая из коллекции гиперссылка. Тип <c>HyperLink</c>.

Teigha.DatabaseServices.HyperLinkCollection.RemoveAt(System.Int32)
Метод позволяет удалить из коллекции объект <c>HyperLink</c> с указанным индексом.
index: Индекс удаляемого из коллекции объекта. Тип <c>int</c>.

Teigha.DatabaseServices.HyperLinkCollection.Count
Свойство возвращает текущее количество элементов в данной коллекции.
Returns: Возвращает количество элементов в коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.HyperLinkCollection.Item
Свойство предоставляет доступ к элементу коллекции с указанным индексом.
index: Индекс элемента коллекции. Тип <c>int</c>.
Returns: Возвращает элемент коллекции с индексом <c>index</c>.  Тип <c>HyperLink</c>.