Teigha.DatabaseServices.ObjectContextCollection
Класс <c>ObjectContextCollection</c> представляет интерфейс к определяемой приложением коллекции объектов <c>ObjectContext</c>.

Teigha.DatabaseServices.ObjectContextCollection.AddContext(Teigha.DatabaseServices.ObjectContext)
Метод добавляет в коллекцию копию указанного контекста.
Добавленный контекст получает новый уникальный идентификатор.
ctx: Контекст, копия которого добавляется в коллекцию, получив новый уникальный идентификатор.

Teigha.DatabaseServices.ObjectContextCollection.GetContext(String)
Метод предназначен для получения копии именованного контекста из коллекции.
contextName: Имя контекста. Тип <c>String</c>.
Returns: Возвращает копию именованного контекста. Тип <c>ObjectContext</c>.
Если контекст с указанным именем в коллекции отсутствует, возвращается <c>nullptr</c>.

Teigha.DatabaseServices.ObjectContextCollection.GetEnumerator
Метод предоставляет перечислитель <c>ObjectContextCollectionEnumerator</c>  для данной коллекции.
Returns: Возвращает перечислитель данной коллекции.  Тип <c>ObjectContextCollectionEnumerator</c>.

Teigha.DatabaseServices.ObjectContextCollection.HasContext(String)
Метод позволяет проверить, существует ли в коллекции контекст с указанным именем.
contextName: Имя контекста. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если контекст с именем <c>contextName</c> присутствует в коллекции.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.ObjectContextCollection.IEnumerable_GetEnumerator
Метод предоставляет перечислитель для данного объекта.
Returns: Возвращает перечислитель для данной коллекции. Тип <c>System.Collections.IEnumerator</c>.

Teigha.DatabaseServices.ObjectContextCollection.RemoveContext(String)
Метод предназначен для удаления контекста из коллекции.
contextName: Имя удаляемого контекста. Тип <c>String</c>.

Teigha.DatabaseServices.ObjectContextCollection.CurrentContext
Свойство представляет текущий контекст в коллекции контекстов.
Returns: Возвращает текущий контекст. Тип <c>ObjectContext</c>.

Teigha.DatabaseServices.ObjectContextCollection.Name
Свойство представляет имя данной коллекции контекстов.
Returns: Возвращает имя коллекции. Тип <c>String</c>.