Teigha.DatabaseServices.DwgFiler
Этот класс является абстрактным базовым классом для классов, которые используются для файловых операций ввода-вывода в формате DWG.

Teigha.DatabaseServices.DwgFiler.ReadAddress
Метод предназначен для получения значения адреса памяти текущего элемента данного объекта Filer.
Returns: Возвращает адреса памяти текущего элемента объекта Filer. Тип IntPtr.

Teigha.DatabaseServices.DwgFiler.ReadBinaryChunk
Метод позволяет получить значение BinaryData текущего элемента этого объекта Filer.
Returns: Возвращает текущий элемент объекта Filer в виде байтового массива. Тип byte[].

Teigha.DatabaseServices.DwgFiler.ReadBoolean
Метод предназначен для получения логического значения из текущего элемента этого объекта Filer.
Returns: Возвращает логическое значение из текущего элемента этого объекта Filer.

Teigha.DatabaseServices.DwgFiler.ReadByte
Метод возвращает 8-разрядное целое число без знака (байт) из текущего элемента этого объекта Filer.
Returns: Возвращает значение типа UInt8 из текущего элемента этого объекта Filer.

Teigha.DatabaseServices.DwgFiler.ReadBytes(array&lt;unsigned char&gt;)
Метод предназначен для получения указанного количества байтов из данного объекта Filer.
value: Массив байтов. Его длина определяет количество считываемых байтов. Тип <c>long long[]</c>.

Teigha.DatabaseServices.DwgFiler.ReadDouble
Метод предназначен для получения значения типа <c>double</c> из текущего элемента данного объекта Filer.
Returns: Возвращает значения типа <c>double</c> из текущего элемента данного объекта Filer.

Teigha.DatabaseServices.DwgFiler.ReadHandle
Метод предназначен для получения дескриптора объекта Handle из текущего элемента этого объекта Filer.
Returns: Возвращает дескриптора объекта. Тип Handle.

Teigha.DatabaseServices.DwgFiler.ReadHardOwnershipId
Метод предназначен для получения идентификатора жесткой ссылки владения объектом HardOwnershipId из текущего элемента данного объекта Filer.
Returns: Возвращает идентификатор жесткой ссылки владения объектом HardOwnershipId. Тип ObjectId.

Teigha.DatabaseServices.DwgFiler.ReadHardPointerId
Метод предназначен для получения идентификатора жесткого указателя (HardPointerId) из текущего элемента данного объекта Filer.
Returns: Возвращает идентификатор жесткого указателя (HardPointerId). Тип ObjectId.

Teigha.DatabaseServices.DwgFiler.ReadInt16
Метод предназначен для получения значения Int16 из текущего элемента данного объекта Filer.
Returns: Возвращает значение из текущего элемента данного объекта Filer. Тип <c>short</c>.

Teigha.DatabaseServices.DwgFiler.ReadInt32
Метод предназначен для получения значения Int32 из текущего элемента данного объекта Filer.
Returns: Возвращает значение из текущего элемента данного объекта Filer. Тип <c>int</c>.

Teigha.DatabaseServices.DwgFiler.ReadInt64
Метод предназначен для получения значения Int64 из текущего элемента данного объекта Filer.
Returns: Возвращает значение текущего элемента данного объекта Filer. Тип <c>long</c>.

Teigha.DatabaseServices.DwgFiler.ReadPoint2d
Метод предназначен для получения точки Point2d из текущего элемента данного объекта Filer.
Returns: Возвращает двумерную точку. Тип <c>Point2d</c>.

Teigha.DatabaseServices.DwgFiler.ReadPoint3d
Метод предназначен для получения точки Point3d из текущего элемента данного объекта Filer.
Returns: Возвращает трехмерную точку. Тип <c>Point3d</c>.

Teigha.DatabaseServices.DwgFiler.ReadScale3d
Метод предназначен для получения масштаба из текущего элемента данного объекта Filer.
Returns: Возвращает масштаб. Тип <c>Scale3d</c>.

Teigha.DatabaseServices.DwgFiler.ReadSoftOwnershipId
Метод предназначен для получения идентификатора мягкой ссылки владения объектом (SoftOwnershipId) из текущего элемента данного объекта Filer.
Returns: Возвращает идентификатор мягкой ссылки владения объектом. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.DwgFiler.ReadSoftPointerId
Метод предназначен для получения идентификатора мягкой ссылки на указатель (SoftPointerId) из текущего элемента данного объекта Filer.
Returns: Возвращает идентификатора мягкой ссылки на указатель (SoftPointerId). Тип <c>ObjectId</c>.

Teigha.DatabaseServices.DwgFiler.ReadString
Метод предназначен для получения текстовой строки из текущего элемента данного объекта Filer.
Returns: Возвращает строку. Тип <c>String</c>.

Teigha.DatabaseServices.DwgFiler.ReadUInt16
Метод предназначен для получения значения UInt16 из текущего элемента данного объекта Filer.
Returns: Возвращает значение 16-разрядного целого числа без знака. Тип <c>ushort</c>.

Teigha.DatabaseServices.DwgFiler.ReadUInt32
Метод предназначен для получения 32-разрядного целого числа без знака (UInt32) из текущего элемента данного объекта Filer.
Returns: Возвращает значение 32-разрядного целого числа без знака. Тип <c>uint</c>.

Teigha.DatabaseServices.DwgFiler.ReadUInt64
Метод предназначен для получения 64-разрядного целого числа без знака (UInt64) из текущего элемента данного объекта Filer.
Returns: Возвращает значение 64-разрядного целого числа без знака. Тип <c>ulong</c>.

Teigha.DatabaseServices.DwgFiler.ReadVector2d
Метод предназначен для получения двумерного вектора из текущего элемента данного объекта Filer.
Returns: Возвращает двумерный вектор. Тип <c>Vector2d</c>.

Teigha.DatabaseServices.DwgFiler.ReadVector3d
Метод предназначен для получения трехмерного вектора из текущего элемента данного объекта Filer.
Returns: Возвращает трехмерный вектор. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.DwgFiler.ResetFilerStatus
Метод предназначен для сброса текущего статуса данного объекта Filer.

Teigha.DatabaseServices.DwgFiler.Seek(long long,System.Int32)
Метод предназначен для перемещения указателя ввода-вывода в указанное место в этом объекте Filer.
offset: Смещение в количестве байтов.  Тип <c>long long</c>.
method: Тип поиска. Тип <c>int</c>

Teigha.DatabaseServices.DwgFiler.WriteAddress(IntPtr)
Метод предназначен для записи указанного адреса памяти в данный объект Filer.
value: Адрес, который следует записать в Filer. Тип <c>IntPtr</c>.

Teigha.DatabaseServices.DwgFiler.WriteBinaryChunk(array&lt;unsigned char&gt;)
Метод предназначен для записи заданного двоичного фрагмента в этот объект Filer.
chunk: Двоичный фрагмент, который требуется записать в Filer.  Тип <c>unsigned char[]</c>.

Teigha.DatabaseServices.DwgFiler.WriteBoolean(System.Boolean)
Метод предназначен для записи заданного логического значения в этот объект Filer.
value: Записываемое в Filer значение. Тип <c>bool</c>.

Teigha.DatabaseServices.DwgFiler.WriteByte(Byte)
Метод предназначен для записи заданного байта в этот объект Filer.
value: Записываемое в Filer значение. Тип <c>byte</c>.

Teigha.DatabaseServices.DwgFiler.WriteBytes(array&lt;unsigned char&gt;)
Метод предназначен для записи заданного байтового массива в этот объект Filer.
value: Записываемый в Filer массив. Тип <c>unsigned char[]</c>.

Teigha.DatabaseServices.DwgFiler.WriteDouble(System.Double)
Метод предназначен для записи заданного значения типа <c>double</c> в этот объект Filer.
value: Записываемое в Filer значение. Тип <c>double</c>.

Teigha.DatabaseServices.DwgFiler.WriteHandle(Teigha.DatabaseServices.Handle)
Метод предназначен для записи заданного дескриптора объекта в этот объект Filer.
handle: Записываемый в Filer дескриптор объекта. Тип <c>Handle</c>.

Teigha.DatabaseServices.DwgFiler.WriteHardOwnershipId(Teigha.DatabaseServices.ObjectId)
Метод предназначен для записи заданного идентификатора жесткой ссылки владения объектом (HardOwnershipId) в этот объект Filer.
value: Записываемый в Filer идентификатор жесткой ссылки владения объектом. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.DwgFiler.WriteHardPointerId(Teigha.DatabaseServices.ObjectId)
Метод предназначен для записи заданного идентификатора жесткой ссылки на указатель (HardPointerId) в этот объект Filer.
value: Записываемый в Filer идентификатор жесткой ссылки на указатель. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.DwgFiler.WriteInt16(short)
Метод предназначен для записи заданного 16-разрядного целого числа со знаком в этот объект Filer.
value: Записываемое в Filer значение. Тип <c>short</c>.

Teigha.DatabaseServices.DwgFiler.WriteInt32(System.Int32)
Метод предназначен для записи заданного 32-разрядного целого числа со знаком (тип <c>int</c>) в этот объект Filer.
value: Записываемое в Filer значение. Тип <c>int</c>.

Teigha.DatabaseServices.DwgFiler.WriteInt64(long long )
Метод предназначен для записи заданного 64-разрядного целого числа со знаком (тип <c>long long</c>) в этот объект Filer.
value: Записываемое в Filer значение. Тип <c>long long</c>.

Teigha.DatabaseServices.DwgFiler.WritePoint2d(Teigha.Geometry.Point2d)
Метод предназначен для записи заданной двумерной точки Point2d в этот объект Filer.
value: Записываемое в Filer значение. Тип <c>Point2d</c>.

Teigha.DatabaseServices.DwgFiler.WritePoint3d(Teigha.Geometry.Point3d)
Метод предназначен для записи указанной трехмерной точки Point3d в этот объект Filer.
value: Записываемое в Filer значение. Тип <c>Point3d</c>.

Teigha.DatabaseServices.DwgFiler.WriteScale3d(Teigha.Geometry.Scale3d)
Метод предназначен для записи указанного объекта <c>Scale3d</c> в этот объект Filer.
value: Записываемое в Filer значение. Тип <c>Scale3d</c>.

Teigha.DatabaseServices.DwgFiler.WriteSoftOwnershipId(Teigha.DatabaseServices.ObjectId)
Метод предназначен для записи в этот Filer указанного идентификатора мягкой ссылки владения объектом <c>SoftOwnershipId</c>.
value: Записываемое в Filer значение. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.DwgFiler.WriteSoftPointerId(Teigha.DatabaseServices.ObjectId)
Метод предназначен для записи в этот Filer указанного идентификатора мягкой ссылки на указатель <c>SoftPointerId</c>.
value: Записываемое в Filer значение. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.DwgFiler.WriteString(String)
Метод предназначен для записи в этот Filer указанной строки.
value: Записываемое в Filer значение. Тип <c>String</c>.

Teigha.DatabaseServices.DwgFiler.WriteUInt16(unsigned short)
Метод записывает в этот Filer указанное 16-разрядное целое число без знака (тип <c>unsigned short</c>).
value: Записываемое в Filer значение. Тип <c>unsigned short</c>.

Teigha.DatabaseServices.DwgFiler.WriteUInt32(unsigned int)
Метод записывает в этот Filer указанное 32-разрядное целое число без знака (тип <c>unsigned int</c>).
value: Записываемое в Filer значение. Тип <c>unsigned int</c>.

Teigha.DatabaseServices.DwgFiler.WriteUInt64(unsigned long long)
Метод записывает в этот Filer указанное 64-разрядное целое число без знака (тип <c>unsigned long long</c>).
value: Записываемое в Filer значение. Тип <c>unsigned long long</c>.

Teigha.DatabaseServices.DwgFiler.WriteVector2d(Teigha.Geometry.Vector2d)
Метод записывает в этот Filer указанный объект <c>Vector2d</c>.
value: Записываемое в Filer значение. Тип <c>Vector2d</c>.

Teigha.DatabaseServices.DwgFiler.WriteVector3d(Teigha.Geometry.Vector3d)
Метод записывает в этот Filer указанный объект <c>Vector3d</c>.
value: Записываемое в Filer значение. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.DwgFiler.FilerStatus
Свойство представляет текущее состояние данного объекта Filer.
Returns: Возвращает статус объекта как значение из перечисления Teigha.Runtime.ErrorStatus.

Teigha.DatabaseServices.DwgFiler.Database
Свойство возвращает объект Database, представляющий базу данных, с которой связан данный объект Filer.
Returns: Возвращает базу данных. Тип DatabaseServices.Database.

Teigha.DatabaseServices.DwgFiler.FilerType
Свойство возвращает тип этого файлера.
Returns: Возвращает тип этого файлера как значение из перечисления Teigha.DatabaseServices.FilerType.

Teigha.DatabaseServices.DwgFiler.DwgVersion
Свойство возвращает версию DWG файла, с которым связан данный файлер, в виде объекта FullDwgVersion.
Returns: Возвращает версию DWG файла как объект FullDwgVersion.

Teigha.DatabaseServices.DwgFiler.Position
Свойство предоставляет доступ к текущей позиции указателя ввода-вывода этого объекта Filer.
Returns: Возвращает текущую позицию указателя ввода-вывода данного файлера. Тип <c>long</c>.