HostMgd.EditorInput.RolloverEventArgs.Highlighted
Устанавливает или возвращает выделенные пути (к
геометрическим подобъектам).

HostMgd.EditorInput.RolloverEventArgs.Picked
Устанавливает или возвращает пути (к геометрическим
подобъектам).