Teigha.DatabaseServices.OpenCloseTransaction
Класс <c>OpenCloseTransaction</c> предназначен для использования в определенных сценариях вместо класса <c>Transaction</c>.

Teigha.DatabaseServices.OpenCloseTransaction.#ctor
Конструктор по умолчанию класса <c>OpenCloseTransaction</c>.

Teigha.DatabaseServices.OpenCloseTransaction.Abort
Метод позволяет прервать текущую открытую транзакцию. Инициирует откат всех изменений объектов с момента начала транзакции.

Teigha.DatabaseServices.OpenCloseTransaction.Commit
Метод фиксирует изменения в объектах, открытых в рамках транзакции <c>OpenCloseTransaction</c>, а затем закрывает эти объекты.

Teigha.DatabaseServices.OpenCloseTransaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode)
Метод обеспечивает доступ к объекту с указанным идентификатором в указанном режиме доступа.
id: Идентификатор объекта, к которому требуется получить доступ. Тип <c>ObjectId</c>.
mode: Требуемый режим доступа к объекту.  Перечисление <c>OpenMode</c>.
Returns: Возвращает дескриптор полученного объекта.
Тип <c>DBObject</c>.

Teigha.DatabaseServices.OpenCloseTransaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean)
Метод обеспечивает доступ к объекту с указанным идентификатором в указанном режиме доступа.
Дополнительный аргумент позволяет управлять опцией доступа к ранее удаленным объектам.
id: Идентификатор объекта, к которому требуется получить доступ. Тип <c>ObjectId</c>.
mode: Требуемый режим доступа к объекту.  Перечисление <c>OpenMode</c>.
openErased: Данный флаг определяет, следует ли получать доступ к объекту, если он был удалён. Тип <c>bool</c>.
Returns: Возвращает дескриптор полученного объекта.
Тип <c>DBObject</c>.

Teigha.DatabaseServices.OpenCloseTransaction.GetObject(Teigha.DatabaseServices.ObjectId,Teigha.DatabaseServices.OpenMode,System.Boolean,System.Boolean)
Метод обеспечивает доступ к объекту с указанным идентификатором в указанном режиме доступа.
Дополнительные аргументы позволяют управлять опцией доступа к ранее удаленным объектам, а также к объектам на заблокированных слоях.
id: Идентификатор объекта, к которому требуется получить доступ. Тип <c>ObjectId</c>.
mode: Требуемый режим доступа к объекту.  Перечисление <c>OpenMode</c>.
openErased: Этот флаг определяет, следует ли получать доступ к объекту, если он был удалён. Тип <c>bool</c>.
forceOpenOnLockedLayer: Этот флаг определяет, следует ли открывать заблокированные слои. Тип <c>bool</c>.
Returns: Возвращает дескриптор полученного объекта.
Тип <c>DBObject</c>.

Teigha.DatabaseServices.OpenCloseTransaction.TransactionManager
Свойство представляет менеджер транзакций, связанный с сданным объектом.
Returns: Возвращает менеджер транзакций. Тип <c>TransactionManager</c>.