Teigha.DatabaseServices.Filters.LayerFilter
Класс реализует объекты <c>LayerFilter</c> в экземпляре базы данных <c>Database</c>.

Teigha.DatabaseServices.Filters.LayerFilter.#ctor
Конструктор класса LayerFilter по умолчанию.

Teigha.DatabaseServices.Filters.LayerFilter.Add(String)
Метод добавляет к данному фильтру слой с указанным именем.
layer: Имя добавляемого слоя.  Тип <c>String</c>.

Teigha.DatabaseServices.Filters.LayerFilter.GetAt(System.Int32,String%)
Метод позволяет получить имя слоя по индексу слоя в данном объекте <c>LayerFilter</c>.
index: Индекс искомого слоя. Тип <c>int</c>.
name: Имя слоя, который в данном фильтре имеет индекс <c>index</c>.  Тип <c>String</c>.

Teigha.DatabaseServices.Filters.LayerFilter.Remove(String)
Метод предназначен для удаления указанного слоя из данного объекта LayerFilter.
layer: Имя удаляемого из фильтра слоя.  Тип <c>String</c>.

Teigha.DatabaseServices.Filters.LayerFilter.IsValid
Свойство <c>IsValid</c> позволяет проверить, все ли добавленные в данный фильтр слои существуют в базе данных, с которой связан данный фильтр.
Returns: Возвращает <c>true</c>, только если все зарегистрированные в фильтре слои присутствуют в базе данных чертежа.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Filters.LayerFilter.LayerCount
Свойство <c>LayerCount</c> возвращает количество слоев, зарегистрированных в данном фильтре.
Returns: Возвращает количество слоев в данном фильтре. Тип <c>int</c>.