Teigha.BoundaryRepresentation.Mesh2d
Класс <c>Mesh2d</c> представляет интерфейсный класс для 2D-сетей.

Teigha.BoundaryRepresentation.Mesh2d.#ctor(Teigha.BoundaryRepresentation.Mesh2dFilter)
Конструктор класса <c>Mesh2d</c>. Создает экземпляр класса с указанными параметрами.
meshFilter: Входной фильтр.  Тип <c>Mesh2dFilter</c>.

Teigha.BoundaryRepresentation.Mesh2d.GetElement2dsStartingFrom(Teigha.BoundaryRepresentation.Element2d)
Метод позволяет получить коллекцию элементов сети <c>Mesh2d</c>, начиная с указанного начального элемента.
startFrom: Начальный элемент сети.  Тип <c>Element2d</c>.
Returns: Возвращает коллекцию элементов двумерной сети <c>Mesh2d</c>.
Тип <c>Mesh2dElement2dCollection</c>.

Teigha.BoundaryRepresentation.Mesh2d.Element2ds
Свойство <c>Element2ds</c> предоставляет доступ ко всем элементам сети <c>Mesh2d</c>.
Returns: Возвращает коллекцию всех элементов данной сети.
Тип <c>Mesh2dElement2dCollection</c>.