Teigha.DatabaseServices.LayoutRenamedEventArgs
Этот класс представляет данные для событий переименования листа в диспетчере листов.

Teigha.DatabaseServices.LayoutRenamedEventArgs.Id
Свойство представляет идентификатор объекта измененного листа.
Returns: Возвращает идентификатор объекта измененного листа.
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.LayoutRenamedEventArgs.Name
Свойство представляет имя измененного листа.
Returns: Возвращает  имя измененного листа. Тип <c>String</c>.

Teigha.DatabaseServices.LayoutRenamedEventArgs.NewName
Свойство представляет новое имя измененного листа.
Returns: Возвращает новое имя измененного листа. Тип <c>String</c>.