Teigha.DatabaseServices.ProxyEntity
Класс <c>ProxyEntity</c> является базовым классом для прокси-объектов, производных от объектов чертежа в базе данных.

Teigha.DatabaseServices.ProxyEntity.GetReferences
Метод предоставляет коллекцию идентификаторов объектов, на которые ссылается этот прокси-объект.
Returns: Возвращает коллекцию идентификаторов объектов. Тип <c>DBObjectReferenceCollection</c>.

Teigha.DatabaseServices.ProxyEntity.ApplicationDescription
Свойство <c>ApplicationDescription</c> обеспечивает доступ к строке с описанием приложения класса, представленного данным прокси-объектом.
Returns: Возвращает строку с описанием приложения. Тип <c>String</c>.

Teigha.DatabaseServices.ProxyEntity.GraphicsMetafileType
Свойство <c>GraphicsMetafileType</c> представляет тип графического метафайла данного прокси-объекта.
Returns: Возвращает тип графического метафайла.
Значение из перечисления <c>DatabaseServices.GraphicsMetafileType</c>.

Teigha.DatabaseServices.ProxyEntity.OriginalClassName
Свойство <c>OriginalClassName</c> возвращает имя класса пользовательского объекта, представленного данным прокси-объектом.
Returns: Возвращает имя класса пользовательского объекта. Тип <c>String</c>.

Teigha.DatabaseServices.ProxyEntity.OriginalDxfName
Свойство <c>OriginalDxfName</c> возвращает имя DXF пользовательского объекта, представленного данным прокси-объектом.
Returns: Возвращает имя DXF пользовательского объекта. Тип <c>String</c>.

Teigha.DatabaseServices.ProxyEntity.ProxyFlags
Свойство <c>ProxyFlags</c> представляет флаги редактирования для класса, связанного с данным прокси-объектом.
Returns: Возвращает флаги редактирования. Тип <c>int</c>.