Teigha.DatabaseServices.UnderlayHost
Класс <c>UnderlayHost</c> реализуется хост-приложениями для поддержки подложек.

Teigha.DatabaseServices.UnderlayHost.GetFile(String,String)
Метод позволяет получить файл подложки. В случае необходимости запрашивает пароль.
path: Полный путь к файлу, который требуется открыть. Тип <c>String</c>.
password: Опциональная строка пароля. Тип <c>String</c>.
Returns: Возвращает файл подложки.
Тип <c>UnderlayFile</c>.

Teigha.DatabaseServices.UnderlayHost.DgnDocHost
Свойство <c>DgnDocHost</c> представляет текущее хост-приложение для подложки DGN, которое использует текущий документ для объектов OLE.
Returns: Возвращает хост-приложение для подложки DGN.
Тип <c>UnderlayHost</c>.

Teigha.DatabaseServices.UnderlayHost.DgnHost
Свойство <c>DgnHost</c> представляет текущее хост-приложение для подложки DGN.
Returns: Возвращает хост-приложение для подложки DGN.
Тип <c>UnderlayHost</c>.

Teigha.DatabaseServices.UnderlayHost.DwfHost
Свойство <c>DwfHost</c> представляет текущее хост-приложение для подложки DWF.
Returns: Возвращает хост-приложение для подложки DWF.
Тип <c>UnderlayHost</c>.

Teigha.DatabaseServices.UnderlayHost.PdfHost
Свойство <c>PdfHost</c> представляет текущее хост-приложение для подложки PDF.
Returns: Возвращает хост-приложение для подложки PDF.
Тип <c>UnderlayHost</c>.