Teigha.Runtime.RXObject
RXObject — это базовый класс для тех классов, чьим объектам во время выполнения требуются идентификация их классов и анализ наследования.  Реализован для поддержки регистрации новых классов из приложений NRX во время выполнения.

Teigha.Runtime.RXObject.Clone
Метод создает клон данного объекта.  Если создать клон не удалось, возвращает NULL.
Returns: Возвращает созданный клон. Тип Object. Если создать клон не удалось, возвращает NULL.

Teigha.Runtime.RXObject.CompareTo(Object)
Метод реализует процедуру сравнения объектов данного класса и возвращает результат сравнения.
obj: Входной объект для сравнения. Тип Object.
Returns: Возвращает true в случае равенства сравниваемых объектов. В противном случае возвращает false.

Teigha.Runtime.RXObject.CopyFrom(Teigha.Runtime.RXObject)
Метод копирует в данный объект, если это возможно, содержимое указанного объекта.
source: Входной объект, который следует копировать. Тип RXObject.

Teigha.Runtime.RXObject.Create(IntPtr,System.Boolean)
Метод создает новый экземпляр класса, используя псевдоконструктор класса и данный экземпляр класса.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип IntPtr.
autoDelete: Флаг автоудаления исходного объекта. Тип bool.
Returns: Возвращает новый экземпляр класса. Тип RXObject.

Teigha.Runtime.RXObject.GetClass(Type)
Метод реализует поиск объекта RXClass, который соответствует указанному типу.
type: Входной тип искомого объекта. Тип Type.
Returns: Возвращает объект RXClass, который соответствует типу type.

Teigha.Runtime.RXObject.GetRXClass
Метод возвращает RXClass.
Returns: Возвращает RXClass.

Teigha.Runtime.RXObject.QueryX(Teigha.Runtime.RXClass)
Метод выполняет поиск объекта расширения протокола, связанного с данным объектом.
protocolClass: Необработанный указатель на класс, описывающий экземпляр, в который должен быть преобразован объект.  Тип RXClass.
Returns: Возвращает указатель на преобразованный объект. Тип IntPtr.
Возвращает NULL, если преобразование оказалось невозможным.

Teigha.Runtime.RXObject.X(Teigha.Runtime.RXClass)
Метод позволяет проверить, принадлежит ли данный объект указанному классу.
Returns: Возвращает указатель на объект расширения протокола. Тип IntPtr.