Teigha.DatabaseServices.FaceRecord
Класс <c>FaceRecord</c> представляет в базе данных грани многогранной сети <c>PolyFaceMesh</c>.

Teigha.DatabaseServices.FaceRecord.#ctor
Конструктор по умолчанию класса <c>FaceRecord</c>.

Teigha.DatabaseServices.FaceRecord.#ctor(short,short,short,short)
Конструктор класса <c>FaceRecord</c>, создающий экземпляр класса с указанными вершинами в угловых точках грани.
vertex0: Индекс первой вершины грани. Тип <c>short</c>.
vertex1: Индекс второй вершины грани.  Тип <c>short</c>.
vertex2: Индекс третьей вершины грани.  Тип <c>short</c>.
vertex3: Индекс четвертой вершины грани.  Тип <c>short</c>.

Teigha.DatabaseServices.FaceRecord.GetVertexAt(short)
Метод позволяет определить индекс вершины <c>PolyFaceMesh</c>, используемой в качестве угловой точки грани.
faceIndex: Индекс угла грани (0, 1, 2 или 3). Тип <c>short</c>.
Returns: Возвращает индекс вершины <c>PolyFaceMesh</c>. Тип <c>short</c>.

Teigha.DatabaseServices.FaceRecord.IsEdgeVisibleAt(short)
Метод позволяет определить, является ли видимым ребро с началом в заданной угловой точке.
faceIndex: Индекс начальной точки ребра. Тип <c>short</c>.
Returns: Возвращает <c>true</c>, если ребро является видимым.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.FaceRecord.MakeEdgeInvisibleAt(short)
Метод позволяет сделать невидимым ребро с началом в указанной угловой точке грани.
faceIndex: Индекс начальной точки ребра (0, 1, 2 или 3). Тип <c>short</c>.

Teigha.DatabaseServices.FaceRecord.MakeEdgeVisibleAt(short)
Метод позволяет сделать видимым ребро с началом в указанной угловой точке грани.
faceIndex: Индекс начальной точки ребра (0, 1, 2 или 3). Тип <c>short</c>.

Teigha.DatabaseServices.FaceRecord.SetVertexAt(short,short)
Метод ставит в соответствие указанный угол данного объекта FaceRecord указанному индексу родительской вершины сети PolyFaceMesh.
faceIndex: Индекс угловой точки грани (0, 1, 2 или 3). Тип <c>short</c>.
vertexIndex: Индекс вершины. Тип <c>short</c>.