Teigha.Runtime.Exception
Класс <c>Exception</c> представляет контейнер для значения перечисления <c>Teigha.Runtime.ErrorStatus</c>.

Teigha.Runtime.Exception.#ctor
Конструктор по умолчанию класса <c>Exception</c>.

Teigha.Runtime.Exception.#ctor(Runtime.ErrorStatus)
Конструктор класса <c>Exception</c>. Создает экземпляр класса с указанным статусом ошибки.
es: Статус ошибки.  Тип <c>Runtime.ErrorStatus</c>.

Teigha.Runtime.Exception.#ctor(Runtime.ErrorStatus,String)
Конструктор класса <c>Exception</c>.
Создает экземпляр класса с указанным статусом ошибки и текстовым сообщением.
es: Статус ошибки.  Тип <c>Runtime.ErrorStatus</c>.
message: Сообщение об ошибке.  Тип <c>String</c>.

Teigha.Runtime.Exception.#ctor(Runtime.ErrorStatus,String,System.Exception)
Конструктор класса <c>Exception</c>.
Создает экземпляр класса с указанным статусом ошибки, текстовым сообщением и внутренним исключением.
es: Статус ошибки.          Тип <c>Runtime.ErrorStatus</c>.
message: Сообщение об ошибке.    Тип <c>String</c>.
innerException: Внутреннее исключение.  Тип <c>System.Exception</c>.

Teigha.Runtime.Exception.GetObjectData(SerializationInfo,StreamingContext)
Метод вызывает версию своего суперкласса и затем добавляет значение с именем <c>AcadErrorStatus</c> к данным указанного потока сериализации.
info: Входные данные о потоке сериализации.  Тип <c>SerializationInfo</c>.
context: Входной контекст.  Тип <c>StreamingContext</c>.

Teigha.Runtime.Exception.ErrorStatus
Свойство <c>ErrorStatus</c> представляет значение статуса ошибки.
Returns: Возвращает статус ошибки.  Тип <c>Runtime.ErrorStatus</c>.