HostMgd.EditorInput.PromptOptions
Базовый класс, предназначенный для хранения набора параметров, необходимых для запроса данных у пользователя.
Абстрактный класс, предназначенный для для хранения набора параметров, необходимых для запроса данных у пользователя.
Является базовым классом для класса .
Класс предоставляет возможность установить для запроса приглашающее сообщение, ключевые слова,
значение по умолчанию и признак его использования.

HostMgd.EditorInput.PromptOptions.#ctor(System.String)
Конструктор класса
Конструктор класса. Устанавливает следующие значения свойств класса:
AppendKeywordsToMessage = true (ключевые слова выводятся вместе с приглашающим сообщением при запросе);
Keywords = null (если в сообщении есть ключевые слова, то они не будут записаны в свойство Keywords);
IsReadOnly = false (свойства класса PromptOptions доступны для чтения и записи);
Message = .
message: Текстовое сообщение, приглашающее предоставить данные для дальнейших действий с объектом или группой объектов.

HostMgd.EditorInput.PromptOptions.#ctor(System.String,System.String)
Конструктор класса
/Конструктор класса. Устанавливает следующие значения свойств класса:
AppendKeywordsToMessage = true (ключевые слова выводятся вместе с приглашающим сообщением при запросе);
в свойство Keywords записываются ключевые слова из параметра ;
IsReadOnly = false (свойства класса PromptOptions доступны для чтения и записи);
Message = .
messageAndKeywords: Cтрока, содержащая в себе сообщение запроса и ключевые слова к нему, которые будут выводиться на экране при запросе данных.
Набор отображаемых ключевых слов строки  должен быть заключен в скобки: "[" в начале и "]" в конце.

HostMgd.EditorInput.PromptOptions.#ctor(const_WCHAR*,const_WCHAR*)
Конструктор класса
/Конструктор класса. Устанавливает следующие значения свойств класса:
AppendKeywordsToMessage = true (ключевые слова выводятся вместе с приглашающим сообщением при запросе);
в свойство Keywords записываются ключевые слова из параметра ;
IsReadOnly = true (свойства класса PromptOptions доступны только для чтения);
Message = .
promptString: Cтрока, содержащая в себе сообщение запроса.

HostMgd.EditorInput.PromptOptions.#ctor(const_WCHAR*,const_WCHAR*,Object)
Конструктор класса с параметрами.
/Конструктор класса. Устанавливает следующие значения свойств класса:
AppendKeywordsToMessage = true (ключевые слова выводятся вместе с приглашающим сообщением при запросе);
в свойство Keywords записываются ключевые слова из параметра ;
IsReadOnly = true (свойства класса PromptOptions доступны только для чтения);
DefaulValueWorker = ;
Message = .
promptString: Cтрока, содержащая в себе сообщение запроса.
defVal: Значение по умолчанию для запрашиваемых данных.