Teigha.DatabaseServices.HighlightOverrule
Этот класс переопределяет подмножество операций подсвечивания, определенных для объекта чертежа.
Он является базовым классом для настройки поведения классов, производных от класса Entity.
Каждая реализация по умолчанию вызывает соответствующий метод целевого класса.

Teigha.DatabaseServices.HighlightOverrule.Highlight(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath,System.Boolean)
Метод реализует подсвечивание указанного пути к подобъекту в данном объекте чертежа.
entity: Объект, тип Entity,
subId: Полный путь к подсвечиваемому подобъекту, тип FullSubentityPath,
highlightAll: Если флаг имеет значение true, то подсвечивание выполняется во всех видовых экранах. Тип bool.

Teigha.DatabaseServices.HighlightOverrule.SetCustomFilter
Включает режим использования метода IsApplicable базового класса Overrule, чтобы установить допустимость применения объектных переопределений.

Teigha.DatabaseServices.HighlightOverrule.SetExtensionDictionaryEntryFilter(String)
Метод включает режим поиска по словарю расширений для фильтрации объектов, к которым будут применены переопределения.
entryName: Имя записи, тип String.

Teigha.DatabaseServices.HighlightOverrule.SetIdFilter(array&lt;ObjectId&gt;)
Метод включает  режим фильтрации по ObjectId при поиске объектов, к которым будут применены переопределения.
Переопределение будет вызвано только для объектов, чьи id присутствуют в заданном списке идентификаторов.
ids: Массив идентификаторов ObjectId.

Teigha.DatabaseServices.HighlightOverrule.SetNoFilter
Отключает при переопределении использование всех методов предварительной фильтрации объектов (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метода IsApplicable() базового класса Overrule.

Teigha.DatabaseServices.HighlightOverrule.SetXDataFilter(String)
Метод включает предварительную фильтрацию объектов по расширенным данным (xdata) прежде чем применить переопределения.
registeredApplicationName: Имя зарегистрированного приложения, тип String.

Teigha.DatabaseServices.HighlightOverrule.Unhighlight(Teigha.DatabaseServices.Entity,Teigha.DatabaseServices.FullSubentityPath,System.Boolean)
Отменяет в данном объекте подсвечивание указанного пути к подобъекту.
entity: Объект, тип Entity.
subId: Полный путь к подобъекту для отмены подсвечивания, тип FullSubentityPath.
highlightAll: Если данный флаг имеет значение true, то отмена подсвечивания выполняется во всех видовых экранах. Тип bool.