Teigha.Geometry.PointEntity3d
Класс <c>PointEntity3d</c> является базовым классом для всех классов трехмерных точечных объектов.

Teigha.Geometry.PointEntity3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>PointEntity3d</c>.

Teigha.Geometry.PointEntity3d.GetPoint
Метод предоставляет трехмерную точку данного объекта.
Returns: Возвращает трехмерную точку данного объекта.
Тип <c>Point3d</c>.