HostMgd.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,TabbedDialogAction)
Конструктор, назначающий обработчик события, определенный как
onOK, выполняемый при нажатии на кнопку ОК в диалоговом окне.
control: Элемент управления С "владелец" данного расширения
onOK: Объект, определяющий действия, которые будут

HostMgd.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,TabbedDialogAction,TabbedDialogAction)
Конструктор, назначающий обработчик события, определенный как
onOK, выполняемый при нажатии на кнопку ОК в диалоговом окне.
Он также назначает обработчик события, определенный как
onCancel, выполняемый при нажатии на кнопку Cancel в
диалоговом окне.
control: Элемент управления С "владелец" данного расширения
onOK: Объект, определяющий действия, которые будут
onCancel: Объект, определяющий действия, которые будут

HostMgd.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,TabbedDialogAction,TabbedDialogAction,TabbedDialogAction)
Конструктор, назначающий обработчик события, определенный как
onOK, выполняемый при нажатии на кнопку ОК в диалоговом окне.
Назначает обработчик события, определенный как onCancel,
выполняемый при нажатии на кнопку Cancel в диалоговом окне.
Он также назначает обработчик события, определенный как
onHelp, выполняемый при нажатии на кнопку Help в диалоговом
окне.
control: Элемент управления С "владелец" данного расширения
onOK: Объект, определяющий действия, которые будут
onCancel: Объект, определяющий действия, которые будут
onHelp: Объект, определяющий действия, которые будут

HostMgd.ApplicationServices.TabbedDialogExtension.#ctor(System.Windows.Forms.Control,TabbedDialogAction,TabbedDialogAction,TabbedDialogAction,TabbedDialogAction)
Конструктор, назначающий обработчик события, определенный как
onOK, выполняемый при нажатии на кнопку ОК в диалоговом окне.
Назначает обработчик события, определенный как onCancel,
выполняемый при нажатии на кнопку Cancel в диалоговом окне.
Назначает обработчик события, определенный как onHelp,
выполняемый при нажатии на кнопку Help в диалоговом окне. Он
также назначает обработчик события, определенный как onApply,
выполняемый при нажатии на кнопку Apply в диалоговом окне.
control: Элемент управления С "владелец" данного расширения
onOK: Объект, определяющий действия, которые будут
onCancel: Объект, определяющий действия, которые будут
onHelp: Объект, определяющий действия, которые будут
onApply: Объект, определяющий действия, которые будут