Teigha.DatabaseServices.Helix
Класс <c>Helix</c> представляет спирали в экземпляре базы данных.

Teigha.DatabaseServices.Helix.#ctor
Конструктор по умолчанию класса <c>Helix</c>.

Teigha.DatabaseServices.Helix.CreateHelix
Метод создает спираль с параметрами, установленными при предыдущих вызовах метода.

Teigha.DatabaseServices.Helix.GetAxisPoint
Метод предоставляет точку начала оси спирали.
Returns: Возвращает точку начала оси. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Helix.SetAxisPoint(Teigha.Geometry.Point3d,System.Boolean)
Метод предоставляет возможность задать точку начала оси спирали.
axisPoint: Новая точка начала оси спирали. Тип <c>Point3d</c>.
moveStartPoint: Флаг, определяющий, следует ли применить к начальной точке спирали такое же смещение, что и у точки начала оси спирали. Тип <c>bool</c>. В случае значения <c>true</c> начальная точка спирали должна сместиться. В противном случае она остается на прежнем месте.

Teigha.DatabaseServices.Helix.AxisVector
Свойство обеспечивает доступ к направляющему вектору оси спирали.
Returns: Возвращает направляющий вектор оси спирали. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Helix.BaseRadius
Свойство обеспечивает доступ к радиусу в основании этой спирали.
Returns: Возвращает радиус в основании спирали. Тип <c>double</c>.

Teigha.DatabaseServices.Helix.Constrain
Свойство предоставляет возможность определить вариант ограничения геометрии спирали -  по высоте витка, по количеству витков или по общей высоте.
Returns: Возвращает вариант ограничения высоты спирали из перечисления <c>ConstrainType</c>.

Teigha.DatabaseServices.Helix.Height
Свойство позволяет управлять высотой спирали.
Returns: Возвращает высоту спирали.  Тип <c>double</c>.

Teigha.DatabaseServices.Helix.StartPoint
Свойство обеспечивает доступ к положению начальной точки спирали.
Returns: Возвращает начальную точку спирали. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Helix.TopRadius
Свойство обеспечивает доступ к радиусу верхнего основания спирали.
Returns: Возвращает радиус верхнего основания спирали. Тип <c>double</c>.

Teigha.DatabaseServices.Helix.TotalLength
Свойство возвращает текущее значение полной длины спирали.
Returns: Возвращает полную длину спирали. Тип <c>double</c>.

Teigha.DatabaseServices.Helix.TurnHeight
Свойство обеспечивает доступ к значению высоты витка спирали.
Returns: Возвращает высоту витка спирали. Тип <c>double</c>.

Teigha.DatabaseServices.Helix.Turns
Свойство обеспечивает доступ к количеству витков спирали.
Returns: Возвращает текущее количество витков спирали. Тип <c>double</c>.

Teigha.DatabaseServices.Helix.TurnSlope
Свойство возвращает угол наклона витков спирали.
Returns: Возвращает угол наклона витков спирали. Тип <c>double</c>.

Teigha.DatabaseServices.Helix.Twist
Свойство обеспечивает доступ к направлению закручивания спирали (по часовой стрелке или против).
Returns: Возвращает <c>true</c>, если спираль закручивается «против часовой стрелки».
В противном случае возвращает <c>false</c>.