Teigha.DatabaseServices.Graph
Класс Graph реализует базовый объект ориентированного графа и предоставляет базовый механизм для выявления циклов.

Teigha.DatabaseServices.Graph.#ctor(Teigha.DatabaseServices.GraphNode)
Конструктор класса <c>Graph</c>. Создает новый объект <c>Graph</c> с указанным корневым узлом.
root: Корневой узел графа. Тип <c>GraphNode</c>.

Teigha.DatabaseServices.Graph.AddEdge(Teigha.DatabaseServices.GraphNode,Teigha.DatabaseServices.GraphNode)
Метод предназначен для добавления к данному объекту <c>Graph</c> нового ориентированного ребра с указанными начальным и конечным узлами.
from: Начальный узел ребра. Тип <c>GraphNode</c>.
toPointer: Конечный узел ребра.  Тип <c>GraphNode</c>.

Teigha.DatabaseServices.Graph.AddNode(Teigha.DatabaseServices.GraphNode)
Метод предназначен для добавления в данный граф нового узла <c>GraphNode</c>.
nodeToAdd: Добавляемый узел. Тип <c>GraphNode</c>.

Teigha.DatabaseServices.Graph.BreakCycleEdge(Teigha.DatabaseServices.GraphNode,Teigha.DatabaseServices.GraphNode)
Метод предназначен для разрыва цикла на конкретном ребре графа с последующим обновлением информации о циклах в данном графе.
from: Узел в начале удаляемого ребра. Тип <c>GraphNode</c>.
toPointer: Узел на конце удаляемого ребра. Тип <c>GraphNode</c>.

Teigha.DatabaseServices.Graph.ClearAll(unsigned char)
Метод предназначен для очистки битовых флагов во всех узлах графа.
flags: Входные битовые флаги, которые следует очистить во всех узлах графа.  Тип <c>unsigned char</c>.

Teigha.DatabaseServices.Graph.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта Graph на базе указанного объекта.
unmanagedPointer: Неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Флаг автоудаления входного объекта. Тип <c>bool</c>.
Returns: Возвращает созданный объект типа <c>Graph</c>.

Teigha.DatabaseServices.Graph.DelNode(Teigha.DatabaseServices.GraphNode)
Метод предназначен для полного удаления конкретного узла из данного графа.
nodeToDelete: Удаляемый узел. Тип <c>GraphNode</c>.

Teigha.DatabaseServices.Graph.FindCycles(Teigha.DatabaseServices.GraphNode)
Метод предназначен для выявления всех узлов данного графа, участвующих в циклах.
start: Узел графа, с которого начинается поиск циклов. Тип <c>GraphNode</c>. Обычно передается <c>null</c>.
Returns: Возвращает <c>true</c>, только если данный объект представляет собой циклический граф.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Graph.GetOutgoing
Метод позволяет получить коллекцию всех исходящих узлов данного графа.
Returns: Возвращает коллекцию исходящих узлов данного графа.  Тип <c>GraphNodeCollection</c>.

Teigha.DatabaseServices.Graph.Node(System.Int32)
Метод предназначен для получения узла данного графа по его индексу.
index: Входной индекс узла. Тип <c>int</c>.
Returns: Возвращает узел с указанным индексом.  Тип <c>GraphNode</c>.
В случае недействительного индекса возвращает <c>null</c>.

Teigha.DatabaseServices.Graph.Reset
Метод предназначен для удаления из данного графа всех узлов, включая узлы циклов, что делает граф пустым.

Teigha.DatabaseServices.Graph.SetNodeGrowthRate(System.Int32)
Метод позволяет задать количество узлов, под которые графу одномоментно выделяется память.
rate: Количество узлов, под которые графу выделяется память. Тип <c>int</c>.

Teigha.DatabaseServices.Graph.IsEmpty
Свойство позволяет проверить, является ли граф пустым.
Returns: Возвращает <c>true</c> тогда и только тогда, когда граф является пустым.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Graph.NumNodes
Свойство возвращает текущее количество узлов в графе.
Returns: Возвращает количество узлов в графе. Тип <c>int</c>.

Teigha.DatabaseServices.Graph.RootNode
Свойство обеспечивает доступ к корневому (первому) узлу графа.
Returns: Возвращает корневой узел графа.  Тип <c>GraphNode</c>.