Teigha.DatabaseServices.Point3AngularDimension
Класс <c>Point3AngularDimension</c> представляет в базе данных объекты углового размера по трем точкам.

Teigha.DatabaseServices.Point3AngularDimension.#ctor
Конструктор по умолчанию класса <c>Point3AngularDimension</c>.

Teigha.DatabaseServices.Point3AngularDimension.#ctor(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,String,DatabaseServices.ObjectId)
Конструктор класса <c>Point3AngularDimension</c>.
centerPoint: Точка вершины измеряемого угла. Тип <c>Point3d</c>.
line1Point: Начальная точка первой выносной линии. Тип <c>Point3d</c>.
line2Point: Начальная точка второй выносной линии. Тип <c>Point3d</c>.
arcPoint: Точка, лежащая на размерной дуге. Тип <c>Point3d</c>.
dimensionText: Размерный текст для замены текста измеренного значения. Тип <c>String</c>.
dimensionStyle: Идентификатор <c>ObjectId</c> размерного стиля, который следует использовать для отрисовки данного размера. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.Point3AngularDimension.arcPoint
Свойство <c>ArcPoint</c> предоставляет доступ к трехмерным координатам (WCS) точки, располагающейся на дуге  данного размера.
Returns: Возвращает точку на размерной дуге в мировой системе координат (WCS). Тип <c>Point3d</c>.

Teigha.DatabaseServices.Point3AngularDimension.centerPoint
Свойство <c>CenterPoint</c> предоставляет доступ к трехмерным координатам (WCS) вершины угла данного размера.
Returns: Возвращает точку вершины угла в мировой системе координат (WCS). Тип <c>Point3d</c>.

Teigha.DatabaseServices.Point3AngularDimension.xLine1Point
Свойство <c>XLine1Point</c> представляет начальную точку первой выносной линии углового размера.
Returns: Возвращает начальную точку первой выносной линии размера. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Point3AngularDimension.xLine2Point
Свойство представляет начальную точку второй выносной линии углового размера.
Returns: Возвращает начальную точку второй выносной линии углового размера.
Тип <c>Point3d</c>.