Teigha.DatabaseServices.DataLink
Класс реализует связывание данных таблицы на чертеже с внешним источником данных.

Teigha.DatabaseServices.DataLink.#ctor
Конструктор по умолчанию класса DataLink.

Teigha.DatabaseServices.DataLink.#ctor(IntPtr,System.Boolean)
Конструктор класса.
unmanagedObjPtr: Неуправляемый указатель на входной объект. Тип <c>IntPtr</c>.
autoDelete: Флаг автоудаления входного объекта. Тип <c>bool</c>.

Teigha.DatabaseServices.DataLink.GetSourceFiles(Teigha.DatabaseServices.DataLinkGetSourceContext)
Метод предоставляет внешние файлы, от которых зависит эта ссылка на данные.
nContext: Входной контекст. В настоящее время не используется. Тип DataLinkGetSourceContext.
Returns: Возвращает массив внешних файлов. Тип <c>ArrayList</c>.

Teigha.DatabaseServices.DataLink.GetTargets
Метод позволяет получить коллекцию идентификаторов резидентных объектов базы данных, которые используют эту ссылку на данные.
Returns: Возвращает коллекцию идентификаторов объектов. Тип ObjectIdCollection.

Teigha.DatabaseServices.DataLink.GetUpdateStatus(UpdateDirection%,DateTime%,String)
Метод предоставляет статус последнего обновления ссылки на данные.
pDir: Возвращает направление последнего обновления. Значение из перечисления UpdateDirection.
pTime: Возвращает время последнего обновления. Тип <c>DateTime</c>.
errMessage: Возвращает сообщение об ошибках при последнем обновлении. Тип <c>String</c>.
Returns: Возвращает статус операции как значение из перечисления Teigha.Runtime.ErrorStatus.

Teigha.DatabaseServices.DataLink.RepathSourceFiles(String,Teigha.DatabaseServices.PathOption)
Метод перенаправляет ссылки на пути к внешним исходным файлам.
sBasePath: Базовый путь к файлам.  Тип <c>String</c>.
nOption: Опции путей. Значение из перечисления PathOption.

Teigha.DatabaseServices.DataLink.Update(Teigha.DatabaseServices.UpdateDirection,DatabaseServices.UpdateOption)
Метод обновляет ссылки на пути к внешним исходным файлам. Не реализован.
dir: Направление обновления. Значение из перечисления UpdateDirection.
option: Опции обновления. Значение из перечисления DatabaseServices.UpdateOption.

Teigha.DatabaseServices.DataLink.ConnectionString
Свойство предоставляет доступ к строке подключения к источнику данных.
Returns: Возвращает строку подключения. Тип <c>String</c>.

Teigha.DatabaseServices.DataLink.DataAdapterId
Свойство предоставляет доступ к идентификатору адаптера данных.
Returns: Возвращает идентификатор адаптера данных. Тип <c>String</c>.

Teigha.DatabaseServices.DataLink.DataLinkOption
Свойство предоставляет доступ к опциям связи с внешними данными.
Returns: Возвращает опции подключения к внешним данным как значение из перечисления DatabaseServices.DataLinkOption.

Teigha.DatabaseServices.DataLink.Description
Свойство предоставляет доступ к описанию связи с данными.
Returns: Возвращает описание связи с данными. Тип <c>String</c>.

Teigha.DatabaseServices.DataLink.IsValid
Свойство позволяет проверить, действительна ли связь с внешними данными и может ли она использоваться для обновления данных.
Returns: Возвращает <c>true</c>, если связь с внешними данными действительна.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DataLink.Name
Свойство предоставляет доступ к наименованию связи с внешними данными.
Returns: Возвращает наименование связи с данными. Тип <c>String</c>.

Teigha.DatabaseServices.DataLink.ToolTip
Свойство предоставляет доступ к строке подсказки связи с данными.
Returns: Возвращает строку подсказки. Тип <c>String</c>.

Teigha.DatabaseServices.DataLink.UpdateOption
Свойство предоставляет доступ к опциям обновления связи с данными.
Returns: Возвращает опции обновления. Тип <c>int</c>.