Teigha.BoundaryRepresentation.ShellFaceEnumerator
Класс <c>ShellFaceEnumerator</c> представляет перечислитель граней оболочки BREP.

Teigha.BoundaryRepresentation.ShellFaceEnumerator.Current
Свойство <c>Current</c> представляет текущий элемент данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип <c>Face</c>.