Teigha.DatabaseServices.BeginInsertEventArgs
Класс представляет данные для события <c>BeginInsert</c> базы данных.

Teigha.DatabaseServices.BeginInsertEventArgs.From
Свойство обеспечивает доступ к вставляемой базе данных.
Returns: Возвращает вставляемую базу данных. Тип Database.