Teigha.DatabaseServices.SubentRef
Класс <c>SubentRef</c> представляет ссылку на подобъект.

Teigha.DatabaseServices.SubentRef.CopyFrom(Teigha.DatabaseServices.SubentRef)
Метод позволяет скопировать в данный объект содержимое указанного объекта.
source: Ссылка на подобъект, являющийся источником данных. Тип <c>SubentRef</c>.

Teigha.DatabaseServices.SubentRef.CreateEntity
Метод создает новый объект чертежа на основе данной ссылки на подобъект.
Returns: Возвращает новый объект чертежа. Тип <c>Teigha.DatabaseServices.Entity</c>.

Teigha.DatabaseServices.SubentRef.Entity
Свойство <c>Entity</c> представляет идентификатор составного объекта, в который входит подобъект, представленный данной ссылкой <c>SubentRef</c>.
Returns: Возвращает идентификатор составного объекта. Тип <c>CompoundObjectId</c>.

Teigha.DatabaseServices.SubentRef.SubentId
Свойство <c>SubentId</c> возвращает идентификатор подобъекта <c>SubentityId</c>, который представлен данной ссылкой <c>SubentRef</c>.
Returns: Возвращает идентификатор подобъекта. Тип <c>SubentityId</c>.