Teigha.DatabaseServices.FormattedTableData
Класс реализует форматирование ячеек, строк и столбцов, чтобы обеспечить желаемое отображение таблицы.

Teigha.DatabaseServices.FormattedTableData.#ctor
Конструктор по умолчанию класса FormattedTableData.

Teigha.DatabaseServices.FormattedTableData.GetAlignment(System.Int32,System.Int32)
Метод позволяет получить выравнивание содержимого ячейки.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и быть меньше, чем количество строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и быть меньше, чем количество столбцов в таблице.
Returns: Возвращает выравнивание содержимого ячейки как значение из перечисления <c>CellAlignment</c>.

Teigha.DatabaseServices.FormattedTableData.GetBackgroundColor(System.Int32,System.Int32)
Метод возвращает цвет фона ячейки, строки или столбца.
row: Индекс строки.  Тип <c>int</c>. Может принимать значение -1.
column: Индекс столбца. Тип <c>int</c>. Может принимать значение -1.
Returns: Возвращает цвет фона ячейки, строки или столбца. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.FormattedTableData.GetContentColor(System.Int32,System.Int32)
Метод позволяет получить цвет содержимого указанной ячейки.
row: Индекс строки. Тип <c>int</c>.
column: Индекс столбца. Тип <c>int</c>.
Returns: Возвращает цвет содержимого ячейки. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.FormattedTableData.GetGridColor(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод позволяет получить цвет сетки в ячейке, строке или столбце.
row: Индекс строки.  Тип <c>int</c>. Может принимать значение -1.
column: Индекс столбца. Тип <c>int</c>. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления <c>GridLineType</c>. Можно задать комбинацию типов линий сетки, объединив их с помощью оператора <c>OR</c>.
Returns: Возвращает цвет линий сетки ячейки. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.FormattedTableData.GetGridLinetype(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод позволяет получить тип линий сетки в ячейке, строке или столбце.
row: Индекс строки.  Тип <c>int</c>. Может принимать значение -1.
column: Индекс столбца. Тип <c>int</c>. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления <c>GridLineType</c>. Можно задать комбинацию типов линий сетки, объединив их с помощью оператора <c>OR</c>.
Returns: Возвращает идентификатор типа линий. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.FormattedTableData.GetGridLineWeight(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод предназначен для получения толщины линий сетки в ячейке, строке или столбце.
row: Индекс строки.  Тип <c>int</c>. Может принимать значение -1.
column: Индекс столбца. Тип <c>int</c>. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления <c>GridLineType</c>. Можно задать комбинацию типов линий сетки, объединив их с помощью оператора <c>OR</c>.
Returns: Возвращает толщину (вес) линий из перечисления <c>LineWeight</c>.

Teigha.DatabaseServices.FormattedTableData.GetGridVisibility(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод позволяет определить видимость линий сетки в ячейке, строке или столбце.
row: Индекс строки.  Тип <c>int</c>. Может принимать значение -1.
column: Индекс столбца. Тип <c>int</c>. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления <c>GridLineType</c>.  Комбинацию типов линий сетки можно задать с помощью логического оператора <c>OR</c>.
Returns: Возвращает видимость линий сетки как значение из перечисления <c>Visibility</c>.

Teigha.DatabaseServices.FormattedTableData.GetMargin(System.Int32,System.Int32,Teigha.DatabaseServices.CellMargins)
Метод предназначен для получения размера полей (расстояний между границами и содержимым) для ячеек, строк или столбцов.
row: Индекс строки.  Тип <c>int</c>. Может принимать значение -1.
column: Индекс столбца. Тип <c>int</c>. Может принимать значение -1.
margin: Тип поля из перечисления <c>CellMargins</c>.
Returns: Возвращает размер полей. Тип <c>double</c>.

Teigha.DatabaseServices.FormattedTableData.GetMergeRange(System.Int32,System.Int32)
Метод позволяет определить диапазон слияния, которому принадлежит указанная ячейка.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает диапазон ячеек. Тип <c>CellRange</c>.

Teigha.DatabaseServices.FormattedTableData.GetOverride(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType)
Метод позволяет получить переопределения для сетки в заданной строке, столбце или ячейке.
row: Индекс строки.  Тип <c>int</c>. Может принимать значение -1.
column: Индекс столбца. Тип <c>int</c>. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления <c>GridLineType</c>.  Комбинацию типов линий сетки можно задать с помощью логического оператора <c>OR</c>.
Returns: Возвращает выявленные переопределения у линий сетки как комбинацию битовых полей из перечисления <c>GridProperties</c>.

Teigha.DatabaseServices.FormattedTableData.GetOverride(System.Int32,System.Int32,System.Int32)
Метод позволяет получить переопределения ячейки, строки, столбца или содержимого ячейки.
row: Индекс строки. Тип <c>int</c>. Индекс может равняться -1.
column: Индекс столбца. Тип <c>int</c>. Индекс может равняться -1.
content: Индекс элемента содержимого ячейки. Тип <c>int</c>. Индекс может равняться -1.
Returns: Возвращает выявленные переопределения у линий сетки как комбинацию битовых полей из перечисления <c>GridProperties</c>.

Teigha.DatabaseServices.FormattedTableData.GetRotation(System.Int32,System.Int32)
Метод позволяет определить угол поворота содержимого указанной ячейки.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает угол поворота в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.FormattedTableData.GetScale(System.Int32,System.Int32)
Метод позволяет определить масштаб элементов содержимого указанной ячейки.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает масштаб содержимого ячейки. Тип <c>double</c>.

Teigha.DatabaseServices.FormattedTableData.GetTextHeight(System.Int32,System.Int32)
Метод предназначен для получения высоты текста в указанной ячейке.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает высоту текста. Тип <c>double</c>.

Teigha.DatabaseServices.FormattedTableData.GetTextStyle(System.Int32,System.Int32)
Метод предназначен для получения текстового стиля указанной ячейки.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает идентификатор текстового стиля. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.FormattedTableData.IsFormatEditable(System.Int32,System.Int32)
Метод позволяет определить, допускается ли изменение формата ячейки.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает <c>true</c>, если изменение формата ячейки возможно. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.FormattedTableData.IsMerged(System.Int32,System.Int32)
Метод позволяет определить, принадлежит ли данная ячейка диапазону слияния ячеек.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
Returns: Возвращает <c>true</c>, если ячейка входит в диапазон слияния.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.FormattedTableData.Merge(Teigha.DatabaseServices.CellRange)
Метод выполняет слияние ячеек в указанном диапазоне.
range: Диапазон, ячейки которого объединяются. Тип <c>CellRange</c>.

Teigha.DatabaseServices.FormattedTableData.RemoveAllOverrides(System.Int32,System.Int32)
Метод предназначен для удаления всех переопределений в ячейке, строке или столбце.
row: Индекс строки.  Тип <c>int</c>. Индекс может равняться -1.
column: Индекс столбца. Тип <c>int</c>. Индекс может равняться -1.

Teigha.DatabaseServices.FormattedTableData.SetAlignment(System.Int32,System.Int32,Teigha.DatabaseServices.CellAlignment)
Метод позволяет задать выравнивание содержимому заданной ячейки.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Тип выравнивания как значение из перечисления <c>CellAlignment</c>.

Teigha.DatabaseServices.FormattedTableData.SetBackgroundColor(System.Int32,System.Int32,Colors.Color)
Метод позволяет задать цвет фона в ячейке, строке или столбце.
row: Индекс строки.   Тип <c>int</c>. Индекс может равняться -1.
column: Индекс столбца.  Тип <c>int</c>. Индекс может равняться -1.
value: Новый цвет фона. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.FormattedTableData.SetContentColor(System.Int32,System.Int32,Colors.Color)
Метод позволяет задать цвет содержимого ячейки.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Новый цвет содержимого ячейки. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.FormattedTableData.SetGridColor(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Colors.Color)
Метод позволяет задать цвет сетки в строке, столбце или ячейке.
row: Индекс строки.  Тип <c>int</c>. Индекс может равняться -1.
column: Индекс столбца. Тип <c>int</c>. Индекс может равняться -1.
gridLinetype: Тип линий сетки из перечисления <c>GridLineType</c>.  Комбинацию типов линий сетки можно задать с помощью логического оператора <c>OR</c>.
value: Новый цвет сетки. Тип <c>Teigha.Colors.Color</c>.

Teigha.DatabaseServices.FormattedTableData.SetGridLinetype(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,DatabaseServices.ObjectId)
Метод позволяет задать тип линий сетки в строке, столбце или ячейке.
row: Индекс строки.  Тип <c>int</c>. Индекс может равняться -1.
column: Индекс столбца. Тип <c>int</c>. Индекс может равняться -1.
gridLinetype: Тип линий сетки из перечисления <c>GridLineType</c>.  Комбинацию типов линий сетки можно задать с помощью логического оператора <c>OR</c>.
value: Идентификатор нового типа линий сетки. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.FormattedTableData.SetGridLineWeight(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.LineWeight)
Метод позволяет задать толщину линий сетки в указанной ячейке, строке или столбце.
row: Индекс строки.  Тип <c>int</c>. Индекс может равняться -1.
column: Индекс столбца. Тип <c>int</c>. Индекс может равняться -1.
gridLinetype: Тип линий сетки из перечисления <c>GridLineType</c>.  Комбинацию типов линий сетки можно задать с помощью логического оператора <c>OR</c>.
value: Новая толщина линий сетки. Значение из перечисления <c>LineWeight</c>.

Teigha.DatabaseServices.FormattedTableData.SetGridVisibility(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.Visibility)
Метод позволяет задать видимость линий сетки в указанной ячейке, строке или столбце.
row: Индекс строки.  Тип <c>int</c>. Индекс может равняться -1.
column: Индекс столбца. Тип <c>int</c>. Индекс может равняться -1.
gridLinetype: Тип линий сетки из перечисления <c>GridLineType</c>.  Комбинацию типов линий сетки можно задать с помощью логического оператора <c>OR</c>.
value: Видимость линий сетки. Значение из перечисления <c>Visibility</c>.

Teigha.DatabaseServices.FormattedTableData.SetMargin(System.Int32,System.Int32,Teigha.DatabaseServices.CellMargins,System.Double)
Метод позволяет задать размер полей в указанной ячейке, строке или столбце.
row: Индекс строки.  Тип <c>int</c>. Может принимать значение -1.
column: Индекс столбца. Тип <c>int</c>. Может принимать значение -1.
margin: Тип поля из перечисления <c>CellMargins</c>.
value: Новый размер полей. Тип <c>double</c>.

Teigha.DatabaseServices.FormattedTableData.SetOverride(System.Int32,System.Int32,Teigha.DatabaseServices.GridLineType,Teigha.DatabaseServices.GridProperties)
Метод позволяет задать переопределения для сетки в указанной строке, столбце или ячейке.
row: Индекс строки.  Тип <c>int</c>. Может принимать значение -1.
column: Индекс столбца. Тип <c>int</c>. Может принимать значение -1.
gridLinetype: Тип линий сетки из перечисления <c>GridLineType</c>.  Комбинацию типов линий сетки можно задать с помощью логического оператора <c>OR</c>.
gridProperty: Задаваемое переопределение из перечисления <c>GridProperties</c>.

Teigha.DatabaseServices.FormattedTableData.SetOverride(System.Int32,System.Int32,System.Int32,Teigha.DatabaseServices.CellProperties)
Метод позволяет задать переопределение для ячейки, строки, столбца или элемента содержимого ячейки.
row: Индекс строки. Тип <c>int</c>. Индекс может равняться -1.
column: Индекс столбца. Тип <c>int</c>. Индекс может равняться -1.
content: Индекс элемента содержимого ячейки. Тип <c>int</c>. Индекс может равняться -1.
cellProperty: Задаваемое переопределение из перечисления <c>GridProperties</c>.

Teigha.DatabaseServices.FormattedTableData.SetRotation(System.Int32,System.Int32,System.Double)
Метод позволяет задать поворот содержимого ячейки.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Угол поворота элементов содержимого ячейки (в радианах).  Тип <c>double</c>.

Teigha.DatabaseServices.FormattedTableData.SetScale(System.Int32,System.Int32,System.Double)
Метод позволяет задать масштаб содержимого ячейки.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Новый масштаб. Тип <c>double</c>.

Teigha.DatabaseServices.FormattedTableData.SetTextHeight(System.Int32,System.Int32,System.Double)
Метод позволяет задать высоту текста в ячейке.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Новая высота текста. Тип <c>double</c>.

Teigha.DatabaseServices.FormattedTableData.SetTextStyle(System.Int32,System.Int32,DatabaseServices.ObjectId)
Метод позволяет задать текстовый стиль в ячейке.
row: Индекс строки.  Тип <c>int</c>. Должен быть неотрицательным и меньше количества строк в таблице.
column: Индекс столбца. Тип <c>int</c>. Должен быть неотрицательным и меньше количества столбцов в таблице.
value: Идентификатор назначаемого текстового стиля. Тип <c>DatabaseServices.ObjectId</c>.

Teigha.DatabaseServices.FormattedTableData.Unmerge(Teigha.DatabaseServices.CellRange)
Метод предназначен для отмены слияния ячеек в указанном диапазоне.
range: Разбиваемый диапазон ячеек.  Тип <c>CellRange</c>.