Teigha.DatabaseServices.SymbolUtilityServices
Класс <c>SymbolUtilityServices</c> предоставляет различные утилиты для работы с именами символов, записями символов и таблицами символов.

Teigha.DatabaseServices.SymbolUtilityServices.GetBlockModelSpaceId(Teigha.DatabaseServices.Database)
Метод извлекает идентификатор пространства модели из таблицы предопределенных символов в указанной базе данных.
databasePointer: База данных, в которой ищется идентификатор объекта.
Returns: Возвращает ненулевой идентификатор, представляющий пространство модели в указанной базе данных.
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetBlockNameFromInsertPathName(String)
Метод позволяет извлечь имя блока из указанного имени пути.
pathName: Имя пути к переданному параметру. Тип <c>String</c>.
Returns: Возвращает строку, которая представляет имя блока. Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetBlockPaperSpaceId(Teigha.DatabaseServices.Database)
Метод извлекает идентификатор пространства листа в таблице предопределенных символов из указанной базы данных.
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор, представляющий пространство листа в указанной базе данных.
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetInsertPathNameFromBlockName(String)
Метод позволяет извлечь путь из имени блока.
blockName: Имя блока, для которого требуется получить путь.
Returns: Возвращает строку с именем блока или пустую строку, если <c>blockName</c> имеет значение <c>NULL</c>.
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetLayerDefpointsId(Teigha.DatabaseServices.Database)
Метод предоставляет идентификатор объекта слоя <c>"DEFPOINTS"</c> в указанной базе данных.
database: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор слоя <c>"DEFPOINTS"</c> в базе данных <c>database</c>.
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetLayerZeroId(Teigha.DatabaseServices.Database)
Метод позволяет извлечь из указанной базы данных идентификатор объекта слоя <c>"0"</c> .
database: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор объекта слоя <c>"0"</c>.
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetLinetypeByBlockId(Teigha.DatabaseServices.Database)
Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "ByBlock".
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор объекта типа линий "ByBlock".
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetLinetypeByLayerId(Teigha.DatabaseServices.Database)
Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "ByLayer".
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор объекта типа линий "ByLayer".
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetLinetypeContinuousId(Teigha.DatabaseServices.Database)
Метод позволяет извлечь из указанной базы данных идентификатор объекта типа линий "Continuous".
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор объекта типа линий "Continuous".
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetMaxSymbolNameLength(System.Boolean,System.Boolean)
Метод предоставляет максимально допустимую длину имен символов.
isNewName: Флаг, определяющий, следует извлекать длину для расширенных или устаревших имен символов. Тип <c>bool</c>.
compatibilityMode: Флаг, определяющий, следует обрабатывать расширенные или устаревшие имена символов. Тип <c>bool</c>.
Returns: Возвращает максимально допустимую длину имен символов.
Тип <c>int</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetPathNameFromSymbolName(String,String)
Метод позволяет извлечь имя пути из указанных имени блока и расширения (или расширений).
symbolName: Имя блока, из которого требуется получить путь. Тип <c>String</c>.
extensions: Список расширений, для которых выполняется поиск путей. Тип <c>String</c>.
Returns: Возвращает имя пути. Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetRegAppAcadId(Teigha.DatabaseServices.Database)
Метод позволяет получить идентификатор объекта зарегистрированного приложения "ACAD" из указанной базы данных.
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает идентификатор RegApp-объекта "ACAD".
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetSymbolNameFromPathName(String,String)
Метод извлекает подходящее имя символа из имени пути.
pathName: Имя блока, из которого требуется получить путь. Тип <c>String</c>.
extensions: Список расширений, для которых ищутся имена символов. Тип <c>String</c>.
Returns: Возвращает имя блока. Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.GetTextStyleStandardId(Teigha.DatabaseServices.Database)
Метод позволяет извлечь идентификатор стандартного текстового стиля.
databasePointer: База данных, из которой извлекается идентификатор объекта.
Returns: Возвращает ненулевой идентификатор стандартного текстового стиля.
Тип <c>ObjectId</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsBlockLayoutName(String)
Метод позволяет проверить, соответствует ли переданное имя имени записи в таблице блоков листа или имени основного блока пространства листа.
name: Проверяемое имя. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если имя <c>name</c> соответствует имени записи в таблице блоков листа или имени основного блока пространства листа. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsBlockModelSpaceName(String)
Метод позволяет проверить, соответствует ли переданное имя имени основного блока пространства модели.
name: Проверяемое имя. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если указанное имя соответствует имени блока пространства модели.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsBlockPaperSpaceName(String)
Метод позволяет проверить, соответствует ли переданное имя имени основного блока пространства листа.
name: Проверяемое имя. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если указанное имя соответствует имени пространства листа.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsCompatibilityMode(Teigha.DatabaseServices.Database)
Метод позволяет проверить настройку <c>EXTNAMES</c> для указанной базы данных.
database: Проверяемая база данных. Тип <c>Database</c>.
Returns: Возвращает <c>true</c>, если используется режим совместимости.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsLayerDefpointsName(String)
Метод позволяет проверить, соответствует ли переданная строка имени слоя "Defpoints".
name: Проверяемое имя. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если строка <c>name</c> соответствует имени слоя "Defpoints".
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsLayerZeroName(String)
Метод позволяет проверить, соответствует ли входная строка имени слоя <c>"0"</c>.
name: Проверяемое имя. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если строка <c>name</c> соответствует имени слоя "0".
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsLinetypeByBlockName(String)
Метод позволяет проверить, соответствует ли входная строка имени типа линии "ByBlock".
name: Проверяемое имя. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если строка <c>name</c> соответствует имени типа линии "ByBlock".
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsLinetypeByLayerName(String)
Метод позволяет проверить, соответствует ли входная строка имени типа линии "ByLayer".
name: Проверяемое имя. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если строка <c>name</c> соответствует имени типа линии "ByLayer".
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsLinetypeContinuousName(String)
Метод позволяет проверить, соответствует ли входная строка имени типа линии "Continuous".
name: Проверяемое имя. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если строка <c>name</c> соответствует имени типа линии "Continuous".
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsRegAppAcadName(String)
Метод позволяет проверить, соответствует ли входная строка имени зарегистрированного приложения "ACAD".
name: Проверяемое имя. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если строка <c>name</c> соответствует имени имени RegApp-объекта "ACAD".
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsTextStyleStandardName(String)
Метод позволяет проверить, соответствует ли входная строка имени стиля текста "Standard".
name: Проверяемое имя. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если входная строка <c>name</c> соответствует имени стиля текста "Standard".
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.IsViewportActiveName(String)
Метод позволяет проверить, соответствует ли входная строка активному имени видового экрана "*Active".
name: Проверяемое имя. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если входная строка <c>name</c> соответствует активному имени видового экрана "*Active".
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.SymbolUtilityServices.MakeDependentName(String,String)
Метод позволяет объединить указанные имя чертежа и имя символа, чтобы получить зависимое имя символа.
dwgName: Имя чертежа. Тип <c>String</c>.
symbolName: Имя символа. Тип <c>String</c>.
Returns: Возвращает строку, которая представляет объединение имён параметров <c>name</c> и <c>symbolName</c>.
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.PreValidateSymbolName(String,System.Boolean)
Метод выполняет предварительную подготовку строки к последующей проверке на соответствие наименованию символа.
symbolName: Наименование символа. Тип <c>String</c>.
preserveCase: Флаг, определяющий, следует ли сохранять регистр алфавитных знаков в строке. Тип <c>bool</c>.
Returns: Возвращает строку, прошедшую предварительную подготовку. Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.RepairPreExtendedSymbolName(String,System.Boolean)
Метод предоставляет строку, являющуюся результатом "восстановления" входной строки для приведения её к виду, когда строка содержит только допустимые символы в соответствии с устаревшими требованиями к именам символов.
oldName: Исходное имя символа, подлежащее восстановлению. Тип <c>String</c>.
allowVerticalBar: Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип <c>bool</c>.
Returns: Возвращает восстановленное имя символа.
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.RepairSymbolName(String,System.Boolean)
Метод обеспечивает "восстановление" входной строки - приведение её к виду, когда она гарантированно содержит только допустимые символы в соответствии с требованиями к расширенным именам символов.
oldName: Исходное имя символа, подлежащее восстановлению. Тип <c>String</c>.
allowVerticalBar: Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип <c>bool</c>.
Returns: Возвращает восстановленное имя символа.
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.ValidateCompatibleSymbolName(String,System.Boolean,System.Boolean,System.Boolean)
Метод позволяет проверить, удовлетворяет ли заданная строка требованиям, предъявляемым к имени символа (в частности, приемлема ли её длина).
name: Проверяемое имя. Тип <c>String</c>.
isNewName: Флаг, определяющий, следует ли рассматривать <c>name</c> как имя нового символа или как имя уже существующего. Тип <c>bool</c>.
allowVerticalBar: Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип <c>bool</c>.
compatibilityMode: Флаг, определяющий, должно ли входное имя <c>name</c> проверяться на соответствие расширенным или устаревшим правилам. Тип <c>bool</c>.
Returns: Возвращает <c>ErrorStatus.OK</c>, если проверка прошла успешно, или соответствующий код ошибки в противном случае.
Тип <c>ErrorStatus</c>.

Teigha.DatabaseServices.SymbolUtilityServices.ValidatePreExtendedSymbolName(String,System.Boolean)
Метод реализует проверку указанного имени на соответствие устаревшим требованиям к именам символов.
name: Проверяемое входное имя. Тип <c>String</c>.
allowVerticalBar: Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип <c>bool</c>.

Teigha.DatabaseServices.SymbolUtilityServices.ValidateSymbolName(String,System.Boolean)
Метод реализует проверку указанного имени на соответствие требованиям к расширенным именам символов.
name: Проверяемое входное имя. Тип <c>String</c>.
allowVerticalBar: Флаг, определяющий, допускается ли в имени символа знак вертикальной черты ("|"). Тип <c>bool</c>.

Teigha.DatabaseServices.SymbolUtilityServices.BlockModelSpaceName
Свойство <c>BlockModelSpaceName</c> представляет предопределенную запись символа для имени пространства модели.
Returns: Возвращает предопределенное имя пространства модели.
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.BlockPaperSpaceName
Свойство <c>BlockPaperSpaceName</c> представляет предопределенную запись символа для имени пространства листа.
Returns: Возвращает предопределенное имя пространства листа.
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.LayerDefpointsName
Свойство <c>LayerDefpointsName</c> представляет предопределенную запись символа для имени слоя "Defpoints".
Returns: Возвращает предопределенное имя слоя "Defpoints".
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.LayerZeroName
Свойство <c>LayerZeroName</c> представляет предопределенную запись символа для имени слоя "0".
Returns: Возвращает предопределенное имя слоя "0".
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.LinetypeByBlockName
Свойство <c>LinetypeByBlockName</c> представляет предопределенную запись символа для имени типа линий "ByBlock".
Returns: Возвращает предопределенное имя типа линий "ByBlock".
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.LinetypeByLayerName
Свойство <c>LinetypeByLayerName</c> представляет предопределенную запись символа для имени типа линий "ByLayer".
Returns: Возвращает предопределенное имя типа линий "ByLayer".
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.LinetypeContinuousName
Свойство <c>LinetypeContinuousName</c> представляет предопределенную запись символа для имени типа линий "Continuous".
Returns: Возвращает предопределенное имя типа линий "Continuous".
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.RegAppAcadName
Свойство <c>RegAppAcadName</c> представляет предопределенную запись символа для имени зарегистрированного приложения.
Returns: Возвращает имя зарегистрированного приложения.
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.TextStyleStandardName
Свойство <c>TextStyleStandardName</c> представляет предопределенную запись символа для имени текстового стиля "STANDARD".
Returns: Возвращает предопределенное имя текстового стиля "STANDARD"
Тип <c>String</c>.

Teigha.DatabaseServices.SymbolUtilityServices.ViewportActiveName
Свойство <c>ViewportActiveName</c> представляет предопределенную запись символа для активного имени видового экрана.
Returns: Возвращает активное имя видового экрана.
Тип <c>String</c>.