Teigha.Geometry.Matrix3dBuilder
Класс <c>Matrix3dBuilder</c> используется для создания экземпляров класса <c>Teigha.Geometry.Matrix3d</c>, который является неизменяемым типом.

Teigha.Geometry.Matrix3dBuilder.#ctor
Конструктор по умолчанию класса <c>Matrix3dBuilder</c>.

Teigha.Geometry.Matrix3dBuilder.#ctor(Teigha.Geometry.Matrix3d)
Конструктор класса <c>Matrix3dBuilder</c>.
Создает новый экземпляр класса на основе указанной матрицы.
value: Входная матрица, на основе которой создается новый экземпляр класса. Тип <c>Matrix3d</c>.

Teigha.Geometry.Matrix3dBuilder.ToMatrix3d
Метод предоставляет трехмерную матрицу, связанную с данным объектом.
Returns: Возвращает матрицу, связанную с данным объектом.
Тип <c>Matrix3d</c>.

Teigha.Geometry.Matrix3dBuilder.ElementAt
Свойство <c>ElementAt</c> представляет элемент матрицы с указанными индексами строки и столбца.
i: Индекс строки.  Тип <c>int</c>.
j: Индекс столбца. Тип <c>int</c>.
Returns: Возвращает элемент матрицы с указанными индексами строки и столбца.
Тип <c>double</c>.