Teigha.DatabaseServices.Xline
Класс Xline представляет в nanoCAD тип объекта XLINE.  Объект Xline — это линия, бесконечная в обоих направлениях.

Teigha.DatabaseServices.Xline.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.Xline.#ctor(IntPtr,System.Boolean)
Конструктор.
unmanagedObjPtr: Указатель на объект, тип IntPtr.
autoDelete: Флаг удаления объекта, тип bool.

Teigha.DatabaseServices.Xline.basePoint
Свойство BasePoint обеспечивает доступ к базовой точке данного объекта Xline.
Returns: Возвращает или задает базовую точку данного объекта Xline. Тип Point3d.

Teigha.DatabaseServices.Xline.SecondPoint
Свойство SecondPoint обеспечивает доступ ко второй опорной точке, через которую проходит объект Xline.
Returns: Возвращает или задает вторую опорную точку данного объекта Xline. Тип Point3d.

Teigha.DatabaseServices.Xline.UnitDir
Свойство UnitDir обеспечивает доступ к направляющему единичному вектору объекта Xline.
Returns: Возвращает или задает направляющий единичный вектор данного объекта Xline. Тип Vector3d.