HostMgd.EditorInput.PromptKeywordOptionsEventArgs
Класс, обеспечивающий данными событие PromptingForKeyword
класса Editor.

HostMgd.EditorInput.PromptKeywordOptionsEventArgs.Options
Возвращает входные параметры приглашения.