Teigha.DatabaseServices.GraphNodeCollection
Этот класс представляет коллекцию узлов графа.

Teigha.DatabaseServices.GraphNodeCollection.#ctor
Конструктор по умолчанию класса GraphNodeCollection.

Teigha.DatabaseServices.GraphNodeCollection.Add(Teigha.DatabaseServices.GraphNode)
Метод позволяет добавить в коллекцию новый элемент.
value: Добавляемый в коллекцию узел графа. Тип <c>GraphNode</c>.
Returns: Возвращает индекс нового элемента коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.GraphNodeCollection.Clear
Метод предназначен для удаления из коллекции всех объектов.

Teigha.DatabaseServices.GraphNodeCollection.Contains(Teigha.DatabaseServices.GraphNode)
Метод позволяет проверить, содержит ли коллекция элемент, соответствующий указанному объекту.
value: Искомый объект. Тип <c>GraphNode</c>.
Returns: Возвращает <c>true</c>, если объект <c>value</c> содержится в коллекции.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GraphNodeCollection.CopyTo(array&lt;GraphNode&gt;,int  )
Метод предназначен для копирования объектов из массива в данную коллекцию, начиная с указанного индекса.
arr: Входной массив узлов. Тип <c>GraphNode[]</c>.
index: Индекс элемента массива, с которого начинается копирование элементов массива в коллекцию. Тип <c>int</c>.

Teigha.DatabaseServices.GraphNodeCollection.GetEnumerator
Метод предоставляет объект перечислителя для данной коллекции.
Returns: Возвращает перечислитель. Тип <c>Collections.IEnumerator</c>.

Teigha.DatabaseServices.GraphNodeCollection.IndexOf(Teigha.DatabaseServices.GraphNode)
Метод позволяет получить индекс элемента коллекции, который соответствует указанному объекту <c>GraphNode</c>.
value: Объект типа <c>GraphNode</c>, для которого предполагается найти индекс.
Returns: Возвращает индекс элемента коллекции, если объект <c>value</c> найден. В противном случае возвращает -1.
Тип <c>int</c>. Индексирование элементов коллекции начинается с нуля.

Teigha.DatabaseServices.GraphNodeCollection.Insert(System.Int32,Teigha.DatabaseServices.GraphNode)
Метод позволяет вставить указанный объект <c>GraphNode</c> в эту коллекцию по заданному индексу.
index: Индекс, по которому вставляется объект <c>value</c>. Тип <c>int</c>.
value: Вставляемый в коллекцию объект. Тип <c>GraphNode</c>.

Teigha.DatabaseServices.GraphNodeCollection.Remove(Teigha.DatabaseServices.GraphNode)
Метод удаляет из коллекции элемент, соответствующий входному объекту <c>GraphNode</c>.
value: Удаляемый из коллекции элемент. Тип <c>GraphNode</c>.

Teigha.DatabaseServices.GraphNodeCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции элемент по указанному индексу.
index: Индекс удаляемого элемента коллекции. Тип <c>int</c>.

Teigha.DatabaseServices.GraphNodeCollection.Item
Свойство предоставляет доступ к элементу коллекции по его индексу.
Returns: Возвращает элемент коллекции. Тип <c>GraphNode</c>.

Teigha.DatabaseServices.GraphNodeCollection.Count
Свойство возвращает текущее количество элементов в коллекции.
Returns: Возвращает количество элементов в коллекции. Тип <c>int</c>.