Teigha.BoundaryRepresentation.Mesh2dFilter
Класс <c>Mesh2dFilter</c> представляет интерфейсный класс для фильтров 2D-сети.

Teigha.BoundaryRepresentation.Mesh2dFilter.#ctor
Конструктор по умолчанию класса <c>Mesh2dFilter</c>.

Teigha.BoundaryRepresentation.Mesh2dFilter.Insert(Teigha.BoundaryRepresentation.BrepEntity,Teigha.BoundaryRepresentation.Mesh2dControl)
Метод позволяет связать указанный элемент управления 2D-сетью с заданным топологическим объектом BREP.
brepEntity: Входной топологический BREP-объект, с которым связывается объект <c>meshControl</c>.  Тип <c>BrepEntity</c>.
meshControl: Входной элемент управления 2D-сети.  Тип <c>Mesh2dControl</c>.