Teigha.Geometry.CubicSplineCurve2d
Класс <c>CubicSplineCurve2d</c> представляет интерполяционный кубический сплайн в двумерном пространстве.

Teigha.Geometry.CubicSplineCurve2d.#ctor
Конструктор по умолчанию класса <c>CubicSplineCurve2d</c>.
Инициализирует кубический сплайн с пустым списком точек.

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.Curve2d,System.Double)
Конструктор класса <c>CubicSplineCurve2d</c>.
Создает кубический сплайн, интерполирующий переданную кривую с заданной точностью интерполяции.
curve: Кривая, для которой следует создать интерполирующий ее двумерный кубический сплайн.  Тип <c>Curve2d</c>.
epsilon: Заданная точность интерполяции.  Тип <c>double</c>.

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2dCollection,System.Boolean)
Конструктор класса <c>CubicSplineCurve2d</c>.
Создает экземпляр класса с указанными определяющими точками, узловым вектором и первыми производными в определяющих точках.
knots: Входной узловой вектор. Тип <c>KnotCollection</c>.
fitPoints: Входная коллекция определяющих точек. Тип <c>Point2dCollection</c>.
firstDerivatives: Входная коллекция векторов первых производных. Тип <c>Vector2dCollection</c>.
periodic: Флаг, указывающий, что сплайн должен быть периодическим (замкнутым). Тип <c>bool</c>.

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.Point2dCollection)
Конструктор класса <c>CubicSplineCurve2d</c>.
Создает интерполяционный кубический сплайн, проходящий через указанные определяющие точки.
fitPoints: Входной массив определяющих точек сплайна. Тип <c>Point2dCollection</c>.

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Tolerance)
Конструктор класса <c>CubicSplineCurve2d</c>.
Создает интерполяционный кубический сплайн, проходящий с заданной точностью через указанные определяющие точки.
fitPoints: Входной массив определяющих точек сплайна. Тип <c>Point2dCollection</c>.
tolerance: Заданная точность интерполяции. Тип <c>Tolerance</c>.

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Конструктор класса <c>CubicSplineCurve2d</c>.
Создает интерполяционный кубический сплайн, проходящий через заданные определяющие точки, с указанными векторами первых производных в начале и в конце сплайна.
fitPoints: Входной массив определяющих точек сплайна. Тип <c>Point2dCollection</c>.
startDerivative: Первая производная в начальной точке. Тип <c>Vector2d</c>.
endDerivative: Первая производная в конечной точке.  Тип <c>Vector2d</c>.

Teigha.Geometry.CubicSplineCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Tolerance)
Конструктор класса <c>CubicSplineCurve2d</c>.
Создает интерполяционный кубический сплайн, проходящий предписанной точностью через заданные определяющие точки, с указанными векторами первых производных в начале и в конце сплайна.
fitPoints: Входной массив определяющих точек сплайна. Тип <c>Point2dCollection</c>.
startDerivative: Первая производная в начальной точке. Тип <c>Vector2d</c>.
endDerivative: Первая производная в конечной точке.  Тип <c>Vector2d</c>.
tolerance: Заданная точность интерполяции. Тип <c>Tolerance</c>.

Teigha.Geometry.CubicSplineCurve2d.Create(IntPtr,System.Boolean)
Метод создает объект <c>CubicSplineCurve2d</c> на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, из которого создается данный объект.  Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный двумерный кубический сплайн.  Тип <c>CubicSplineCurve2d</c>.

Teigha.Geometry.CubicSplineCurve2d.GetFirstDerivativeAt(System.Int32)
Метод позволяет получить вектор первой производной в определяющей точке этого сплайна с заданным индексом.
index: Индекс определяющей точки, в которой требуется вычислить вектор первой производной.
Returns: Возвращает вектор первой производной в указанной определяющей точке сплайна.
Тип <c>Vector2d</c>.

Teigha.Geometry.CubicSplineCurve2d.GetFitPointAt(System.Int32)
Метод позволяет получить определяющую точку этого сплайна с заданным индексом.
index: Индекс искомой определяющей точки данного сплайна.  Тип <c>int</c>.
Returns: Возвращает определяющую точку сплайна с индексом <c>index</c>.  Тип <c>Point2d</c>.

Teigha.Geometry.CubicSplineCurve2d.SetFirstDerivativeAt(System.Int32,Teigha.Geometry.Vector2d)
Метод позволяет переопределить вектор первой производной в определяющей точке с указанным индексом.
index: Индекс определяющей точки.  Тип <c>int</c>.
derivative: Новый вектор первой производной в указанной определяющей точке.  Тип <c>Vector2d</c>.

Teigha.Geometry.CubicSplineCurve2d.SetFitPointAt(System.Int32,Teigha.Geometry.Point2d)
Метод позволяет переопределить в этом сплайне определяющую точку с указанным индексом.
index: Индекс определяющей точки.  Тип <c>int</c>.
point: Новые координаты определяющей точки с индексом <c>index</c>. Тип <c>Point2d</c>.

Teigha.Geometry.CubicSplineCurve2d.NumFitPoints
Свойство <c>NumFitPoints</c> представляет количество определяющих точек данного сплайна.
Returns: Возвращает количество определяющих точек сплайна. Тип <c>int</c>.