Teigha.Runtime.Overrule
Класс Overrule — это базовый класс для реализации объектных переопределений.

Teigha.Runtime.Overrule.AddOverrule(Teigha.Runtime.RXClass,Teigha.Runtime.Overrule,System.Boolean)
Метод регистрирует объект для данного класса, который надлежит переопределить.
targetClass: Целевой класс, к которому применяется переопределение. Тип RXClass.
overrule: Объектное переопределение. Тип Overrule.
bAtLast: Флаг, который определяет, следует ли добавлять пару в конец коллекции переопределений.  Значение по умолчанию - false. Тип bool.

Teigha.Runtime.Overrule.HasOverrule(Teigha.Runtime.RXObject,Teigha.Runtime.RXClass)
Метод позволяет проверить, поддерживает ли указанное переопределение данный объект.
overruledSubject: Переопределяемый объект. Тип RXObject.
targetClass: Целевой класс, к которому применяется переопределение. Тип RXClass.
Returns: Возвращает true, если объект overruledSubject должен обрабатываться переопределением.
В противном случае возвращает false.

Teigha.Runtime.Overrule.RemoveOverrule(Teigha.Runtime.RXClass,Teigha.Runtime.Overrule)
Метод отменяет регистрацию объектного переопределения для данного класса.
targetClass: Целевой класс, к которому применяется переопределение. Тип RXClass.
overrule: Объектное переопределение. Тип Overrule.

Teigha.Runtime.Overrule.IsApplicable(Teigha.Runtime.RXObject)
Метод позволяет определить, применимо ли объектное переопределение.
overruledSubject: Переопределяемый объект. Тип RXObject.
Returns: Если переопределение применимо, возвращает true. В противном случае возвращает false.

Teigha.Runtime.Overrule.SetCustomFilter
Этот метод включает использование метода IsApplicable, чтобы устанавливать применимость объектного переопределения.

Teigha.Runtime.Overrule.SetExtensionDictionaryEntryFilter(String)
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
entryName: Имя записи в словаре расширений. Тип String.

Teigha.Runtime.Overrule.SetIdFilter(array&lt;DatabaseServices.ObjectId&gt;)
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
ids: Входной массив идентификаторов объектов.  Тип ObjectId[].

Teigha.Runtime.Overrule.SetNoFilter
Метод отключает все методы предварительной фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метод IsApplicable, перед применением объектных переопределений.

Teigha.Runtime.Overrule.SetXDataFilter(String)
Метод включает использование расширенных данных в условии применимости объектного переопределения.
registeredApplicationName: Имя зарегистрированного приложения. Тип String.

Teigha.Runtime.Overrule.Overruling
Свойство позволяет включить или отключить механизм объектного переопределения.
Returns: Возвращает true, если механизм объектного переопределения включен.  В противном случае возвращает false.