Teigha.Geometry.BoundBlock2d
Класс <c>BoundBlock2d</c> реализует двумерную граничную рамку геометрического объекта.

Teigha.Geometry.BoundBlock2d.#ctor
Конструктор по умолчанию класса <c>BoundBlock2d</c>.
Создает граничную рамку с минимальной и максимальной точками в начале системы координат.

Teigha.Geometry.BoundBlock2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса <c>BoundBlock2d</c>.
Создает прямоугольную граничную рамку, ориентированную по осям системы координат, с указанными минимальной и максимальной точками.
point1: Входная минимальная  точка прямоугольной рамки.  Тип <c>Point2d</c>.
point2: Входная максимальная точка прямоугольной рамки.  Тип <c>Point2d</c>.

Teigha.Geometry.BoundBlock2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Конструктор класса <c>BoundBlock2d</c>.
Создает граничную рамку в виде параллелограмма с заданными базовой точкой и сторонами.
basePoint: Базовая точка параллелограмма.  Тип <c>Point2d</c>.
direction1: Вектор, определяющий направление и длину первой стороны параллелограмма.  Тип <c>Vector2d</c>.
direction2: Вектор, определяющий направление и длину второй стороны параллелограмма.  Тип <c>Vector2d</c>.

Teigha.Geometry.BoundBlock2d.Contains(Teigha.Geometry.Point2d)
Метод позволяет проверить, содержит ли данная граничная рамка указанную точку.
point: Входная 2D-точка.
Returns: Возвращает <c>true</c>, если  и только если указанная точка находится в пределах граничной рамки.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.BoundBlock2d.Create(IntPtr,System.Boolean)
Метод создает объект <c>BoundBlock2d</c> на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект, на основе которого создается новый объект.  Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает новый объект типа <c>BoundBlock2d</c>.

Teigha.Geometry.BoundBlock2d.Extend(Teigha.Geometry.Point2d)
Метод изменяет размеры граничной рамки так, чтобы она включала указанную точку.
point: Входная точка, которая должна находиться в пределах граничной рамки.  Тип <c>Point2d</c>.

Teigha.Geometry.BoundBlock2d.GetMaximumPoint
Метод предоставляет максимальную точку данной граничной рамки.
Returns: Возвращает экземпляр класса <c>Point2d</c>, который представляет максимальную точку граничной рамки.

Teigha.Geometry.BoundBlock2d.GetMinimumPoint
Метод предоставляет минимальную точку данной граничной рамки.
Returns: Возвращает экземпляр класса <c>Point2d</c>, который представляет минимальную точку граничной рамки.

Teigha.Geometry.BoundBlock2d.IsDisjoint(Teigha.Geometry.BoundBlock2d)
Метод позволяет проверить, пересекается ли данная граничная рамка с указанной граничной рамкой.
block: Входная граничная рамка, пересечение с которой требуется проверить.
Returns: Возвращает <c>true</c> тогда и только тогда, когда указанная граничная рамка не пересекается с данной.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.BoundBlock2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод позволяет задать минимальную и максимальную точки данной граничной рамки.
firstPoint: Новая минимальная  точка граничной рамки.  Тип <c>Point2d</c>.
secondPoint: Новая максимальная точка граничной рамки.  Тип <c>Point2d</c>.

Teigha.Geometry.BoundBlock2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Метод позволяет задать базовую точку и стороны граничной рамки с геометрией в виде параллелограмма.
basePoint: Входная базовая точка граничной рамки. Тип <c>Point2d</c>.
direction1: Первая сторона параллелограмма. Тип <c>Vector2d</c>.
direction2: Вторая сторона параллелограмма. Тип <c>Vector2d</c>.

Teigha.Geometry.BoundBlock2d.Swell(System.Double)
Метод раздвигает стороны данной граничной рамки на указанное расстояние.
distance: Величина смещения сторон граничной рамки.  Тип <c>double</c>.

Teigha.Geometry.BoundBlock2d.BasePoint
Свойство <c>BasePoint</c> представляет базовую вершину данной граничной рамки.
Returns: Возвращает базовую точку данной граничной рамки.
Тип <c>Point2d</c>.

Teigha.Geometry.BoundBlock2d.Direction1
Свойство <c>Direction1</c> представляет направление и длину первой стороны данной граничной рамки.
Returns: Возвращает вектор, определяющий первую сторону граничной рамки.
Тип <c>Vector2d</c>.

Teigha.Geometry.BoundBlock2d.Direction2
Свойство <c>Direction2</c> представляет направление и длину второй стороны данной граничной рамки.
Returns: Возвращает вектор, определяющий вторую сторону граничной рамки.
Тип <c>Vector2d</c>.

Teigha.Geometry.BoundBlock2d.IsBox
Свойство <c>IsBox</c> позволяет проверить, представлена ли граничная рамка прямоугольником, который ориентирован вдоль осей системы координат.
Returns: Возвращает <c>true</c>, если граничная рамка представлена прямоугольником, который ориентирован по осям системы координат.
В противном случае возвращает <c>false</c>.