Teigha.GraphicsInterface.ViewportDraw
Класс предназначен для получения характеристик текущего видового экрана.

Teigha.GraphicsInterface.ViewportDraw.IsValidId(IntPtr)
Метод позволяет установить, существует ли видовой экран с указанным идентификатором.
id: Входной идентификатор видового экрана. Тип IntPtr.
Returns: Возвращает значение true, если видовой экран с указанным id в данный момент существует.
В противном случае возвращает false.

Teigha.GraphicsInterface.ViewportDraw.Geometry
Свойство предоставляет доступ к геометрии пользователя (полилинии, дуги, сети и т.д.).
Returns: Возвращает объект ViewportGeometry.

Teigha.GraphicsInterface.ViewportDraw.SequenceNumber
Свойство предоставляет доступ к количеству видовых экранов, удаленных к данному моменту за время сеанса редактирования текущего чертежа.
Returns: Возвращает количество удаленных видовых экранов. Тип Int32.

Teigha.GraphicsInterface.ViewportDraw.Viewport
Свойство предоставляет доступ к объекту Viewport, используемому объектом ViewportDraw.
Объект Viewport содержит информацию, специфичную для текущего видового экрана, в котором выполняется отрисовка геометрии.
Returns: Возвращает объект Viewport, который используется объектом ViewportDraw.  Тип GraphicsInterface.Viewport.

Teigha.GraphicsInterface.ViewportDraw.ViewportObjectId
Свойство предоставляет доступ к идентификатору объекта Viewport, в котором в данный момент осуществляется отрисовка геометрии.
Returns: Возвращает идентификатору текущего объекта Viewport. Тип DatabaseServices.ObjectId.