HostMgd.EditorInput.PromptDoubleResult
Класс, содержащий результаты ввода вещественного числа после
приглашения.

HostMgd.EditorInput.PromptDoubleResult.ToString(IFormatProvider)
Возвращает строку, соответствующую введенному вещественному
числу в соответствии с заданным форматом, зависящим от
локализации.
provider: Формат, зависящий от локализации

HostMgd.EditorInput.PromptDoubleResult.Value
Возвращает или задает значение вещественного числа,
введенного пользователем.