Teigha.DatabaseServices.ResultBufferEnumerator
Класс <c>ResultBufferEnumerator</c> представляет перечислитель для класса <c>ResultBuffer</c>.

Teigha.DatabaseServices.ResultBufferEnumerator.MoveNext
Метод предназначен для перехода перечислителя к следующему типизированному значению в результирующем буфере.
Returns: Возвращает <c>true</c>, если индекс типизированного значения не вышел за пределы результирующего буфера.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.ResultBufferEnumerator.Reset
Метод реинициализирует данный перечислитель, устанавливая его указатель на первый элемент результирующего буфера.

Teigha.DatabaseServices.ResultBufferEnumerator.Current
Свойство <c>Current</c> представляет текущее типизированное значение данного перечислителя.
Returns: Возвращает текущее типизированное значение. Тип <c>TypedValue</c>.