Teigha.DatabaseServices.UnderlayItem
Класс <c>UnderlayItem</c> реализуется хост-приложениями, которым требуется поддержка подложек.

Teigha.DatabaseServices.UnderlayItem.Extents
Свойство <c>Extents</c> представляет габаритную рамку данного элемента в координатах модели элемента.
Returns: Возвращает габаритную рамку элемента.
Тип <c>Extents2d</c>.

Teigha.DatabaseServices.UnderlayItem.Name
Свойство <c>Name</c> представляет уникальное имя данного элемента в файле.
Returns: Возвращает уникальное имя элемента.
Тип <c>String</c>.

Teigha.DatabaseServices.UnderlayItem.Thumbnail
Свойство <c>Thumbnail</c> представляет изображение предварительного просмотра данного элемента.
Returns: Возвращает изображение предварительного просмотра элемента.
Тип <c>Bitmap</c>.

Teigha.DatabaseServices.UnderlayItem.Units
Свойство <c>Units</c> представляет единицы измерения, используемые данным элементом.
Returns: Возвращает единицы измерения, используемые элементом. Перечисление <c>UnitsValue</c>.

Teigha.DatabaseServices.UnderlayItem.UsingPartialContent
Свойство <c>UsingPartialContent</c> позволяет определить, использует ли данный элемент только часть содержимого листа/модели, представленного элементом.
Returns: Возвращает <c>true</c>, если элемент использует лишь часть содержимого листа/модели.
В противном случае возвращает <c>false</c>.