Teigha.DatabaseServices.BulgeVertexCollection
Класс представляет коллекцию объектов BulgeVertex.

Teigha.DatabaseServices.BulgeVertexCollection.#ctor
Констрктор по умолчанию класса BulgeVertexCollection.

Teigha.DatabaseServices.BulgeVertexCollection.Add(Teigha.DatabaseServices.BulgeVertex)
Метод добавляет объект BulgeVertex в данную коллекцию.
value: Добавляемый в коллекцию объект. Тип BulgeVertex.
Returns: Возвращает отсчитываемый от нуля индекс вновь добавленного элемента коллекции.

Teigha.DatabaseServices.BulgeVertexCollection.Contains(Teigha.DatabaseServices.BulgeVertex)
Метод проверяет, содержится ли в данной коллекции указанный объект BulgeVertex.
value: Искомый объект. Тип BulgeVertex.
Returns: Возвращает <c>true</c>, если искомый объект найден в коллекции.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.BulgeVertexCollection.CopyTo(array&lt;BulgeVertex&gt;,System.Int32)
Метод копирует эту коллекцию объектов BulgeVertex в заданный массив по указанному индексу.
array: Массив, в который следует скопировать элементы данной коллекции. Тип BulgeVertex[].
index: Индекс, начиная с которого вставляются в массив элементы коллекции.

Teigha.DatabaseServices.BulgeVertexCollection.IndexOf(Teigha.DatabaseServices.BulgeVertex)
Метод возвращает индекс элемента данной коллекции, соответствующий указанному объекту BulgeVertex.
value: Искомый объект типа BulgeVertex.
Returns: Возвращает индекс элемента данной коллекции, который соответствует аргументу value.
Если элемент отсутствует, возвращает -1.

Teigha.DatabaseServices.BulgeVertexCollection.Insert(System.Int32,Teigha.DatabaseServices.BulgeVertex)
Метод вставляет в коллекцию указанный объект BulgeVertex по указанному индексу.
index: Индекс для нового элемента коллекции. Тип int.
value: Вставляемый объект. Тип BulgeVertex.

Teigha.DatabaseServices.BulgeVertexCollection.Remove(Teigha.DatabaseServices.BulgeVertex)
Метод удаляет из коллекции элемент, соответствующий указанному объекту BulgeVertex.
value: Объект типа BulgeVertex, который должен быть удален из коллекции.

Teigha.DatabaseServices.BulgeVertexCollection.Item
Свойство возвращает элемент коллекции c указанным индексом.
Returns: Возвращает элемент коллекции по его индексу. Тип BulgeVertex.
Если индекс окажется за пределами допустимого диапазона, выбросит исключение "Индекс вне диапазона".