Teigha.Geometry.Entity2d
Класс <c>Entity2d</c> служит базовым классом для всех двумерных геометрических объектов.

Teigha.Geometry.Entity2d.Clone
Метод предназначен для создания полной копии данного объекта.
Returns: Возвращает новый объект, являющийся полной копией данного объекта.
Тип <c>Object</c>.

Teigha.Geometry.Entity2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>Entity2d</c>.

Teigha.Geometry.Entity2d.IsEqualTo(Teigha.Geometry.Entity2d)
Метод позволяет проверить равен ли данный объект указанному объекту.
Используется точность по умолчанию.
entity: Входной объект, с которым выполняется сравнение. Тип <c>Entity2d</c>.
Returns: Возвращает <c>true</c> в случае равенства объектов, т.е. оба объекта имеют один тип, совпадающие наборы точек в пределах указанной точности и одинаковую параметризацию.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.Entity2d.IsEqualTo(Teigha.Geometry.Entity2d,Teigha.Geometry.Tolerance)
Метод проверяет данный объект на равенство указанному объекту с использованием заданной геометрической точности.
entity: Входной объект, с которым выполняется сравнение. Тип <c>Entity2d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c> в случае равенства объектов, т.е. оба объекта имеют один тип, совпадающие наборы точек в пределах указанной точности и одинаковую параметризацию.  В противном случае возвращает <c>false</c>.

Teigha.Geometry.Entity2d.IsOn(Teigha.Geometry.Point2d)
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Используется геометрическая точность по умолчанию.
point: Проверяемая точка. Тип <c>Point2d</c>.
Returns: Возвращает <c>true</c>, если в рамках используемой точности точка <c>point</c> лежит на данном объекте.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Entity2d.IsOn(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, лежит ли указанная точка на данном объекте.
Используется заданная геометрическая точность.
point: Проверяемая точка. Тип <c>Point2d</c>.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если в рамках используемой точности точка <c>point</c> лежит на данном объекте.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Entity2d.Mirror(Teigha.Geometry.Line2d)
Метод выполняет зеркальное отображение данного объекта относительно указанной 2D-линии.
line: Ось зеркального отображения. Тип <c>Line2d</c>.

Teigha.Geometry.Entity2d.RotateBy(System.Double,Teigha.Geometry.Point2d)
Метод предназначен для вращения данного объекта вокруг указанной точки на заданный угол.
angle: Угол поворота.  Тип <c>double</c>.
point: Центр вращения. Тип <c>Point2d</c>.

Teigha.Geometry.Entity2d.ScaleBy(System.Double,Teigha.Geometry.Point2d)
Метод позволяет изменить масштаб данного объекта на заданную величину относительно указанной точки.
scaleFactor: Коэффициент масштабирования объекта. Тип <c>double</c>.
point: Точка, относительно которой выполняется масштабирование объекта. Тип <c>Point2d</c>.

Teigha.Geometry.Entity2d.TransformBy(Teigha.Geometry.Matrix2d)
Метод применяет к данному объекту указанное двумерное геометрическое преобразование.
transform: Матрица двумерного геометрического преобразования. Тип <c>Matrix2d</c>.

Teigha.Geometry.Entity2d.TranslateBy(Teigha.Geometry.Vector2d)
Метод выполняет трансляцию данного объекта на заданный двумерный вектор.
translateVector: Вектор, определяющий операцию 2D-трансляции. Тип <c>Vector2d</c>.