Teigha.GraphicsSystem.ViewEventArgs
Класс <c>ViewEventArgs</c> представляет аргументы для различных событий объектов <c>View</c>.

Teigha.GraphicsSystem.ViewEventArgs.View
Свойство <c>View</c> представляет объект вида <c>View</c>, с которым ассоциирован данный объект.
Returns: Возвращает объект вида. Тип <c>GraphicsSystem.View</c>.