Teigha.DatabaseServices.LayerStateManager
Класс LayerStateManager используется для доступа и управления состояниями индивидуального слоя, связанными с базой данных чертежа.

Teigha.DatabaseServices.LayerStateManager.#ctor(Teigha.DatabaseServices.Database)
Конструктор класса LayerStateManager, использует базу данных, которую связывает с новым экземпляром менеджера состояния слоя.
database: База данных, связываемая с новым экземпляром LayerStateManager, тип Database.

Teigha.DatabaseServices.LayerStateManager.CompareLayerStateToDb(String,DatabaseServices.ObjectId)
Сравнивает значения слоя, сохраненные в состоянии слоя, со значениями текущего слоя в чертеже.
name: Имя состояния слоя, которое необходимо сравнить с состоянием слоя в чертеже, тип String.
idVp: Идентификатор ObjectId видового экрана, настройки VPLAYER которого должны использоваться при сравнении.
Returns: Возвращает true, если состояние слоя соответствует состоянию слоя в чертеже, и false в противном случае.

Teigha.DatabaseServices.LayerStateManager.DeleteLayerState(String)
Удаляет указанное состояние слоя.
name: Имя состояния слоя, которое подлежит удалению. Тип String.

Teigha.DatabaseServices.LayerStateManager.ExportLayerState(String,String)
Метод ExportLayerState() получает имя состояния слоя и экспортирует соответствующее состояние слоя в указанный файл.
nameToExport: Имя состояния слоя, тип String. Концом строки считается первый встретившийся нуль-символ.
fileName: Имя файла, в который экспортируется состояние слоя. Тип String.

Teigha.DatabaseServices.LayerStateManager.GetLayerStateDescription(String)
Извлекает описание, заданное методом SetLayerStateDescription().
name: Имя состояния слоя, описание которого необходимо получить, тип String.
Returns: Возвращает строку с именем состояния слоя.

Teigha.DatabaseServices.LayerStateManager.GetLayerStateLayers(String,System.Boolean)
Возвращает массив с именами всех слоев, сохраненных в состоянии слоя.
Если bInvert равно true, массив будет содержать имена слоев в текущем чертеже, которые НЕ сохранены в состоянии слоя.
name: Имя состояния слоя, для которого выполняется запрос, тип String.
bInvert: Если данному аргументу задано значение true, возвращаемый массив будет содержать имена слоев в текущем чертеже, которые НЕ сохранены в состоянии слоя. Тип bool.
Returns: Тип результата - ArrayList.

Teigha.DatabaseServices.LayerStateManager.GetLayerStateMask(String)
Возвращает маску для именованного состояния слоя.
name: Имя состояния слоя, тип String.
Returns: Возвращаемый тип - LayerStateMasks.

Teigha.DatabaseServices.LayerStateManager.GetLayerStateNames(System.Boolean,System.Boolean)
Возвращает массив с именами всех состояний слоя.
bIncludeHidden: Задать true, чтобы включить в массив имена скрытых состояний слоя. Тип bool.
bIncludeXref: Задать true для включения XRefs. Тип bool.
Returns: Возвращает массив типа ArrayList с именами всех состояний слоя.

Teigha.DatabaseServices.LayerStateManager.HasLayerState(String)
Возвращает true, если указанное имя состояния слоя существует. В противном случае возвращает false.
name: Имя состояния слоя, String.
Returns: Возвращает true, если указанное имя состояния слоя существует. В противном случае возвращает false.

Teigha.DatabaseServices.LayerStateManager.ImportLayerState(String)
Метод ImportLayerState() импортирует в чертеж состояния слоя из указанного файла импорта.
fileName: Имя файла для импорта состояний слоя, String.

Teigha.DatabaseServices.LayerStateManager.ImportLayerStateFromDb(String,Teigha.DatabaseServices.Database)
Метод импортирует состояние слоя с указанным именем, используя указатель открытого файла чертежа, переданный через базу данных.
name: Имя импортируемого состояния слоя, String.
database: Указатель на действительную и доступную на чтение базу данных, из которой следует импортировать состояние слоя.

Teigha.DatabaseServices.LayerStateManager.LayerStateHasViewportData(String)
Метод определяет, связаны ли с этим состоянием слоя данные видового экрана.  Состояние слоя имеет данные видового экрана, если метод SaveLayerState() был вызван с ненулевым параметром id.
name: Имя интересующего состояния слоя, тип String.
Returns: Возвращает true, если с этим состоянием слоя связаны данные видового экрана, и false в противном случае.

Teigha.DatabaseServices.LayerStateManager.LayerStatesDictionaryId(System.Boolean)
Возвращает ObjectId словаря расширения состояний слоя (в словаре расширения таблицы слоев) или ObjectId (NULL).
createIfNotPresent: Логический флаг, управляющий созданием словаря, тип bool.
Returns: Возвращает ObjectId словаря расширения состояний слоя (в словаре расширения таблицы слоев) или нулевой ObjectId (NULL).

Teigha.DatabaseServices.LayerStateManager.RenameLayerState(String,String )
Метод переименовывает состояние слоя.
name: Имя существующего состояния слоя, String.
newName: Новое имя состояния слоя, String.

Teigha.DatabaseServices.LayerStateManager.RestoreLayerState(String,DatabaseServices.ObjectId,System.Int32,Teigha.DatabaseServices.LayerStateMasks)
Метод восстанавливает имя состояния слоя и настройки VPLAYER для указанного видового экрана. Также восстанавливает атрибуты, указанные в clientMask.
name: Имя состояния слоя, которое станет текущим, тип String.
id: Идентификатор ObjectId видового экрана, настройка VPLAYER которого должна быть восстановлена из сохраненных данных, тип DatabaseServices.ObjectId.
undefinedLayerStatePolicy: Аргумент, определяющий, следует ли обрабатывать неопределенные слои, тип int.
clientMask: Маска атрибутов слоя, тип LayerStateMasks.

Teigha.DatabaseServices.LayerStateManager.SaveLayerState(String,Teigha.DatabaseServices.LayerStateMasks,DatabaseServices.ObjectId)
Метод сохраняет текущее состояние слоя в состоянии слоя с указанным именем.
name: Имя сохраняемого состояния слоя, тип String.
mask: Маска для применения к состоянию слоя, тип LayerStateMasks,
id: ObjectId видового экрана, чья настройка VPLAYER должна быть сохранена, тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.LayerStateManager.SetLayerStateDescription(String,String)
Метод задает произвольную строку в качестве описания состояния слоя.
name: Имя состояния слоя, у которого обновляется описание, тип String.
description: Строка описания длиной до 256 символов, тип String.

Teigha.DatabaseServices.LayerStateManager.SetLayerStateMask(String,Teigha.DatabaseServices.LayerStateMasks)
Обновляет маску LayerStateMasks, используемую при восстановлении состояния слоя.
name: Имя состояния слоя для маски, тип String.
mask: Маска, применяемая к состоянию слоя, тип LayerStateMasks.

Teigha.DatabaseServices.LayerStateManager.LastRestoredLayerState
Метод обеспечивает доступ к последнему восстановленному состоянию слоя.
Returns: Возвращает имя последнего восстановленного состояния слоя, String.