Teigha.DatabaseServices.RenderGlobal
Класс <c>RenderGlobal</c> служит контейнером для всех глобальных свойств рендеринга.

Teigha.DatabaseServices.RenderGlobal.#ctor
Конструктор по умолчанию класса <c>RenderGlobal</c>.

Teigha.DatabaseServices.RenderGlobal.Dimensions
Свойство <c>Dimensions</c> представляет размеры изображения для рендеринга.
Returns: Возвращает размеры изображения. Тип <c>DimensionsParameter</c>.

Teigha.DatabaseServices.RenderGlobal.ExposureType
Свойство <c>ExposureType</c> представляет текущий тип управления экспозицией в данном объекте.
Returns: Возвращает тип управления экспозицией. Значение из перечисления <c>DatabaseServices.ExposureType</c>.

Teigha.DatabaseServices.RenderGlobal.HighInfoLevel
Свойство <c>HighInfoLevel</c> позволяет проверить, отображаются ли настройки в пользовательском интерфейсе с высоким уровнем детализации.
Returns: Возвращает <c>true</c>, если настройки отображаются с высоким уровнем детализации.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RenderGlobal.PredefinedPresetsFirst
Свойство <c>PredefinedPresetsFirst</c> позволяет определить, расположены ли предопределенные наборы настроек перед пользовательскими наборами настроек в пользовательском интерфейсе.
Returns: Возвращает <c>true</c>, если предопределенные наборы настроек располагаются перед пользовательскими наборами.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RenderGlobal.ProcedureAndDestination
Свойство <c>ProcedureAndDestination</c> представляет тип контента и направление вывода для рендеринга.
Returns: Возвращает текущее значение свойства как объект типа <c>ProcedureAndDestinationParameter</c>.

Teigha.DatabaseServices.RenderGlobal.SaveEnabled
Свойство <c>SaveEnabled</c> позволяет определить, следует ли сохранять визуализированное изображение в файле на диске.
Returns: Возвращает <c>true</c>, если сохранение результата рендеринга включено.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RenderGlobal.SaveFileName
Свойство <c>SaveFileName</c> представляет полный путь и имя файла изображения.
Returns: Возвращает полное имя файла изображения (путь и имя). Тип <c>String</c>.