Teigha.BoundaryRepresentation.Mesh2dControl
Интерфейсный класс <c>Mesh2dControl</c> представляет элементы управления 2D-сетью <c>Mesh2d</c>.

Teigha.BoundaryRepresentation.Mesh2dControl.#ctor
Конструктор по умолчанию класса <c>Mesh2dControl</c>.

Teigha.BoundaryRepresentation.Mesh2dControl.ElementShape
Свойство <c>ElementShape</c> предоставляет доступ к форме 2D-элемента.
Returns: Возвращает форму 2D-элемента данного объекта.
Перечисление <c>Element2dShape</c>.

Teigha.BoundaryRepresentation.Mesh2dControl.MaxAspectRatio
Свойство <c>MaxAspectRatio</c> представляет максимальное соотношение ширины и высоты, допустимое для данного элемента управления.
Returns: Возвращает максимальное соотношение сторон для данного элемента управления.
Тип <c>double</c>.