Teigha.GraphicsInterface.Viewport
Этот класс представляет характеристики текущего видового экрана, используемые механизмами векторизации графического интерфейса.
Эти характеристики представляют интерес для оптимизации графического представления пользовательских объектов с учетом конкретной конфигурации видового экрана.

Teigha.GraphicsInterface.Viewport.DoInversePerspective(Teigha.Geometry.Point3d)
Метод выполняет обратное преобразование перспективы для указанной точки из нормализованных координат устройства в координаты EyeSpace.
value: Исходная точка. Тип <c>Point3d</c>.
Returns: Возвращает преобразованную точку.  Тип <c>Point3d</c>.

Teigha.GraphicsInterface.Viewport.DoPerspective(Teigha.Geometry.Point3d)
Метод применяет к указанной точке текущее преобразование перспективы.
value: Исходная точка.  Тип <c>Point3d</c>.
Returns: Возвращает преобразованную точку. Тип <c>Point3d</c>.

Teigha.GraphicsInterface.Viewport.GetNumPixelsInUnitSquare(Teigha.Geometry.Point3d)
Метод вычисляет плотность пикселей дисплея  для данного объекта <c>Viewport</c> в указанной точке WCS.
givenWorldPoint: Центр единичного квадрата в системе координат WCS. Тип <c>Point3d</c>.
Returns: Возвращает точку, которая представляет плотность пикселей. Тип <c>Point2d</c>.

Teigha.GraphicsInterface.Viewport.LayerVisible(DatabaseServices.ObjectId)
Метод позволяет проверить, не заморожен ли указанный слой глобально или в данном видовом экране.
idLayer: Постоянный идентификатор объекта слоя. Тип <c>DatabaseServices.ObjectId</c>.
Returns: Возвращает <c>true</c>, если слой <c>idLayer</c> не заморожен ни в данном видовом экране, ни глобально.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsInterface.Viewport.AcadWindowId
Свойство возвращает индекс видового экрана, в котором выполняется отрисовка.
Returns: Возвращает индекс видового экрана. Тип <c>int</c>.

Teigha.GraphicsInterface.Viewport.CameraLocation
Свойство возвращает положение камеры видового экрана в мировой системе координат.
Returns: Возвращает положение камеры в WCS. Тип <c>Point3d</c>.

Teigha.GraphicsInterface.Viewport.CameraTarget
Свойство возвращает положение целевой точки камеры видового экрана в мировой системе координат.
Returns: Возвращает целевую точку камеры видового экрана в WCS. Тип <c>Point3d</c>.

Teigha.GraphicsInterface.Viewport.CameraUpVector
Свойство возвращает вектор направления «вверх» камеры видового экрана в WCS.
Returns: Возвращает вектор направления «вверх» камеры. Тип <c>Vector3d</c>.

Teigha.GraphicsInterface.Viewport.DeviceContextViewportCorners
Свойство возвращает границы видового экрана, по которым выравниваются положения геометрических объектов (например, иконок обозначений), которые должны оставаться в зафиксированных положениях или иметь постоянный размер в окне видового экрана.
Returns: Возвращает границы видового экрана. Тип <c>DatabaseServices.Extents2d</c>.

Teigha.GraphicsInterface.Viewport.EyeToModelTransform
Свойство возвращает матрицу геометрического преобразования текущих координат "глаза" камеры в координаты пространства модели.
Returns: Возвращает матрицу геометрического преобразования. Тип <c>Matrix3d</c>.

Teigha.GraphicsInterface.Viewport.EyeToWorldTransform
Свойство возвращает матрицу преобразования текущих координат "глаза" камеры в координаты мировой системы координат WCS.
Returns: Возвращает матрицу геометрического преобразования. Тип <c>Matrix3d</c>.

Teigha.GraphicsInterface.Viewport.FrontAndBackClipping
Свойство возвращает информацию о наличии и расположении передней и задней плоскостей отсечения дисплея.
Returns: Возвращает объект <c>GraphicsInterface.FrontAndBackClipping</c> с данными о плоскостях отсечения.

Teigha.GraphicsInterface.Viewport.IsPerspective
Свойство позволяет проверить, включен ли режим перспективного проецирования.
Returns: Возвращает <c>true</c>, если режим перспективного проецирования включен.
В противном случае возвращает <c>false</c>.

Teigha.GraphicsInterface.Viewport.LinetypeGenerationCriteria
Свойство возвращает критерий для определения того, следует ли детально отображать типы линий для данного объекта или уже следует перейти к режиму отрисовки сплошными линиями.
Returns: Возвращает критерий для перехода к детализированному отображению типов линий.
Тип <c>double</c>.

Teigha.GraphicsInterface.Viewport.LinetypeScaleMultiplier
Свойство возвращает масштабный множитель типа линий данного видового экрана.
Returns: Возвращает масштабный множитель типа линий. Тип <c>double</c>.

Teigha.GraphicsInterface.Viewport.ModelToEyeTransform
Свойство возвращает матрицу геометрического преобразования координат точки пространства модели в координаты точки "глаза" камеры видового экрана.
Returns: Возвращает матрицу геометрического преобразования. Тип <c>Matrix3d</c>.

Teigha.GraphicsInterface.Viewport.ViewDirection
Свойство возвращает текущее направление просмотра видового экрана.
Returns: Возвращает направление просмотра видового экрана. Тип <c>Vector3d</c>.

Teigha.GraphicsInterface.Viewport.ViewportId
Свойство возвращает идентификатор видового экрана, используемый в графическом интерфейсе.
Returns: Возвращает идентификатор видового экрана. Тип <c>IntPtr</c>.

Teigha.GraphicsInterface.Viewport.WorldToEyeTransform
Свойство возвращает матрицу геометрического преобразования из координат точки в WCS в координаты  "глаза" камеры видового экрана.
Returns: Возвращает матрицу геометрического преобразования. Тип <c>Matrix3d</c>.