Teigha.DatabaseServices.RenderGlobal.DimensionsParameter.#ctor(System.Int32,System.Int32)
Конструктор структуры <c>DimensionsParameter</c>.
Создает экземпляр структуры с указанными значениями высоты и ширины.
w: Ширина. Тип <c>int</c>.
h: Высота. Тип <c>int</c>.

Teigha.DatabaseServices.RenderGlobal.DimensionsParameter.Height
Свойство <c>Height</c> представляет размер по высоте.
Returns: Возвращает значение высоты. Тип <c>int</c>.

Teigha.DatabaseServices.RenderGlobal.DimensionsParameter.Width
Свойство <c>Width</c> представляет размер по ширине.
Returns: Возвращает значение ширины. Тип <c>int</c>.