Teigha.Runtime.Marshaler
Класс <c>Marshaler</c> представляет служебные методы для преобразования растровых изображений и путей подобъектов между управляемыми объектами и неуправляемыми указателями.

Teigha.Runtime.Marshaler.BitmapInfoToBitmap(IntPtr)
Метод позволяет преобразовать <c>BitmapInfo</c> в объект <c>Bitmap</c>.
bitmapInfo: Входной объект с информацией о растровом изображении. Тип <c>IntPtr</c>.
Returns: Возвращает сформированное изображение. Тип <c>System.Drawing.Bitmap</c>.

Teigha.Runtime.Marshaler.BitmapToBitmapInfo(Drawing.Bitmap)
Метод позволяет преобразовать объект <c>Bitmap</c> в <c>BitmapInfo</c>.
bitmap: Входное изображение.  Тип <c>Drawing.Bitmap</c>.
Returns: Возвращает указатель <c>BitmapInfo</c>. Тип <c>IntPtr</c>.

Teigha.Runtime.Marshaler.CopyToManagedFullSubentityPath(IntPtr)
Метод преобразует переданный путь в управляемый объект пути.
path: Входной путь. Тип <c>IntPtr</c>.
Returns: Возвращает полный путь к подобъекту.  Тип <c>FullSubentityPath</c>.

Teigha.Runtime.Marshaler.CopyToUnmanagedFullSubentityPath(Teigha.DatabaseServices.FullSubentityPath,IntPtr)
Метод преобразует переданный путь в неуправляемый объект пути.
path: Входной полный путь к подобъекту.   Тип <c>FullSubentityPath</c>.
newPath: Выходной неуправляемый объект пути. Тип <c>IntPtr</c>.

Teigha.Runtime.Marshaler.ViewportDraw(IntPtr,System.Boolean)
Метод преобразует переданный неуправляемый объект в управляемый объект <c>ViewportDraw</c>.
unmanagedPointer: Неуправляемый указатель на входной объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает результат преобразования. Тип <c>GraphicsInterface.ViewportDraw</c>.

Teigha.Runtime.Marshaler.WorldDraw(IntPtr,System.Boolean)
Метод преобразует переданный неуправляемый объект в управляемый объект <c>WorldDraw</c>.
unmanagedPointer: Неуправляемый указатель на входной объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает результат преобразования. Тип <c>GraphicsInterface.WorldDraw</c>.