Teigha.BoundaryRepresentation.VertexLoopEnumerator
Класс <c>VertexLoopEnumerator</c> представляет представляет перечислитель циклов, связанных с вершиной.

Teigha.BoundaryRepresentation.VertexLoopEnumerator.Current
Свойство <c>Current</c> предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип <c>BoundaryLoop</c>.