Teigha.DatabaseServices.XrefBeginOperationEventArgs
Класс <c>XrefBeginOperationEventArgs</c> представляет данные для событий базы данных <c>XrefBeginRestore</c>, <c>XrefBeginAttached</c> и <c>XrefBeginOtherAttached</c>.

Teigha.DatabaseServices.XrefBeginOperationEventArgs.FileName
Свойство <c>FileName</c> представляет имя файла, на который указывает внешняя ссылка.
Returns: Возвращает имя файла. Тип <c>String</c>.

Teigha.DatabaseServices.XrefBeginOperationEventArgs.From
Свойство <c>From</c> представляет базу данных, на которую имеется внешняя ссылка.
Returns: Возвращает базу данных внешней ссылки.
Тип <c>Database</c>.