Teigha.Geometry.ExternalCurve2d
Класс <c>ExternalCurve2d</c> представляет 2D-кривые, определения которых являются внешними по отношению к геометрической библиотеке nanoCAD.

Teigha.Geometry.ExternalCurve2d.#ctor
Конструктор по умолчанию класса <c>ExternalCurve2d</c>.

Teigha.Geometry.ExternalCurve2d.#ctor(IntPtr,Teigha.Geometry.ExternalEntityKind)
Конструктор класса <c>ExternalCurve2d</c>.
Создает объект на основе указателя на определение внешней кривой и сведений о системе, в которой было создано ее определение.
curveDef: Входное определение внешней кривой. Тип <c>IntPtr</c>.
curveKind: Информация о системе, в которой было создано определение внешнего объекта. Перечисление <c>ExternalEntityKind</c>.

Teigha.Geometry.ExternalCurve2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>ExternalCurve2d</c>.

Teigha.Geometry.ExternalCurve2d.Set(IntPtr,Teigha.Geometry.ExternalEntityKind)
Метод позволяет переопределить параметры данного объекта, используя указатель на определение внешнего объекта и его тип.
curveDef: Указатель на определение внешней кривой. Тип <c>IntPtr</c>.
curveKind: Информация о системе, в которой было создано определение внешнего объекта. Тип <c>ExternalEntityKind</c>.

Teigha.Geometry.ExternalCurve2d.SetToOwnCurve
Метод делает этот объект владельцем данных своего определения.

Teigha.Geometry.ExternalCurve2d.ExternalCurve
Свойство <c>ExternalCurve</c> представляет внешнюю кривую в ее исходном виде.
Returns: Возвращает указатель на внешнюю кривую. Тип <c>IntPtr</c>.

Teigha.Geometry.ExternalCurve2d.ExternalCurveKind
Свойство <c>ExternalCurveKind</c> представляет информацию о нативной системе, в которой было создано определение внешней кривой.
Returns: Возвращает информацию о системе, в которой было создано определение внешнего объекта.
Тип <c>Geometry.ExternalEntityKind</c>.

Teigha.Geometry.ExternalCurve2d.IsDefined
Свойство <c>IsDefined</c> позволяет проверить, является ли данный объект определенным, т.е. сформировано ли определение данной кривой.
Returns: Возвращает <c>true</c>, если данный объект имеет определение кривой.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve2d.IsNurbCurve
Свойство <c>IsNurbCurve</c> позволяет проверить, может ли экземпляр внешней кривой быть представлен определением, которое является нативным для графической системы платформы.
Returns: Возвращает <c>true</c>, если внешняя кривая имеет точное нативное представление в графической системе платформы.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve2d.IsOwnerOfCurve
Свойство <c>IsOwnerOfCurve</c> позволяет убедиться, что данный объект является владельцем данных своего определения.
Returns: Возвращает <c>true</c>, если данный объект является владельцем данных своего определения.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.ExternalCurve2d.NurbCurve
Свойство <c>NurbCurve</c> представляет внешнюю кривую в нативном представлении графической системы платформы.
Returns: Возвращает нативное представление кривой в графической системе платформы.
Тип <c>NurbCurve2d</c>.