Teigha.Geometry.PointOnCurve3d
Этот класс представляет точку на трехмерной параметрической кривой.

Teigha.Geometry.PointOnCurve3d.#ctor
Конструктор по умолчанию для класса PointOnCurve3d.

Teigha.Geometry.PointOnCurve3d.#ctor(Teigha.Geometry.Curve3d,System.Double)
Конструктор класса PointOnCurve3d. Создает точку на указанной кривой с указанным значением параметра.
curve: Входная кривая. Тип Curve3d.
parameter: Входное значение параметра для точки. Тип double.

Teigha.Geometry.PointOnCurve3d.Create(IntPtr,System.Boolean)
Метод создает точку на кривой на основе переданного указателя.
unmanagedPointer: Неуправляемый указатель. Тип IntPtr.
autoDelete: Флаг автоматического удаления исходного объекта. Тип bool.
Returns: Возвращает точку на кривой. Тип PointOnCurve3d.

Teigha.Geometry.PointOnCurve3d.GetCurvature
Метод вычисляет кривизну кривой в данной точке на кривой.
Метод не реализован.
Returns: Возвращает значение кривизны кривой в данной точке на кривой. Тип double.

Teigha.Geometry.PointOnCurve3d.GetCurvature(System.Double)
Метод вычисляет кривизну кривой в точке, соответствующей указанному значению параметра.
Метод не реализован.
parameter: Входной параметр точки на кривой. Тип double.
Returns: Возвращает значение кривизны кривой в указанной точке на кривой. Тип double.

Teigha.Geometry.PointOnCurve3d.GetDerivative(System.Int32)
Метод вычисляет первую или вторую производную кривой в данной точке на кривой.
order: Порядок вычисляемой производной. Тип int.  Допустимые значения 1 или 2.
Returns: Возвращает вектор производной. Тип Vector3d.

Teigha.Geometry.PointOnCurve3d.GetDerivative(System.Int32,Teigha.Geometry.Curve3d,System.Double)
Метод вычисляет первую либо вторую производную указанной кривой в заданной параметром точке на кривой.
order: Порядок вычисляемой производной. Тип int. Допустимые значения 1 и 2.
curve: Входная кривая. Тип Curve3d.
parameter: Входное значение параметра, задающее точку на кривой для вычисления производной. Тип double.
Returns: Возвращает вектор производной. Тип Vector3d.

Teigha.Geometry.PointOnCurve3d.GetDerivative(System.Int32,System.Double)
Метод вычисляет первую либо вторую производную кривой в заданной параметром точке на кривой.
order: Порядок вычисляемой производной. Тип int. Допустимые значения 1 и 2.
parameter: Входное значение параметра, задающее точку на кривой для вычисления производной. Тип double.
Returns: Возвращает вектор производной. Тип Vector3d.

Teigha.Geometry.PointOnCurve3d.GetPointAtParameter(System.Double)
Метод восстанавливает параметрическое представление кривой и возвращает 3D-точку, координаты которой соответствуют указанному значению параметра.
parameter: Входное значение параметра. Тип	double.
Returns: Возвращает 3D-точку, положение которой определяется точкой на кривой с указанным значением параметра. Тип Point3d.

Teigha.Geometry.PointOnCurve3d.GetPointOnCurve(Teigha.Geometry.Curve3d,System.Double)
Метод восстанавливает параметрическое представление заданной кривой и возвращает 3D-точку на кривой, координаты которой соответствуют заданному значению параметра.
curve: Входная произвольная 3D-кривая. Тип Curve3d.
parameter: Входное значение параметра. Тип	double.
Returns: Возвращает 3D-точку, положение которой определяется точкой на кривой с указанным значением параметра. Тип Point3d.

Teigha.Geometry.PointOnCurve3d.IsSingular(Teigha.Geometry.Tolerance)
Метод позволяет проверить равенство нулю длины вектора первой производной кривой в данной точке (в пределах указанного допуска).
tolerance: Входное значение допуска. Тип Tolerance.
Returns: Возвращает true, если в пределах указанного допуска длину вектора первой производной можно считать нулевой; в противном случае возвращает false.

Teigha.Geometry.PointOnCurve3d.IsSingular
Метод позволяет проверить равенство нулю длины вектора первой производной кривой в данной точке.
Returns: Возвращает true, если длина вектора первой производной равна нулю; в противном случае возвращает false.

Teigha.Geometry.PointOnCurve3d.Curve
Свойство обеспечивает доступ к кривой, на которой лежит данная точка.
Returns: Возвращает кривую, на которой лежит данная точка. Тип Curve3d.

Teigha.Geometry.PointOnCurve3d.Parameter
Свойство возвращает значение параметра данной точки на кривой.
Returns: Возвращает значение параметра данной точки на кривой. Тип double.

Teigha.Geometry.PointOnCurve3d.Point
Свойство предоставляет доступ к 3D-точке, координаты которой совпадают с данной точкой на кривой.
Returns: Возвращает 3D-точку, координаты которой совпадают с данной точкой на кривой. Тип Point3d.