Teigha.Geometry.Cone
Класс <c>Cone</c> представляет ограниченный прямой круговой конус.

Teigha.Geometry.Cone.#ctor
Конструктор по умолчанию для класса <c>Cone</c>.
Создает прямой круговой конус с параметрами по умолчанию.

Teigha.Geometry.Cone.#ctor(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d)
Конструктор класса <c>Cone</c>.
Создает полный конус с заданными центром и радиусом основания, осью конуса и углом при вершине.
cosineAngle: Косинус угла между осью конуса и его образующей. Тип <c>double</c>.
sineAngle: Синус угла между осью конуса и его образующей.   Тип <c>double</c>.
baseOrigin: Центр окружности в основании конуса. Тип <c>Point3d</c>.
baseRadius: Радиус основания конуса. Тип <c>double</c>.
axisOfSymmetry: Направление оси конуса. Тип <c>Vector3d</c>.

Teigha.Geometry.Cone.#ctor(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Конструктор класса <c>Cone</c>.
Создает конус с заданными центром и радиусом основания, осью конуса, косинусом и синусом угла между осью конуса и образующей, высотой конуса, а также начальным и конечным углами поворота образующей конуса.
cosineAngle: Косинус угла между осью конуса и его образующей. Тип <c>double</c>.
sineAngle: Синус угла между осью конуса и его образующей.   Тип <c>double</c>.
baseOrigin: Центр окружности в основании конуса. Тип <c>Point3d</c>.
baseRadius: Радиус основания конуса. Тип <c>double</c>.
axisOfSymmetry: Направление оси конуса. Тип <c>Vector3d</c>.
referenceAxis: Опорный вектор в основании конуса, задающий направление отсчета углов в основании. Тип <c>Vector3d</c>.
height: Высота конуса. Тип <c>Interval</c>.
startAngle: Начальный угол поворота образующей в радианах.  Тип <c>double</c>.
endAngle: Конечный  угол поворота образующей в радианах.  Тип <c>double</c>.

Teigha.Geometry.Cone.Create(IntPtr,System.Boolean)
Метод создает объект <c>Cone</c> на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, на основе которого создается конус.   Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>Cone</c>.

Teigha.Geometry.Cone.GetAngles
Метод позволяет получить начальный и конечный углы поворота образующей для данного конуса.
Returns: Возвращает массив, содержащий углы поворота. Тип <c>double[]</c>.
Элемент массива с индексом 0 представляет начальный угол, а с индексом 1 — конечный угол.

Teigha.Geometry.Cone.GetHalfAngles
Метод позволяет получить косинус и синус угла между осью конуса и его образующей.
Returns: Возвращает массив, в котором элемент с индексом 0 представляет косинус угла, а с индексом 1 — синус угла между осью конуса и его образующей. Тип <c>double[]</c>.

Teigha.Geometry.Cone.GetHeightAt(System.Double)
Метод позволяет вычислить высоту данного конуса, соответствующую указанному параметру на оси <c>U</c>.
parameter: Параметр, определяющий положение точки на оси <c>U</c> данного конуса.
Returns: Возвращает высоту этого конуса, соответствующую входному значению аргумента <c>parameter</c>.
Тип <c>double</c>.

Teigha.Geometry.Cone.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод позволяет получить точки пересечения данного конуса с указанным линейным объектом.
linearEntity: Линейный объект, который пересекается с конусом. Тип <c>LinearEntity3d</c>.
Returns: Возвращает массив точек пересечения.
Тип <c>Point3d[]</c>.

Teigha.Geometry.Cone.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод позволяет получить точки пересечения данного конуса с указанным линейным объектом, вычисленные с заданной точностью.
linearEntity: Линейный объект, который пересекается с конусом. Тип <c>LinearEntity3d</c>.
tolerance: Заданная точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает массив точек пересечения.
Тип <c>Point3d[]</c>.

Teigha.Geometry.Cone.IsClosed
Метод позволяет проверить, является ли основание данного конуса полным кругом.
Returns: Возвращает <c>true</c> тогда и только тогда, когда основание этого конуса является полным кругом.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Cone.IsClosed(Teigha.Geometry.Tolerance)
Метод позволяет проверить с указанной точностью, является ли основание данного конуса полным кругом.
tolerance: Заданная точность вычислений.
Returns: Возвращает <c>true</c> тогда и только тогда, когда основание этого конуса является полным кругом.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Cone.Set(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d)
Метод позволяет переопределить основные параметры конуса - центр и радиус основания, направление оси и угол раствора конуса.
cosineAngle: Косинус угла между осью конуса и его образующей. Тип <c>double</c>.
sineAngle: Синус угла между осью конуса и его образующей.   Тип <c>double</c>.
baseCenter: Центр окружности в основании конуса. Тип <c>Point3d</c>.
baseRadius: Радиус основания конуса. Тип <c>double</c>.
axisOfSymmetry: Направление оси конуса. Тип <c>Vector3d</c>.

Teigha.Geometry.Cone.Set(System.Double,System.Double,Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Метод позволяет переопределить все параметры конуса - центр и радиус основания, направление оси конуса, косинус и синус угла между осью конуса и образующей, высоту конуса, а также начальный и конечный углы поворота образующей конуса.
cosineAngle: Косинус угла между осью конуса и его образующей. Тип <c>double</c>.
sineAngle: Синус угла между осью конуса и его образующей.   Тип <c>double</c>.
baseCenter: Центр окружности в основании конуса. Тип <c>Point3d</c>.
baseRadius: Радиус основания конуса. Тип <c>double</c>.
axisOfSymmetry: Направление оси конуса. Тип <c>Vector3d</c>.
refAxis: Опорный вектор в основании конуса, задающий направление отсчета углов в основании. Тип <c>Vector3d</c>.
height: Высота конуса. Тип <c>Interval</c>.
startAngle: Начальный угол поворота образующей в радианах.  Тип <c>double</c>.
endAngle: Конечный  угол поворота образующей в радианах.  Тип <c>double</c>.

Teigha.Geometry.Cone.SetAngles(System.Double,System.Double)
Метод позволяет переопределить начальный и конечный углы поворота образующей этого конуса.
startAngle: Начальный угол поворота образующей в радианах.  Тип <c>double</c>.
endAngle: Конечный  угол поворота образующей в радианах.  Тип <c>double</c>.

Teigha.Geometry.Cone.Apex
Свойство <c>Apex</c> представляет вершину данного конуса.
Returns: Возвращает вершину данного конуса.
Тип <c>Point3d</c>.

Teigha.Geometry.Cone.AxisOfSymmetry
Свойство <c>AxisOfSymmetry</c> представляет ось данного конуса.
Returns: Возвращает направляющий вектор оси конуса.
Тип <c>Vector3d</c>.

Teigha.Geometry.Cone.BaseCenter
Свойство <c>BaseCenter</c> представляет центр основания данного конуса.
Returns: Возвращает центр основания данного конуса.
Тип <c>Point3d</c>.

Teigha.Geometry.Cone.BaseRadius
Свойство <c>BaseRadius</c> представляет доступ к радиусу основания данного конуса.
Returns: Возвращает радиус основания данного конуса.
Тип <c>double</c>.

Teigha.Geometry.Cone.HalfAngle
Свойство <c>HalfAngle</c> представляет угол между осью и образующей конуса.
Returns: Возвращает угол между осью и образующей конуса (в радианах).
Тип <c>double</c>.

Teigha.Geometry.Cone.Height
Свойство <c>Height</c> обеспечивает доступ к параметрическому интервалу, который определяет высоту данного конуса.
Returns: Возвращает параметрический интервал, определяющий высоту данного конуса.
Тип <c>Interval</c>.

Teigha.Geometry.Cone.IsOuterNormal
Свойство <c>IsOuterNormal</c> представляет флаг, определяющий, направлена ли нормаль конуса в сторону замкнутого конуса.
Returns: Возвращает <c>true</c>, если нормаль конуса ориентирована в сторону замкнутого конуса.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Cone.ReferenceAxis
Свойство <c>ReferenceAxis</c> представляет опорный вектор в основании конуса.
Returns: Возвращает опорный вектор в основании конуса.
Тип <c>Vector3d</c>.