HostMgd.EditorInput.PromptDoubleResultEventArgs
Класс, обеспечивающий данными событие PromptedForDouble
класса Editor.

HostMgd.EditorInput.PromptDoubleResultEventArgs.Result
Возвращает результат выбора.