Teigha.DatabaseServices.AttributeDefinition
Класс AttributeDefinition представляет определения атрибутов (ATTDEF) в экземпляре базы данных.

Teigha.DatabaseServices.AttributeDefinition.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.AttributeDefinition.#ctor(Teigha.Geometry.Point3d,String,String,String,DatabaseServices.ObjectId)
Конструктор класса, предназначенный для создания нового экземпляра класса AttributeDefinition с указанными параметрами.
position: Позиция объекта AttributeDefinition. Тип Point3d.
value: Значение объекта AttributeDefinition. Тип String.
tag: Тег объекта AttributeDefinition. Тип String.
prompt: Запрос объекта AttributeDefinition. Тип String.
style: Стиль объекта AttributeDefinition. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.AttributeDefinition.UpdateMTextAttributeDefinition
Метод позволяет обновить внутренний объект MText, который в базовых свойствах AttributeDefinition представляет определение многострочного атрибута.

Teigha.DatabaseServices.AttributeDefinition.Constant
Свойство получает или задает значение флага, определяющего, является ли данный объект <c>AttributeDefinition</c> постоянным.
Returns: Возвращает <c>true</c>, если данный объект <c>AttributeDefinition</c> является постоянным.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AttributeDefinition.FieldLength
Свойство позволяет получить или задать длину поля в данном объекте AttributeDefinition.
Returns: Возвращает длину поля. Тип int.

Teigha.DatabaseServices.AttributeDefinition.Invisible
Свойство предоставляет доступ на изменение к флагу невидимости объекта <c>AttributeDefinition</c>.
Returns: Если флаг принимает значение <c>true</c>, объект <c>AttributeDefinition</c> становится невидимым.

Teigha.DatabaseServices.AttributeDefinition.IsMTextAttributeDefinition
Свойство предоставляет доступ на изменение к флагу, который определяет, является ли данный объект AttributeDefinition  определением многострочного атрибута.
Returns: Возвращает <c>true</c>, если определение атрибута является многострочным. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AttributeDefinition.LockPositionInBlock
Свойство позволяет получить или задать флаг фиксации относительного положения объекта AttributeDefinition в блоке.
Returns: Возвращает <c>true</c>, если определение атрибута не может смещаться относительно геометрии. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AttributeDefinition.MTextAttributeDefinition
Свойство обеспечивает доступ на изменение к объекту MText, который представляет определение многострочного атрибута.
Returns: Возвращает объект MText определения многострочного атрибута.

Teigha.DatabaseServices.AttributeDefinition.Preset
Свойство предоставляет доступ на изменение статуса "Установленный" (Preset) данного определения атрибута AttributeDefinition.
Returns: Возвращает <c>true</c>, если данному определению атрибута присвоен статус "Установленный" (Preset).
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.AttributeDefinition.Prompt
Свойство позволяет получить или задать строку подсказки данного объекта AttributeDefinition.
Returns: Возвращает строку подсказки. Тип String.

Teigha.DatabaseServices.AttributeDefinition.Tag
Свойство позволяет получить или задать строку тега данного объекта AttributeDefinition.
Returns: Возвращает строку тега. Тип String.

Teigha.DatabaseServices.AttributeDefinition.Verifiable
Свойство позволяет получить или задать статус "Контролируемый" данного объекта AttributeDefinition.
Returns: Возвращает <c>true</c>, если объекту AttributeDefinition задан статус "Контролируемый".
В противном случае возвращает <c>false</c>.