Teigha.DatabaseServices.RotatedDimension
Класс RotatedDimension представляет тип размера между двумя точками в пространстве, которые располагаются на линии,  ориентированной под определенным углом к горизонту в плоскости размера (угол поворота).

Teigha.DatabaseServices.RotatedDimension.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.RotatedDimension.#ctor(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,String,DatabaseServices.ObjectId)
Данный конструктор создает новый объект RotatedDimension с указанными в аргументах параметрами.
rotation: Угол поворота размера в радианах, тип double.
line1Point: Первая выносная точка - точка, от которой строится размер и где начинается первая выносная линия. Тип Point3d.
line2Point: Вторая выносная точка - точка, до которой строится размер и где начинается вторая  выносная линия. Тип Point3d.
dimensionLinePoint: Точка на размерной линии, тип Point3d.
dimensionText: Размерный текст, которым заменяется текст с измеренным значением. Тип String.
dimensionStyle: ID размерного стиля, который используется для отображения размера. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.RotatedDimension.dimLinePoint
Свойство предоставляет доступ к точке определения (в мировой системе координат WCS), которая указывает, где будет находиться размерная линия (т.е. эта точка будет располагаться где-то на размерной линии).
Returns: Возвращает точку Point3d, которая располагается где-то на размерной линии.
Система координат - мировая (WCS).

Teigha.DatabaseServices.RotatedDimension.Rotation
Свойство задает или получает угол поворота (в радианах) для повернутого размера.
Returns: Возвращает или получает угол поворота (в радианах) для повернутого размера.

Teigha.DatabaseServices.RotatedDimension.xLine1Point
Свойство задает и получает начальную трехмерную точку первой выносной линии размера. Система координат - мировая (WCS).
Returns: Возвращает или задает начальную трехмерную точку первой выносной линии размера, тип Point3d.

Teigha.DatabaseServices.RotatedDimension.xLine2Point
Свойство задает и получает начальную трехмерную точку второй выносной линии размера. Система координат - мировая (WCS).
Returns: Возвращает или задает начальную трехмерную точку второй выносной линии размера, тип Point3d.