Teigha.Geometry.PointOnSurface
Класс <c>PointOnSurface</c> представляет точку на трехмерной поверхности.

Teigha.Geometry.PointOnSurface.#ctor
Конструктор по умолчанию класса <c>PointOnSurface</c>.

Teigha.Geometry.PointOnSurface.#ctor(Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Конструктор класса <c>PointOnSurface</c>.
Создает на указанной поверхности точку с заданными параметрическими координатами.
surf: Входная поверхность, на которой лежит данная точка. Тип <c>Surface</c>.
point: Значения параметра для этой точки. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.

Teigha.Geometry.PointOnSurface.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>PointOnSurface</c>.

Teigha.Geometry.PointOnSurface.GetInverseTangentVector(Teigha.Geometry.Vector3d)
Метод проецирует указанный 3D-вектор на плоскость, касательную к поверхности в данной точке, и возвращает 2D-вектор в пространстве параметров, который отображается на этот спроецированный вектор.
В текущей версии не реализован.
vector: Входной вектор. Тип <c>Vector3d</c>.
Returns: Возвращает 2D-вектор в пространстве параметров, который отображается на проекцию вектора <c>vector</c>.
Тип <c>Vector2d</c>.

Teigha.Geometry.PointOnSurface.GetInverseTangentVector(Teigha.Geometry.Vector3d,Teigha.Geometry.Point2d)
Метод проецирует указанный 3D-вектор на касательную плоскость в указанной точке и возвращает вектор в 2D-пространстве параметров, который соответствует полученному вектору-проекции.
vector: Входной вектор, который проецируется на касательную плоскость в точке <c>point</c>.  Тип <c>Vector3d</c>.
point: Входная точка на поверхности.  Тип <c>Point2d</c>.
Returns: Возвращает 2D-вектор в пространстве параметров, который отображается на проекцию вектора <c>vector</c>.  Тип <c>Vector2d</c>.

Teigha.Geometry.PointOnSurface.GetInverseTangentVector(Teigha.Geometry.Vector3d,Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Проецирует заданный 3D-вектор на плоскость, касательную к указанной поверхности в точке с заданными параметрическими координатами, и возвращает вектор в параметрическом 2D-пространстве, который отображается на полученный вектор-проекцию.
В текущей версии не реализован.
vector: Входной вектор, который проецируется на касательную плоскость в точке <c>point</c>. Тип <c>Vector3d</c>.
surf: Входная поверхность. Тип <c>Surface</c>.
point: Входная точка на поверхности, заданная в пространстве параметров. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.
Returns: Возвращает 2D-вектор в пространстве параметров, который отображается на проекцию вектора <c>vector</c>.  Тип <c>Vector2d</c>

Teigha.Geometry.PointOnSurface.GetMixedPartial
Метод вычисляет смешанную частную производную в текущей точке поверхности.
В текущей версии не реализован.
Returns: Возвращает вектор смешанной частной производной в данной точке поверхности.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetMixedPartial(Teigha.Geometry.Point2d)
Метод вычисляет смешанную частную производную в указанной точке поверхности.
В текущей версии не реализован.
point: Точка поверхности, заданная параметрически. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.
Returns: Возвращает вектор смешанной частной производной в точке <c>point</c> поверхности.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetMixedPartial(Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод вычисляет смешанную частную производную указанной поверхности в параметрически заданной точке.
В текущей версии не реализован.
surf: Входная поверхность. Тип <c>Surface</c>.
point: Точка поверхности, заданная параметрически. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.
Returns: Возвращает вектор смешанной частной производной в точке <c>point</c> поверхности <c>surf</c>.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetNormal
Метод вычисляет нормаль к поверхности в текущей точке.
В текущей версии не реализован.
Returns: Возвращает вектор нормали в точке, определяемой данным объектом.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetNormal(Teigha.Geometry.Point2d)
Метод вычисляет нормаль к поверхности в указанной точке.
В текущей версии не реализован.
point: Точка поверхности, заданная параметрически. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.
Returns: Возвращает вектор нормали в указанной точке поверхности.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetNormal(Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод вычисляет нормаль к указанной поверхности в заданной точке.
В текущей версии не реализован.
surf: Входная поверхность. Тип <c>Surface</c>.
point: Точка поверхности, заданная параметрически. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.
Returns: Возвращает вектор нормали в указанной точке поверхности.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetPoint(Teigha.Geometry.Point2d)
Метод переопределяет параметрические 2D-координаты связанной с данным объектом точки поверхности и возвращает соответствующую точку в 3D-пространстве моделирования.
point: Новые параметрические координаты точки на поверхности. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.
Returns: Возвращает точку в 3D-пространстве моделирования, которой соответствует точка <c>point</c> в пространстве параметров.
Тип <c>Point3d</c>.

Teigha.Geometry.PointOnSurface.GetPoint(Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод переопределяет связанную с данным объектом поверхность и параметрические 2D-координаты точки на этой поверхности и возвращает соответствующую точку в 3D-пространстве моделирования.
surface: Новая 3D-поверхность. Тип <c>Surface</c>.
point: Новые параметрические координаты точки на поверхности. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.
Returns: Возвращает точку на поверхности <c>surface</c> в 3D-пространстве моделирования, которой соответствует точка <c>point</c> в пространстве параметров.
Тип <c>Point3d</c>.

Teigha.Geometry.PointOnSurface.GetTangentVector(Teigha.Geometry.Vector2d)
Метод позволяет вычислить 3D-вектор в плоскости, касательной к поверхности в данной точке, которому соответствует указанный 2D-вектор в пространстве параметров.
В текущей версии не реализован.
vector: Входной 2D-вектор в пространстве параметров. Тип <c>Vector2d</c>.
Returns: Возвращает 3D-вектор в касательной плоскости, который соответствует параметрически заданному 2D-вектору <c>vector</c>.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetTangentVector(Teigha.Geometry.Vector2d,Teigha.Geometry.Point2d)
Метод вычисляет 3D-вектор в плоскости, касательной к поверхности в заданной точке, которому соответствует указанный 2D-вектор в пространстве параметров.
В текущей версии этот метод не реализован.
vector: Входной 2D-вектор в пространстве параметров. Тип <c>Vector2d</c>.
point: Входная 2D-точка в пространстве параметров. Тип <c>Point2d</c>.
Returns: Возвращает 3D-вектор в касательной плоскости, который соответствует параметрически заданному 2D-вектору <c>vector</c>.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetTangentVector(Teigha.Geometry.Vector2d,Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод вычисляет 3D-вектор в касательной плоскости к указанной поверхности в заданной точке, которому соответствует указанный 2D-вектор в пространстве параметров.
В текущей версии этот метод не реализован.
vector: Входной 2D-вектор в пространстве параметров. Тип <c>Vector2d</c>.
vectorSurface: Входная поверхность. Тип <c>Surface</c>.
pointer: Входная 2D-точка в пространстве параметров. Тип <c>Point2d</c>.
Returns: Возвращает 3D-вектор в касательной плоскости, который соответствует параметрически заданному 2D-вектору <c>vector</c>.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetUDerivative(System.Int32)
Метод вычисляет в текущей точке частную производную указанного порядка для поверхности в направлении <c>U</c>.
В текущей версии этот метод не реализован.
order: Порядок вычисляемой производной (1 или 2). Тип <c>int</c>.
Returns: Возвращает вектор частной производной порядка <c>order</c> в направлении <c>U</c>.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetUDerivative(System.Int32,Teigha.Geometry.Point2d)
Метод переопределяет в данном объекте точку поверхности, используя новые параметрические координаты, и вычисляет в этой точке частную производную указанного порядка в направлении <c>U</c>.  В текущей версии этот метод не реализован.
order: Порядок производной (1 или 2). Тип <c>int</c>.
point: Входная 2D-точка в пространстве параметров. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.
Returns: Возвращает вектор частной производной порядка <c>order</c> в направлении <c>U</c>.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetUDerivative(System.Int32,Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод переопределяет в данном объекте поверхность и точку поверхности, используя новые параметрические координаты, и вычисляет в указанной точке частную производную заданного порядка в направлении <c>U</c>.
В текущей версии этот метод не реализован.
order: Порядок производной (1 или 2). Тип <c>int</c>.
surface: Входная поверхность. Тип <c>Surface</c>.
point: Входная 2D-точка в пространстве параметров. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.
Returns: Возвращает вектор частной производной порядка <c>order</c> в направлении <c>U</c>.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetVDerivative(System.Int32)
Метод вычисляет в текущей точке частную производную указанного порядка для поверхности в направлении <c>V</c>.
В текущей версии этот метод не реализован.
order: Порядок вычисляемой производной (1 или 2). Тип <c>int</c>.
Returns: Возвращает вектор частной производной порядка <c>order</c> в направлении <c>V</c>.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetVDerivative(System.Int32,Teigha.Geometry.Point2d)
Метод переопределяет в данном объекте точку поверхности, используя новые параметрические координаты, и вычисляет в этой точке частную производную указанного порядка в направлении <c>V</c>.  В текущей версии этот метод не реализован.
order: Порядок производной (1 или 2). Тип <c>int</c>.
point: Входная 2D-точка в пространстве параметров. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.
Returns: Возвращает вектор частной производной порядка <c>order</c> в направлении <c>V</c>.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.GetVDerivative(System.Int32,Teigha.DatabaseServices.Surface,Teigha.Geometry.Point2d)
Метод переопределяет в данном объекте поверхность и точку поверхности, используя новые параметрические координаты, и вычисляет в указанной точке частную производную заданного порядка в направлении <c>V</c>.
В текущей версии этот метод не реализован.
order: Порядок производной (1 или 2). Тип <c>int</c>.
surface: Входная поверхность. Тип <c>Surface</c>.
point: Входная 2D-точка в пространстве параметров. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.
Returns: Возвращает вектор частной производной порядка <c>order</c> в направлении <c>V</c>.
Тип <c>Vector3d</c>.

Teigha.Geometry.PointOnSurface.Parameter
Свойство <c>Parameter</c> представляет текущее параметрическое представление точки поверхности.
Returns: Возвращает текущие параметрические координаты точки поверхности. Тип <c>Point2d</c>. Координата <c>point.x</c> определяет значение параметра точки по оси <c>u</c>, а координата <c>point.y</c> - значение параметра по оси <c>v</c>.

Teigha.Geometry.PointOnSurface.Surface
Свойство <c>Surface</c> представляет поверхность, на которой лежит точка данного объекта.
Returns: Возвращает 3D-поверхность. Тип <c>Surface</c>.