Teigha.DatabaseServices.DwfDefinition
Этот класс представляет определения подложек DWF на чертеже.

Teigha.DatabaseServices.DwfDefinition.#ctor
Конструктор по умолчанию.

Teigha.DatabaseServices.DwfDefinition.isDWFx
Свойство предоставляет возможность проверить, является ли объект файлом формата DWFx.
Returns: Возвращает <c>true</c>, если объект является файлом формата DWFx.
В противном случае возвращает <c>false</c>.