Teigha.DatabaseServices.GripData
Класс представляет данные ручек для объектов чертежа.

Teigha.DatabaseServices.GripData.CallHotGrip(Teigha.DatabaseServices.ObjectId,GripData.Context)
Метод реализует действия при активации (выделении) этой ручки курсором мыши.
entityId: Идентификатор объекта чертежа. Тип <c>ObjectId</c>.
contextFlags: Флаги контекста ручки. Перечисление <c>GripData.Context</c>.
Returns: Возвращает результат выполнения операции. Перечисление <c>GripData.ReturnValue</c>.

Teigha.DatabaseServices.GripData.CallHoverGrip(Teigha.DatabaseServices.ObjectId,GripData.Context)
Метод реализует действия при подсветке этой ручки курсором мыши.
entityId: Идентификатор объекта чертежа. Тип <c>ObjectId</c>.
contextFlags: Флаги контекста ручки. Перечисление <c>GripData.Context</c>.
Returns: Возвращает результат выполнения операции. Перечисление <c>GripData.ReturnValue</c>.

Teigha.DatabaseServices.GripData.CallTooltip
Метод вызывает подсказку данной ручки.
Returns: Возвращает строку подсказки ручки. Тип <c>String</c>.

Teigha.DatabaseServices.GripData.CallViewportDraw(GraphicsInterface.ViewportDraw,Teigha.DatabaseServices.ObjectId,DrawType,Nullable&lt;Point3d&gt;,System.Int32)
Метод предназначен для отрисовки графики пользовательского глифа ручки, которая зависит от видового экрана.
worldDraw: Входной интерфейс <c>Teigha.GraphicsInterface.<link Teigha
entityId: Идентификатор объекта чертежа.  Тип <c>ObjectId</c>.
t: Тип отображения ручки. Перечисление <c>GripData.DrawType</c>.
imageGripPoint: Базовая точка изображения ручки. Тип <c>Point3d?</c>.
gripSizeInPixels: Размер ручки в пикселях. Тип <c>int</c>.

Teigha.DatabaseServices.GripData.CallWorldDraw(GraphicsInterface.WorldDraw,Teigha.DatabaseServices.ObjectId,DrawType,Nullable&lt;Point3d&gt;,System.Double)
Метод предназначен для отрисовки графики пользовательского глифа ручки, которая не зависит от видового экрана.
worldDraw: Входной интерфейс <c>Teigha.GraphicsInterface.<link Teigha
entityId: Идентификатор объекта чертежа. Тип <c>ObjectId</c>.
t: Тип отображения ручки. Перечисление <c>GripData.DrawType</c>.
imageGripPoint: Базовая точка изображения ручки. Тип <c>Point3d?</c>.
dGripSize: Размер ручки. Тип <c>double</c>.
Returns: Возвращает <c>true</c> в случае успешного завершения операции.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GripData.ChangeGripStatus(Teigha.DatabaseServices.ObjectId,Status)
Метод предназначен для изменения статуса этой ручки.
entityId: Идентификатор объекта чертежа. Тип <c>ObjectId</c>.
newStatus: Новый статус ручки. Перечисление <c>GripData.Status</c>.

Teigha.DatabaseServices.GripData.GetHotGripDimensionData(System.Double)
Метод позволяет получить данные размера с активной ручкой.
dimScale: Масштаб размера. Тип <c>double</c>.
Returns: Возвращает данные размера. Тип <c>DynamicDimensionDataCollection</c>.

Teigha.DatabaseServices.GripData.GetHoverDimensionData(System.Double)
Метод позволяет получить данные подсвеченного размера.
dimScale: Масштаб размера. Тип <c>double</c>.
Returns: Возвращает данные подсвеченного размера. Тип <c>DynamicDimensionDataCollection</c>.

Teigha.DatabaseServices.GripData.GetTooltip
Метод задает функцию, используемую для получения строки подсказки для этой ручки.
Returns: Возвращает строку подсказки для ручки. Тип <c>String</c>.

Teigha.DatabaseServices.GripData.OnGripStatusChanged(Teigha.DatabaseServices.ObjectId,Status)
Метод предназначен для обработки события изменения статуса ручки.
entityId: Идентификатор объекта чертежа. Тип <c>ObjectId</c>.
newStatus: Новый статус ручки. Перечисление <c>GripData.Status</c>.

Teigha.DatabaseServices.GripData.OnHotGrip(Teigha.DatabaseServices.ObjectId,Teigha.GraphicsInterface.Context)
Метод предназначен для обработки события, когда ручка становится активной (выделенной).
entityId: Идентификатор объекта чертежа. Тип <c>ObjectId</c>.
contextFlags: Флаги контекста ручки. Перечисление <c>Context</c>.
Returns: Возвращает результат выполнения операции. Перечисление <c>GripData.ReturnValue</c>.

Teigha.DatabaseServices.GripData.OnHover(Teigha.DatabaseServices.ObjectId,Teigha.GraphicsInterface.Context)
Метод предназначен для обработки события подсвечивания этой ручки курсором мыши.
entityId: Идентификатор объекта чертежа. Тип <c>ObjectId</c>.
contextFlags: Флаги контекста ручки. Перечисление <c>Context</c>.
Returns: Возвращает результат выполнения операции. Перечисление <c>GripData.ReturnValue</c>.

Teigha.DatabaseServices.GripData.OnRightClick(Teigha.DatabaseServices.GripDataCollection,Teigha.DatabaseServices.ObjectIdCollection)
Метод предназначен для обработки события нажатия правой кнопки мыши на этой ручке.
hotGrips: Коллекция активных ручек. Тип <c>GripDataCollection</c>.
entities: Коллекция идентификаторов объектов чертежа.  Тип <c>ObjectIdCollection</c>.
Returns: Возвращает интерфейс <c>System.Collections.Generic.IEnumerable<Runtime.IMenuItem></c>.

Teigha.DatabaseServices.GripData.ViewportDraw(GraphicsInterface.ViewportDraw,Teigha.DatabaseServices.ObjectId,DrawType,Nullable&lt;Point3d&gt;,System.Int32)
Метод предоставляет указатель на обратный вызов, который отвечает за отрисовку пользовательской графики глифа ручки, зависящей от видового экрана. Возвращаемое значение может быть нулевым.
worldDraw: Входной интерфейс <c>Teigha.GraphicsInterface.<link Teigha
entityId: Идентификатор объекта чертежа. Тип <c>ObjectId</c>.
t: Тип отображения ручки. Перечисление <c>GripData.DrawType</c>.
imageGripPoint: Точка привязки изображения ручки. Тип <c>Point3d?</c>.
gripSizeInPixels: Размер ручки в пикселях. Тип <c>int</c>.
Returns: Возвращает <c>true</c> в случае успешного завершения операции.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GripData.WorldDraw(GraphicsInterface.WorldDraw,Teigha.DatabaseServices.ObjectId,DrawType,Nullable&lt;Point3d&gt;,System.Double)
Метод предоставляет указатель на обратный вызов, который отвечает за отрисовку пользовательской графики глифа ручки, не зависящей от видового экрана.
worldDraw: Входной интерфейс <c>Teigha.GraphicsInterface.<link Teigha
entityId: Идентификатор объекта чертежа.  Тип <c>ObjectId</c>.
t: Тип отображения ручки. Перечисление <c>GripData.DrawType</c>.
imageGripPoint: Точка привязки ручки. Тип <c>Point3d?</c>.
dGripSize: Размер ручки. Тип <c>double</c>.
Returns: Возвращает <c>true</c> в случае успешного завершения операции.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GripData.AlternateBasePoint
Свойство обеспечивает доступ к альтернативной базовой точке этой ручки.
Returns: Возвращает базовую точку ручки. Тип <c>Point3d?</c>.

Teigha.DatabaseServices.GripData.AppData
Свойство возвращает данные приложения, связанные с этим объектом ручки.
Returns: Возвращает указатель на данные этой ручки. Тип <c>IntPtr</c>.

Teigha.DatabaseServices.GripData.DrawAtDragImageGripPoint
Свойство определяет, следует ли отрисовывать глиф ручки в базовой точке перемещаемого изображения ручки.
Returns: Возвращает <c>true</c>, если глиф ручки должен отрисовываться.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GripData.ForcedPickOn
Свойство определяет, следует ли идентифицировать все объекты в пределах зоны выделения, независимо от того, получена ли точка и активны ли в данный момент какие-либо конкретные режимы объектной привязки OSNAP.
Returns: Возвращает <c>true</c>, если следует идентифицировать все объекты в пределах зоны выделения. В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GripData.GizmosEnabled
Свойство определяет, следует ли использовать гизмо для изменения ручки.
Returns: Возвращает <c>true</c>, если гизмо должны появляться при подсвечивании ручки курсором.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GripData.GripPoint
Свойство предоставляет доступ к точке привязки этой ручки.
Returns: Возвращает базовую точку ручки. Тип <c>Point3d</c>.

Teigha.DatabaseServices.GripData.HotGripInvokesRightClick
Свойство определяет, назначено ли выделение ручки нажатию правой кнопки мыши.
Returns: Возвращает <c>true</c>, если ручка становится активной при нажатии правой кнопки мыши.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GripData.IsPerViewport
Свойство определяет, используется ли эта ручка в каждом видовом экране.
Returns: Возвращает <c>true</c>, если ручка используется в каждом видовом экране.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GripData.ModeKeywordsDisabled
Свойство предоставляет возможность отключить активацию ключевых слов.
Returns: Возвращает <c>true</c>, если активация ключевых слов отключена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GripData.RubberBandLineDisabled
Свойство определяет, допускается ли отображать резиновую линию во время любых операций перетаскивания.
Returns: Возвращает <c>true</c>, если отображение резиновой линии не допускается.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GripData.SkipWhenShared
Свойство определяет, следует ли пропускать отрисовку пользовательской графики этой ручки, если ее базовая точка является общей.
Returns: Возвращает <c>true</c>, если базовая точка ручки является общей, и отрисовка ручки пропускается.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.GripData.TriggerGrip
Свойство позволяет определить, является ли эта ручка триггерной.
Returns: Возвращает <c>true</c>, если ручка является триггерной.
В противном случае возвращает <c>false</c>.