Teigha.DatabaseServices.Handle
Класс Handle предназначен для инкапсуляции 64-битных целочисленных идентификаторов дескрипторов, которые использовались в ряде ранних релизов.

Teigha.DatabaseServices.Handle.#ctor
Конструктор создает экземпляр дескриптора Handle, используя на входе значение 64-битного дескриптора.
value: Входное значение 64-битного дескриптора, тип long.

Teigha.DatabaseServices.Handle.Equals(Object)
Возвращает true, если данный объект идентичен укзазанному в аргументе.
obj: Объект для сравнения, тип Object.
Returns: Возвращает true, если данный объект идентичен укзазанному в аргументе, и false в противном случае.

Teigha.DatabaseServices.Handle.GetHashCode
Возвращает хэш-код для данного объекта.
Returns: Возвращает хэш-код для данного объекта, тип Int32.

Teigha.DatabaseServices.Handle.ToString
Возвращает эквивалентное строковое представление данного объекта.
Returns: Возвращает эквивалентное строковое представление данного объекта, тип String.

Teigha.DatabaseServices.Handle.ToString(IFormatProvider)
Возвращает эквивалентное строковое представление данного объекта в формате, который учитывает заданные поставщиком языковые и региональные параметры.
provider: Поставщик настраиваемого формата, реализующий интерфейс IFormatProvider.
Returns: Возвращает эквивалентное строковое представление данного объекта, тип String.

Teigha.DatabaseServices.Handle.IsOne
Возвращает true, если значение дескриптора у этого объекте равно 1.
Returns: Возвращает true, если значение дескриптора у этого объекте равно 1, и false в противном случае.

Teigha.DatabaseServices.Handle.Value
Свойство предоставляет доступ к значению данного дескриптора.
Returns: Свойство возвращает значение данного дескриптора, тип Int64.