Teigha.DatabaseServices.Cell
Данный класс представляет ячейки таблицы.

Teigha.DatabaseServices.Cell.#ctor(Teigha.DatabaseServices.Table,System.Int32,System.Int32)
Конструктор класса Cell. Создает ячейку в указанной таблице в заданных строке и столбце.
table: Таблица, в которой создается ячейка. Тип <c>Table</c>.
row: Индекс строки таблицы. Тип <c>int</c>.
column: Индекс столбца таблицы. Тип <c>int</c>.

Teigha.DatabaseServices.Cell.GetBlockAttributeValue(Teigha.DatabaseServices.ObjectId)
Метод позволяет получить значение указанного атрибута блока данной ячейки.
attDefId: Идентификатор объекта определения атрибута. Тип <c>ObjectId</c>.
Returns: Возвращает значение указанного атрибута блока.  Тип <c>String</c>.

Teigha.DatabaseServices.Cell.GetDataLinkRange
Метод позволяет получить диапазон ячеек со ссылками на внешние данные.
Returns: Возвращает диапазон ячеек. Тип <c>CellRange</c>.

Teigha.DatabaseServices.Cell.GetExtents
Метод предназначен для получения ограничивающего бокса данной ячейки в виде коллекции трехмерных точек.
Returns: Возвращает коллекцию трехмерных точек, которые определяют ограничивающий бокс данной ячейки.
Тип <c>Point3dCollection</c>.

Teigha.DatabaseServices.Cell.GetMergeRange
Метод позволяет получить диапазон слияния данной ячейки.
Returns: Возвращает диапазон слияния данной ячейки. Тип <c>CellRange</c>.

Teigha.DatabaseServices.Cell.GetTextString(Teigha.DatabaseServices.FormatOption)
Метод позволяет получить текстовую строку из данной ячейки, отформатированную согласно указанным опциям.
formatOption: Опции форматирования строки. Значение из перечисления <c>FormatOption</c>.
Returns: Возвращает отформатированную текстовую строку из данной ячейки. Тип <c>String</c>.

Teigha.DatabaseServices.Cell.GetValue(Teigha.DatabaseServices.FormatOption)
Метод позволяет получить значение, сохраненное в данной ячейке.
formatOption: Опции форматирования значения из ячейки из перечисления <c>FormatOption</c>.
Returns: Возвращает значение из ячейки в требуемом формате. Тип <c>Object</c>.

Teigha.DatabaseServices.Cell.RemoveDataLink
Метод предназначен для удаления ссылки на данные из этой ячейки.

Teigha.DatabaseServices.Cell.ResetValue
Метод предоставляет возможность сбросить значение в этой ячейке.

Teigha.DatabaseServices.Cell.SetBlockAttributeValue(Teigha.DatabaseServices.ObjectId,String)
Метод задаёт значение указанного атрибута блока данной ячейки.
attDefId: Идентификатор объекта определения атрибута. Тип <c>ObjectId</c>.
value: Новое значение атрибута. Тип <c>String</c>.

Teigha.DatabaseServices.Cell.SetValue(Object,Teigha.DatabaseServices.ParseOption)
Метод позволяет задать значение указанного атрибута блока данной ячейки.
value: Новое значение атрибута. Тип <c>Object</c>.
parseOption: Опции представления нового значения из перечисления <c>ParseOption</c>.

Teigha.DatabaseServices.Cell.UpdateDataLink(Teigha.DatabaseServices.UpdateDirection,Teigha.DatabaseServices.UpdateOption)
Метод обновляет в этой ячейке ссылки на внешние данные.
dir: Направление обновления ссылок. Значение из перечисления <c>UpdateDirection</c>.
option: Опции обновления ссылок. Значение из перечисления <c>UpdateOption</c>.

Teigha.DatabaseServices.Cell.AttachmentPoint
Свойство возвращает точку присоединения ячейки.
Returns: Возвращает точку присоединения ячейки. Тип <c>Point3d</c>.

Teigha.DatabaseServices.Cell.BlockTableRecordId
Свойство предоставляет доступ к идентификатору записи в таблице блоков для данного объекта.
Returns: Возвращает идентификатор записи в таблице блоков. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.Cell.CellType
Свойство возвращает тип данной ячейки.
Returns: Возвращает тип ячейки. Значение из перечисления <c>TableCellType</c>.

Teigha.DatabaseServices.Cell.Column
Свойство возвращает индекс столбца данной ячейки.
Returns: Возвращает индекс столбца данной ячейки. Тип <c>int</c>.

Teigha.DatabaseServices.Cell.Contents
Свойство возвращает коллекцию элементов содержимого данной ячейки.
Returns: Возвращает коллекцию элементов содержимого данной ячейки. Тип <c>CellContentsCollection</c>.

Teigha.DatabaseServices.Cell.ContentTypes
Свойство возвращает тип содержимого ячейки.
Returns: Возвращает тип содержимого ячейки из перечисления <c>Teigha.DatabaseServices.CellContentTypes</c>.

Teigha.DatabaseServices.Cell.DataLink
Свойство обеспечивает доступ к ссылке на внешние данные, которая хранится в данной ячейке.
Returns: Возвращает ссылку на данные. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.Cell.FieldId
Свойство обеспечивает доступ к идентификатору поля в данной ячейке.
Returns: Возвращает идентификатор поля.  Тип <c>ObjectId</c>.

Teigha.DatabaseServices.Cell.Row
Свойство возвращает индекс строки данной ячейки.
Returns: Возвращает индекс строки данной ячейки. Тип <c>int</c>.

Teigha.DatabaseServices.Cell.TextString
Свойство обеспечивает доступ к текстовой строке, которая хранится в данной ячейке.
Returns: Возвращает строку. Тип <c>String</c>.

Teigha.DatabaseServices.Cell.ToolTip
Свойство обеспечивает доступ к подсказке, сохраненной в данной ячейке.
Returns: Возвращает текст подсказки в ячейке. Тип <c>String</c>.

Teigha.DatabaseServices.Cell.Value
Свойство обеспечивает доступ к значению, хранимому в данной ячейке.
Returns: Возвращает к значению, хранимому в данной ячейке. Тип <c>Object</c>.