Teigha.BoundaryRepresentation.Element
Класс <c>Element</c> является интерфейсным базовым классом для элементов сети.
Элемент сети представляет собой минимальное замкнутое, упорядоченное подмножество соединенных узлов сети.
Этот класс определяет функционал, который является общим для элементов сети во всех измерениях.
Пользователь не может создавать экземпляры этого класса непосредственно.