Teigha.GraphicsSystem.ClientViewInfo.AcadWindowId
Свойство <c>AcadWindowId</c> представляет идентификатор окна nanoCAD.
Returns: Возвращает идентификатор окна nanoCAD.
Тип <c>long</c>.

Teigha.GraphicsSystem.ClientViewInfo.ViewportFlags
Свойство <c>ViewportFlags</c> представляет флаги видового экрана.
Returns: Возвращает флаги видового экрана.
Тип <c>unsigned int</c>.

Teigha.GraphicsSystem.ClientViewInfo.ViewportId
Свойство <c>ViewportId</c> представляет идентификатор видового экрана.
Returns: Возвращает идентификатор видового экрана.
Тип <c>int</c>.

Teigha.GraphicsSystem.ClientViewInfo.ViewportObjectId
Свойство <c>ViewportObjectId</c> представляет идентификатор объекта видового экрана.
Returns: Возвращает идентификатор объекта видового экрана.
Тип <c>long long</c>.