Teigha.DatabaseServices.TableEnumerator
Класс <c>TableEnumerator</c> представляет перечислитель для таблицы.

Teigha.DatabaseServices.TableEnumerator.MoveNext
Метод обеспечивает переход перечислителя к следующему элементу таблицы.
Returns: Возвращает <c>true</c>, если текущий элемент перечислителя находится в таблице (его индекс не превышает максимальный индекс таблицы).
Если он вышел за пределы таблицы, возвращает <c>false</c>.

Teigha.DatabaseServices.TableEnumerator.Reset
Метод реинициализирует перечислитель, сбрасывая его текущий индекс в значение <c>-1</c>.