Teigha.DatabaseServices.SequenceEnd
Класс <c>SequenceEnd</c> представляет объекты <c>SequenceEnd</c> в экземпляре базы данных <c>Database</c>.

Teigha.DatabaseServices.SequenceEnd.#ctor
Конструктор по умолчанию класса <c>SequenceEnd</c>.