HostMgd.EditorInput.Editor
Системный объект класса, наследованный от этого абстрактного
базового класса, позволяет приложению управлять реакторами
редактора nanoCAD. Приложения могут добавлять и удалять
реакторы из цепочки реакторов редактора nanoCAD.

HostMgd.EditorInput.Editor.DoPrompt(HostMgd.EditorInput.PromptOptions)
Выполняет приглашение в соответствии с заданными опциями.
Возвращает результат операции после приглашения.
opt: Опции для приглашения

HostMgd.EditorInput.Editor.Drag(HostMgd.EditorInput.Jig)
Запускает операцию Jig. Возвращает результат этой операции.
jig: Jig для перетаскивания

HostMgd.EditorInput.Editor.Drag(HostMgd.EditorInput.PromptDragOptions)
Предлагает пользователю изменить положение выделенного набора путем графического перемещения этого набора.
Только объекты пространства модели  и пространства листа текущего чертежа могут работать с этой функцией.
Не работает с неграфическими объектами или примитивами в других определениях таблицы блоков.
Предлагает пользователю изменить положение выделенного набора объектов путем перетаскивания.
Функция работает только с графическими объектами пространства модели и пространства листа текущего чертежа.
options: Опции для перетаскивания

HostMgd.EditorInput.Editor.Drag(HostMgd.EditorInput.SelectionSet,System.String,DragCallback)
Предлагает пользователю изменить положение выделенного набора путем графического перемещения этого набора.
Только объекты пространства модели  и пространства листа текущего чертежа могут работать с этой функцией.
Не работает с неграфическими объектами или примитивами в других определениях таблицы блоков.
Приглашает пользователя изменить положение множества выбранных обектов путем перетаскиванием.
selection: Множество выбранных объектов
message: Приглашающее сообщение
callback: Любое событие перетаскивания
selection: Множество выбранных объектов
message: Приглашающее сообщение
callback: Функция обратного вызова

HostMgd.EditorInput.Editor.DrawVector(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,System.Int32,System.Boolean)
Отрисовка вектора, заданного начальной и конечной точками.
Также могут быть указаны цвет и выделение.
from: Начальная точка вектора
to: Конечная точка вектора
color: Цвет вектора

HostMgd.EditorInput.Editor.DrawVectors(Teigha.DatabaseServices.ResultBuffer,Teigha.Geometry.Matrix3d)
Отрисовка набора векторов, которые преобразуются по входной
матрице.
rb: Результирующий буфер, содержащий вектора
transform: Матрица преобразования

HostMgd.EditorInput.Editor.GetAngle(HostMgd.EditorInput.PromptAngleOptions)
Предлагает пользователю ввести угол с учетом
текущего значения системной переменной ANGBASE.
options: Дополнительные параметры

HostMgd.EditorInput.Editor.GetAngle(String)
Предлагает пользователю ввести угол с учетом
текущего значения системной переменной ANGBASE.

HostMgd.EditorInput.Editor.GetCorner(HostMgd.EditorInput.PromptCornerOptions)
Позволяет пользователю ввести информацию о точке угла
прямоугольника.
options: Необязательные параметры приглашения

HostMgd.EditorInput.Editor.GetCorner(String,Teigha.Geometry.Point3d)
Позволяет пользователю ввести информацию о точке угла
прямоугольника.

HostMgd.EditorInput.Editor.GetDistance(HostMgd.EditorInput.PromptDistanceOptions)
Позволяет пользователю ввести информацию о линейном
расстоянии. Возвращает объект PromptDoubleResult с
результатом ввода.
options: Необязательные параметры приглашения

HostMgd.EditorInput.Editor.GetDistance(String)
Позволяет пользователю ввести информацию о линейном
расстоянии. Возвращает объект PromptDoubleResult с
результатом ввода.

HostMgd.EditorInput.Editor.GetDouble(HostMgd.EditorInput.PromptDoubleOptions)
Позволяет пользователю ввести действительное число.
Возвращает объект PromptDoubleResult с результатом ввода.
options: Необязательные параметры приглашения

HostMgd.EditorInput.Editor.GetDouble(String)
Позволяет пользователю ввести действительное число.

HostMgd.EditorInput.Editor.GetEntity(HostMgd.EditorInput.PromptEntityOptions)
Приглашает пользователя выбрать геометрический объект по
одной из его точек.
Ожидает ввод пользователя и возвращает имя геометрического
объекта и точку, которая используется для выбора этого
объекта.
Метод не возвращает имя не графического объекта.
options: Необязательные параметры приглашения

HostMgd.EditorInput.Editor.GetEntity(String)
Приглашает пользователя выбрать геометрический объект по
одной из его точек.
Исполнение приостанавливается до ввода и имени
геометрического объекта, и точки, которая используется для
выбора этого объекта.
Метод не возвращает имя не графического объекта.
message: Приглашающее сообщение

HostMgd.EditorInput.Editor.GetFileNameForOpen(HostMgd.EditorInput.PromptOpenFileOptions)
Метод эмулирует ввод имени открываемого файла.
Формирует приглашение в командной строке, если значение
переменной FILEDIA равно 0 или выполняется скрипт
или процедура LISP.
options: Опции окна открытия файла

HostMgd.EditorInput.Editor.GetFileNameForOpen(String)
Метод эмулирует ввод имени открываемого файла.
Формирует приглашение в командной строке, если значение
переменной FILEDIA равно 0 или выполняется скрипт
или процедура LISP.
message: Строка приглашения

HostMgd.EditorInput.Editor.GetFileNameForSave(HostMgd.EditorInput.PromptSaveFileOptions)
Метод эмулирует ввод имени сохраняемого файла.
Формирует приглашение в командной строке, если значение
переменной FILEDIA равно 0 или выполняется скрипт
или процедура LISP.
options: Опции для сохранения файла

HostMgd.EditorInput.Editor.GetFileNameForSave(String)
Метод эмулирует ввод имени сохраняемого файла.
Формирует приглашение в командной строке, если значение
переменной FILEDIA равно 0 или выполняется скрипт
или процедура LISP.
message: Приглашающее сообщение

HostMgd.EditorInput.Editor.GetInteger(HostMgd.EditorInput.PromptIntegerOptions)
Позволяет пользователю ввести целое число. Пользователь может
ввести любое число от -32768 до +32767.
options: Необязательные параметры приглашения

HostMgd.EditorInput.Editor.GetInteger(String)
Позволяет пользователю ввести целое число. Пользователь может
ввести любое число от -32768 до +32767.

HostMgd.EditorInput.Editor.GetKeywords(HostMgd.EditorInput.PromptKeywordOptions)
Позволяет пользователю ввести ключевое слово с клавиатуры.
Если пользователь введет строку, не специфицируемую при
вызове GetKeywords(), nanoCAD выведет сообщение об ошибке и
после этого можно выполнить повторную поптыку ввода
(приглашение, если оно должно быть, будет повторно выведено).
Если пользователь нажмет только клавишу 'Enter', то
GetKeywords() вернет пустую строку (""), за исключением
случая, когда вызов GetKeywords() запрещает пустые значения
на входе.
options: Необязательные параметры приглашения

HostMgd.EditorInput.Editor.GetKeywords(String,...array)
Позволяет пользователю ввести ключевое слово с клавиатуры.
Список ключевых слов, допустимых в данном методе,
определяется с помощью предварительного вызова метода
GetInteger(). Если пользователь введет строку, не
специфицируемую при вызове GetKeywords(), nanoCAD выведет
сообщение об ошибке и после этого можно выполнить повторную
поптыку ввода (приглашение, если оно должно быть, будет
повторно выведено). Если пользователь введет только клавишу
'Enter', то GetKeywords() вернет пустую строку (""), за
исключением случая, когда вызов GetKeywords() запрещает
пустые значения на входе.

HostMgd.EditorInput.Editor.GetNestedEntity(HostMgd.EditorInput.PromptNestedEntityOptions)
Позволяет пользователю получить имя выбранного геометрического объекта
(вложенного во внешнюю ссылку или блок) и базовую точку,
в которой был выбран этот объект.
options: Необязательные параметры приглашения

HostMgd.EditorInput.Editor.GetNestedEntity(String)
Позволяет пользователю получить имя выбранного геометрического объекта
(вложенного во внешнюю ссылку или блок) и базовую точку,
в которой был выбран этот объект.
message: Приглашающее сообщение

HostMgd.EditorInput.Editor.GetPoint(HostMgd.EditorInput.PromptPointOptions)
Позволяет пользователю ввести точку.
options: Необязательные параметры приглашения

HostMgd.EditorInput.Editor.GetPoint(String)
Позволяет пользователю ввести точку.

HostMgd.EditorInput.Editor.GetSelection(HostMgd.EditorInput.PromptSelectionOptions)
Позволяет пользователю получить множество выбранных объектов,
используя параметр options для приглашения для выбора
объектов, и не используя фильтр на выбираемые объекты.
options: Опции выбора

HostMgd.EditorInput.Editor.GetSelection(HostMgd.EditorInput.PromptSelectionOptions,HostMgd.EditorInput.SelectionFilter)
Позволяет пользователю получить множество выбранных объектов,
используя параметр options для приглашения для выбора
объектов, и используя фильтр на выбираемые объекты.
Указание набора объектов.
options: Опции выбора
filter: Фильтр выбора

HostMgd.EditorInput.Editor.GetSelection(HostMgd.EditorInput.SelectionFilter)
Возвращает набор выбранных объектов, полученное из полного
набора выбранных объектов с помощью применения фильтра
filter.
filter: Фильтр на выбираемые объекты

HostMgd.EditorInput.Editor.GetString(HostMgd.EditorInput.PromptStringOptions)
Позволяет пользователю ввести строку. Возвращает объект
PromptResult, представляющий результат ввода.
options: Необязательные параметры приглашения

HostMgd.EditorInput.Editor.GetString(String)
Позволяет пользователю ввести строку. Возвращает объект
PromptResult, представляющий результат ввода.

HostMgd.EditorInput.Editor.GetViewportNumber(System.Drawing.Point)
Получение номера видового экрана по точке экрана.
point: Точка, по которой определяется номер видового экрана

HostMgd.EditorInput.Editor.PointToScreen(Teigha.Geometry.Point3d,System.Int32)
Функция возвращает трехмерую точку на экране с заданным
номером видового экрана.
pt: Точка, которую необходимо захватить
viewportNumber: Номер видового экрана

HostMgd.EditorInput.Editor.PointToWorld(System.Drawing.Point)
Функция возвращает точку в мировых координатах текущего видового экрана.
pt: Точка в системе координат экрана

HostMgd.EditorInput.Editor.PointToWorld(System.Drawing.Point,System.Int32)
Функция возвращает точку в мировых координатах заданного видового экрана.
pt: Точка в системе координат экрана
viewportNumber: Номер видового экрана

HostMgd.EditorInput.Editor.SelectAll(HostMgd.EditorInput.SelectionFilter)
Выбирает все объекты (с учетом фильтра) и возвращает этот
набор объектов.
filter: Фильтр для выбора объектов

HostMgd.EditorInput.Editor.SelectCrossingPolygon(Teigha.Geometry.Point3dCollection)
Возвращает в качестве выбранного набор объектов, пересекающих
или входящих в многоугольник, заданный своими вершинами.

HostMgd.EditorInput.Editor.SelectCrossingPolygon(Teigha.Geometry.Point3dCollection,HostMgd.EditorInput.SelectionFilter)
Возвращает в качестве выбранного набор объектов, пересекающих
или входящих в многоугольник, заданный своими вершинами, и
удовлетворяющих заданному фильтру.
filter: Фильтр на выбор объектов

HostMgd.EditorInput.Editor.SelectCrossingWindow(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Возвращает в качестве выбранного набор объектов, пересекающих
или входящих в окно, заданное двумя противоположными углами.
pt1: Точка, задающая первый угол окна
pt2: Точка, задающая второй угол окна

HostMgd.EditorInput.Editor.SelectCrossingWindow(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,HostMgd.EditorInput.SelectionFilter)
Возвращает в качестве выбранного набор объектов, пересекающих
или входящих в окно, заданное двумя противоположными углами,
и удовлетворяющих заданному фильтру.
pt1: Точка, задающая первый угол окна
pt2: Точка, задающая второй угол окна
filter: Фильтр на выбираемые объекты

HostMgd.EditorInput.Editor.SelectFence(Teigha.Geometry.Point3dCollection)
Возвращает в качестве выбранного множество объектов,
пересекаемых линией выбора, представленной набором вершин.
fence: Коллекция точек, представляющих вершины линии выбора

HostMgd.EditorInput.Editor.SelectFence(Teigha.Geometry.Point3dCollection,HostMgd.EditorInput.SelectionFilter)
Возвращает в качестве выбранного множество объектов,
пересекаемых линией выбора, представленной набором вершин, и
удовлетворяющих заданному фильтру.
fence: Коллекция точек, представляющих вершины линии выбора
filter: Фильтр на выбираемые объекты

HostMgd.EditorInput.Editor.SelectWindow(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Возвращает в качестве выбранного набор объектов, полностью
входящих в окно, заданное двумя противоположными углами.
pt1: Точка, задающая первый угол окна
pt2: Точка, задающая второй угол окна

HostMgd.EditorInput.Editor.SelectWindow(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,HostMgd.EditorInput.SelectionFilter)
Возвращает в качестве выбранного набор объектов, полностью
входящих в окно, заданное двумя противоположными углами, и
удовлетворяющих заданному фильтру.
pt1: Точка, задающая первый угол окна
pt2: Точка, задающая второй угол окна
filter: Фильтр на выбираемые объекты

HostMgd.EditorInput.Editor.SelectWindowPolygon(Teigha.Geometry.Point3dCollection)
Возвращает в качестве выбранного набор объектов, полностью
входящих в многоугольник, заданный своими вершинами.

HostMgd.EditorInput.Editor.SelectWindowPolygon(Teigha.Geometry.Point3dCollection,HostMgd.EditorInput.SelectionFilter)
Возвращает в качестве выбранного набор объектов, полностью
входящих в многоугольник, заданный своими вершинами, и
удовлетворяющих заданному фильтру.
filter: Фильтр на выбор объектов

HostMgd.EditorInput.Editor.SetCurrentView(Teigha.DatabaseServices.ViewTableRecord)
Установка текущего вида, заданного параметром метода.
value: Значение нового значения записи в таблице видов

HostMgd.EditorInput.Editor.SetImpliedSelection(array )
Установка набора выделенных объектов

HostMgd.EditorInput.Editor.StartUserInteraction(System.Windows.Forms.Control)
Скрывает модальную форму пользователя, позволяя выполнять другие команды.
modalForm: Форма типа Control
Returns:

HostMgd.EditorInput.Editor.TraceBoundary(Teigha.Geometry.Point3d,System.Boolean)
Возвращает множество полилиний, образующих замкнутый контур вокруг указанной точки.
seedPoint: Точка, вокруг которой будет производиться поиск замкнутого контура.
detectIslands: Искать ли островки?

HostMgd.EditorInput.Editor.WriteMessage(IFormatProvider,String,...array)
Вывод текста в командной строке.
sFormat: Формат вывода
aAgs: Выводимые значения

HostMgd.EditorInput.Editor.WriteMessage(String)
Вывод текста в командной строке.
message: Выводимый текст

HostMgd.EditorInput.Editor.WriteMessage(String,...array)
Вывод текста в командной строке.
sFormat: Формат вывода
aAgs: Выводимые значения