Teigha.Geometry.CircularArc2d
Класс <c>CircularArc2d</c> представляет окружности и круглые дуги в двумерном пространстве.

Teigha.Geometry.CircularArc2d.#ctor
Конструктор по умолчанию класса <c>CircularArc2d</c>.
Создает единичную окружность с центром (0,0).

Teigha.Geometry.CircularArc2d.#ctor(Teigha.Geometry.Point2d,System.Double)
Конструктор класса <c>CircularArc2d</c>. Создает окружность с заданными центром и радиусом.
center: Входной центр  окружности.  Тип <c>Point2d</c>.
radius: Входной радиус окружности.  Тип <c>double</c>.

Teigha.Geometry.CircularArc2d.#ctor(Teigha.Geometry.Point2d,System.Double,System.Double,System.Double,Teigha.Geometry.Vector2d,System.Boolean)
Конструктор класса <c>CircularArc2d</c>.
Создает круглую дугу с указанными центром, радиусом, начальным и конечным углами.
center: Центр дуги.  Тип <c>Point2d</c>.
radius: Радиус дуги. Тип <c>double</c>.
startAngle: Начальный угол дуги. Тип <c>double</c>.
endAngle: Конечный угол дуги.  Тип <c>double</c>.
referenceVector: Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла).  Тип <c>Vector2d</c>.
isClockWise: Флаг, определяющий, что дуга строится по часовой стрелке. Тип <c>bool</c>.

Teigha.Geometry.CircularArc2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d,System.Double,System.Boolean)
Конструктор класса <c>CircularArc2d</c>.
Создает круглую дугу с заданными концами и величиной прогиба.
startPoint: Начальная точка дуги.  Тип <c>Point2d</c>.
endPoint: Конечная точка дуги.   Тип <c>Point2d</c>.
bulge: Величина прогиба дуги. Тип <c>double</c>.
bulgeFlag: Флаг интерпретации прогиба. Тип <c>bool</c>.

Teigha.Geometry.CircularArc2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Конструктор класса <c>CircularArc2d</c>. Создает круглую дугу по трем точкам.
startPoint: Начальная точка дуги. Тип <c>Point2d</c>.
point: Точка на дуге.        Тип <c>Point2d</c>.
endPoint: Конечная точка дуги.  Тип <c>Point2d</c>.

Teigha.Geometry.CircularArc2d.Create(IntPtr,System.Boolean)
Метод предназначен для создания объекта <c>CircularArc2d</c> на основе переданного  указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, на основе которого создается данный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, который указывает, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>CircularArc2d</c>.

Teigha.Geometry.CircularArc2d.GetTangent(Teigha.Geometry.Point2d)
Метод позволяет получить линию касательной к дуге в указанной точке.
point: Входная точка, в которой требуется построить касательную к дуге.
Returns: Возвращает линию касательной к дуге.
Тип <c>Line2d</c>.

Teigha.Geometry.CircularArc2d.GetTangent(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет получить линию касательной к дуге в указанной точке, вычисленную с указанной точностью.
point: Входная точка, в которой требуется построить касательную к дуге.  Тип <c>Point2d</c>.
tolerance: Входная точность геометрических вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает линию касательной к дуге.
Тип <c>Line2d</c>.

Teigha.Geometry.CircularArc2d.IntersectWith(Teigha.Geometry.CircularArc2d)
Метод позволяет получить точки пересечения данного объекта с указанной дугой окружности.
arc: Входная круглая дуга, пересечение с которой требуется вычислить. Тип <c>CircularArc2d</c>.
Returns: Возвращает массив точек пересечения двух дуг. Тип <c>Point2d[]</c>.

Teigha.Geometry.CircularArc2d.IntersectWith(Teigha.Geometry.CircularArc2d,Teigha.Geometry.Tolerance)
Метод позволяет получить точки пересечения данного объекта с указанной дугой окружности, вычисленные с заданной точностью.
arc: Входная круглая дуга, пересечение с которой требуется вычислить. Тип <c>CircularArc2d</c>.
tolerance: Заданная точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает массив точек пересечения двух дуг. Тип <c>Point2d[]</c>.

Teigha.Geometry.CircularArc2d.IntersectWith(Teigha.Geometry.LinearEntity2d)
Метод позволяет получить точки пересечения данного объекта с указанной 2D-линией.
line: Входная 2D-линия, точки пересечения с которой требуется вычислить.  Тип <c>LinearEntity2d</c>.
Returns: Возвращает массив точек пересечения. Тип <c>Point2d[]</c>.

Teigha.Geometry.CircularArc2d.IntersectWith(Teigha.Geometry.LinearEntity2d,Teigha.Geometry.Tolerance)
Метод позволяет получить точки пересечения данной дуги с указанной линией, вычисленные с заданной точностью.
line: Входная 2D-линия, точки пересечения с которой требуется вычислить. Тип <c>LinearEntity2d</c>.
tolerance: Заданная точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает массив точек пересечения. Тип <c>Point2d[]</c>.

Teigha.Geometry.CircularArc2d.IsInside(Teigha.Geometry.Point2d)
Метод позволяет проверить, находится ли указанная точка в пределах полной окружности данной дуги.
point: Проверяемая 2D-точка.  Тип <c>Point2d</c>.
Returns: Возвращает <c>true</c>, только если точка <c>point</c> располагается в пределах полной окружности данной дуги.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CircularArc2d.IsInside(Teigha.Geometry.Point2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить с заданной точностью, находится ли указанная точка в пределах полной окружности данной дуги.
point: Проверяемая 2D-точка.  Тип <c>Point2d</c>.
tolerance: Заданная точность вычислений. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если точка <c>point</c> располагается в пределах полной окружности данной дуги с точностью <c>tolerance</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Point2d,System.Double)
Метод позволяет переопределить центр и радиус данной дуги.
center: Новое положение центра дуги. Тип <c>Point2d</c>.
radius: Новый радиус дуги. Тип <c>double</c>.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Point2d,System.Double,System.Double,System.Double,Teigha.Geometry.Vector2d,System.Boolean)
Метод позволяет переопределить все параметры данной дуги.
center: Центр дуги.   Тип <c>Point2d</c>.
radius: Радиус дуги. Тип <c>double</c>.
angle1: Начальный угол дуги. Тип <c>double</c>.
angle2: Конечный угол дуги.  Тип <c>double</c>.
referenceVector: Опорный вектор, определяющий направление начала отсчета углов дуги (направление нулевого угла).  Тип <c>Vector2d</c>.
isClockWise: Флаг, определяющий, что дуга строится по часовой стрелке. Тип <c>bool</c>.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d,System.Double,System.Boolean)
Метод позволяет переопределить данную дугу, задавая концы дуги и величину ее прогиба.
startPoint: Начальная точка дуги.  Тип <c>Point2d</c>.
endPoint: Конечная точка дуги.   Тип <c>Point2d</c>.
bulge: Величина прогиба дуги. Тип <c>double</c>.
bulgeFlag: Флаг интерпретации прогиба. Тип <c>bool</c>.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Point2d,Teigha.Geometry.Point2d,Teigha.Geometry.Point2d)
Метод позволяет переопределить данную дугу по трем точкам.
startPoint: Начальная точка дуги. Тип <c>Point2d</c>.
point: Точка на дуге.        Тип <c>Point2d</c>.
endPoint: Конечная точка дуги.  Тип <c>Point2d</c>.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,System.Double,System.Double,System.Double)
Метод позволяет переопределить данную дугу так, чтобы она касалась двух указанных кривых и имела заданный радиус.
curve1: Первая 2D-кривая, задающая условие касательности в начале дуги. Тип <c>Curve2d</c>.
curve2: Вторая 2D-кривая, задающая условие касательности на конце дуги. Тип <c>Curve2d</c>.
radius: Радиус дуги. Тип <c>double</c>.
parameter1: Возвращает параметр, соответствующий точке касания на кривой <c>curve1</c>.  Тип <c>double</c>.
parameter2: Возвращает параметр, соответствующий точке касания на кривой <c>curve2</c>.  Тип <c>double</c>.

Teigha.Geometry.CircularArc2d.Set(Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,Teigha.Geometry.Curve2d,System.Double,System.Double,System.Double)
Метод позволяет переопределить данную дугу так, чтобы она была касательной к трем указанным 2D-кривым.
curve1: Первая 2D-кривая, задающая условие касательности дуги. Тип <c>Curve2d</c>.
curve2: Вторая 2D-кривая, задающая условие касательности дуги. Тип <c>Curve2d</c>.
curve3: Третья 2D-кривая, задающая условие касательности дуги. Тип <c>Curve2d</c>.
parameter1: Возвращает параметр, соответствующий точке касания на кривой <c>curve1</c>. Тип <c>double</c>.
parameter2: Возвращает параметр, соответствующий точке касания на кривой <c>curve2</c>. Тип <c>double</c>.
parameter3: Возвращает параметр, соответствующий точке касания на кривой <c>curve3</c>. Тип <c>double</c>.

Teigha.Geometry.CircularArc2d.SetAngles(System.Double,System.Double)
Метод позволяет переопределить углы начальной и конечной точек данной дуги.
startAngle: Новое значение начального угла. Тип <c>double</c>.
endAngle: Новое значение конечного угла.  Тип <c>double</c>.

Teigha.Geometry.CircularArc2d.SetToComplement
Метод позволяет изменить направление данной дуги при сохранении ее конечных точек.

Teigha.Geometry.CircularArc2d.Center
Свойство <c>Center</c> представляет центр данной дуги.
Returns: Возвращает 2D-точку центра дуги. Тип <c>Point2d</c>.

Teigha.Geometry.CircularArc2d.EndAngle
Свойство <c>EndAngle</c> представляет угол конечной точки дуги относительно опорного вектора.
Returns: Возвращает конечный угол дуги. Тип <c>double</c>.

Teigha.Geometry.CircularArc2d.EndPoint
Свойство <c>EndPoint</c> представляет конечную точку дуги.
Returns: Возвращает конечную точку дуги. Тип <c>Point2d</c>.

Teigha.Geometry.CircularArc2d.IsClockWise
Свойство <c>IsClockWise</c> позволяет проверить, ориентирована ли данная дуга по часовой стрелке.
Returns: Возвращает <c>true</c>, если дуга ориентирована по часовой стрелке.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CircularArc2d.Radius
Свойство <c>Radius</c> представляет радиус дуги.
Returns: Возвращает радиус дуги. Тип <c>double</c>.

Teigha.Geometry.CircularArc2d.ReferenceVector
Свойство <c>ReferenceVector</c> предоставляет доступ к опорному вектору данной дуги.
Returns: Возвращает опорный вектор дуги. Тип <c>Vector2d</c>.

Teigha.Geometry.CircularArc2d.StartAngle
Свойство <c>StartAngle</c> представляет начальный угол дуги.
Returns: Возвращает начальный угол дуги. Тип <c>double</c>.

Teigha.Geometry.CircularArc2d.StartPoint
Свойство <c>StartPoint</c> представляет начальную точку дуги.
Returns: Возвращает начальную точку дуги. Тип <c>Point2d</c>.