Teigha.DatabaseServices.EdgeRef
Класс EdgeRef представляет ссылку на ребро.

Teigha.DatabaseServices.EdgeRef.#ctor
Конструктор класса EdgeRef по умолчанию.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.DatabaseServices.FullSubentityPath)
Конструктор класса EdgeRef. Создает ссылку на ребро на базе указанного полного пути к подобъекту.
path: Полный путь к подобъекту, который используется для создания ссылки на ребро.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.DatabaseServices.CompoundObjectId)
Конструктор класса EdgeRef. Создает ссылку на ребро на основе указанного составного объекта <c>CompoundObjectId</c>.
compoundObjectId: Идентификатор составного объекта, который используется для создания ссылки на ребро. Тип <c>CompoundObjectId</c>.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.SubentityId)
Конструктор класса EdgeRef.
Создает ссылку на ребро на основе полного пути к подобъекту ребра указанного составного объекта.
compoundObjectId: Идентификатор составного объекта. Тип <c>CompoundObjectId</c>.
edgeSubentId: Идентификатор подобъекта-ребра. Тип <c>SubentityId</c>.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.SubentityId,Teigha.DatabaseServices.SubentityId)
Конструктор класса EdgeRef.
Создает ссылку на ребро, используя полные пути подобъектов ребра и грани указанного составного объекта.
compoundObjectId: Идентификатор составного объекта. Тип <c>CompoundObjectId</c>.
edgeSubentId: Идентификатор подобъекта-ребра. Тип <c>SubentityId</c>.
faceSubentId: Идентификатор подобъекта-грани.  Тип <c>SubentityId</c>.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.DatabaseServices.CompoundObjectId,Teigha.DatabaseServices.SubentityId,Teigha.DatabaseServices.SubentityId,Teigha.Geometry.Curve3d)
Конструктор класса EdgeRef.
Создает ссылку на ребро, используя полные пути подобъектов ребра и грани указанного составного объекта и кривую Curve3d.
compoundObjectId: Идентификатор составного объекта. Тип <c>CompoundObjectId</c>.
edgeSubentId: Идентификатор подобъекта-ребра. Тип <c>SubentityId</c>.
faceSubentId: Идентификатор подобъекта-грани.  Тип <c>SubentityId</c>.
curve: 3D-кривая, используемая для создания этой ссылки на ребро. Тип <c>Curve3d</c>.

Teigha.DatabaseServices.EdgeRef.#ctor(Teigha.Geometry.Curve3d)
Конструктор класса EdgeRef. Создает ссылку на ребро, используя указанную кривую Curve3d.
curve: 3D-кривая, используемая для создания этой ссылки на ребро. Тип <c>Curve3d</c>.

Teigha.DatabaseServices.EdgeRef.#ctor(DatabaseServices.Entity)
Конструктор класса <c>EdgeRef</c>. Создает ссылку на ребро, используя указанный объект чертежа <c>Entity</c>.
entity: Объект чертежа, используемый для создания этой ссылки на ребро. Тип <c>DatabaseServices.Entity</c>.

Teigha.DatabaseServices.EdgeRef.Curve
Свойство Curve задает или возвращает кривую Curve3d, на основе которой была создана данная ссылка на ребро.
Returns: Возвращает кривую, на основе которой была создана данная ссылка на ребро. Тип <c>Curve3d</c>.

Teigha.DatabaseServices.EdgeRef.FaceSubentity
Свойство FaceSubentity обеспечивает доступ к идентификатору подобъекта-грани составного объекта, использованной для создания данной ссылки на ребро.
Returns: Возвращает идентификатор подобъекта. Тип <c>SubentityId</c>.