Teigha.Geometry.CoordinateSystem2d.#ctor(Teigha.Geometry.Point2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Конструктор класса <c>CoordinateSystem2d</c>.
Создает экземпляр класса с указанными параметрами.
o: Точка начала системы координат.   Тип <c>Point2d</c>.
x: Направляющий вектор оси <c>X</c>. Тип <c>Vector2d</c>.
y: Направляющий вектор оси <c>Y</c>. Тип <c>Vector2d</c>.

Teigha.Geometry.CoordinateSystem2d.Equals(Object)
Метод предназначен для проверки равенства объектов.
obj: Объект, с которым проверяется равенство.
Returns: Возвращает <c>true</c>, если переданная система координат <c>obj</c> не является нулевой и имеет те же начальную точку и направляющие векторы осей <c>X</c> и <c>Y</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CoordinateSystem2d.GetHashCode
Метод позволяет получить хеш-код данного объекта.
Returns: Возвращает хеш-код данного объекта.
Тип <c>int</c>.

Teigha.Geometry.CoordinateSystem2d.IsEqualTo(Teigha.Geometry.CoordinateSystem2d)
Метод позволяет проверить, совпадает ли переданная в метод координатная система <c>CoordinateSystem2d</c> с данным объектом.
a: Входная система координат, которая сравнивается с данной.  Тип <c>CoordinateSystem2d</c>.
Returns: Возвращает <c>true</c>, если переданная система координат <c>a</c> не является нулевой и имеет те же начальную точку и направляющие векторы осей <c>X</c> и <c>Y</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CoordinateSystem2d.IsEqualTo(Teigha.Geometry.CoordinateSystem2d,Teigha.Geometry.Tolerance)
Метод позволяет проверить, совпадает ли переданная в метод координатная система <c>CoordinateSystem2d</c> с данным объектом в пределах заданной точности.
a: Проверяемая система координат. Тип <c>CoordinateSystem2d</c>.
tolerance: Заданная точность вычислений.  Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если переданная система координат <c>a</c> не является нулевой и имеет те же начальную точку и направляющие векторы осей <c>X</c> и <c>Y</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CoordinateSystem2d.ToString
Метод позволяет получить эквивалентное строковое представление данного объекта.
Returns: Возвращает строковое представление данного объекта.
Тип <c>String</c>.

Teigha.Geometry.CoordinateSystem2d.ToString(IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта с учетом региональных и языковых настроек.
provider: Заданный провайдер региональных и языковых настроек.  Тип <c>IFormatProvider</c>.
Returns: Возвращает строковое представление данного объекта.  Тип <c>String</c>.

Teigha.Geometry.CoordinateSystem2d.ToString(String,IFormatProvider)
Метод позволяет получить эквивалентное строковое представление данного объекта в предписанном формате и с учетом заданных языковых и региональных настроек.
format: Предписанный формат строки. Тип <c>String</c>.
provider: Входной провайдер региональных и языковых настроек.  Тип <c>IFormatProvider</c>.
Returns: Возвращает строковое представление данного объекта.
Тип <c>String</c>.

Teigha.Geometry.CoordinateSystem2d.Origin
Свойство <c>Origin</c> представляет точку начала данной системы координат.
Returns: Возвращает точку начала системы координат. Тип <c>Point2d</c>.

Teigha.Geometry.CoordinateSystem2d.Xaxis
Свойство <c>Xaxis</c> представляет направляющий вектор оси <c>X</c> данной системы координат.
Returns: Возвращает направляющий вектор оси <c>X</c> данной системы координат.
Тип <c>Vector2d</c>.

Teigha.Geometry.CoordinateSystem2d.Yaxis
Свойство <c>Yaxis</c> представляет направляющий вектор оси <c>Y</c> данной системы координат.
Returns: Возвращает направляющий вектор оси <c>Y</c> данной системы координат.
Тип <c>Vector2d</c>.