Teigha.DatabaseServices.LoftOptionsBuilder
Этот вспомогательный класс используется для формирования настроек для операции вытягивания поверхности по сечениям (лофт).

Teigha.DatabaseServices.LoftOptionsBuilder.#ctor
Конструктор по умолчанию класса <c>LoftOptionsBuilder</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.#ctor(Teigha.DatabaseServices.LoftOptions)
Конструктор класса <c>LoftOptionsBuilder</c>.
Создает новый экземпляр класса <c>LoftOptionsBuilder</c> на основе существующего объекта <c>LoftOptions</c>.
value: Входной объект типа <c>LoftOptions</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.SetOptionsFromSysvars(Teigha.DatabaseServices.Database)
Метод предназначен для задания параметров лофта в соответствии со значениями системных переменных в указанной базе данных.
pDb: База данных, которая служит источником значений параметров. Тип <c>Database</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.ToLoftOptions
Метод позволяет преобразовать данный объект в объект <c>LoftOptions</c>.
Returns: Возвращает результат преобразования. Тип <c>LoftOptions</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.AlignDirection
Свойство позволяет проверить состояние флага-индикатора "правильной" взаимной ориентации нормалей заданных поперечных сечений.
Returns: Возвращает <c>true</c> в случае корректной взаимной ориентации поперечных сечений.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.ArcLengthParam
Свойство позволяет проверить, применяется ли параметризация по длине дуги.
Returns: Возвращает <c>true</c>, если параметризация применяется.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.Closed
Свойство позволяет проверить состояние флага замкнутости получаемой поверхности.
Returns: Возвращает <c>true</c>, если результирующая поверхность является замкнутой.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.DraftEnd
Свойство возвращает угол в радианах, под которым результирующая поверхность входит в последнее поперечное сечение (end draft angle, угол входа поверхности в сечение).
Returns: Возвращает угол сопряжения поверхности с последним поперечным сечением (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.DraftEndMag
Свойство возвращает величину вытягивания для поверхности у последнего поперечного сечения (end draft magnitude).
Returns: Возвращает величину вытягивания. Тип <c>double</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.DraftStart
Свойство возвращает угол в радианах, под которым результирующая поверхность вытягивается из первого поперечного сечения (start draft angle, угол выхода поверхности из сечения).
Returns: Возвращает угол сопряжения поверхности с первым поперечным сечением (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.DraftStartMag
Свойство возвращает величину вытягивания для поверхности у первого поперечного сечения (start draft magnitude).
Returns: Возвращает величину вытягивания поверхности из первого поперечного сечения. Тип <c>double</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.NormalOption
Свойство возвращает настройку для нормали к плоскости в данном объекте из перечисления <c>LoftOptionsNormalOption</c>.
Returns: Возвращает значение из перечисления <c>LoftOptionsNormalOption</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.NoTwist
Свойство возвращает значение опции <c>noTwist</c> (нет кручения).
Returns: Возвращает <c>true</c>, если установлена опция "нет кручения".
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.Ruled
Свойство возвращает состояние флага <c>ruled</c> (кусочно-линейная поверхность).
Returns: Возвращает <c>true</c>, если строится кусочно-линейная поверхность.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.Simplify
Свойство возвращает состояние флага <c>simplify</c> (упрощение), который определяет возможность использования простых типов поверхностей вместо общего там, где это возможно.
Returns: Возвращает <c>true</c>, если предписывается использовать простые типы поверхностей.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.LoftOptionsBuilder.VirtualGuide
Свойство позволяет определить, используется ли при создании лофт-поверхностей опция <c>virtual guide</c> (виртуальная направляющая).
Returns: Возвращает <c>true</c>, если опция <c>virtual guide</c> используется.
В противном случае возвращает <c>false</c>.