HostMgd.PlottingServices.PlotConfig
Класс описания устройства или РС3 файла, установленных в системе.
Предоставляет методы и свойства для описания размеров листа и полей.
Экземпляр этого класса возвращается свойством PlotConfig класса