Teigha.DatabaseServices.PlotSettingsValidator
Этот класс определяет методы, которые позволяют проверить данные для настроек печати в объекте <c>PlotSettings</c> до фактического переопределения этих настроек в объектах.

Teigha.DatabaseServices.PlotSettingsValidator.GetCanonicalMediaNameList(Teigha.DatabaseServices.PlotSettings)
Метод предоставляет коллекцию независимых от локализации (канонических) имен бумажных носителей для указанного объекта <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c>.
Returns: Возвращает коллекцию независимых от локализации (канонических) имен бумажных носителей.
Тип <c>StringCollection</c>.
Notes
Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод <c>RefreshLists()</c>, чтобы обновить списки стилей и устройств вывода.

Teigha.DatabaseServices.PlotSettingsValidator.GetLocaleMediaName(Teigha.DatabaseServices.PlotSettings,System.Int32)
Метод предоставляет локализованную версию наименования бумажного носителя по его индексу в коллекции
канонических имен носителей, возвращаемой методом <c>GetCanonicalMediaNameList()</c>.
plotSet: Входной объект <c>PlotSettings</c>.
index: Входной индекс носителя в коллекции, возвращаемой методом <c>GetCanonicalMediaNameList()</c>.
Returns: Возвращает локализованную версию наименования бумажного носителя.
Тип <c>String</c>.

Teigha.DatabaseServices.PlotSettingsValidator.GetLocaleMediaName(Teigha.DatabaseServices.PlotSettings,String)
Метод предоставляет локализованную версию наименования бумажного носителя по его наименованию в коллекции
канонических имен носителей, возвращаемой методом <c>GetCanonicalMediaNameList()</c>.
plotSet: Входной объект <c>PlotSettings</c>.
canonicalName: Независимое от локализации каноническое имя носителя.  Тип <c>String</c>.
Returns: Возвращает локализованную версию наименования бумажного носителя.
Тип <c>String</c>.
Notes
Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод <c>RefreshLists()</c>, чтобы обновить списки стилей и устройств вывода.

Teigha.DatabaseServices.PlotSettingsValidator.GetPlotDeviceList
Метод предоставляет коллекцию всех доступных системных принтеров и файлов PC3 c настройками устройств печати.
Returns: Возвращает коллекцию всех доступных системных принтеров.
Тип <c>StringCollection</c>.
Notes
Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод <c>RefreshLists()</c>, чтобы обновить списки стилей и устройств вывода.

Teigha.DatabaseServices.PlotSettingsValidator.GetPlotStyleSheetList
Метод предоставляет коллекцию всех доступных таблиц стилей печати.
Returns: Возвращает коллекцию всех доступных таблиц стилей печати.
Тип <c>StringCollection</c>.
Notes
Если какие-либо устройства печати, файлы PC3 или таблицы стилей печати изменяются после запуска приложения, то перед использованием других методов этого класса следует вызвать метод <c>RefreshLists()</c>, чтобы обновить списки стилей и устройств вывода.

Teigha.DatabaseServices.PlotSettingsValidator.RefreshLists(Teigha.DatabaseServices.PlotSettings)
Метод обновляет в указанном объекте <c>PlotSettings</c> списки устройств печати, коллекцию доступных бумажных носителей и таблицы стилей печати.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.

Teigha.DatabaseServices.PlotSettingsValidator.SetCanonicalMediaName(Teigha.DatabaseServices.PlotSettings,String)
Метод позволяет задать каноническое (независимое от локализации) имя физического носителя для указанного объекта <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
mediaName: Каноническое имя бумажного носителя.  Тип <c>String</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetClosestMediaName(Teigha.DatabaseServices.PlotSettings,System.Double,System.Double,Teigha.DatabaseServices.PlotPaperUnit,System.Boolean)
Метод позволяет задать в указанном объекте <c>PlotSettings</c> имя носителя, который лучше других соответствует переданным параметрам.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
paperWidth: Ширина бумаги. Тип <c>double</c>.
paperHeight: Высота бумаги. Тип <c>double</c>.
units: Единицы измерения для бумажного носителя (миллиметры, дюймы, пиксели).
matchPrintableArea: Флаг, определяющий, идет ли речь о поиске соответствия по границам области печати (значение <c>true</c>) или по физическим размерам бумажного носителя (значение <c>false</c>). Тип <c>bool</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetCurrentStyleSheet(Teigha.DatabaseServices.PlotSettings,String)
Метод позволяет задать текущую таблицу стилей печати для указанного объекта <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
styleSheetName: Имя текущего стиля листа. Тип <c>String</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetCustomPrintScale(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.CustomScale)
Метод позволяет задать для указанного объекта <c>PlotSettings</c> пользовательский масштаб печати.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
scale: Пользовательский масштаб. Тип <c>CustomScale</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetDefaultPlotConfig(Teigha.DatabaseServices.PlotSettings)
Метод применяет параметры настроек печати по умолчанию к указанному объекту <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotCentered(Teigha.DatabaseServices.PlotSettings,System.Boolean)
Метод предназначен для управления центрированием чертежа на листе бумаги с учетом настроек печати <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
isCentered: Входной флаг, управляющий центрированием при печати на листе. Тип <c>bool</c>. В случае значения <c>true</c> поля печати на бумаге вычисляются автоматически так, чтобы расположить чертеж по центру листа.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotConfigurationName(Teigha.DatabaseServices.PlotSettings,String,String)
Метод задает имена устройства печати и носителя для указанного объекта <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
plotDeviceName: Имя системного принтера или файла PC3 с настройками устройств печати.  Тип <c>String</c>.
mediaName: Наименование бумажного носителя. Тип <c>String</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotOrigin(Teigha.DatabaseServices.PlotSettings,Teigha.Geometry.Point2d)
Метод задает в настройках печати <c>PlotSettings</c> смещение начала координат области печати на печатаемом листе.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
origin: Смещение начала координат. Тип <c>Point2d</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotPaperUnits(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.PlotPaperUnit)
Метод задает единицы измерения на бумаге, используемые указанным объектом <c>PlotSettings</c> для полей, смещений, размера бумаги и единиц чертежа.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
units: Единицы измерения из перечисления <c>PlotPaperUnit</c> (миллиметры, дюймы, пиксели).

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotRotation(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.PlotRotation)
Метод задает поворот при печати в настройках этого объекта <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
rotationType: Тип поворота чертежа при печати. Значение из перечисления <c>PlotRotation</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotType(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.PlotType)
Метод задает тип печати чертежа, определенный для данного объекта <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
plotAreaType: Тип печати чертежа. Значение из перечисления <c>PlotType</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotViewName(Teigha.DatabaseServices.PlotSettings,String)
Метод задает именованный вид, определяющий печатаемый контент для указанного объекта <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
viewName: Имя вида. Тип <c>String</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetPlotWindowArea(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.Extents2d)
Метод задает углы рамки, определяющей печатаемую область чертежа для указанного объекта <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
windowArea: Границы рамки. Тип <c>Extents2d</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetStdScale(Teigha.DatabaseServices.PlotSettings,System.Double)
Метод задает для указанного объекта <c>PlotSettings</c> стандартный масштаб как действительное число с плавающей точкой.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
standardScale: Стандартный масштаб. Тип <c>double</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetStdScaleType(Teigha.DatabaseServices.PlotSettings,Teigha.DatabaseServices.StdScaleType)
Метод позволяет задать для указанного объекта <c>PlotSettings</c> стандартный масштаб из перечисления <c>StdScaleType</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
scaleType: Стандартный тип масштаба.  Значение из перечисления <c>StdScaleType</c>.

Teigha.DatabaseServices.PlotSettingsValidator.SetUseStandardScale(Teigha.DatabaseServices.PlotSettings,System.Boolean)
Метод позволяет контролировать использование стандартного масштаба для указанного объекта <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
useStandard: Входной флаг, определяющий, должен ли использоваться стандартный масштаб.

Teigha.DatabaseServices.PlotSettingsValidator.SetZoomToPaperOnUpdate(Teigha.DatabaseServices.PlotSettings,System.Boolean)
Метод управляет настройкой «Масштабировать в размер листа бумаги при обновлении» для указанного объекта <c>PlotSettings</c>.
plotSet: Входной объект <c>PlotSettings</c> с настройками печати.
doZoom: Флаг масштабирования. Тип <c>bool</c>. Если данный флаг принимает значение <c>true</c>, должно применяться масштабирование.

Teigha.DatabaseServices.PlotSettingsValidator.Current
Свойство представляет текущий элемент.
Returns: Возвращает текущий элемент. Тип <c>PlotSettingsValidator</c>.