Teigha.Geometry.Point3dCollection
Этот класс представляет коллекцию 3D-точек.

Teigha.Geometry.Point3dCollection.#ctor
Конструктор по умолчанию для класса Point3dCollection.  Создает пустую коллекцию 3D-точек.

Teigha.Geometry.Point3dCollection.#ctor(array&lt;Point3d&gt;)
Конструктор для класса Point3dCollection.  Создает коллекцию 3D-точек на основе переданного массива точек.
values: Входной массив точек. Тип Point3d[].

Teigha.Geometry.Point3dCollection.Add(Teigha.Geometry.Point3d)
Метод добавляет точку в коллекцию и возвращает индекс вновь добавленного элемента коллекции.
p: Добавляемая точка. Тип Point3d.
Returns: Возвращает отсчитываемый от нуля индекс вновь добавленного элемента коллекции.  Тип int.

Teigha.Geometry.Point3dCollection.Clear
Метод предназначен для очистки коллекции 3D-точек.

Teigha.Geometry.Point3dCollection.Contains(Teigha.Geometry.Point3d)
Метод проверяет, содержится ли в коллекции точка, совпадающая с заданной.
p: Точка Point3d для поиска.
Returns: Возвращает true, если в коллекции присутствует точка, совпадающая с заданной, в противном случае возвращает false.

Teigha.Geometry.Point3dCollection.CopyTo(array&lt;Point3d&gt;,System.Int32)
Метод копирует эту коллекцию точек в указанный массив, начиная с указанного индекса.
a: Входной массив, в который выполняется копирование. Тип Point3d[].
index: Входной индекс, начиная с которого в массив копируются точки из коллекции. Тип int.

Teigha.Geometry.Point3dCollection.GetEnumerator
Метод предоставляет перечислитель для этой коллекции точек.
Returns: Возвращает перечислитель. Тип System.Collections.IEnumerator.

Teigha.Geometry.Point3dCollection.IndexOf(Teigha.Geometry.Point3d)
Метод определяет индекс элемента коллекции, соответствующего указанной точке.
p: Точка, для которой требуется определить индекс в коллекции. Тип Point3d.
Returns: Возвращает отсчитываемый от нуля индекс элемента коллекции, соответствующего точке p.

Teigha.Geometry.Point3dCollection.Insert(System.Int32,Teigha.Geometry.Point3d)
Метод позволяет вставить точку в коллекцию по указанному индексу.
index: Индекс для вставки нового элемента коллекции. Тип int.
value: Вставляемая в коллекцию точка. Тип Point3d.

Teigha.Geometry.Point3dCollection.Remove(Teigha.Geometry.Point3d)
Метод удаляет из коллекции точку, совпадающую с указанной.
value: Входная точка для поиска удаляемой точки в коллекции. Тип Point3d.

Teigha.Geometry.Point3dCollection.RemoveAt(System.Int32)
Метод удаляет из коллекции точку, заданную по ее индексу в коллекции.
index: Индекс удаляемой точки. Тип int.

Teigha.Geometry.Point3dCollection.Count
Свойство предоставляет доступ к текущему количеству элементов в коллекции.
Returns: Возвращает количество элементов в этой коллекции. Тип Int32.

Teigha.Geometry.Point3dCollection.IsFixedSize
Свойство показывает, является ли размер этой коллекции фиксированным.
Returns: Возвращает true, если размер коллекции является фиксированным, иначе - false.

Teigha.Geometry.Point3dCollection.IsReadOnly
Свойство показывает, является ли эта коллекция доступной только для чтения.
Returns: Возвращает true, если эта коллекция доступна только для чтения; в противном случае возвращает false.

Teigha.Geometry.Point3dCollection.IsSynchronized
Свойство показывает, является ли доступ к этой коллекции потокобезопасным.
Returns: Возвращает true, если доступ к этой коллекции является потокобезопасным; в противном случае возвращает false.

Teigha.Geometry.Point3dCollection.Item
Свойство, представляющее элемент из коллекции с указанным индексом.
index: Индекс элемента коллекции. Тип int.
Returns: Возвращает элемент коллекции с указанным индексом. Тип Point3d.

Teigha.Geometry.Point3dCollection.SyncRoot
Свойство предоставляет объект, который можно использовать для синхронизации доступа к этой коллекции.
Returns: Возвращает объект, используемый для синхронизации доступа к коллекции. Тип Object.