Teigha.BoundaryRepresentation.BrepComplexCollection
Класс <c>BrepComplexCollection</c> представляет набор комплексов, соответствующих граничному представлению.

Teigha.BoundaryRepresentation.BrepComplexCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции комплексов.
Returns: Возвращает перечислитель коллекции комплексов.
Тип <c>BrepComplexEnumerator</c>.