Teigha.Runtime.RXClass
Объекты данного класса используются в качестве узлов в иерархическом дереве классов среды выполнения.

Teigha.Runtime.RXClass.AddX(Teigha.Runtime.RXClass,Teigha.Runtime.RXObject)
Метод создает расширение протокола для указанного RxClass.
runtimeClass: Указатель на класс расширения протокола. Тип RXClass.
protocolExtension: Указатель на объект расширения протокола. Тип RXObject.
Returns: Возвращает интеллектуальный указатель на расширение протокола. Тип IntPtr.

Teigha.Runtime.RXClass.Create
Метод создает новый экземпляр класса, используя данный объект в псевдоконструкторе класса.
Returns: Возвращает интеллектуальный указатель на вновь созданный экземпляр RXObject.

Teigha.Runtime.RXClass.DelX(Teigha.Runtime.RXClass)
Метод удаляет расширение протокола для указанного класса расширения протокола.
runtimeClass: Указатель на класс расширения протокола. Тип RXClass.
Returns: В случае успешного завершения возвращает интеллектуальный указатель на удаленный объект расширения протокола. В противном случае возвращает NULL.

Teigha.Runtime.RXClass.GetX(Teigha.Runtime.RXClass)
Метод возвращает объект расширения протокола для указанного класса расширения протокола.
runtimeClass: Указатель на класс расширения протокола. Тип RXClass.
Returns: Возвращает интеллектуальный указатель на объект расширения протокола. Тип IntPtr.

Teigha.Runtime.RXClass.IsDerivedFrom(Teigha.Runtime.RXClass)
Метод позволяет проверить, является ли данный объект наследником указанного класса RXClass.
runtimeClass: Входной объект искомого базового класса. Тип RXClass.
Returns: Возвращает true, если данный объект является наследником класса runtimeClass.
В противном случае возвращает false.

Teigha.Runtime.RXClass.QueryX
Метод позволяет найти объект расширения протокола для указанного класса расширения протокола.
В случае необходимости выполняется рекурсивный поиск по дереву наследования в родительских классах.
runtimeClass: Входной класс расширения протокола. Тип RXClass.
Returns: Возвращает интеллектуальный указатель на найденный объект расширения протокола либо NULL, если поиск успехом не увенчался.

Teigha.Runtime.RXClass.AppName
Свойство возвращает имя приложения, которое соответствует данному классу.
Returns: Возвращает имя приложения. Тип String.

Teigha.Runtime.RXClass.ClassVersion
Свойство возвращает версию класса в виде значений DWG_VERSION и MAINTENANCE_VERSION, указанных при регистрации данного класса.
Returns: Возвращает версию данного класса. Тип Version.

Teigha.Runtime.RXClass.DxfName
Свойство возвращает имя DXF данного класса.
Returns: Возвращает имя DXF данного класса.  Тип String.

Teigha.Runtime.RXClass.MyParent
Свойство возвращает необработанный указатель на экземпляр класса, который описывает родительский класс для этого класса как объект OdRxClass.
Returns: Возвращает необработанный указатель на объект RXClass.

Teigha.Runtime.RXClass.Name
Свойство возвращает имя класса C++, представленного данным объектом.
Returns: Возвращает имя класса. Тип String.

Teigha.Runtime.RXClass.ProxyFlags
Свойство возвращает значения флагов ProxyFlag данного класса.
Returns: Возвращает значения флагов ProxyFlag. Тип Int32.