Teigha.BoundaryRepresentation.BrepShellCollection
Класс <c>BrepShellCollection</c> представляет коллекцию оболочек, соответствующих граничному представлению.

Teigha.BoundaryRepresentation.BrepShellCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции оболочек B-Rep.
Returns: Возвращает перечислитель данной коллекции.
Тип <c>BrepShellEnumerator</c>.