Teigha.GraphicsSystem.StereoParameters.#ctor(System.Double,System.Double)
Конструктор структуры <c>StereoParameters</c>. Создает экземпляр структуры с указанными магнитудой и параллаксом.
magnitude: Магнитуда разделения видов. Тип <c>double</c>.
parallax: Значение параллакса. Тип <c>double</c>.

Teigha.GraphicsSystem.StereoParameters.Magnitude
Свойство <c>Magnitude</c> управляет разделением видов.
Returns: Возвращает значение магнитуды. Тип <c>double</c>.

Teigha.GraphicsSystem.StereoParameters.Parallax
Свойство <c>Parallax</c> представляет текущее значение параллакса.
Returns: Возвращает текущее значение параллакса.  Тип <c>double</c>.