HostMgd.EditorInput.PromptIntegerResultEventArgs
Класс, обеспечивающий данными событие PromptingForInteger
класса Editor.

HostMgd.EditorInput.PromptIntegerResultEventArgs.Result
Возвращает результат ввода.