Teigha.Geometry.CompositeCurve2d
Класс <c>CompositeCurve2d</c> представляет двумерные составные кривые, которые состоят из произвольного количества подкривых, соединенных конец в конец.

Teigha.Geometry.CompositeCurve2d.#ctor(array&lt;Curve2d&gt;)
Конструктор класса <c>CompositeCurve2d</c>.
Создает составную кривую из кривых в предоставленном списке.
curves: Массив кривых, из которых будет создана составная кривая.

Teigha.Geometry.CompositeCurve2d.Create(IntPtr,System.Boolean)
Метод предназначен для создания составной кривой на основе переданного указателя.
unmanagedPointer: Входной неуправляемый указатель на объект, из которого требуется создать данный объект.  Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора.  Тип <c>bool</c>.
Returns: Возвращает созданную составную кривую.
Тип <c>CompositeCurve2d</c>.

Teigha.Geometry.CompositeCurve2d.GetCurves
Метод позволяет получить массив подкривых, которые составляют данную составную кривую.
Returns: Возвращает массив подкривых, составляющих данный объект.
Тип <c>Curve2d[]</c>.

Teigha.Geometry.CompositeCurve2d.GlobalToLocalParameter(System.Double)
Метод позволяет получить локальное значение параметра подкривой, которое соответствует переданному глобальному параметрическому значению составной кривой.
value: Значение параметра точки на составной кривой.
Returns: Возвращает составной параметр, который включает значение параметра подкривой и индекс этой подкривой.
Тип <c>CompositeParameter</c>.

Teigha.Geometry.CompositeCurve2d.LocalToGlobalParameter(Teigha.Geometry.CompositeParameter)
Метод позволяет получить значение глобального параметра составной кривой, которое соответствует переданному локальному значению параметра подкривой.
value: Значение локального параметра подкривой.
Returns: Возвращает значение параметра точки на составной кривой.
Тип <c>double</c>.

Teigha.Geometry.CompositeCurve2d.SetCurves(array&lt;Curve2d&gt;)
Метод позволяет переопределить массив подкривых, которые образуют данную составную кривую.
curves: Входной массив новых составляющих подкривых.