Teigha.Geometry.NurbCurve2d
Класс <c>NurbCurve2d</c> представляет неоднородные рациональные B-сплайны (NURBS) в двумерном пространстве.

Teigha.Geometry.NurbCurve2d.#ctor
Конструктор по умолчанию класса <c>NurbCurve2d</c>.
Создаваемые им объекты не содержат никаких данных.

Teigha.Geometry.NurbCurve2d.#ctor(Teigha.Geometry.EllipticalArc2d)
Конструктор класса <c>NurbCurve2d</c>.
Создает двумерную NURBS кривую, которая интерполирует указанную двумерную эллиптическую дугу.
ellipse: Входная эллиптическая дуга. Тип <c>EllipticalArc2d</c>.

Teigha.Geometry.NurbCurve2d.#ctor(Teigha.Geometry.LineSegment2d)
Конструктор класса <c>NurbCurve2d</c>.
Создает двумерную NURBS кривую, которая интерполирует указанный линейный сегмент.
linSegment: Входной линейный сегмент. Тип <c>LineSegment2d</c>.

Teigha.Geometry.NurbCurve2d.#ctor(Teigha.Geometry.Point2dCollection)
Конструктор класса <c>NurbCurve2d</c>.
Создает двумерную NURBS кривую, которая интерполирует указанный массив двумерных точек в пределах точности по умолчанию.
fitPoints: Входная коллекция определяющих точек. Тип <c>Point2dCollection</c>.

Teigha.Geometry.NurbCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Tolerance)
Конструктор класса <c>NurbCurve2d</c>.
Создает двумерную NURBS кривую, которая интерполирует указанный массив двумерных точек в пределах заданной точности.
fitPoints: Входная коллекция определяющих точек. Тип <c>Point2dCollection</c>.
fitTolerance: Входная точность интерполяции. Тип <c>Tolerance</c>. Определяет максимальное отклонение интерполирующей кривой от определяющих точек.

Teigha.Geometry.NurbCurve2d.#ctor(System.Int32,Teigha.Geometry.PolylineCurve2d,System.Boolean)
Конструктор класса <c>NurbCurve2d</c>.
Создает NURBS кривую заданной степени, которая интерполирует вершины указанной полилинии и опционально может быть замкнутой.
degree: Входная степень NURBS кривой. Тип <c>int</c>.
fitPolyline: 2D-полилиния, вершины которой используются как определяющие точки для NURBS кривой. Тип <c>PolylineCurve2d</c>.
periodic: Флаг, указывающий, что требуется получить замкнутую (соответственно, периодическую) NURBS кривую. Тип <c>bool</c>.

Teigha.Geometry.NurbCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2dCollection,System.Boolean)
Конструктор класса <c>NurbCurve2d</c>.
Создает двумерную полиномиальную кривую, которая интерполирует заданный массив двумерных определяющих точек.
fitPoints: Массив определяющих двумерных точек, которые подлежат интерполяции.  Тип <c>Point2dCollection</c>.
fitTangents: Векторы, интерполирующие производные кривой в определяющих точках.   Тип <c>Vector2dCollection</c>.
periodic: Флаг, определяющий, должна ли создаваемая кривая быть периодической (замкнутой). Тип <c>bool</c>.

Teigha.Geometry.NurbCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2dCollection,Teigha.Geometry.Tolerance,System.Boolean)
Конструктор класса <c>NurbCurve2d</c>.
Создает двумерную полиномиальную кривую, которая в пределах указанной точности интерполирует заданный массив двумерных определяющих точек.
fitPoints: Массив определяющих двумерных точек, которые подлежат интерполяции.  Тип <c>Point2dCollection</c>.
fitTangents: Векторы, интерполирующие производные кривой в определяющих точках.   Тип <c>Vector2dCollection</c>.
fitTolerance: Входная точность интерполяции. Тип <c>Tolerance</c>.
periodic: Флаг, определяющий, должна ли создаваемая кривая быть периодической (замкнутой). Тип <c>bool</c>.

Teigha.Geometry.NurbCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Boolean,System.Boolean)
Конструктор класса <c>NurbCurve2d</c>.
Создает двумерную кривую, которая интерполирует заданный массив определяющих 2D-точек и опционально использует указанные производные в начальной и конечной точках.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип <c>Point2dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector2d</c>.
endTangent: Вектор касательной в конечной точке.  Тип <c>Vector2d</c>.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>startTangent</c>. Тип <c>bool</c>.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>endTangent</c>.   Тип <c>bool</c>.

Teigha.Geometry.NurbCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Boolean,System.Boolean,Teigha.Geometry.Tolerance)
Конструктор класса <c>NurbCurve2d</c>.
Создает двумерную кривую, которая интерполирует заданный массив определяющих 2D-точек с заданной точностью и опционально использует указанные производные в начальной и конечной точках.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип <c>Point2dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector2d</c>.
endTangent: Вектор касательной в конечной точке.  Тип <c>Vector2d</c>.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>startTangent</c>. Тип <c>bool</c>.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>endTangent</c>.   Тип <c>bool</c>.
fitTolerance: Заданная точность интерполяции. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve2d.#ctor(System.Int32,Teigha.Geometry.KnotCollection,Teigha.Geometry.Point2dCollection,System.Boolean)
Конструктор класса <c>NurbCurve2d</c>.
Создает NURBS кривую заданной степени с указанными узловым вектором и массивом управляющих вершин.
degree: Степень NURBS кривой. Тип <c>int</c>.
knots: Узловой вектор. Тип <c>KnotCollection</c>.
controlPoints: Коллекция управляющих вершин. Тип <c>Point2dCollection</c>.
periodic: Флаг, который определяет, следует ли создавать замкнутую кривую (периодическую). Тип <c>bool</c>.

Teigha.Geometry.NurbCurve2d.#ctor(System.Int32,Teigha.Geometry.KnotCollection,Teigha.Geometry.Point2dCollection,Teigha.Geometry.DoubleCollection,System.Boolean)
Конструктор класса <c>NurbCurve2d</c>.
Создает опционально замкнутую NURBS кривую заданной степени с указанными узловым вектором и массивами управляющих вершин и значений весов.
degree: Степень NURBS кривой. Тип <c>int</c>.
knots: Узловой вектор. Тип <c>KnotCollection</c>.
controlPoints: Коллекция управляющих вершин. Тип <c>Point2dCollection</c>.
weights: Коллекция весов. Тип <c>DoubleCollection</c>.
periodic: Флаг, который определяет, следует ли создавать замкнутую кривую (периодическую). Тип <c>bool</c>.

Teigha.Geometry.NurbCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Boolean,System.Boolean,Teigha.Geometry.KnotParameterizationEnum)
Конструктор класса <c>NurbCurve2d</c>.
Создает двумерную кривую, которая интерполирует заданный массив 2D-точек, используя предписанный метод узловой параметризации и указанные производные в начальной и конечной точках.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип <c>Point2dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector2d</c>.
endTangent: Вектор касательной в конечной точке.  Тип <c>Vector2d</c>.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>startTangent</c>. Тип <c>bool</c>.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>endTangent</c>.   Тип <c>bool</c>.
knotParam: Метод узловой параметризации сплайна. Перечисление <c>KnotParameterizationEnum</c>.

Teigha.Geometry.NurbCurve2d.#ctor(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Boolean,System.Boolean,Teigha.Geometry.KnotParameterizationEnum,Teigha.Geometry.Tolerance)
Конструктор класса <c>NurbCurve2d</c>.
Создает двумерную кривую, которая интерполирует заданный массив 2D-точек в пределах указанной точности, используя предписанный метод узловой параметризации и указанные производные в начальной и конечной точках.
fitPoints: Массив определяющих точек для интерполирующей кривой. Тип <c>Point2dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector2d</c>.
endTangent: Вектор касательной в конечной точке.  Тип <c>Vector2d</c>.
startTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>startTangent</c>. Тип <c>bool</c>.
endTangentDefined: Флаг, который указывает, что следует использовать аргумент <c>endTangent</c>.   Тип <c>bool</c>.
knotParam: Метод узловой параметризации сплайна. Перечисление <c>KnotParameterizationEnum</c>.
fitTolerance: Входная точность интерполяции. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve2d.AddControlPointAt(System.Double,Teigha.Geometry.Point2d,System.Double)
Метод добавляет управляющую вершину в указанном узле.
newKnot: Параметр узла, в котором добавляется новая управляющая вершина. Тип <c>double</c>.
point: Координаты добавляемой управляющей вершины. Тип <c>Point2d</c>.
weight: Значение веса, которое присваивается управляющей вершине. Тип <c>double</c>.

Teigha.Geometry.NurbCurve2d.AddFitPointAt(System.Int32,Teigha.Geometry.Point2d)
Метод позволяет вставить определяющую точку с заданным индексом.
index: Индекс определяющей точки. Тип <c>int</c>.
point: Положение определяющей точки. Тип <c>Point2d</c>.
Returns: Возвращает <c>true</c>, если сплайн был создан методом определяющих точек, и вставка новой определяющей точки с заданным индексом завершилась успешно.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2d.AddKnot(System.Double)
Метод добавляет новый узел в узловой вектор сплайна.
newKnot: Значение нового узла. Тип <c>double</c>.

Teigha.Geometry.NurbCurve2d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>NurbCurve2d</c>.

Teigha.Geometry.NurbCurve2d.DeleteControlPointAt(System.Int32)
Метод удаляет управляющую вершину с указанным индексом.
index: Индекс удаляемой управляющей вершины.  Тип <c>int</c>.

Teigha.Geometry.NurbCurve2d.DeleteFitPointAt(System.Int32)
Метод удаляет определяющую точку с указанным индексом.
index: Индекс удаляемой определяющей точки. Тип <c>int</c>.
Returns: Возвращает <c>true</c> в случае успешного удаления определяющей точки.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2d.ElevateDegree(System.Int32)
Метод увеличивает степень сплайна на указанную величину.
plusDegree: Величина, на которую увеличивается степень сплайна.  Тип <c>int</c>.

Teigha.Geometry.NurbCurve2d.GetFitPointAt(System.Int32)
Метод предоставляет определяющую точку с указанным индексом.
index: Индекс определяющей точки. Тип <c>int</c>.
Returns: Возвращает определяющую точку с индексом <c>index</c>.  Тип <c>Point2d</c>.

Teigha.Geometry.NurbCurve2d.GetFitTangents
Метод предоставляет векторы касательных в начальной и конечной точках, если данный сплайн был построен методом определяющих точек.
Returns: Возвращает векторы производных в начальной и конечной точках в виде массива из двух элементов.
Тип <c>Vector2d[]</c>.

Teigha.Geometry.NurbCurve2d.GetParametersOfC1Discontinuity
Returns: Возвращает массив значений параметра в точках с нарушенной C1 непрерывностью.
Тип <c>DoubleCollection</c>.

Teigha.Geometry.NurbCurve2d.GetParametersOfC1Discontinuity(Teigha.Geometry.Tolerance)
tolerance: Входная точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив значений параметра в точках с нарушенной C1 непрерывностью. Тип <c>DoubleCollection</c>.

Teigha.Geometry.NurbCurve2d.GetParametersOfG1Discontinuity
Метод предоставляет значения параметра всех точек сплайна с нарушенной G1 непрерывностью (неколлинеарность касательных векторов слева и справа от точки).
Returns: Возвращает массив значений параметра в точках с нарушенной G1 непрерывностью.
Тип <c>DoubleCollection</c>.

Teigha.Geometry.NurbCurve2d.GetParametersOfG1Discontinuity(Teigha.Geometry.Tolerance)
Метод предоставляет значения параметра всех точек сплайна с нарушенной в пределах заданной точности G1 непрерывностью (неколлинеарность  касательных векторов слева и справа от точки).
tolerance: Заданная точность. Тип <c>Tolerance</c>.
Returns: Возвращает массив значений параметра в точках с нарушенной G1 непрерывностью.
Тип <c>DoubleCollection</c>.

Teigha.Geometry.NurbCurve2d.GetWeightAt(System.Int32)
Метод предоставляет вес управляющей вершины с указанным индексом.
index: Индекс управляющей вершины. Тип <c>int</c>.  Должен быть неотрицательным и меньше количества управляющих вершин.
Returns: Возвращает значение веса по указанному индексу.
Тип <c>double</c>.

Teigha.Geometry.NurbCurve2d.HardTrimByParams(System.Double,System.Double)
Метод позволяет обрезать данную NURBS кривую, задав ей новые значения начального и конечного параметров.
newStartParameter: Новое начальное значение параметра. Тип <c>double</c>.
newEndParameter: Новое конечное значение параметра. Тип <c>double</c>.

Teigha.Geometry.NurbCurve2d.InsertKnot(System.Double)
Метод вставляет новый узел в узловой вектор данной кривой.
newKnot: Новый узел.

Teigha.Geometry.NurbCurve2d.JoinWith(Teigha.Geometry.NurbCurve2d)
Метод дополняет данную кривую указанным сплайном и перевычисляет результирующую кривую.
curve: Сплайн, который требуется присоединить к данной кривой.

Teigha.Geometry.NurbCurve2d.MakeClosed
Метод позволяет сделать данную кривую замкнутой, если она еще не замкнута.

Teigha.Geometry.NurbCurve2d.MakeNonPeriodic
Метод делает данную кривую непериодической (если она таковой еще не является).

Teigha.Geometry.NurbCurve2d.MakeOpen
Метод делает замкнутый сплайн незамкнутым.

Teigha.Geometry.NurbCurve2d.MakePeriodic
Метод позволяет сделать данную кривую периодическим сплайном.

Teigha.Geometry.NurbCurve2d.MakeRational(System.Double)
Метод позволяет преобразовать данную кривую в рациональный сплайн. Каждой управляющей вершине назначается указанный вес.
weight: Вес, который назначается каждой управляющей вершине. Тип <c>double</c>.

Teigha.Geometry.NurbCurve2d.PurgeFitData
Метод предназначен для удаления всех определяющих данных, использованных для построения данной кривой.
Returns: Возвращает <c>true</c>, если этот сплайн был построен методом определяющих точек.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2d.SetEvaluateMode(System.Boolean)
Метод задает режим вычислений, включающий или отключающий внутреннюю оптимизацию.
evaluateMode: Режим вычислений NURBS кривой. Тип <c>bool</c>.

Teigha.Geometry.NurbCurve2d.SetFitData(System.Int32,Teigha.Geometry.Point2dCollection)
Метод перевычисляет сплайн, используя заданные определяющие точки и степень сплайна, а также точность по умолчанию.
degree: Степень сплайна. Тип <c>int</c>.
fitPoints: Массив определяющих точек сплайна. Тип <c>Point2dCollection</c>.

Teigha.Geometry.NurbCurve2d.SetFitData(System.Int32,Teigha.Geometry.Point2dCollection,Teigha.Geometry.Tolerance)
Метод перевычисляет сплайн, используя заданные определяющие точки, степень сплайна и точность интерполяции.
degree: Степень сплайна. Тип <c>int</c>.
fitPoints: Массив определяющих точек сплайна. Тип <c>Point2dCollection</c>.
fitTolerance: Геометрическая точность. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve2d.SetFitData(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,System.Boolean)
Метод пересчитывает сплайн, используя указанные определяющие точки, векторы касательных в начальной и конечной точках и точность по умолчанию.
fitKnots: Узловой вектор нового сплайна. Тип <c>KnotCollection</c>.
fitPoints: Массив определяющих точек. Тип <c>Point2dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector2d</c>.
endTangent: Вектор касательной в конечной точке. Тип <c>Vector2d</c>.
periodic: Флаг, определяющий, требуется ли построить периодический сплайн (замкнутую кривую). Тип <c>bool</c>.

Teigha.Geometry.NurbCurve2d.SetFitData(Teigha.Geometry.KnotCollection,Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Tolerance,System.Boolean)
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
Опционально сплайн может быть построен периодическим.
fitKnots: Узловой вектор нового сплайна. Тип <c>KnotCollection</c>.
fitPoints: Массив определяющих точек. Тип <c>Point2dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector2d</c>.
endTangent: Вектор касательной в конечной точке. Тип <c>Vector2d</c>.
fitTolerance: Точность интерполяции. Тип <c>Tolerance</c>.
periodic: Флаг, определяющий, требуется ли построить периодический сплайн (замкнутую кривую). Тип <c>bool</c>.

Teigha.Geometry.NurbCurve2d.SetFitData(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,Teigha.Geometry.Tolerance)
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках и точность интерполяции.
fitPoints: Определяющие точки. Тип <c>Point2dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector2d</c>.
endTangent: Вектор касательной в конечной  точке. Тип <c>Vector2d</c>.
fitTolerance: Требуемая точность интерполяции. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve2d.SetFitData(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Метод пересчитывает сплайн, используя заданные определяющие точки, векторы касательных в начальной и конечной точках.
fitPoints: Определяющие точки. Тип <c>Point2dCollection</c>.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector2d</c>.
endTangent: Вектор касательной в конечной  точке. Тип <c>Vector2d</c>.

Teigha.Geometry.NurbCurve2d.SetFitData(Teigha.Geometry.Point2dCollection,Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d,Teigha.Geometry.KnotParameterizationEnum,Teigha.Geometry.Tolerance)
Метод задает новые определяющие данные в этом объекте и перевычисляет сплайн.
fitPoints: Массив определяющих точек. Тип <c>Point2dCollection</c>. Точек должно быть не менее двух.
startTangent: Вектор касательной в начальной точке. Тип <c>Vector2d</c>.
endTangent: Вектор касательной в конечной  точке. Тип <c>Vector2d</c>.
knotParam: Метод узловой параметризации сплайна. Тип <c>KnotParameterizationEnum</c>.
fitTolerance: Требуемая точность интерполяции. Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve2d.SetFitPointAt(System.Int32,Teigha.Geometry.Point2d)
Метод изменяет определяющую точку с указанным индексом.
index: Индекс определяющей точки. Тип <c>int</c>.
point: Новые координаты определяющей точки. Тип <c>Point2d</c>.
Returns: Возвращает <c>true</c>, если перевычисление сплайна после изменения определяющей точки завершилось успешно.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2d.SetFitTangents(Teigha.Geometry.Vector2d,Teigha.Geometry.Vector2d)
Метод позволяет переопределить направления касательных на концах сплайна.
startTangent: Направление касательной в начальной точке сплайна. Тип <c>Vector2d</c>.
endTangent: Направление касательной в конечной  точке сплайна. Тип <c>Vector2d</c>.
Returns: Возвращает <c>true</c>, если перевычисление сплайна с новыми касательными завершилось успешно.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2d.SetWeightAt(System.Int32,System.Double)
Метод позволяет задать вес управляющей вершины сплайна с указанным индексом.
index: Индекс управляющей вершины. Тип <c>int</c>. Индекс должен быть больше или равен 0 и меньше количества управляющих вершин.
value: Новое значение веса. Тип <c>double</c>.

Teigha.Geometry.NurbCurve2d.DefinitionData
Свойство <c>DefinitionData</c> возвращает все данные, определяющие сплайн.
Returns: Возвращает данные, определяющие этот сплайн. Тип <c>NurbCurve2dData</c>.

Teigha.Geometry.NurbCurve2d.EvalMode
Свойство <c>EvalMode</c> позволяет узнать текущий режим вычисления сплайна.
Returns: Возвращает <c>true</c>, если внутренняя оптимизация включена.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.NurbCurve2d.FitData
Свойство <c>FitData</c> представляет все определяющие данные, использованные для построения сплайна.
Returns: Возвращает определяющие данные, использованные для построения сплайна. Тип <c>NurbCurve2dFitData</c>.

Teigha.Geometry.NurbCurve2d.FitKnotParameterization
Свойство <c>FitKnotParameterization</c> представляет метод узловой параметризации данного сплайна.
Returns: Возвращает метод узловой параметризации сплайна. Перечисление <c>KnotParameterizationEnum</c>.

Teigha.Geometry.NurbCurve2d.FitTolerance
Свойство <c>FitTolerance</c> представляет точность интерполяции для данного сплайна.
Returns: Возвращает геометрическая точность.
Тип <c>Tolerance</c>.

Teigha.Geometry.NurbCurve2d.NumFitPoints
Свойство <c>NumFitPoints</c> представляет количество определяющих точек, использованных для построения сплайна.
Returns: Возвращает количество определяющих точек сплайна.
Тип <c>int</c>.

Teigha.Geometry.NurbCurve2d.NumWeights
Свойство <c>NumWeights</c> представляет количество значений веса, определенных у этого сплайна.
Returns: Если сплайн является рациональным, возвращаемое значение равно количеству управляющих вершин. В противном случае свойство возвращает 0.
Тип <c>int</c>.