Teigha.BoundaryRepresentation.Element2d
Класс <c>Element2d</c> — это интерфейсный класс для линейных двумерных элементов первого порядка в сети.
Реализован только в среде пространственного моделирования.

Teigha.BoundaryRepresentation.Element2d.#ctor
Конструктор по умолчанию класса <c>Element2d</c>.

Teigha.BoundaryRepresentation.Element2d.GetNodesStartingFrom(Teigha.BoundaryRepresentation.Node)
Метод предоставляет коллекцию узлов элемента, начиная с указанной начальной точки.
startFrom: Входной узел, с которого начинается требуемая коллекция.
Returns: Возвращает коллекцию узлов 2D-элемента.
Тип <c>Element2dNodeCollection</c>.

Teigha.BoundaryRepresentation.Element2d.Nodes
Свойство <c>Nodes</c> предоставляет доступ к множеству всех узлов данного элемента.
Returns: Возвращает коллекцию узлов элемента.
Тип <c>Element2dNodeCollection</c>.

Teigha.BoundaryRepresentation.Element2d.Normal
Свойство <c>Normal</c> представляет вектор нормали данного элемента.
Returns: Возвращает вектор нормали.
Тип <c>Vector3d</c>.