Teigha.DatabaseServices.XrefVetoableSubCommandEventArgs
Класс <c>XrefVetoableSubCommandEventArgs</c> представляет данные для команды <c>XrefVetoableSubCommand</c> базы данных.

Teigha.DatabaseServices.XrefVetoableSubCommandEventArgs.abortOp
Свойство <c>abortOp</c> позволяет определить, была ли прервана операция.
Returns: Возвращает <c>true</c>, если операция прервана.
В противном случае возвращает <c>false</c>.