HostMgd.EditorInput.PromptSelectionOptionsEventArgs
Класс, обеспечивающий данными событие PromptingForSelection
класса Editor.

HostMgd.EditorInput.PromptSelectionOptionsEventArgs.Filter
Возвращает фильтр, который использовался при выборе.

HostMgd.EditorInput.PromptSelectionOptionsEventArgs.Options
Возвращает входные параметры приглашения.