Teigha.DatabaseServices.Light
Этот класс представляет шаблон для всех общих свойств источников света, хранящихся в базе данных.

Teigha.DatabaseServices.Light.#ctor
Конструктор по умолчанию класса <c>Light</c>.

Teigha.DatabaseServices.Light.ResultingColor
Метод позволяет получить окончательный цвет источника света как результат смешивания цвета лампы и цвета фильтра.
Returns: Возвращает итоговый цвет источника света. Тип <c>Colors.Color</c>.

Teigha.DatabaseServices.Light.SetHotspotAndFalloff(System.Double,System.Double)
Метод определяет световое пятно и спад освещенности конуса направленного света.
hotspot: Угол светового конуса в радианах. Тип <c>double</c>. Определяет наиболее яркую часть светового пучка.
falloff: Угол поля направленного света, в радианах. Тип <c>double</c>. Определяет полный световой конус.

Teigha.DatabaseServices.Light.Attenuation
Свойство предоставляет доступ к информации о пределах затухания источника света.
Returns: Возвращает объект <c>LightAttenuation</c> с информацией о пределах затухания источника света.

Teigha.DatabaseServices.Light.AttenuationType
Свойство представляет тип затухания данного источника света.
Returns: Возвращает тип затухания. Перечисление <c>AttenuationType</c>.

Teigha.DatabaseServices.Light.Direction
Свойство представляет направление удаленного источника света.
Returns: Возвращает направление излучения света. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.Light.EndLimitOffset
Свойство представляет конечный предел затухания источника света.
Returns: Возвращает удаление плоскости отсечения конечного предела затухания источника света.
Тип <c>double</c>.

Teigha.DatabaseServices.Light.FalloffAngle
Свойство представляет полный угол светового конуса, геометрически определяющий спад освещенности для данного источника света.
Returns: Возвращает полный угол светового конуса (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.Light.GlyphDisplayType
Свойство представляет вариант отображения глифа для данного источника света.
Returns: Возвращает вариант отображения глифа для данного источника света. Перечисление <c>GlyphDisplayType</c>.

Teigha.DatabaseServices.Light.HasTarget
Свойство позволяет проверить, отображает ли данный источник света ручку цели для выбора направления распространения света.
Returns: Возвращает <c>true</c>, если ручка отображается.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Light.HotspotAngle
Свойство возвращает угол светового пучка источника света, определяющий самую яркую его часть (наиболее яркое пятно данного источника).
Returns: Возвращает угол светового пучка (в радианах). Тип <c>double</c>.

Teigha.DatabaseServices.Light.IlluminanceDistance
Свойство представляет дальность освещения для данного источника света.
Returns: Возвращает дальность освещения. Тип <c>double</c>.

Teigha.DatabaseServices.Light.Intensity
Свойство представляет интенсивность данного источника света.
Returns: Возвращает интенсивность источника света. Тип <c>double</c>.

Teigha.DatabaseServices.Light.IsOn
Свойство позволяет проверить, включен ли данный источник света.
Returns: Возвращает <c>true</c>, если источник света включен.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Light.IsPlottable
Свойство позволяет проверить, отображается ли этот источник света при печати.
Returns: Возвращает <c>true</c>, если источник при печати отображается.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Light.LampColorPreset
Свойство представляет предустановленный цвет лампы данного источника света.
Returns: Возвращает цвет лампы. Перечисление <c>LampColorPreset</c>.

Teigha.DatabaseServices.Light.LampColorRGB
Свойство представляет значение <c>RGB</c> цвета лампы данного источника света.
Returns: Возвращает значение <c>RGB</c> цвета лампы. Тип <c>ColorRGB</c>.

Teigha.DatabaseServices.Light.LampColorTemp
Свойство представляет цветовую температуру источника в Кельвинах, если в свойстве <c>Light.LampColorType</c> задан тип
<c>LampColorType.Kelvin</c>.
Returns: Возвращает цветовую температуру источника в Кельвинах. Тип <c>double</c>.

Teigha.DatabaseServices.Light.LampColorType
Свойство представляет тип цвета лампы, который определяет, как именно задается цвет лампы (цветовая температура в Кельвинах или предустановленный цвет лампы).
Returns: Возвращает тип цвета лампы. Перечисление <c>LampColorType</c>.

Teigha.DatabaseServices.Light.LightColor
Свойство представляет цвет данного источника света.
Returns: Возвращает цвет источника света.  Тип <c>Color</c>.

Teigha.DatabaseServices.Light.LightType
Свойство представляет тип данного источника света: <c>DistantLight</c>, <c>PointLight</c>, <c>SpotLight</c> или <c>WebLight</c>.
Returns: Возвращает тип источника света. Перечисление <c>DrawableType</c>.

Teigha.DatabaseServices.Light.MapSize
Свойство представляет размер карты теней. Возможные значения: 64, 128, 256, 512, 1024, 2048 или 4096.
Returns: Возвращает размер карты теней.
Тип <c>int</c>.

Teigha.DatabaseServices.Light.Name
Свойство представляет наименование данного источника света.
Returns: Возвращает наименование источника света.
Тип <c>String</c>.

Teigha.DatabaseServices.Light.PhysicalIntensity
Свойство представляет физическую интенсивность источника света.
Returns: Возвращает физическую интенсивность источника света.
Тип <c>double</c>.

Teigha.DatabaseServices.Light.PhysicalIntensityMethod
Свойство представляет способ задания физической интенсивности данного источника света. Он определяет метод вычисления физической интенсивности света (по пиковой интенсивности, по потоку или по освещенности).
Returns: Возвращает метод вычисления физической интенсивности света. Перечисление <c>PhysicalIntensityMethod</c>.

Teigha.DatabaseServices.Light.Position
Свойство представляет положение точечного источника света и прожектора.
Returns: Возвращает положение источника света в пространстве.  Тип <c>Point3d</c>.

Teigha.DatabaseServices.Light.Shadow
Свойство представляет параметры тени для данного источника света.
Returns: Возвращает параметры тени для источника света.
Тип <c>ShadowParameters</c>.

Teigha.DatabaseServices.Light.ShadowType
Свойство представляет тип тени для данного источника света.
Returns: Возвращает тип тени для источника света.
Перечисление <c>ShadowType</c>.

Teigha.DatabaseServices.Light.Softness
Свойство представляет параметр мягкости тени для данного источника света.
Returns: Возвращает параметр мягкости тени.
Тип <c>int</c>.

Teigha.DatabaseServices.Light.StartLimitOffset
Свойство представляет начальный предел затухания для данного источника света.
Returns: Возвращает начальный предел затухания освещения.
Тип <c>double</c>.

Teigha.DatabaseServices.Light.TargetLocation
Свойство представляет положение цели данного источника света.
Returns: Возвращает положение цели источника света.
Тип <c>Point3d</c>.

Teigha.DatabaseServices.Light.UseLimits
Свойство позволяет проверить, используются ли пределы в расчетах затухания света от источника.
Returns: Возвращает <c>true</c>, если пределы используются в расчетах затухания света.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.Light.WebFile
Свойство представляет полный путь к файлу световой сетки с гониометрическими данными источника света (файл IES).
Returns: Возвращает полный путь к файлу световой сетки.
Тип <c>String</c>.

Teigha.DatabaseServices.Light.WebRotation
Свойство представляет угловые смещения световой сетки, необходимые для ориентирования гониометрических данных относительно текущей ориентации источника света.
Returns: Возвращает угловые смещения световой сетки вокруг оптических осей X, Y и Z (в радианах).
Тип <c>Vector3d</c>.