Teigha.DatabaseServices.MeshFaceterData.#ctor(System.Double,System.Double,System.Double,System.Double,unsigned short,unsigned short,unsigned short,short)
Конструктор структуры <c>MeshFaceterData</c>.
surface: Значение, представляющее отклонение сети от грани. Тип <c>double</c>.
normal: Угол между соседними гранями сети. Тип <c>double</c>.
gRatio: Максимальное соотношение сторон для четырехугольников сети. Тип <c>double</c>.
eLength: Максимальная длина ребра. Тип <c>double</c>.
numGrid: Максимальное количество используемых линий сети. Тип <c>unsigned short</c>.
uGrid: Минимальное значение параметра <c>U</c> для линий сети. Тип <c>unsigned short</c>.
vGrid: Минимальное значение параметра <c>V</c> для линий сети. Тип <c>unsigned short</c>.
mType: Геометрический тип граней сети.  Тип <c>short</c>. Допустимы следующие типы

Teigha.DatabaseServices.MeshFaceterData.FaceterDevNormal
Свойство <c>DevNormal</c> представляет максимальное угловое отклонение нормалей соседних граней (угол между соседними гранями сети).
Returns: Возвращает максимальный угол между соседними гранями сети. Тип <c>double</c>.

Teigha.DatabaseServices.MeshFaceterData.FaceterDevSurface
Свойство <c>FaceterDevSurface</c> представляет максимальное отклонение сети от поверхности.
Returns: Возвращает максимальное отклонение сети от поверхности. Тип <c>double</c>.

Teigha.DatabaseServices.MeshFaceterData.FaceterGridRatio
Свойство представляет максимальное соотношение сторон у четырехугольников сети.
Returns: Возвращает максимальное соотношение сторон у четырехугольников сети. Тип <c>double</c>.

Teigha.DatabaseServices.MeshFaceterData.FaceterMaxEdgeLength
Свойство представляет максимальную длину ребер сети.
Returns: Возвращает максимальную длину ребер сети.  Тип <c>double</c>.

Teigha.DatabaseServices.MeshFaceterData.FaceterMaxGrid
Свойство представляет максимальное количество линий сети, которые допустимо использовать.
Returns: Возвращает максимальное количество линий сети. Тип <c>short</c>.

Teigha.DatabaseServices.MeshFaceterData.FaceterMeshType
Свойство представляет геометрический тип граней сети (треугольные, четырехугольные, гибридный (смешанный) тип).
Returns: Возвращает геометрический тип граней сети. Тип <c>short</c>.

Teigha.DatabaseServices.MeshFaceterData.FaceterMinUGrid
Свойство представляет минимальное значение параметра <c>U</c> для линий сети.
Returns: Возвращает минимальное значение параметра <c>U</c>. Тип <c>short</c>.

Teigha.DatabaseServices.MeshFaceterData.FaceterMinVGrid
Свойство представляет минимальное значение параметра <c>V</c> для линий сети.
Returns: Возвращает минимальное значение параметра <c>V</c>. Тип <c>short</c>.