Teigha.DatabaseServices.PolyFaceMeshVertex
Класс <c>PolyFaceMeshVertex</c> представляет в базе данных вершины сети <c>PolyFaceMesh</c>.

Teigha.DatabaseServices.PolyFaceMeshVertex.#ctor
Конструктор по умолчанию класса <c>PolyFaceMeshVertex</c>.

Teigha.DatabaseServices.PolyFaceMeshVertex.#ctor(Teigha.Geometry.Point3d)
Конструктор класса <c>PolyFaceMeshVertex</c>. Создает экземпляр класса в заданной пространственной точке.
point: Координаты вершины в мировой системе координат (WCS). Тип <c>Point3d</c>.

Teigha.DatabaseServices.PolyFaceMeshVertex.Position
Свойство <c>Position</c> представляет позицию данной вершины в мировой системе координат (WCS).
Returns: Возвращает точку, в которой располагается вершина. Тип <c>Point3d</c>.