Teigha.GraphicsInterface.DrawableOverrule
Класс предназначен для создания переопределения графического представления стандартных примитивов nanoCAD.

Teigha.GraphicsInterface.DrawableOverrule.SetAttributes(Teigha.GraphicsInterface.Drawable,Teigha.GraphicsInterface.DrawableTraits)
Данный метод переопределяет метод Drawable.SetAttributes.
Реализация по умолчанию вызывает метод Drawable.setAttributes.
drawable: Объект Drawable, к которому применяется переопределение. Тип Drawable.
traits: Входной объект GraphicsInterface.DrawableTraits, который необходимо заполнить атрибутами. Тип GraphicsInterface.DrawableTraits.
Returns: Возвращает комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributeFlags. Тип int.

Teigha.GraphicsInterface.DrawableOverrule.SetCustomFilter
Этот метод активирует использование метода IsApplicable, чтобы устанавливать применимость объектного переопределения.

Teigha.GraphicsInterface.DrawableOverrule.SetExtensionDictionaryEntryFilter(String)
Метод включает предварительный поиск в словаре расширений для установления применимости объектного переопределения.
entryName: Входное имя записи. Тип String.

Teigha.GraphicsInterface.DrawableOverrule.SetIdFilter(array&lt;DatabaseServices.ObjectId&gt;)
Метод включает предварительную фильтрацию объектов по их ObjectId прежде чем применять к ним объектное переопределение.
Переопределения будут вызываться только для объектов, чей ObjectId присутствует в заданном массиве идентификаторов.
ids: Входной массив идентификаторов объектов. Тип DatabaseServices.ObjectId[].

Teigha.GraphicsInterface.DrawableOverrule.SetNoFilter
Метод отключает все методы предварительной фильтрации (SetCustomFilter, SetExtensionDictionaryEntryFilter, SetIdFilter, SetXDataFilter), а также метод IsApplicable, перед применением объектных переопределений.

Teigha.GraphicsInterface.DrawableOverrule.SetXDataFilter(String)
Метод включает использование расширенных данных в условии применимости объектного переопределения.
registeredApplicationName: Входное имя зарегистрированного приложения.  Тип String.

Teigha.GraphicsInterface.DrawableOverrule.ViewportDraw(Teigha.GraphicsInterface.Drawable,GraphicsInterface.ViewportDraw)
Данный метод переопределяет метод Drawable.ViewportDraw.
drawable: Входной объект, к которому применяется переопределение. Тип Drawable.
vd: Входной интерфейс GraphicsInterface.ViewportDraw.

Teigha.GraphicsInterface.DrawableOverrule.ViewportDrawLogicalFlags(Teigha.GraphicsInterface.Drawable,GraphicsInterface.ViewportDraw)
Данный метод переопределяет метод Drawable.ViewportDrawLogicalFlags.
Реализация по умолчанию вызывает метод Drawable.ViewportDrawLogicalFlags.
drawable: Входной объект Drawable, к которому применяется переопределение. Тип Drawable.
vd: Входной интерфейс ViewportDraw. Тип GraphicsInterface.ViewportDraw.
Returns: Возвращает комбинацию атрибутных флагов из перечисления Teigha.GraphicsInterface.AttributeFlags. Тип int.

Teigha.GraphicsInterface.DrawableOverrule.WorldDraw(Teigha.GraphicsInterface.Drawable,GraphicsInterface.WorldDraw)
Переопределяет метод Drawable.WorldDraw.
Реализация по умолчанию вызывает метод Drawable.WorldDraw.
drawable: Входной объект Drawable, к которому применяется переопределение. Тип Drawable.
wd: Входной интерфейс WorldDraw.  Тип GraphicsInterface.WorldDraw.
Returns: Возвращает true, только если геометрическое представление объекта не зависит от видового экрана.
Возвращаемое значение false указывает, что какая-то часть графики объекта зависит от видового представления, поэтому 3D GS должна дополнительно вызвать ViewportDraw(), чтобы для такого объекта получить законченную геометрию и полный набор атрибутов.