Teigha.BoundaryRepresentation.ComplexShellCollection
Класс <c>ComplexShellCollection</c> представляет коллекцию оболочек, соответствующих некоторому комплексу.

Teigha.BoundaryRepresentation.ComplexShellCollection.GetEnumerator
Метод предоставляет перечислитель данной коллекции оболочек комплекса.
Returns: Возвращает перечислитель коллекции оболочек комплекса.
Тип <c>ComplexShellEnumerator</c>.