HostMgd.EditorInput.PromptNestedEntityOptionsEventArgs
Класс, обеспечивающий данными событие
PromptingForNestedEntity класса Editor.

HostMgd.EditorInput.PromptNestedEntityOptionsEventArgs.Options
Возвращает параметры приглашения.