HostMgd.EditorInput.CrossingOrWindowSelectedObject
Класс, описывающий объект, который выбран окном или
многоугольником (определяющем выбираемые объекты). Это окно
выбора объектов может быть или не быть окном выбора
пересечением (когда выбранными считаются объекты, любая часть
которых попала в окно выбора).

HostMgd.EditorInput.CrossingOrWindowSelectedObject.#ctor(Teigha.DatabaseServices.ObjectId,HostMgd.EditorInput.SelectionMethod,System.Int32)
Конструктор.
id: Id объекта, с которым было пересечение окна выбора
method: Метод выбора объекта
gsMarker: Любой GS маркер