Teigha.DatabaseServices.Filters.Filter
Данный класс является базовым для всех классов фильтров.
Этот класс определяет "запрос" и предоставляет "ключ" к объекту <c>FilteredBlockIterator</c>.
Индекс, соответствующий этому ключу возвращает свойство <c>IndexClass</c>.

Teigha.DatabaseServices.Filters.Filter.#ctor(IntPtr,System.Boolean)
Конструктор класса Filter.
unmanagedObjPtr: Неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Флаг автоудаления исходного объекта. Тип <c>bool</c>.

Teigha.DatabaseServices.Filters.Filter.IndexClass
Свойство <c>IndexClass</c> предоставляет доступ к дескриптору класса <c>Index</c>  для данного фильтра.
Returns: Возвращает дескриптор класса. Тип <c>RXClass</c>.