Teigha.Geometry.CompositeParameter.#ctor(System.Int32,System.Double)
Конструктор структуры <c>CompositeParameter</c>.
Создает экземпляр структуры с переданным индексом подкривой и значением локального параметра.
segmentIndex: Индекс подкривой.  Тип <c>int</c>.
localParameter: Значение локального параметра точки на указанной подкривой.  Тип <c>double</c>.

Teigha.Geometry.CompositeParameter.Equals(Object)
Метод предназначен для проверки на равенство данного и переданного объектов.
obj: Входной объект, с которым проверяется равенство.  Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если оба сравниваемых объекта не являются нулевыми и одновременно выполняются следующие условия:
1. Индексы подкривых совпадают.
2. Значения локальных параметров равны.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CompositeParameter.GetHashCode
Метод предоставляет хеш-код данного объекта.
Returns: Возвращает хеш-код объекта.
Тип <c>int</c>.

Teigha.Geometry.CompositeParameter.IsEqualTo(Teigha.Geometry.CompositeParameter)
Метод предназначен для проверки данного объекта на равенство переданному объекту <c>CompositeParameter</c>.
a: Входной объект, с которым проверяется равенство. Тип <c>CompositeParameter</c>.
Returns: Возвращает <c>true</c>, если оба объекта не являются нулевыми и одновременно выполняются следующие условия:
1. Индексы подкривых совпадают.
2. Значения локальных параметров равны.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CompositeParameter.IsEqualTo(Teigha.Geometry.CompositeParameter,Teigha.Geometry.Tolerance)
Метод предназначен для проверки данного объекта на равенство переданному объекту <c>CompositeParameter</c> с использованием заданной точности.
a: Входной объект, с которым проверяется равенство. Тип <c>CompositeParameter</c>.
tolerance: Заданная точность для сравнения параметров.      Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если оба объекта не являются нулевыми и одновременно выполняются следующие условия:
1. Индексы подкривых совпадают.
2. Значения локальных параметров совпадают в пределах заданной точности <c>tolerance</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CompositeParameter.LocalParameter
Свойство <c>LocalParameter</c> представляет значение локального параметра у данного объекта.
Returns: Возвращает значение локального параметра.
Тип <c>double</c>.

Teigha.Geometry.CompositeParameter.SegmentIndex
Свойство <c>SegmentIndex</c> представляет индекс подкривой у данного объекта.
Returns: Возвращает индекс подкривой.
Тип <c>int</c>.