Teigha.DatabaseServices.RevolveOptions
Вспомогательный класс <c>RevolveOptions</c> представляет настраиваемые опции операции создания тел и поверхностей вращения.

Teigha.DatabaseServices.RevolveOptions.#ctor
Конструктор по умолчанию класса <c>RevolveOptions</c>.

Teigha.DatabaseServices.RevolveOptions.#ctor(Teigha.DatabaseServices.RevolveOptions)
Конструктор класса <c>RevolveOptions</c>. Позволяет создать новый экземпляр как копию предоставленного объекта данного класса.
opts: Входной объект для копирования. Тип <c>RevolveOptions</c>.

Teigha.DatabaseServices.RevolveOptions.CheckRevolveCurve(Teigha.DatabaseServices.Entity,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Boolean)
Метод реализует проверку на допустимость указанного объекта чертежа для операции вращения вокруг указанной оси.
ent: Объект чертежа, проверяемый на допустимость для операции вращения. Тип <c>Entity</c>.
axisPnt: Точка на оси вращения.  Тип <c>Point3d</c>.
axisDir: Направляющий вектор оси вращения. Тип <c>Vector3d</c>.
displayErrorMessages: Входной флаг, определяющий, следует ли выводить сообщения об ошибках в случае их обнаружения.
Returns: Возвращает результат проверки в виде объекта типа <c>RevolveOptionsCheckRevolveCurveOut</c>.
Notes
Эта проверка всегда выполняется методами <c>CreateRevolvedSurface()</c> и <c>CreateRevolvedSolid()</c>, поэтому приложению не обязательно вызывать этот метод непосредственно.

Teigha.DatabaseServices.RevolveOptions.Clone
Метод предназначен для клонирования текущих настроек операции вращения.
Returns: Возвращает объект, являющийся клоном текущих настроек операции вращения. Тип <c>Object</c>.

Teigha.DatabaseServices.RevolveOptions.CloseToAxis
Свойство <c>CloseToAxis</c> позволяет определить, следует ли замкнуть на ось вращения концы незамкнутого профиля перед выполнением операции вращения.
Returns: Возвращает <c>true</c>, если опция дотягивания концов кривой до оси вращения включена.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.RevolveOptions.DraftAngle
Свойство <c>DraftAngle</c> представляет угол сужения при вращении.
Returns: Возвращает угол сужения в радианах. Тип <c>double</c>.

Teigha.DatabaseServices.RevolveOptions.TwistAngle
Свойство <c>TwistAngle</c> представляет угол закручивания при вращении.
Returns: Возвращает угол закручивания в радианах.
Тип <c>double</c>.