HostMgd.EditorInput.PromptDistanceOptions
Класс, представляющий необязательные параметры для
приглашения ввода расстояния.

HostMgd.EditorInput.PromptDistanceOptions.BasePoint
Возвращает или устанавливает базовую точку, используемую в
приглашении.

HostMgd.EditorInput.PromptDistanceOptions.DefaultValue
Возвращает или устанавливает значение, которое будет
присвоено при нажатии только Enter без какого-либо другого
ввода.

HostMgd.EditorInput.PromptDistanceOptions.Only2d
Возвращает и устанавливает признак, должно ли возвращаемое
значение расстояния рассматриваться как проекция в местной
системе координат (ПСК).
Свойство не используется.

HostMgd.EditorInput.PromptDistanceOptions.#ctor(String)
Конструктор.
message: Приглашающее сообщение

HostMgd.EditorInput.PromptDistanceOptions.#ctor(String,String)
Конструктор.
messageAndKeywords: Приглашающая строка с ключевыми словами
globalKeywords: Ключевые слова (глобальные имена)

HostMgd.EditorInput.PromptDistanceOptions.UseBasePoint
Возвращает и выставляет признак того, будет ли использоваться
базовая точка.

HostMgd.EditorInput.PromptDistanceOptions.UseDashedLine
Включает и выключает штриховую "резиновую" линию, которая
рисуется между базовой точкой и текущим положением курсора
при вводе.