Teigha.DatabaseServices.PolyFaceMesh
Класс PolyFaceMesh представляет специальный тип полилинии PolyFaceMesh в nanoCAD.

Teigha.DatabaseServices.PolyFaceMesh.#ctor
Конструктор по умолчанию. Инициализирует счетчики граней и вершин нулями.

Teigha.DatabaseServices.PolyFaceMesh.AppendFaceRecord(Teigha.DatabaseServices.FaceRecord)
Данный метод добавляет запись FaceRecord, указанную в аргументе toAppend, в конец списка граней PolyFaceMesh, определяет объект PolyFaceMesh владельцем FaceRecord и добавляет FaceRecord в базу данных, содержащую PolyFaceMesh.
toAppend: Запись FaceRecord для добавления к сети.
Returns: Возвращает ObjectId.

Teigha.DatabaseServices.PolyFaceMesh.AppendVertex(Teigha.DatabaseServices.PolyFaceMeshVertex)
Этот метод добавляет вершину PolyFaceMeshVertex, указанную в аргументе vertexToAppend, в конец списка вершин PolyFaceMesh, определяет PolyFaceMesh владельцем вершины и добавляет эту вершину в базу данных, содержащую PolyFaceMesh.
vertexToAppend: Добавляемая в сеть вершина PolyFaceMeshVertex.
Returns: Возвращает ObjectId.

Teigha.DatabaseServices.PolyFaceMesh.GetEnumerator
Этот метод возвращает перечислитель для данной коллекции.
Returns: Возвращает перечислитель System.Collections.IEnumerator.

Teigha.DatabaseServices.PolyFaceMesh.NumFaces
Свойство предоставляет доступ к количеству граней в сети PolyFaceMesh.
Returns: Возвращает количество граней в сети PolyFaceMesh, тип int.

Teigha.DatabaseServices.PolyFaceMesh.NumVertices
Свойство предоставляет доступ к количеству вершин по координатным точкам в списке вершин сети PolyFaceMesh.
Returns: Возвращает количество вершин в сети PolyFaceMesh, тип int.