Teigha.BoundaryRepresentation.LoopVertexEnumerator
Класс <c>LoopVertexEnumerator</c> представляет перечислитель вершин цикла грани.

Teigha.BoundaryRepresentation.LoopVertexEnumerator.Current
Свойство <c>Current</c> предоставляет доступ к текущему элементу данного перечислителя.
Returns: Возвращает текущий элемент данного перечислителя.
Тип <c>Vertex</c>.