Teigha.DatabaseServices.DynamicBlockReferenceProperty
Класс DynamicBlockReferenceProperty является служебным классом, который обеспечивает доступ к свойствам вхождений динамических блоков.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.GetAllowedValues
Метод позволяет получить массив допустимых значений для данного свойства динамического блока.
Returns: Возвращает массив допустимых значений.  Тип Object[].

Teigha.DatabaseServices.DynamicBlockReferenceProperty.BlockId
Свойство BlockId представляет идентификатор объекта вхождения динамического блока.
Returns: Возвращает идентификатор объекта. Тип DatabaseServices.ObjectId.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.Description
Свойство Description возвращает описание данного свойства динамического блока.
Returns: Возвращает описание свойства динамического блока. Тип <c>String</c>.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.PropertyName
Свойство PropertyName представляет имя данного свойства динамического блока.
Returns: Возвращает имя свойства динамического блока. Тип <c>String</c>.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.PropertyTypeCode
Свойство PropertyTypeCode представляет тип значения свойства динамического блока.
Returns: Возвращает тип значения свойства динамического блока. Тип <c>short</c>.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.ReadOnly
Свойство ReadOnly определяет, доступно ли данное свойство динамического блока только для чтения.
Returns: Возвращает <c>true</c>, если данное свойство динамического блока доступно только для чтения.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.Show
Свойство Show позволяет определить, отображается ли данное свойство динамического блока на палитре свойств.
Returns: Возвращает <c>true</c>, если данное свойство отображается на палитре свойств.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.UnitsType
Свойство UnitsType представляет типы единиц измерения данного свойства динамического блока.
Returns: Возвращает тип единиц измерения из перечисления DynamicBlockReferencePropertyUnitsType.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.Value
Свойство Value представляет текущее значение данного свойства у вхождения динамического блока.
Returns: Возвращает текущее значение данного свойства. Тип <c>Object</c>.

Teigha.DatabaseServices.DynamicBlockReferenceProperty.VisibleInCurrentVisibilityState
Свойство VisibleInCurrentVisibilityState определяет, является ли данное свойство видимым в текущем представлении динамического блока.
Returns: Возвращает <c>true</c>, если свойство является видимым.
В противном случае возвращает <c>false</c>.