HostMgd.EditorInput.PromptAngleOptionsEventArgs
Класс обеспечивает данными событие PromptingForAngle класса
Editor.

HostMgd.EditorInput.PromptAngleOptionsEventArgs.Options
Возвращает параметры приглашения.