Teigha.DatabaseServices.PolygonMeshVertex
Класс <c>PolygonMeshVertex</c> представляет в базе данных вершины сети <c>PolygonMesh</c>.

Teigha.DatabaseServices.PolygonMeshVertex.#ctor
Конструктор по умолчанию класса <c>PolygonMeshVertex</c>.

Teigha.DatabaseServices.PolygonMeshVertex.#ctor(Teigha.Geometry.Point3d)
Конструктор класса <c>PolygonMeshVertex</c>. Создает экземпляр класса в заданной пространственной точке.
point: Координаты создаваемой вершины в мировой системе координат (WCS).

Teigha.DatabaseServices.PolygonMeshVertex.Position
Свойство <c>Position</c> представляет позицию данной вершины в мировой системе координат (WCS).
Returns: Возвращает точку, в которой располагается вершина. Тип <c>Point3d</c>.

Teigha.DatabaseServices.PolygonMeshVertex.VertexType
Свойство <c>VertexType</c> представляет тип данной вершины.
Returns: Возвращает тип вершины как значение из перечисления <c>Vertex3dType</c>.