Teigha.DatabaseServices.ViewTableRecord.LiveSection
Свойство предназначено для управления отображением
псевдоразреза, применяемого в именованном виде.
Returns: Возвращает тип данных ObjectId.

Teigha.DatabaseServices.ViewTableRecord.Layout
В свойстве хранится ObjectId листа, к которому относится
именованный вид.
Returns: Возвращает тип данных ObjectId.

Teigha.DatabaseServices.ViewTableRecord.AnnotationScale
В свойстве хранится аннотативный масштаб именованного вида.
Returns: Возвращает тип данных <xref target="Teigha::DatabaseServices::AnnotationScale" text="AnnotationScale" />.