Teigha.DatabaseServices.UnderlayLayerCollection
Класс <c>UnderlayLayerCollection</c> представляет коллекцию слоев подложки.

Teigha.DatabaseServices.UnderlayLayerCollection.CopyTo(array&lt; UnderlayLayer &gt;,System.Int32)
Метод предназначен для копирования коллекции слоёв подложки в указанный массив, начиная с позиции с указанным индексом.
arr: Массив, в который выполняется копирование элементов данной коллекции. Тип <c>UnderlayLayer[]</c>.
index: Позиция в массиве, начиная с которой в массив копируются элементы коллекции слоёв. Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayLayerCollection.GetEnumerator
Метод предоставляет перечислитель для данной коллекции.
Returns: Возвращает перечислитель для данной коллекции. Тип <c>Collections.IEnumerator</c>.

Teigha.DatabaseServices.UnderlayLayerCollection.Count
Свойство <c>Count</c> представляет текущее количество элементов в данной коллекции.
Returns: Возвращает текущее количество элементов в коллекции.
Тип <c>int</c>.

Teigha.DatabaseServices.UnderlayLayerCollection.Item
Свойство <c>Item</c> представляет слой подложки с указанным индексом.
index: Индекс искомого слоя подложки. Тип <c>int</c>.
Returns: Возвращает слой подложки с индексом <c>index</c>.
Тип <c>UnderlayLayer</c>.