Teigha.DatabaseServices.DynamicDimensionChangedEventArgs
Этот класс предоставляет данные для функции OnDimensionValueChanged класса Jig.

Teigha.DatabaseServices.DynamicDimensionChangedEventArgs.#ctor(System.Int32,System.Double)
Этот конструктор создает новый объект класса с указанными индексом и значением.
index: Индекс размера. Тип <c>int</c>.
value: Значение размера. Тип <c>double</c>.

Teigha.DatabaseServices.DynamicDimensionChangedEventArgs.Index
Свойство обеспечивает доступ к значению индекса.
Returns: Возвращает текущее значение индекса. Тип <c>int</c>.

Teigha.DatabaseServices.DynamicDimensionChangedEventArgs.Value
Свойство обеспечивает доступ к текущему значению размера.
Returns: Возвращает текущее значение размера. Тип <c>double</c>.