Teigha.BoundaryRepresentation.Mesh2dElement2dCollection
Класс <c>Mesh2dElement2dCollection</c> представляет коллекцию объектов <c>Element2d</c> двумерной сети <c>Mesh2d</c>.

Teigha.BoundaryRepresentation.Mesh2dElement2dCollection.GetEnumerator
Метод предоставляет перечислитель данной коллекции.
Returns: Возвращает перечислитель данной коллекции.
Тип <c>Mesh2dElement2dEnumerator</c>.