HostMgd.EditorInput.Editor.ActiveViewportId
Возвращает значение Id активного порта.
( Объекты ViewportTableRecord or Viewport,
в зависимости от того, какая вкладка - Модель или Лист - активна)
Только на чтение