Teigha.DatabaseServices.HyperLink
Класс <c>HyperLink</c> служит базовым классом для объектов гиперссылок.

Teigha.DatabaseServices.HyperLink.#ctor
Конструктор по умолчанию класса <c>HyperLink</c>.

Teigha.DatabaseServices.HyperLink.Equals(Object)
Метод предназначен для проверки равенства данного объекта указанному объекту.
other: Объект, проверяемый на равенство. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если объекты равны. В противном случае возвращает <c>false</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику -
если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод <c>Equals()</c> из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать этот GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.HyperLink.GetHashCode
Метод предназначен для получения хеш-кода данного объекта.
Returns: Возвращает хеш-код объекта. Тип <c>int</c>.
Notes
Переопределение методов <c>Equals</c> и <c>GetHashCode</c>  должно выполняться совместно, чтобы не нарушать логику -
если <c>Equals</c> возвращает <c>true</c>, хеш-коды сравниваемых объектов должны совпадать.
Обратное не гарантируется - совпадение хеш-кодов не всегда означает совпадение объектов вследствие возможных коллизий.
Хеш-коды следует формировать для полей, на которых основано равенство.
Иногда используется метод <c>Equals()</c> из объекта C++, но поскольку сравниваются указатели, вы по-прежнему можете использовать этот GetHashCode(), в то время как метод Equals() может быть переопределен в производном классе.

Teigha.DatabaseServices.HyperLink.Description
Свойство обеспечивает доступ к описанию, связанному с данным объектом <c>HyperLink</c>.
Returns: Возвращает описание данного объекта. Тип <c>String</c>.

Teigha.DatabaseServices.HyperLink.DisplayString
Свойство возвращает отображаемую строку вида "<Name> — <SubLocation>", связанную с этим объектом <c>HyperLink</c>.
Returns: Возвращает отображаемую строку. Тип <c>String</c>.

Teigha.DatabaseServices.HyperLink.IsOutermostContainer
Свойство позволяет определить, связан ли данный объект <c>HyperLink</c> с самым внешним контейнером.
Returns: Возвращает <c>true</c>, если гиперссылка связана с самым внешним контейнером.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.HyperLink.Name
Свойство обеспечивает доступ к имени, которое связано с данным объектом <c>HyperLink</c>.
Returns: Возвращает имя, связанное с данным объектом. Тип <c>String</c>.

Teigha.DatabaseServices.HyperLink.NestedLevel
Свойство позволяет определить уровень вложенности данного объекта <c>HyperLink</c>.
Returns: Возвращает уровень вложенности данного объекта. Тип <c>int</c>.

Teigha.DatabaseServices.HyperLink.SubLocation
Свойство обеспечивает доступ к вложенной именованной позиции, связанной с этим объектом <c>HyperLink</c>.
Returns: Возвращает вложенную именованную позицию этой гиперссылки. Тип <c>String</c>.