Teigha.DatabaseServices.PlotSettingsShadePlotType
Данное перечисление определяет режимы тонированной печати, используемые объектом <c>PlotSettings</c>.
От режима тонирования зависит, как будут отображаться видовые экраны при выводе на печать.