Teigha.Geometry.OffsetCurve3d
Класс <c>OffsetCurve3d</c> представляет трехмерную кривую, получаемую операцией смещения исходной (базовой) кривой.

Teigha.Geometry.OffsetCurve3d.#ctor(Teigha.Geometry.Curve3d,Teigha.Geometry.Vector3d,System.Double)
Конструктор класса <c>OffsetCurve3d</c>.
Создает кривую, которая является точным смещением на заданное расстояние указанной базовой кривой, располагающейся в указанной плоскости.
baseCurve: Плоская базовая кривая. Тип <c>Curve3d</c>.
planeNormal: Нормаль плоскости, в которой лежит базовая кривая. Тип <c>Vector3d</c>.
offsetDistance: Величина смещения(со знаком).  Тип <c>double</c>.

Teigha.Geometry.OffsetCurve3d.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект.
Тип <c>OffsetCurve3d</c>.

Teigha.Geometry.OffsetCurve3d.Curve
Свойство <c>Curve</c> представляет базовую кривую данной кривой смещения.
Returns: Возвращает базовую кривую для данного объекта.
Тип <c>Curve3d</c>.

Teigha.Geometry.OffsetCurve3d.Normal
Свойство <c>Normal</c> представляет направление нормали плоскости базовой кривой.
Returns: Возвращает нормаль плоскости базовой кривой.
Тип <c>Vector3d</c>.

Teigha.Geometry.OffsetCurve3d.OffsetDistance
Свойство <c>OffsetDistance</c> представляет расстояние со знаком, которое определяет текущее смещение данной кривой относительно её базовой кривой.
Returns: Возвращает величину смещения со знаком.
Тип <c>double</c>.

Teigha.Geometry.OffsetCurve3d.ParameterDirection
Свойство <c>ParameterDirection</c> позволяет определить направление изменения параметра у данной кривой относительно направления изменения параметра у базовой кривой.
Returns: Возвращает <c>true</c>, если направления изменения параметра у данной кривой и ее базовой кривой совпадают.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.OffsetCurve3d.Transformation
Свойство <c>Transformation</c> представляет матрицу геометрического преобразования, которое было применено к этой кривой путем вызова метода <c>TransformBy()</c>.
Returns: Возвращает матрицу геометрического преобразования, которое было применено к данной кривой.
Тип <c>Matrix3d</c>.