Teigha.DatabaseServices.RevolvedSurface
Класс <c>RevolvedSurface</c> представляет объект трехмерной поверхности вращения.

Teigha.DatabaseServices.RevolvedSurface.#ctor
Конструктор по умолчанию класса <c>RevolvedSurface</c>.

Teigha.DatabaseServices.RevolvedSurface.CreateRevolvedSurface(Teigha.DatabaseServices.Entity,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double,DatabaseServices.RevolveOptions)
Метод предназначен для создания поверхности вращения с указанными параметрами.
revolveEntity: Плоская кривая, область или плоская поверхность, которая служит образующей для создания поверхности вращения. Тип <c>Entity</c>.
axisPoint: Точка, через которую проходит ось вращения. Тип <c>Point3d</c>.
axisDirection: Направляющий вектор оси вращения. Тип <c>Vector3d</c>.
revolveAngle: Угол поворота (в радианах). Положительное направление отсчета углов - против часовой стрелки, если смотреть навстречу направляющему вектору оси вращения. Тип <c>double</c>.
startAngle: Начальный угол поворота (в радианах).  Тип <c>double</c>.
revolveOptions: Опции операции вращения. Тип <c>DatabaseServices.RevolveOptions</c>.

Teigha.DatabaseServices.RevolvedSurface.SetRevolve(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,Teigha.DatabaseServices.RevolveOptions)
Метод позволяет установить в данном объекте новые значения указанных параметров поверхности вращения.
axisPoint: Точка, через которую проходит ось вращения. Тип <c>Point3d</c>.
axisDirection: Направляющий вектор оси вращения. Тип <c>Vector3d</c>.
revolveAngle: Угол поворота (в радианах). Положительное направление отсчета углов - против часовой стрелки, если смотреть навстречу направляющему вектору оси вращения. Тип <c>double</c>.
revolveOptions: Опции операции вращения. Тип <c>DatabaseServices.RevolveOptions</c>.

Teigha.DatabaseServices.RevolvedSurface.AxisDirection
Свойство <c>AxisDirection</c> представляет направляющий вектор оси вращения данного объекта.
Returns: Возвращает направляющий вектор оси вращения. Тип <c>Vector3d</c>.

Teigha.DatabaseServices.RevolvedSurface.AxisPoint
Свойство <c>AxisPoint</c> представляет 3D-точку, через которую проходит ось вращения.
Returns: Возвращает 3D-точку на оси вращения. Тип <c>Point3d</c>.

Teigha.DatabaseServices.RevolvedSurface.RevolveAngle
Свойство <c>RevolveAngle</c> представляет угол поворота данного объекта.
Returns: Возвращает угол поворота для данной поверхности. Тип <c>double</c>.

Teigha.DatabaseServices.RevolvedSurface.RevolveEntity
Свойство <c>RevolveEntity</c> представляет геометрию образующей данной поверхности вращения.
Returns: Возвращает объект чертежа. Тип <c>Entity</c>.

Teigha.DatabaseServices.RevolvedSurface.RevolveOptions
Свойство <c>RevolveOptions</c> представляет опции операции вращения, влияющие на форму получаемой поверхности.
Returns: Возвращает опции операции вращения. Тип <c>DatabaseServices.RevolveOptions</c>.

Teigha.DatabaseServices.RevolvedSurface.StartAngle
Свойство <c>StartAngle</c> представляет начальный угол операции вращения.
Returns: Возвращает начальный угол операции вращения (в радианах). Тип <c>double</c>.