Teigha.Geometry.Curve3dCollection
Класс <c>Curve3dCollection</c> представляет коллекцию объектов <c>Curve3d</c>.

Teigha.Geometry.Curve3dCollection.#ctor
Конструктор по умолчанию класса <c>Curve3dCollection</c>.

Teigha.Geometry.Curve3dCollection.Add(Teigha.Geometry.Curve3d)
Метод добавляет в данную коллекцию новую кривую <c>Curve3d</c>.
value: Входная кривая, которая добавляется в коллекцию.
Returns: Возвращает индекс добавленной кривой в данной коллекции.
Тип <c>int</c>.

Teigha.Geometry.Curve3dCollection.Clear
Метод удаляет из коллекции все объекты.

Teigha.Geometry.Curve3dCollection.Contains(Teigha.Geometry.Curve3d)
Метод позволяет проверить, содержится ли в коллекции указанная кривая.
value: Проверяемая кривая.
Returns: Возвращает <c>true</c>, если кривая <c>value</c> содержится в данной коллекции.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve3dCollection.CopyTo(array&lt;Curve3d&gt;,System.Int32)
Метод копирует элементы этой коллекции в предоставленный массив, начиная с указанного индекса.
array: Массив, в который следует копировать элементы коллекции.  Тип <c>Curve3d[]</c>.
index: Индекс в массиве, начиная с которого в массив копируются элементы коллекции.  Тип <c>int</c>.

Teigha.Geometry.Curve3dCollection.GetEnumerator
Метод предоставляет перечислитель этой коллекции.
Returns: Возвращает перечислитель этой коллекции.
Тип <c>System.Collections.IEnumerator</c>.

Teigha.Geometry.Curve3dCollection.IndexOf(Teigha.Geometry.Curve3d)
Метод позволяет найти индекс указанной кривой в данной коллекции.
value: Искомая кривая.  Тип <c>Curve3d</c>.
Returns: Возвращает индекс элемента <c>value</c> в коллекции.
Тип <c>int</c>.

Teigha.Geometry.Curve3dCollection.Insert(System.Int32,Teigha.Geometry.Curve3d)
Метод вставляет в коллекцию указанный элемент в позицию с заданным индексом.
index: Позиция вставляемого элемента в коллекции.  Тип <c>int</c>.
value: Вставляемый в коллекцию элемент.  Тип <c>Curve3d</c>.

Teigha.Geometry.Curve3dCollection.Remove(Teigha.Geometry.Curve3d)
Метод предназначен для удаления из коллекции указанного элемента, если он там существует.
value: Удаляемый элемент.  Тип <c>Curve3d</c>.

Teigha.Geometry.Curve3dCollection.RemoveAt(System.Int32)
Метод предназначен для удаления из коллекции элемента в позиции с указанным индексом, если он существует.
index: Индекс удаляемого элемента.  Тип <c>int</c>.

Teigha.Geometry.Curve3dCollection.Count
Свойство <c>Count</c> представляет количество объектов в данной коллекции.
Returns: Возвращает текущее количество объектов в коллекции.
Тип <c>int</c>.

Teigha.Geometry.Curve3dCollection.IsFixedSize
Свойство <c>IsFixedSize</c> позволяет проверить, является ли размер данной коллекции фиксированным.
Returns: Возвращает <c>true</c>, если размер коллекции является фиксированным.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve3dCollection.IsReadOnly
Свойство <c>IsReadOnly</c> позволяет проверить, доступна ли данная коллекция только на чтение.
Returns: Возвращает <c>true</c>, если данная коллекция доступна только на чтение.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Curve3dCollection.Item
Свойство <c>Item</c> представляет элемент коллекции с указанным индексом.
index: Входной индекс элемента коллекции.  Тип <c>int</c>.
Returns: Возвращает элемент коллекции с указанным индексом.
Тип <c>Curve3d</c>.