Teigha.DatabaseServices.Filters.IndexUpdateData
Этот класс предназначен для сопоставления идентификаторов объектов <c>ObjectId</c> с любыми данными или флагами, специфичными для индекса.

Teigha.DatabaseServices.Filters.IndexUpdateData.AddId(Teigha.DatabaseServices.ObjectId)
Метод добавляет к данному объекту <c>IndexUpdateData</c> указанный идентификатор объекта <c>ObjectId</c>.
id: Добавляемый идентификатор объекта. Тип <c>ObjectId</c>.

Teigha.DatabaseServices.Filters.IndexUpdateData.GetIdData(Teigha.DatabaseServices.ObjectId)
Устарел - Используйте вместо него метод <c>GetIdDataPtr</c>.
Метод позволяет получить 32-битные данные, связанные с указанным идентификатором объекта.
id: Входной идентификатор объекта.  Тип <c>ObjectId</c>.
Returns: Возвращает целое число. Тип <c>int</c>.

Teigha.DatabaseServices.Filters.IndexUpdateData.GetIdDataPtr(Teigha.DatabaseServices.ObjectId)
Метод позволяет получить указатель <c>IntPtr</c> на данные, связанные с переданным идентификатором объекта.
id: Входной идентификатор объекта.  Тип <c>ObjectId</c>.
Returns: Возвращает указатель на связанные данные. Тип <c>IntPtr</c>.

Teigha.DatabaseServices.Filters.IndexUpdateData.GetIdFlags(Teigha.DatabaseServices.ObjectId)
Метод предназначен для получения 8-битного флага, связанного с идентификатором объекта <c>ObjectId</c>.
id: Входной идентификатор объекта, с которым связан флаг. Тип <c>ObjectId</c>.
Returns: Возвращает флаг, связанный с указанным <c>ObjectId</c>. Тип <c>byte</c>.

Teigha.DatabaseServices.Filters.IndexUpdateData.SetIdData(Teigha.DatabaseServices.ObjectId,System.Int32)
Метод устарел - используйте метод <c>SetIdData(ObjectId, IntPtr)</c>.
Метод позволяет задать в этом объекте <c>IndexUpdateData</c> указанные данные, связанные с переданным идентификатором объекта.
id: Входной идентификатор объекта. Тип <c>ObjectId</c>.
data: Связанные с идентификатором <c>id</c> данные. Тип <c>int</c>.

Teigha.DatabaseServices.Filters.IndexUpdateData.SetIdData(Teigha.DatabaseServices.ObjectId,IntPtr)
Метод задаёт в этом объекте <c>IndexUpdateData</c> указатель <c>IntPtr</c> на данные, связанные с переданным идентификатором объекта <c>ObjectId</c>.
id: Входной идентификатор объекта. Тип <c>ObjectId</c>.
data: Указатель на данные, связанные с <c>id</c>. Тип <c>IntPtr</c>.

Teigha.DatabaseServices.Filters.IndexUpdateData.SetIdFlags(Teigha.DatabaseServices.ObjectId,unsigned char)
Этот метод позволяет задать флаги, связанные указанным идентификатором объекта <c>ObjectId</c>.
id: Входной идентификатор объекта, с которым связаны флаги <c>flags</c>. Тип <c>ObjectId</c>.
flags: Флаги, связанные с идентификатором <c>id</c>. Тип <c>unsigned char</c>.