Teigha.BoundaryRepresentation.Exception
Класс <c>Exception</c> представляет контейнер для ошибок BREP.

Teigha.BoundaryRepresentation.Exception.#ctor
Конструктор по умолчанию класса <c>Exception</c>.

Teigha.BoundaryRepresentation.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus)
Конструктор класса <c>Exception</c>. Создает экземпляр класса для указанного статуса ошибки.
es: Входной статус ошибки.  Тип <c>BoundaryRepresentation.ErrorStatus</c>.

Teigha.BoundaryRepresentation.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus,String)
Конструктор класса <c>Exception</c>. Создает экземпляр класса для указанного статуса ошибки и с указанным сообщением.
es: Входной статус ошибки.  Тип <c>BoundaryRepresentation.ErrorStatus</c>.
message: Входное сообщение об ошибке. Тип <c>String</c>.

Teigha.BoundaryRepresentation.Exception.#ctor(Teigha.BoundaryRepresentation.ErrorStatus,String,Teigha.BoundaryRepresentation.Exception)
Конструктор класса <c>Exception</c>.
Создает экземпляр класса с указанными статусом ошибки, сообщением об ошибке и с внутренним исключением.
es: Входной статус ошибки.         Тип <c>BoundaryRepresentation.ErrorStatus</c>.
message: Входное сообщение об ошибке.   Тип <c>String</c>.
innerException: Входное внутреннее исключение. Тип <c>Exception</c>.

Teigha.BoundaryRepresentation.Exception.#ctor(SerializationInfo,StreamingContext)
Конструктор класса <c>Exception</c>. Создает исключение, используя указанную информацию о сериализации и потоковом контексте.
info: Входные данные, необходимые для сериализации/десериализации объекта.  Тип <c>SerializationInfo</c>.
context: Входной контекст сериализованного потока.  Тип <c>StreamingContext</c>.

Teigha.BoundaryRepresentation.Exception.GetObjectData(SerializationInfo,StreamingContext)
Данный метод вызывает версию своего суперкласса, а затем добавляет статус ошибки во входной объект <c>SerializationInfo</c>.
info: Входные данные, необходимые для сериализации/десериализации объекта.  Тип <c>SerializationInfo</c>.
context: Входной контекст сериализованного потока.  Тип <c>StreamingContext</c>.

Teigha.BoundaryRepresentation.Exception.ErrorStatus
Свойство <c>ErrorStatus</c> предоставляет доступ к статусу ошибки.
Returns: Возвращает статус ошибки BREP.  Тип <c>BoundaryRepresentation.ErrorStatus</c>.