Teigha.Geometry.Cylinder
Класс <c>Cylinder</c> представляет прямые круговые цилиндры.

Teigha.Geometry.Cylinder.#ctor(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Конструктор класса <c>Cylinder</c>.
Создает экземпляр класса с указанными осью цилиндра, началом координат и радиусом.
radius: Радиус основания цилиндра. Тип <c>double</c>.
origin: Начало координат цилиндра. Тип <c>Point3d</c>.
axisOfSymmetry: Ось цилиндра. Тип <c>Vector3d</c>.

Teigha.Geometry.Cylinder.#ctor(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Конструктор класса <c>Cylinder</c>.
Создает экземпляр класса с указанными осью цилиндра, началом координат, радиусом, высотой, направлением отсчета углов, начальным и конечным углами.
radius: Радиус цилиндра. Тип <c>double</c>.
origin: Точка на оси цилиндра в качестве начала координат. Тип <c>Point3d</c>.
axisOfSymmetry: Ось цилиндра. Тип <c>Vector3d</c>.
referenceAxis: Направление отсчета углов. Тип <c>Vector3d</c>.
height: Высота цилиндра. Тип <c>Interval</c>.
startAngle: Начальный угол. Тип <c>double</c>.
endAngle: Конечный угол. Тип <c>double</c>.

Teigha.Geometry.Cylinder.Create(IntPtr,System.Boolean)
Метод создает объект на основе переданного неуправляемого указателя.
unmanagedPointer: Входной неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Входной флаг, определяющий, должен ли создаваемый объект автоматически удаляться сборщиком мусора. Тип <c>bool</c>.
Returns: Возвращает созданный объект. Тип <c>Cylinder</c>.

Teigha.Geometry.Cylinder.GetAngles
Метод предоставляет начальный и конечный углы на базовой окружности цилиндра.
Returns: Возвращает массив из двух элементов, которые определяют начальный и конечный углы, соответственно.
Тип <c>double[]</c>.

Teigha.Geometry.Cylinder.GetHeightAt(System.Double)
Метод вычисляет высоту цилиндра, которая соответствует переданному значению параметра <c>U</c>.
parameter: Значение параметра <c>U</c> из области определения цилиндра. Тип <c>double</c>.
Returns: Возвращает значение высоты, которая соответствует переданному значению <c>parameter</c>.
Тип <c>double</c>.

Teigha.Geometry.Cylinder.IntersectWith(Teigha.Geometry.LinearEntity3d)
Метод вычисляет точки пересечения данного цилиндра с указанным линейным объектом, используя геометрическую точность по умолчанию.
linearEntity: Входной линейный объект, точки пересечения с которым требуется вычислить. Тип <c>LinearEntity3d</c>.
Returns: Возвращает массив, состоящий из двух элементов, которые соответствуют, соответственно, первой и второй точкам пересечения (если они существуют).
Тип <c>Point3d[]</c>.

Teigha.Geometry.Cylinder.IntersectWith(Teigha.Geometry.LinearEntity3d,Teigha.Geometry.Tolerance)
Метод вычисляет точки пересечения данного цилиндра с указанным линейным объектом, используя указанную геометрическую точность.
linearEntity: Входной линейный объект, точки пересечения с которым требуется вычислить. Тип <c>LinearEntity3d</c>.
tolerance: Заданная геометрическая точность вычисления пересечений. Тип <c>Tolerance</c>.
Returns: Возвращает массив, состоящий ровно из двух элементов, которые соответствуют, соответственно, первой и второй точкам пересечения (если они существуют). Тип <c>Point3d[]</c>.
Notes
В случае отсутствия точек пересечения или при возникновении ошибки метод возвращает <c>null</c>.

Teigha.Geometry.Cylinder.IsClosed
Метод позволяет проверить, является ли основание данного цилиндра полной окружностью.
Используется геометрическая точность по умолчанию.
Returns: Возвращает <c>true</c>, если с используемой точностью основание данного цилиндра можно считать полной окружностью.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Cylinder.IsClosed(Teigha.Geometry.Tolerance)
Метод позволяет убедиться, что с переданной в метод точностью основание данного цилиндра можно считать полной окружностью.
tolerance: Заданная геометрическая точность. Тип <c>Tolerance</c>.
Returns: Возвращает <c>true</c>, если с указанной точностью основание данного цилиндра можно считать полной окружностью.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Cylinder.Set(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод переопределяет данный объект, используя новые ось цилиндра, его радиус и начало координат.
radius: Радиус основания цилиндра. Тип <c>double</c>.
origin: Начало координат цилиндра. Тип <c>Point3d</c>.
axisOfSymmetry: Ось цилиндра. Тип <c>Vector3d</c>.

Teigha.Geometry.Cylinder.Set(System.Double,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Interval,System.Double,System.Double)
Метод позволяет переопределить данный объект, используя новые ось цилиндра, начало координат, радиус, высоту, направление отсчета углов, а также начальный и конечный углы.
radius: Радиус цилиндра. Тип <c>double</c>.
origin: Точка на оси цилиндра в качестве начала координат. Тип <c>Point3d</c>.
axisOfSymmetry: Ось цилиндра. Тип <c>Vector3d</c>.
referenceAxis: Направление отсчета углов. Тип <c>Vector3d</c>.
height: Высота цилиндра. Тип <c>Interval</c>.
startAngle: Начальный угол. Тип <c>double</c>.
endAngle: Конечный угол. Тип <c>double</c>.

Teigha.Geometry.Cylinder.SetAngles(System.Double,System.Double)
Метод позволяет переопределить начальный и конечный углы для данного цилиндра.
startAngle: Начальный угол. Тип <c>double</c>.
endAngle: Конечный угол. Тип <c>double</c>.

Teigha.Geometry.Cylinder.AxisOfSymmetry
Свойство <c>AxisOfSymmetry</c> представляет направление оси цилиндра.
Returns: Возвращает направление оси цилиндра. Тип <c>Vector3d</c>.

Teigha.Geometry.Cylinder.Height
Свойство <c>Height</c> представляет интервал для высоты данного цилиндра.
Returns: Возвращает интервал для высоты цилиндра. Тип <c>Interval</c>.

Teigha.Geometry.Cylinder.IsOuterNormal
Свойство <c>IsOuterNormal</c> позволяет проверить, направлена ли нормаль цилиндрической поверхности наружу.
Returns: Возвращает <c>true</c>, если нормаль цилиндрической поверхности направлена наружу.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.Cylinder.Origin
Свойство <c>Origin</c> представляет точку начала координат данного цилиндра.
Returns: Возвращает точку начала координат цилиндра.
Тип <c>Point3d</c>.

Teigha.Geometry.Cylinder.Radius
Свойство <c>Radius</c> представляет радиус данного цилиндра.
Returns: Возвращает радиус цилиндра.
Тип <c>double</c>.

Teigha.Geometry.Cylinder.ReferenceAxis
Свойство <c>ReferenceAxis</c> предоставляет доступ к направлению отсчета углов в основании данного цилиндра.
Returns: Возвращает направление отсчета углов в основании цилиндра.
Тип <c>Vector3d</c>.