HostMgd.EditorInput.PromptSelectionResult
Класс, содержащий результаты выбора после приглашения

HostMgd.EditorInput.PromptSelectionResult.Status
Свойство возвращает статус завершения операции после
приглашения.

HostMgd.EditorInput.PromptSelectionResult.StringResult
Возвращает необязательную строку с результатом опеации после
приглашения. Это значение устанавливается, если статус
операции С PromptStatus.Keyword, или после приглашения как
первичный результат возвращается строка.

HostMgd.EditorInput.PromptSelectionResult.ToString(IFormatProvider)
Возвращает строковое представление данного объекта в
соответствии с заданным форматом, зависящим от локализации.
provider: Формат, зависящей от локализации

HostMgd.EditorInput.PromptSelectionResult.Value
Возвращает множество выбранных пользователем объектов.