Teigha.Geometry.CurveBoundaryData.Equals(Object)
Метод предназначен для проверки идентичности данного объекта указанному объекту.
obj: Входной объект, с которым выполняется сравнение. Тип <c>Object</c>.
Returns: Возвращает <c>true</c>, если данный объект идентичен объекту <c>obj</c>.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CurveBoundaryData.GetCurve2ds
Метод предоставляет массив 2D-кривых в параметрическом пространстве для данного объекта.
Returns: Возвращает массив 2D-кривых для данного объекта.
Тип <c>Curve2d[]</c>.

Teigha.Geometry.CurveBoundaryData.GetCurve3ds
Метод предоставляет массив трехмерных кривых для данного объекта.
Returns: Возвращает массив трехмерных кривых для данного объекта.
Тип <c>Entity3d[]</c>.

Teigha.Geometry.CurveBoundaryData.GetHashCode
Метод предоставляет хеш-код для этого объекта.
Returns: Возвращает хеш-код для данного объекта.
Тип <c>int</c>.

Teigha.Geometry.CurveBoundaryData.IsEqualTo(Teigha.Geometry.CurveBoundaryData)
Метод предназначен для сравнения 2D- и 3D-ориентаций, а также 2D- и 3D-кривых в этом определении границы с данными в указанном объекте <c>CurveBoundaryData</c>.
a: Входной объект, с которым выполняется сравнение. Тип <c>CurveBoundaryData</c>.
Returns: Возвращает <c>true</c>, если сравнение подтверждает идентичность 2D- и 3D-ориентаций, а также 2D- и 3D-кривых для сравниваемых объектов.
В противном случае возвращает <c>false</c>.

Teigha.Geometry.CurveBoundaryData.Orientation2d
Свойство <c>Orientation2d</c> позволяет проверить логическую ориентацию 2D-кривых в параметрическом пространстве.
Returns: Возвращает <c>true</c>, если ориентация 2D-кривых является нормальной.
В случае обратной ориентации возвращает <c>false</c>.

Teigha.Geometry.CurveBoundaryData.Orientation3d
Свойство <c>Orientation3d</c> позволяет проверить логическую ориентацию 3D-кривых в данном объекте.
Returns: Возвращает <c>true</c>, если ориентация 3D-кривых является нормальной.
В случае обратной ориентации возвращает <c>false</c>.