Teigha.GraphicsInterface.Geometry
Класс Geometry абстрагирует общее между классами ViewportGeometry и WorldGeometry.

Teigha.GraphicsInterface.Geometry.Circle(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод отображает графический примитив в виде окружности, построенной по трем несовпадающим точкам, которые лежат на окружности.
firstPoint: Первая точка на окружности. Тип Point3d.
secondPoint: Вторая точка на окружности. Тип Point3d.
thirdPoint: Третья точка на окружности. Тип Point3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Circle(Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d)
Метод отображает графический примитив в виде окружности с указанными центром и радиусом, которая лежит в заданной плоскости.
center: Точка центра окружности. Тип Point3d.
radius: Радиус окружности. Тип double.
normal: Вектор нормали к плоскости окружности. Тип Vector3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.CircularArc(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.Geometry.Point3d,Teigha.GraphicsInterface.ArcType)
Метод отображает графический примитив в виде дуги с типом из перечисления ArcType, определяемой тремя точками: точками начала и конца, а также точкой, лежащей на дуге.
start: Входная точка начала дуги. Тип Point3d.
point: Входная точка, лежащая на дуге. Тип Point3d.
endingPoint: Входная точка конца дуги. Тип Point3d.
arcType: Требуемый тип дуги. Значение из перечисления ArcType.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.CircularArc(Teigha.Geometry.Point3d,System.Double,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,Teigha.GraphicsInterface.ArcType)
Метод отображает графический примитив в виде дуги, определяемой центром дуги, ее радиусом, вектором нормали плоскости, вектором от центра дуги до начальной точки дуги, углом раствора дуги и типом дуги из перечисления ArcType.
center: Точка центра дуги. Тип Point3d.
radius: Радиус дуги. Тип double.
normal: Вектор нормали плоскости, в которой лежит дуга. Тип Vector3d.
startVector: Вектор, направленный из центра дуги к ее начальной точке. Тип Vector3d.
sweepAngle: Угол раствора дуги (в радианах). Тип double.
arcType: Требуемый тип дуги. Значение из перечисления ArcType.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Draw(Teigha.GraphicsInterface.Drawable)
Метод дает команду графической системе регенерировать графическое представление входного значения как компонента данного объекта.
value: Входной объект Drawable, который должен быть отрисован.
Returns: Возвращает true, если отрисовка завершилась успешно. В противном случае возвращает false.
Example
В качестве примера приведен фрагмент кода, где используется метод Draw() класса Geometry. Наиболее распространенным случаем использования этого метода в .NET API nanoCAD является технология Jig.
Jig использует метод WorldDraw, у которого входным параметром является переменная типа Teigha.GraphicsInterface.WorldDraw. У этого типа есть свойство Geometry типа Teigha.GraphicsInterface.Geometry, через которое можно получить доступ к методу Draw():
<pre><b>C#</b></pre>
<code lang="c#">
// Определение метода WorldDraw из класса HostMgd.EditorInput.DrawJig
protected override bool WorldDraw(WorldDraw draw)
{
// Переменная line объявлена в классе-наследнике HostMgd.EditorInput.DrawJig
if (line == null)
{
line = new Teigha.DatabaseServices.Line();
line.SetDatabaseDefaults();
}
// Присваиваем значения начальной и конечной точкам линии.
// Переменные basePt и newPt объявлены в классе-наследнике HostMgd.EditorInput.DrawJig
line.StartPoint = basePt;
line.EndPoint = newPt;
// Для отрисовки линии здесь применяется метод Draw()
draw.Geometry.Draw(line);
return true;
}
</code>
Полный пример применения технологии Jig, где используется метод Draw() класса Geometry, приведен в описании класса
<link @@HostMgd::EditorInput::DrawJig, DrawJig>.

Teigha.GraphicsInterface.Geometry.EllipticalArc(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Double,System.Double,Teigha.GraphicsInterface.ArcType)
Метод реализует отрисовку эллиптической дуги или полного эллипса, с заливкой или без заливки.
center: Центр дуги. Тип Point3d.
normal: Вектор нормали к плоскости, в которой располагается дуга/эллипс. Тип Vector3d.
majorAxisLength: Длина большой оси эллипса. Тип double.
minorAxisLength: Длина малой оси эллипса. Тип double.
startDegreeInRads: Начальный угол в радианах. Тип double.
endDegreeInRads: Конечный угол в радианах. Тип double.
tiltDegreeInRads: Угол наклона большой оси эллипса. Тип double.
arcType: Тип отображения дуги. Значение из перечисления ArcType.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Image(Teigha.GraphicsInterface.ImageBGRA32,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод реализует отрисовку прозрачного изображения ImageBGRA32, используя переданные в метод параметры.
Изображение будет растянуто, если его "родные" размеры не равны заявленным.
imageSource: Входное прозрачное изображение. Тип ImageBGRA32.
position: Точка вставки изображения. Тип Point3d. Используется система координат дисплея.
u: Требуемая ширина прямоугольного изображения. Тип Vector3d.
v: Требуемая высота прямоугольного изображения. Тип Vector3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Image(Teigha.GraphicsInterface.ImageBGRA32,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,Teigha.GraphicsInterface.TransparencyMode)
Метод реализует отрисовку прозрачного изображения ImageBGRA32, используя переданные в метод параметры. Изображение будет растянуто, если его "родные" размеры не равны заявленным. Метод позволяет задать режим прозрачности для изображения TransparencyMode.
imageSource: Входное прозрачное изображение. Тип ImageBGRA32.
position: Точка вставки изображения. Тип Point3d. Используется система координат дисплея.
u: Требуемая ширина прямоугольного изображения. Тип Vector3d.
v: Требуемая высота прямоугольного изображения. Тип Vector3d.
transparencyMode: Режим прозрачности при отрисовке изображения. Значение из перечисления TransparencyMode.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.  Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Mesh(System.Int32,System.Int32,Teigha.Geometry.Point3dCollection,Teigha.GraphicsInterface.EdgeData,Teigha.GraphicsInterface.FaceData,Teigha.GraphicsInterface.VertexData,System.Boolean)
Метод предназначен для создания и отображения примитива сети, характеристики которой определяются объектами, переданными в метод в качестве параметров.
rows: Количество строк в сети. Тип int.
columns: Количество столбцов в сети. Тип int.
points: Входной массив вершин. Размерность массива определяется произведением rows x columns. Тип Point3dCollection.
edgeData: Входной объект EdgeData для данных о ребрах. Тип EdgeData.
faceData: Входной объект FaceData для данных о гранях. Тип FaceData.
vertexData: Входной объект VertexData для данных о вершинах. Тип VertexData.
bAutoGenerateNormals: Входной флаг, который определяет, должна ли система отображения автоматически генерировать нормали для вершин и граней, если они не передаются через массивы vertexData и faceData. Тип bool.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.OwnerDraw(Teigha.GraphicsInterface.GdiDrawObject,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d)
Метод позволяет вызвать отрисовку объекта-владельца GDI.
gdiDrawObject: Входной объект gdiDrawObject объекта-владельца GDI. Тип GdiDrawObject.
position: Точка начала (точка вставки) для отрисовки объекта-владельца GDI. Тип Point3d.
u: Входная ориентация и ширина окна отрисовки.
v: Входная ориентация и высота окна отрисовки.
Returns: Возвращает false , если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.PolyPolygon(Teigha.Geometry.UInt32Collection,Teigha.Geometry.Point3dCollection,Teigha.Geometry.UInt32Collection,Teigha.Geometry.Point3dCollection,Teigha.Colors.EntityColorCollection,Teigha.GraphicsInterface.LinetypeCollection,Teigha.Colors.EntityColorCollection,Colors.TransparencyCollection)
Метод вводит несколько полигонов в контекст векторизации с соответствующей настройкой их свойств (форма, непрозрачность, контуры и т.д.).
numPolygonPositions: Массив, элементы которого хранят количество полигонов каждого типа. Тип UInt32Collection.
polygonPositions: Массив позиций полигонов (смещения для каждого полигона). Тип Point3dCollection.
numPolygonPoints: Массив с количествами вершин у полигонов. Тип UInt32Collection.
polygonPoints: Массив вершин каждого полигона. Тип Point3dCollection.
outlineColors: Массив цветов контуров для типов полигонов, по одному цвету на каждый индекс полигона. Тип EntityColorCollection.
outlineTypes: Массив типов контуров для каждого типа полигонов, по одному типу на каждый индекс полигона. Тип LinetypeCollection.
fillColors: Массив цветов заливки для каждого типа полигонов, по одному цвету fillColor на каждый индекс полигона. Тип EntityColorCollection.
fillOpacities: Массив объектов непрозрачности для полигонов, по одному fillOpacity на каждый индекс полигона. Тип Colors.TransparencyCollection.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.
Example
Пример вызова метода (здесь квадратные скобки обозначают массив):
<code>
polyPolygon (
[100, 7],
[100 + 7 = 107 общее количество позиций],
[4, 6],
[4 + 6 = 10 всего точек],
[outlinecolor0, outlinecolor1],
[pattern0, pattern1],
[fillcolor0, fillcolor1],
[opacity0, opacity1]
);
</code>

Teigha.GraphicsInterface.Geometry.PolyPolyline(Teigha.GraphicsInterface.PolylineCollection)
Метод вводит несколько полилиний в контекст векторизации.
polylineCollection: Входная коллекция полилиний. Тип PolylineCollection.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polygon(Teigha.Geometry.Point3dCollection)
Метод вводит в контекст векторизации новый полигон с указанными вершинами.
points: Входная коллекция вершин полигона (минимум три). Тип Point3dCollection.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polyline(GraphicsInterface.Polyline)
Метод рисует указанную полилинию.
polylineObj: Входная полилиния. Тип GraphicsInterface.Polyline.
Returns: Возвращаемое значение true означает, что операция выполнена успешно.
В противном случае возвращает false.

Teigha.GraphicsInterface.Geometry.Polyline(DatabaseServices.Polyline,System.Int32,System.Int32)
Метод использует входной объект Polyline для создания отображаемой геометрии указанной последовательности сегментов полилинии.
value: Входной существующий объект полилинии. Тип DatabaseServices.Polyline.
fromIndex: Индекс начального отображаемого сегмента полилинии. Тип int.
segments: Входное количество отображаемых сегментов. Тип int.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polyline(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3d,IntPtr)
Метод создает отображаемую геометрию полилинии, позволяя вызывающему объекту задать последовательные маркеры подобъектов для сегментов полилинии.
points: Входная последовательность вершин полилинии (минимум две). Тип Point3dCollection.
normal: Входной вектор нормали. Тип Vector3d.
subEntityMarker: Входной маркер подобъекта для первого сегмента полилинии. Тип IntPtr.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polypoint(Teigha.Geometry.Point3dCollection,Teigha.Geometry.Vector3dCollection,Teigha.Geometry.IntPtrCollection)
Метод создает отображаемую геометрию полилинии, используя переданные в метод коллекции вершин, нормалей и маркеров подобъектов полилинии.
points: Входная коллекция вершин полилинии. Тип Point3dCollection.
normals: Входная коллекция нормалей полилинии. Тип Vector3dCollection.
subentityMarkers: Входная коллекция маркеров подобъектов.  Тип IntPtrCollection.
Returns: Возвращает true, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polypoint(Teigha.Geometry.Point3dCollection,Teigha.Colors.EntityColorCollection,Teigha.Colors.TransparencyCollection,Teigha.Geometry.Vector3dCollection,Teigha.Geometry.IntPtrCollection,System.Int32)
Метод отображает полилинию, используя входные коллекции вершин, цветов, прозрачностей, нормалей и маркеров подобъектов.
points: Входная коллекция вершин. Тип Point3dCollection.
colors: Входная коллекция цветов. Тип EntityColorCollection.
transparency: Входная коллекция объектов Transparency. Тип TransparencyCollection.
normals: Входная коллекция нормалей. Тип Vector3dCollection.
subentityMarkers: Входная коллекция маркеров подобъектов. Тип IntPtrCollection.
pointSize: Отображаемый размер вершины. Тип int.
Returns: Возвращает true, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Polypoint(Teigha.Geometry.Point3dCollection,Teigha.Colors.EntityColorCollection,Teigha.Geometry.Vector3dCollection,Teigha.Geometry.IntPtrCollection)
Метод отображает полилинию, используя входные коллекции вершин, цветов, нормалей и маркеров подобъектов.
points: Входная коллекция вершин. Тип Point3dCollection.
colors: Входная коллекция цветов. Тип EntityColorCollection.
normals: Входная коллекция нормалей. Тип Vector3dCollection.
subentityMarkers: Входная коллекция маркеров подобъектов. Тип IntPtrCollection.
Returns: Возвращает true, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.PopClipBoundary
Метод удаляет из стека самую верхнюю границу обрезки.

Teigha.GraphicsInterface.Geometry.PopModelTransform
Этот метод должен быть вызван для восстановления преобразования модели после вызова метода PushModelTransform().
Returns: Возвращает true в случае успешного завершения. В противном случае возвращает false.

Teigha.GraphicsInterface.Geometry.PushClipBoundary(Teigha.GraphicsInterface.ClipBoundary)
Метод помещает в стек новую границу обрезки.
boundary: Входная граница обрезки для помещения в стек. Тип ClipBoundary.
Returns: Возвращает true в случае успешного завершения. В случае ошибки генерирует соотетствующее исключение.

Teigha.GraphicsInterface.Geometry.PushClipBoundary(Teigha.GraphicsInterface.ClipBoundary,Teigha.GraphicsInterface.AbstractClipBoundary)
Метод помещает в стек новую границу обрезки вместе с дополнительной информацией об этой обрезке.
boundary: Входная граница обрезки. Тип ClipBoundary.
abstrClip: Дополнительная информация об обрезке. Тип AbstractClipBoundary.

Teigha.GraphicsInterface.Geometry.PushModelTransform(Teigha.Geometry.Matrix3d)
Метод помещает указанную матрицу геометрического преобразования модели в текущий стек геометрических преобразований.
matrix: Входная матрица геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.PushModelTransform(Teigha.Geometry.Vector3d)
Метод помещает геометрическое преобразование трансляции модели на заданный 3D-вектор в текущий стек геометрических преобразований.
normal: Входной вектор трансляции модели. Тип Vector3d.

Teigha.GraphicsInterface.Geometry.PushOrientationTransform(Teigha.GraphicsInterface.OrientationBehavior)
Метод помещает в текущий стек преобразований новое преобразование ориентации, сформированное в соответствии с входным значением OrientationBehavior, и возвращает результирующую матрицу.
behavior: Вариант ориентационного поведения из перечисления OrientationBehavior.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.PushPositionTransform(Teigha.GraphicsInterface.PositionBehavior,Teigha.Geometry.Point2d)
Метод помещает в текущий стек преобразований новое преобразование позиции, сформированное в соответствии с входным значением PositionBehavior. Положение задается объектом Point2d. Метод возвращает результирующую матрицу.
behavior: Вариант поведения при преобразовании положения. Значение из перечисления PositionBehavior.
offset: Входное смещение. Тип Point2d.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.PushPositionTransform(Teigha.GraphicsInterface.PositionBehavior,Teigha.Geometry.Point3d)
Метод помещает в текущий стек преобразований новое преобразование позиции, сформированное в соответствии с входным значением PositionBehavior. Положение задается объектом Point3d. Метод возвращает результирующую матрицу.
behavior: Вариант поведения при преобразовании положения. Значение из перечисления PositionBehavior.
offset: Входное смещение. Тип Point3d.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.PushScaleTransform(Teigha.GraphicsInterface.ScaleBehavior,Teigha.Geometry.Point2d)
Метод помещает в текущий стек преобразований новое преобразование масштаба, сформированное в соответствии с входным значением ScaleBehavior. Масштабирование задается объектом Point2d. Метод возвращает результирующую матрицу.
behavior: Вариант поведения при преобразовании масштаба. Значение из перечисления ScaleBehavior.
extents: Входные значения масштаба.  Тип Point2d.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.PushScaleTransform(Teigha.GraphicsInterface.ScaleBehavior,Teigha.Geometry.Point3d)
Метод помещает в текущий стек преобразований новое преобразование масштаба, сформированное в соответствии с входным значением ScaleBehavior. Масштабирование задается объектом Point3d. Метод возвращает результирующую матрицу.
behavior: Вариант поведения при преобразовании масштаба. Значение из перечисления ScaleBehavior.
extents: Входные значения масштаба.  Тип Point3d.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.Ray(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод отображает луч, построенный по двум 3D-точкам.
point1: Начальная точка луча. Тип Point3d.
point2: Точка, через которую проходит луч. Не должна совпадать с начальной точкой. Тип Point3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.RowOfDots(System.Int32,Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d)
Метод отображает последовательность равноудаленных точек вдоль заданного направления.
count: Входное количество точек. Тип int.
start: Начальная точка. Тип Point3d.
step: Шаг точек. Тип Vector3d.
Returns: Возвращает true в случае успешного завершения.  В противном случае возвращает false.

Teigha.GraphicsInterface.Geometry.Shell(Teigha.Geometry.Point3dCollection,Teigha.Geometry.IntegerCollection,Teigha.GraphicsInterface.EdgeData,Teigha.GraphicsInterface.FaceData,Teigha.GraphicsInterface.VertexData,System.Boolean)
Метод создает примитив оболочки и вводит его в контекст векторизации.
points: Входная коллекция вершин. Тип Point3dCollection.
faces: Входная целочисленная коллекция, описывающая грани оболочки. Тип IntegerCollection.
edgeData: Входной существующий объект EdgeData с дополнительной информацией о ребрах.
faceData: Входной существующий объект FaceData с дополнительной информацией о гранях.
vertexData: Входной существующий объект VertexData с дополнительной информацией о вершинах.
bAutoGenerateNormals: Входной флаг, который определяет, должна ли система отображения автоматически генерировать нормали для вершин и граней, если они не передаются через аргументы <c>vertexData</c> и <c>faceData</c>. Тип bool.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.
Этот метод также генерирует соответствующее исключение в случае ошибки.

Teigha.GraphicsInterface.Geometry.Text(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,String,System.Boolean,Teigha.GraphicsInterface.TextStyle)
Метод предназначен для отображения указанного текста в заданной ориентации и в заданном стиле.
position: Точка вставки текста. Тип Point3d.
normal: Вектор нормали плоскости текста. Тип Vector3d.
direction: Направление текста. Тип Vector3d.
message: Отображаемый текст. Тип String.
raw: Флаг, определяющий, следует ли интерпретировать escape-коды. Тип bool.
textStyle: Существующий текстовый стиль, который следует применить при отображении текста. Тип TextStyle.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Text(Teigha.Geometry.Point3d,Teigha.Geometry.Vector3d,Teigha.Geometry.Vector3d,System.Double,System.Double,System.Double,String)
Метод предназначен для отображения указанного текста в заданной ориентации и с заданными высотой, шириной и углом наклона символов.
position: Точка вставки текста. Тип Point3d.
normal: Вектор нормали плоскости текста. Тип Vector3d.
direction: Направление текста. Тип Vector3d.
height: Высота текста. Тип double.
width: Ширина текста. Тип double.
oblique: Угол наклона текста. Тип double.
message: Отображаемый текст. Тип String.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.WorldLine(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод отображает линию, проходящую между двумя точками, заданными в мировой системе координат.
startPoint: Начальная точка линии. Тип Point3d.
endPoint: Конечная точка линии. Тип Point3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.Xline(Teigha.Geometry.Point3d,Teigha.Geometry.Point3d)
Метод отображает конструкционную линию xline, проходящую через две заданных точки.
point1: Первая точка, через которую проходит линия. Тип Point3d.
point2: Вторая точка, через которую проходит линия. Тип Point3d.
Returns: Возвращает false, если примитив успешно сохранен в графической базе данных.
Возвращаемое значение true указывает, что операция была прервана, и приложение хочет вернуть управление как можно скорее.

Teigha.GraphicsInterface.Geometry.ModelToWorldTransform
Свойство позволяет получить матрицу геометрического преобразования из системы координат модели в мировую систему координат.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.

Teigha.GraphicsInterface.Geometry.WorldToModelTransform
Свойство позволяет получить матрицу геометрического преобразования из мировой системы координат в систему координат модели.
Returns: Возвращает матрицу геометрического преобразования. Тип Matrix3d.