Teigha.BoundaryRepresentation.VertexEdgeCollection
Класс <c>VertexEdgeCollection</c> представляет набор ребер, с которыми связана вершина.

Teigha.BoundaryRepresentation.VertexEdgeCollection.GetEnumerator
Метод позволяет получить перечислитель данной коллекции ребер.
Returns: Возвращает перечислитель коллекции ребер.
Тип <c>VertexEdgeEnumerator</c>.