Teigha.DatabaseServices.HostApplicationServices
Класс <c>HostApplicationServices</c> предоставляет хост-приложениям различные сервисы времени выполнения.

Teigha.DatabaseServices.HostApplicationServices.#ctor
Конструктор по умолчанию класса <c>HostApplicationServices</c>.

Teigha.DatabaseServices.HostApplicationServices.#ctor(IntPtr,System.Boolean)
Конструктор класса <c>HostApplicationServices</c>.
unmanagedObject: Неуправляемый указатель на исходный объект. Тип <c>IntPtr</c>.
autoDelete: Флаг автоудаления исходного объекта. Тип <c>bool</c>.

Teigha.DatabaseServices.HostApplicationServices.BitmapDevice(Teigha.Runtime.RXObject,Teigha.DatabaseServices.Database,Teigha.DatabaseServices.BitmapDeviceFlags)
Метод предназначен для получения имени растрового устройства, связанного с данным объектом <c>HostApplicationServices</c>.
В текущей версии не реализован.
viewObj: Объект, совместимый с <c>AbstractViewPE</c> (<c>View</c>, <c>Viewport</c> и т.п.). Тип <c>RXObject</c>.
database: Контекст базы данных. Тип <c>Database</c>.
flag: Флаги растрового устройства. Тип <c>BitmapDeviceFlags</c>.
Returns: Возвращает имя растрового устройства, связанного с этим объектом (если оно реализовано). Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.FindFile(String,Teigha.DatabaseServices.Database,Teigha.DatabaseServices.FindFileHint)
Метод позволяет получить полный путь к указанному файлу.
fileName: Имя файла, который требуется найти. Тип <c>String</c>.
database: Указатель на контекст базы данных.  Тип <c>Database</c>. Указать значение <c>null</c>, если искомый файл не связан с базой данных.
hint: Уточнение типа искомого файла. Перечисление <c>FindFileHint</c>.
Returns: Возвращает полное имя файла либо пустую строку, если файл найти не удалось. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.FindFileEx(String,Teigha.DatabaseServices.Database,Teigha.DatabaseServices.FindFileHint)
Метод позволяет получить полный путь к указанному файлу.
fileName: Имя файла, который требуется найти. Тип <c>String</c>.
database: Указатель на контекст базы данных.  Тип <c>Database</c>. Указать значение <c>null</c>, если искомый файл не связан с базой данных.
hint: Уточнение типа искомого файла. Перечисление <c>FindFileHint</c>.
Returns: Возвращает полное имя файла либо пустую строку, если файл найти не удалось. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.GetPassword(String,Teigha.DatabaseServices.PasswordOptions)
Хост-приложения вызывают этот метод внутри себя, чтобы отобразить диалоговое окно запроса пароля.
Метод устарел. См. метод <c>bool GetPassword()</c>.
fileName: Имя файла чертежа, для доступа к которому требуется пароль. Тип <c>String</c>.
options: Опции пароля. Перечисление <c>PasswordOptions</c>.
Returns: Возвращает пустую строку. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.GetPassword(String,Teigha.DatabaseServices.PasswordOptions,[Out] String%)
Хост-приложения вызывают этот метод внутри себя, чтобы отобразить диалоговое окно запроса пароля.
В текущей версии не реализован.
fileName: Имя файла чертежа, для доступа к которому требуется пароль. Тип <c>String</c>.
options: Опции пароля. Перечисление <c>PasswordOptions</c>.
pass: Полученный пароль. Тип <c>String</c>.
Returns: Возвращает <c>false</c>.

Teigha.DatabaseServices.HostApplicationServices.GetRemoteFile(Uri,System.Boolean)
Метод предназначен для получения файла, заданного параметром <c>URL</c>. В текущей версии не реализован.
url: URL, которым идентифицируется файл. Тип <c>Uri</c>.
ignoreCache: Флаг, определяющий, следует ли загружать существующие кэшированные файлы. Тип <c>bool</c>.  В случае значения <c>true</c> кэшированные файлы не загружаются.
Returns: Возвращает найденный файл. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.GetUrl(String)
Метод позволяет сопоставить локальный файл с соответствующим адресом URL, с которого файл был загружен.
localFile: Локальный файл. Тип <c>String</c>.
Returns: Возвращает URI загруженного файла. Тип <c>Uri</c>.

Teigha.DatabaseServices.HostApplicationServices.IsUrl(String)
Метод позволяет проверить, является ли переданная строка допустимым URL-адресом.
В текущей версии не реализован.
filePath: Проверяемая строка. Тип <c>String</c>.
Returns: Возвращает <c>true</c>, если переданная в метод строка является допустимым URL-адресом.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.HostApplicationServices.LoadApplication(String,Teigha.DatabaseServices.ApplicationLoadReasons,System.Boolean,System.Boolean)
Метод позволяет загрузить приложение. В текущей версии не реализован.
appName: Нуль-терминированная строка, представляющая имя загружаемого приложения. Тип <c>String</c>.
why: Причина загрузки приложения. Перечисление <c>ApplicationLoadReasons</c>.
printIt: Флаг, определяющий, печатать ли сообщение о состоянии загрузки. Тип <c>bool</c>.
asCmd: Флаг, определяющий, следует ли загружать приложение, как это происходит по команде пользователя. Тип <c>bool</c>.

Teigha.DatabaseServices.HostApplicationServices.NewProgressMeter
Метод позволяет получить индикатор прогресса, который визуально отражает ход завершения некоторого процесса.
В текущей версии не реализован.
Returns: Если метод реализован, возвращает индикатор прогресса. Тип <c>ProgressMeter</c>.
В текущей версии возвращает <c>null</c>.

Teigha.DatabaseServices.HostApplicationServices.PutRemoteFile(Uri,String)
Метод позволяет загрузить локальный файл в удаленное расположение с указанным URI.
В текущей версии не реализован.
url: Целевой адрес URL. Тип <c>Uri</c>.
localFile: Локальный файл-источник для загрузки.  Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.recoverFile(Teigha.Runtime.StreamBuf,Teigha.DatabaseServices.AuditInfo,String)
Метод предназначен для восстановления файла в указанном файловом буфере.
fileBuff: Файловый буфер с данными для восстановления. Тип <c>StreamBuf</c>.
auditInfo: Объект <c>AuditInfo</c> для данных аудита процесса восстановления файла.
password: Пароль для доступа к файлу. Тип <c>String</c>.
Returns: Возвращает дескриптор базы данных восстановленного файла. Тип <c>Database</c>.

Teigha.DatabaseServices.HostApplicationServices.UserBreak
Метод вызывается (обычно кодом базы данных), чтобы определить, ввел ли пользователь команду <c>CTRL+C</c>.
В текущей версии метод не реализован.
Returns: Возвращает <c>true</c>, если пользователь нажал <c>CTRL+C</c>.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.HostApplicationServices.AlternateFontName
Свойство возвращает имя "альтернативного" шрифта (шрифта по умолчанию), который используется, когда не удается найти никакой другой шрифт.
Returns: Возвращает имя "альтернативного" шрифта. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.CompanyName
Свойство возвращает наименование компании, владеющей приложением.
Returns: Возвращает наименование компании. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.Current
Свойство обеспечивает доступ к активному в данный момент объекту <c>HostApplicationServices</c>.
Returns: Возвращает активный объект <c>HostApplicationServices</c>.

Teigha.DatabaseServices.HostApplicationServices.FontMapFileName
Свойство возвращает имя файла сопоставления (мэппинга) шрифтов.
Реализация по умолчанию возвращает пустую строку.
Returns: Возвращает имя файла сопоставления (мэппинга) шрифтов. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.GRIPCOLOR
Свойство обеспечивает доступ к значению цвета невыделенных ручек. Индекс цвета принимает значения в диапазоне [1..255].
Returns: Возвращает индекс цвета невыделенных ручек. Тип <c>short</c>.

Teigha.DatabaseServices.HostApplicationServices.GRIPHOT
Свойство обеспечивает доступ к значению цвета выделенных ручек.
Индекс цвета принимает значения в диапазоне [1..255].
Returns: Возвращает индекс цвета выделенных ручек. Тип <c>short</c>.

Teigha.DatabaseServices.HostApplicationServices.GRIPHOVER
Свойство представляет доступ к индексу цвета ACI невыбранных ручек, когда на них наведен курсор (подсвеченное состояние).
Returns: Возвращает индекс цвета ручки. Тип <c>short</c>.

Teigha.DatabaseServices.HostApplicationServices.GRIPOBJLIMIT
Свойство представляет количество выделенных объектов, свыше которого ручки у набора выделенных объектов подавляются.
Диапазон допустимых значений [0..32767].
Returns: Возвращает верхний предел количества выделенных объектов. Тип <c>int</c>.

Teigha.DatabaseServices.HostApplicationServices.GRIPSIZE
Свойство предоставляет отображаемый размер ручки. Допустимы значения в диапазоне [1..255] пикселей.
Returns: Возвращает размер ручки. Тип <c>int</c>.

Teigha.DatabaseServices.HostApplicationServices.LocalRootFolder
Свойство предоставляет путь к корневой папке. Реализация по умолчанию возвращает пустую строку.
Returns: Возвращает путь к корневой папке. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.ModelerFlavor
Свойство возвращает возможные уровни поддержки средств геометрического моделирования, доступные в хост-приложениях.
Returns: Возвращает уровень поддержки средств геометрического моделирования. Перечисление <c>ModelerFlavor</c>.

Teigha.DatabaseServices.HostApplicationServices.Product
Свойство возвращает наименование продукта.
Returns: Возвращает наименование продукта. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.Program
Свойство возвращает наименование программы.
Returns: Возвращает наименование программы. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.RegistryProductRootKey
Свойство возвращает корневой ключ продукта в реестре Windows.
Returns: Возвращает корневой ключ продукта в реестре. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.ReleaseMajorVersion
Свойство возвращает основную версию релиза клиентского приложения.
Returns: Возвращает основную версию релиза клиентского приложения. Тип <c>int</c>.

Teigha.DatabaseServices.HostApplicationServices.ReleaseMinorVersion
Свойство возвращает дополнительную версию клиентского приложения.
Returns: Возвращает дополнительную версию клиентского приложения. Тип <c>int</c>.

Teigha.DatabaseServices.HostApplicationServices.RoamableRootFolder
Свойство возвращает путь к локальному каталогу перемещаемых файлов.
Реализация по умолчанию возвращает пустую строку.
Returns: Возвращает путь к локальному каталогу. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.TEXTFILL
Свойство позволяет определить, применяется ли заливка к шрифтам TrueType.
Returns: Возвращает <c>true</c>, если к шрифтам TrueType применяется заливка.
В противном случае возвращает <c>false</c>.

Teigha.DatabaseServices.HostApplicationServices.VersionString
Свойство возвращает строку с основной и дополнительной версиями релиза.
Returns: Возвращает строку с основной и дополнительной версиями релиза. Тип <c>String</c>.

Teigha.DatabaseServices.HostApplicationServices.WorkingDatabase
Свойство предоставляет доступ к текущей активной базе данных.
Returns: Возвращает активную базу данных. Тип <c>Database</c>.