Teigha.DatabaseServices.XrefSubCommandEventArgs
Класс <c>XrefSubCommandEventArgs</c> представляет данные для событий базы данных, связанных с подкомандами внешних ссылок (<c>XrefSubCommandStart</c>, <c>XrefSubCommandEnd</c> и <c>XrefSubCommandAborted</c>).

Teigha.DatabaseServices.XrefSubCommandEventArgs.btrIds
Свойство <c>btrIds</c> представляет коллекцию идентификаторов записей таблицы блоков.
Returns: Возвращает коллекцию идентификаторов объектов.
Тип <c>ObjectIdCollection</c>.

Teigha.DatabaseServices.XrefSubCommandEventArgs.btrNames
Свойство <c>btrNames</c> представляет массив имён записей таблицы блоков.
Returns: Возвращает массив имён.
Тип <c>String[]</c>.

Teigha.DatabaseServices.XrefSubCommandEventArgs.paths
Свойство <c>paths</c> представляет пути записей таблицы блоков.
Returns: Возвращает массив путей.
Тип <c>String[]</c>.

Teigha.DatabaseServices.XrefSubCommandEventArgs.xrefOp
Свойство <c>xrefOp</c> представляет связанную с событием подкоманду внешних ссылок.
Returns: Возвращает подкоманду внешних ссылок. Значение из перечисления <c>XrefOperation</c>.